// BSEBClass10HindiMockTest.jsx
import React, { useState, useEffect } from "react";

// --- BSEB Class 10 Hindi Question Bank (100 questions) ---
const hindiQuestions = [
 {
    question: "‘आविन्यों’ कहाँ स्थित है?",
    option:["फ्रांस",
            "रूस",
            "भारत",
            "मिस्र"],
    answer:"फ्रांस"
},

{
    question: "‘नंदनंद’ किसे कहा गया है?",
    option:["नंद बाबा को",
            "बलराम को",
            "श्रीकृष्ण को",
            "ग्वाल-बालकों को"],
    answer:"श्रीकृष्ण को"
},

{
    question: "‘प्रेमघन’ ने किस साप्ताहिक पत्र का संपादन किया?",
    option:["नागरी नीरद",
            "साहित्य नीरद",
            "साहित्य सरस",
            "नौरद नागरी"],
    answer:"नागरी नीरद"
},

{
    question: "कवि रसखान ने अपने दोहे में ‘बेमन’ किसे कहा है?",
    option:["श्रीकृष्ण को",
            "ग्वाल बालों को",
            "यशोदा को",
            "भक्त के रूप में स्वयं को"],
    answer:"भक्त के रूप में स्वयं को"
},

{
question: "‘नृवंश विद्या’ का सम्बन्ध किससे है?",
option:["वनस्पतिविज्ञान से",
        "प्राणिविज्ञान से",
        "मानवविज्ञान से",
        "अंतरिक्षविज्ञान से"],
answer:"मानवविज्ञान से"
},

{
    question: "‘नखधर’ मनुष्य किसपर भरोसा करके आगे की ओर चल पड़ा है?",
    option:["स्वयं पर",
            "देवताओं पर",
            "पाषाण-अस्त्र पर",
            "एटम बम पर"],
    answer:"एटम बम पर"
},

{
    question: "‘एथेन्स’ किस महादेश में है?",
    option:["यूरोप",
            "एशिया",
            "अमेरिका",
            "ऑस्ट्रेलिया"],
    answer:"यूरोप"
},

{
    question: "जीवनानंद दास का निधन कब हुआ था?",
    option:["1948 ई. में",
            "1950 ई. में",
            "1952 ई. में",
            "1954 ई. में"],
    answer:"1954 ई. में"
},

{
    question: "मंगम्मा अलग होने के बाद अपने लिए कौन-सी चीज सिलवाने की बात करती है?",
    option:["साड़ी",
            "मखमल की ब्लाउज",
            "धोती",
            "शॉल"],
    answer:"मखमल की ब्लाउज"
},

{
    question: "मंगम्मा जब दही बेचने जाती थी तो रास्ते में कुएँ के पास कौन मिला था?",
    option:["उसका बेटा",
            "उसका पोता",
            "उसकी बहू",
            "रंगप्पा"],
    answer:"रंगप्पा"
},

{
    question: "गुरुनानक का जन्म-स्थान कहा जाता है।",
    option:["गुरु ग्राम",
            "गुरु साहेब",
            "नानक ग्राम",
            "नानकाना साहब"],
    answer:"नानकाना साहब"
},

{
    question: "गाँधीजी के अनुसार ‘शिक्षा’ का माध्यम होना चाहिए।",

    option:["नाट्य-कला",
            "हस्तकला",
            "अहिंसा",
            "सत्याग्रह"],

    answer:"हस्तकला"
},

{
    question: "पंतजी की भारतमाता कहाँ की निवासिनी है?",
    option:["ग्रामवासिनी",
            "नगरवासिनी",
            "शहरवासिनी",
            "पर्वतवासिनी"],
    answer:"ग्रामवासिनी"
},

{
    question: "हिरोशिमा अज्ञेय के किस काव्य संग्रह से संकलित है?",
    option:["सदानीरा",
            "विपथगा",
            "बावरा अहेरी",
            "लौटती पगडंडियाँ"],
    answer:"सदानीरा"
},

{
    question: "मंगम्मा के बेटे ने अलग होने पर मंगम्मा से क्या कहा?",
    option:["तुम मेरे साथ ही रहो",
            "तुम्हारी मर्जी, तुम जहाँ रहना चाहो",
            "तुम्हें क्या मैं पाल सकता हूँ?",
            "तुम बहू को घर से निकाल दो"],
    answer:"तुम्हें क्या मैं पाल सकता हूँ?"
},

{
    question: "लौटकर आऊँगा फिर कविता में किस फसल के खेत की चर्चा है?",
    option:["गेहूँ के",
            "जौ के",
            "धान के",
            "गुलाब के"],
    answer:"धान के"
},

{
    question: "‘प्रेम-वाटिका’ किस प्रकार की रचना है?",
    option:["भक्ति संबंधी",
            "प्रेम-निरूपण संबंधी",
            "आत्मज्ञान संबंधी",
            "निराकार-ब्रह्म संबंधी"],
    answer:"प्रेम-निरूपण संबंधी"
},

{
question: "कहानी में अमीरी और गरीबी का क्या प्रतीक है?",
option:["खोखा और मदन",
        "सेन साहब और गिरधर",
        "मदन और गिरधर",
        "सेन साहब और मदन"],
answer:"सेन साहब और मदन"
},

{
    question: "खालिस शब्द हैं",
    option:["ग्रीक",
            "फारसी",
            "अरबी",
            "देवनागरी"],
    answer:"अरबी"
},

{
    question: "“गुणाकर मुले” का जन्म कब हुआ?",
    option:["1935",
            "1835",
            "1936",
            "1836"],
    answer:"1935"
},

{
    question: "‘लाक्षणिक मूर्तिमत्ता और प्रयोग वैचित्र्य’ के कवि कौन हैं?",
    option:["घनानन्द",
            "सूरदास",
            "बिहारी",
            "तुलसीदास"],
    answer:"घनानन्द"
},

{
    question: "हिरोशिमा में सूरज कहाँ से निकला था?",
    option:["आसमान में",
            "पहाड़ पर",
            "नगर के चौक पर",
            "बादल में"],
    answer:"नगर के चौक पर"
},

{
    question: "कविता में घ से किसका बोध कराया गया है?",
    option:["घड़ी",
            "घमंड",
            "घंटी",
            "घड़ा"],
    answer:"घड़ा"
},

{
    question: "भारतमाता के सम्बन्ध में क्या सही है?",
    option:["शैलवासिनी",
            "नगरवासिनी",
            "ग्रामवासिनी",
            "विंध्यवासिनी"],
    answer:"ग्रामवासिनी"
},

{
    question: "अशोक वाजपेयी की लगभग कितनी मौलिक और संपादित कृतियाँ प्रकाशित हुई हैं?",
    option:["एक दर्जन",
            "दो दर्जन",
            "तीन दर्जन",
            "चार दर्जन"],
    answer:"तीन दर्जन"
},

{
    question: "गुरुनानक देव ने क्या कहते हुए प्राण-त्याग किया?",
    option:["हे गुरु",
            "वाहे गुरु",
            "हे ईश्वर",
            "सत् गुरु"],
    answer:"वाहे गुरु"
},

{
    question: "हिरोशिमा शीर्षक कविता में वर्णित सूरज कहाँ निकला?",
    option:["पूर्वी क्षितिज पर",
            "नगर के चौक पर",
            "पूर्वी दिशा में",
            "इनमें से कहीं नहीं"],
    answer:"नगर के चौक पर"
},

{
    question: "‘नि:स्वार्थ भाव से, निश्चल होकर अपने को समर्पित कर देना किसका कथन है?",
    option:["सुजान का",
            "धनानंद का",
            "मुहम्मदशाह का",
            "इनमें से कोई नहीं"],
    answer:"धनानंद का"
},

{
    question: "बीजाक्षर किस प्रकार की रचना है?",
    option:["काव्य संकलन",
            "कहानी संकलन",
            "निबंध",
            "उपन्यास"],
    answer:"काव्य संकलन"
},

{
    question: "बीजाक्षर किसकी कृति है?",
    option:["कृष्णा सोबती की",
            "अर्चना वर्मा की",
            "अनामिका की",
            "स्नेहलता की"],
    answer:"अनामिका की"
},

{
    question: "घनानंद का दूसरा पद किसे संबोधित है?",
    option:["सुजान को",
            "भगवान को",
            "बादल को",
            "इनमें से कोई नहीं"],
    answer:"बादल को"
},

{
    question: "धूसरता किससे श्रृंगार सजाती है?",
    option:["लोहे",
            "मिट्टी",
            "सोने",
            "पानी"],
    answer:"सोने"
},

{
    question: "नागरी लिपि के निबंधकार है?",
    option:["गुणाकर मुले",
            "रामचन्द्र शुक्ल",
            "अमरकांत",
            "रामविलास शर्मा"],
    answer:"गुणाकर मुले"
},

{
    question: "अज्ञेय का काव्य-संग्रह है",
    option:["हरी घास पर क्षण भर",
            "कितनी नावों में कितनी बार",
            "आँगन के पार द्वार",
            "इनमें से सभी"],
    answer:"इनमें से सभी"
},

{
question: "सच्चे लोकतंत्र का पर्याय है",
option:["जाति-प्रथा",
        "सुशासन",
        "भाईचारा",
        "कानून व्यवस्था"],
answer:"भाईचारा"
},

{
    question: "अक्षर-ज्ञान नामक कविता अनामिका जी की किस चर्चित श्रृंखला से ली गई है?",
    option:["यामा",
            "गलत पते की चिट्ठी",
            "कवि ने कहा",
            "बीजाक्षर"],
    answer:"कवि ने कहा"
},

{
question: "सेन साहब ने किस कारण मदन के पिता को नौकरी से बर्खास्त किया?",
option:["व्यक्तिगत कारण",
        "मदन की हरकतों की वजह से",
        "आर्थिक कारण",
        "कोई कारण नहीं"],
answer:"मदन की हरकतों की वजह से"
},

{
    question: "‘बचाना है मनुष्य को जंगल हो जाने से’—इस कथन के माध्यम से कवि मनुष्य के सम्बन्ध में क्या सोचता है?",
    option:["मनुष्य सभ्य है",
            "मनुष्य सुसंस्कृत है",
            "मनुष्य निरंतर असभ्य होता जा रहा है",
            "मनुष्य सामाजिक प्राणी है"],
    answer:"मनुष्य निरंतर असभ्य होता जा रहा है"
},

{
    question: "‘वीलनव्व ल आविन्यों’ का अर्थ होता है",
    option:["आविन्यों का नया आदमी",
            "आविन्यों का नया गाँव",
            "आविन्यों की नदी",
            "आविन्यों का पर्वत"],
    answer:"आविन्यों का नया गाँव"
},

{
    question: "किसके बिना प्रभु गृहहीन होंगे?",

    option:["पूजा के बिना",
            "मंत्रोच्चारण के बिना",
            "दास के बिना",
            "अवतार के बिना"],

    answer:"दास के बिना"
},

{
    question: "“एक वृक्ष की हत्या” में दूर से ही कौन ललकारता था?",
    option:["बूढ़ा वृक्ष",
            "मालिक",
            "चौकीदार",
            "मालकिन"],
    answer:"बूढ़ा वृक्ष"
},

{
    question: "गुरुनानक किस भक्तिधारा के कवि हैं?",
    option:["निर्गुण भक्तिधारा",
            "सगुण भक्ति धारा",
            "सरस भक्तिधारा",
            "ब्रह्मानंद भक्तिधारा"],
    answer:"निर्गुण भक्तिधारा"
},

{
    question: "साहित्य की परम्परा का पूर्ण ज्ञान किस व्यवस्था में संभव है?",
    option:["सामन्तवादी व्यवस्था",
            "पूँजीवादी व्यवस्था",
            "समाजवादी व्यवस्था",
            "इनमें सभी"],
    answer:"समाजवादी व्यवस्था"
},

{
question: "‘विष के दाँत’ का मुख्य संदेश क्या है?",
option:["अमीरों के अत्याचार के विरुद्ध आवाज उठाना",
        "साहस से भरा जीवन",
        "परिवार की महत्ता",
        "प्रेम और सहिष्णुता"],
answer:"अमीरों के अत्याचार के विरुद्ध आवाज उठाना"
},

{
    question: "महात्मा गाँधी का जन्म कहाँ हुआ ?",

    option:["अहमदाबाद",
            "मध्यप्रदेश",
            "राजस्थान",
            "गुजरात"],

    answer:"गुजरात"
},

{
    question: "किस उम्र में बिरजू महाराज नृत्यकला में पारंगत हो गए?",
    option:["7 वर्ष की",
            "8 वर्ष की",
            "9 वर्ष की",
            "10 वर्ष की"],
    answer:"8 वर्ष की"
},

{
    question: "‘अत्याचारी’ का शाब्दिक अर्थ है",
    option:["अन्यायी",
            "जिद्दी",
            "अस्वीकार",
            "इनमें से कोई नहीं"],
    answer:"अन्यायी"
},

{
    question: "अशोक वाजपेयी ने किस पत्रिका का सम्पादन किया?",
    option:["समवेत",
            "यंग इंडिया",
            "पाञ्चजन्य",
            "नट रंग"],
    answer:"समवेत"
},

{
    question: "‘आसादीवार’ किसकी रचना है?",
    option:["गुरु गोविन्द सिंह की",
            "अर्जुनदेव की",
            "तेगबहादुर सिंह की",
            "गुरुनानक की"],
    answer:"गुरुनानक की"
},

{
    question: "पंडित बिरजू महाराज किस लड़के को डाँस सिखाते थे?",
    option:["राधेश्याम बागला को",
            "गौरीशंकर बागला को",
            "सीताराम बागला को",
            "राधामोहन बागला को"],
    answer:"सीताराम बागला को"
},

{
question: "जाति-प्रथा किस प्रकार का श्रम-विभाजन है?",
option:["अस्वाभाविक",
        "प्राकृतिक",
        "स्वाभाविक",
        "संवैधानिक"],
answer:"अस्वाभाविक"
},

{
    question: "गुणाकर मूले की मृत्यु कब हुई?",
    option:["1995 ई० में",
            "1999 ई० में",
            "2005 ई० में",
            "2009 ई० में"],
    answer:"2009 ई० में"
},

{
    question: "अबोध बालक के अक्षर पाटी पर क्या नहीं अँटता?",
    option:["क",
            "ख",
            "ङ",
            "ब"],
    answer:"क"
},

{
question: "भीमराव अंबेदकर की रचना है",
option:["द राइट एंड फॉल ऑफ द हिन्दू वीमेन",
        "संत परंपरा और साहित्य",
        "विचार और वितर्क",
        "भारतीय लिपियों की कहानी"],
answer:"द राइट एंड फॉल ऑफ द हिन्दू वीमेन"
},

{
    question: "‘जिन्दगी और जोंक’ किसकी कहानी है?",
    option:["प्रेमचन्द",
            "सुदर्शन",
            "महीप सिंह",
            "अमरकांत"],
    answer:"अमरकांत"
},

{
    question: "‘नदी के किनारे भी नदी है’ गद्यकाव्य किसकी कृति है?",
    option:["अज्ञेय की",
            "अशोक वाजपेयी की",
            "शांतिप्रिय द्विवेदी की",
            "विद्यानिवास मिश्र की"],
    answer:"अशोक वाजपेयी की"
},

{
    question: "‘कुँवर’ ने लिखने की शुरुआत कब से की?",
    option:["1948 ई० के आसपास",
            "1950 ई० के आसपास",
            "1952 ई० के आसपास",
            "1954 ई० के आसपास"],
    answer:"1950 ई० के आसपास"
},

{
    question: "बिस्मिल्ला खाँ का जन्म कहाँ हुआ था?",
    option:["काशी में",
            "दिल्ली में",
            "डुमराँव",
            "पटना में"],
    answer:"डुमराँव"
},

{
    question: "‘जनतंत्र का जन्म’ शीर्षक कविता में कवि ने किसे देवता कहा है?",
    option:["राम",
            "कृष्ण",
            "बुद्ध",
            "किसान-मजदूर"],
    answer:"किसान-मजदूर"
},

{
    question: "मंगम्मा की बहू का क्या नाम है?",
    option:["नंजम्मा",
            "रंगम्मा",
            "गंगम्मा",
            "संगम्मा"],
    answer:"नंजम्मा"
},

{
    question: "“सबै बिदेसी वस्तु नर, गति रति रीत लखात।………. कछु न अब, भारतं म दरसात।”",
    option:["राष्ट्रीयता",
            "भारतीयता",
            "मनुजता",
            "आत्मीयता"],
    answer:"भारतीयता"
},

{
    question: "वीरेन डंगवाल किस दैनिक पत्र के संपादकीय सलाहकार हैं?",
    option:["दैनिक जागरण",
            "जनसत्ता",
            "अमर उजाला",
            "दैनिक भास्कर"],
    answer:"अमर उजाला"
},

{
    question: "कौन चाहते थे कि सभी देशों की संस्कृति की हवा उनके घर के पास बहती रहे ?",

    option:["राजेन्द्रप्रसाद",
            "नेहरू",
            "महात्मा गाँधी",
            "सरदार पटेल"],

    answer:"महात्मा गाँधी"
},

{
question: "मदन के पिता कौन हैं?",
option:["गिरधर",
        "सेन साहब",
        "काशू",
        "खोखा"],
answer:"गिरधर"
},

{
    question: "‘दिनकरजी’ किस युग के प्रमुख कवि थे?",
    option:["भारतेन्दु युग के",
            "छायावाद युग के",
            "उत्तर छायावाद युग के",
            "इनमें से कोई नहीं"],
    answer:"उत्तर छायावाद युग के"
},

{
    question: "निर्मला कौन थी?",
    option:["कहानीकार की नौकरानी",
            "कहानीकार की बहन",
            "कहानीकार की पत्नी",
            "कहानीकार की मौसी"],
    answer:"कहानीकार की पत्नी"
},

{
    question: "रंगप्पा था-",
    option:["जुआरी",
            "व्यापारी",
            "वकील",
            "किसान"],
    answer:"जुआरी"
},

{
    question: "बिरजू महाराज का जन्म हुआ था",
    option:["शुक्रवार बसंत पंचमी के दिन",
            "शुक्रवार बसंत पंचमी के एक दिन पहले",
            "शुक्रवार बसंत पंचमी के एक दिन बाद",
            "शुक्रवार बसंत पंचमी के दो दिन बाद"],
    answer:"शुक्रवार बसंत पंचमी के एक दिन पहले"
},

{
    question: "पिकासो क्या थे?",
    option:["कवि",
            "चित्रकार",
            "नाटककार",
            "उपन्यासकार"],
    answer:"चित्रकार"
},

{
    question: "घसीली जमीन पर बच्चा क्या फेंकेगा?",
    option:["सरसों",
            "चावल",
            "चना",
            "मूंगफली"],
    answer:"चावल"
},

{
    question: "लेखक ला शत्रूज में अपने साथ क्या-क्या लेकर गये थे?",
    option:["पुस्तकें",
            "कॉपी",
            "पत्र",
            "कपड़े"],
    answer:"पुस्तकें"
},

{
    question: "“बिरजू महाराज” को किसमें महारथ हासिल थी?",
    option:["गायन",
            "भरतनाट्यम",
            "कथक",
            "वादन"],
    answer:"कथक"
},

{
    question: "नागरी लिपि के आरंभिक लेख मिले हैं",
    option:["पूर्वोत्तर भारत से",
            "दक्षिण भारत से",
            "उत्तर भारत से",
            "इनमें से कोई नहीं"],
    answer:"दक्षिण भारत से"
},

{
    question: "मंगम्मा कहाँ की रहने वाली है?",
    option:["अवलूर के पास किसी गाँव की",
            "सातूर के पास किसी गाँव की",
            "जालौन के पास किसी गाँव की",
            "नागौर के पास किसी गाँव की"],
    answer:"अवलूर के पास किसी गाँव की"
},

{
    question: "‘प्रेमघन’ किस युग के साहित्यकार थे?",
    option:["द्विवेदीयुग के",
            "प्रसादयुग के",
            "भारतेन्दुयुग के",
            "इनमें से कोई नहीं"],
    answer:"भारतेन्दुयुग के"
},

{
    question: "मछली से कौन डर रहा था?",
    option:["संतू",
            "भग्गू",
            "कथाकार की माँ",
            "कथाकार की बहन"],
    answer:"संतू"
},

{
    question: "संतू के घर से तीन मील दूर कौन-सी नदी थी?",
    option:["मोहारा नदी",
            "गंगा नदी",
            "यमुना नदी",
            "कावेरी नदी"],
    answer:"मोहारा नदी"
},

{
    question: "‘जित-जित मैं निरखत हूँ’ पाठ का संबंध किससे है?",
    option:["शंभु महाराज",
            "लच्छू महाराज",
            "बिरजू महाराज",
            "किशन महाराज"],
    answer:"बिरजू महाराज"
},

{
    question: "टॉल्सटाय कौन थे?",

    option:["रूसी लेखक",
            "चीनी लेखक",
            "अंग्रेजी लेखक",
            "फ्रेंच लेखक"],

    answer:"रूसी लेखक"
},

{
    question: "किसका ध्यान क लिखते समय कबूतर पर होता है?",
    option:["कवयित्री",
            "अबोध बालक",
            "ज्ञानी",
            "इनमें कोई नहीं"],
    answer:"अबोध बालक"
},

{
    question: "‘बहादुर’ कहानी है",
    option:["नेपाली गँवई गोरखे की",
            "उत्तरप्रदेश के ग्रामीण बालक की",
            "आदिवासी बालक की",
            "ग्रामीण बिहारी बालक की"],
    answer:"नेपाली गँवई गोरखे की"
},

{
    question: "रामविलास शर्मा की मृत्यु कब और कहाँ हुई थी?",
    option:["1999, महाराष्ट्र में",
            "2000, दिल्ली में",
            "2001, मालदा में",
            "2002, कानपुर में"],
    answer:"2000, दिल्ली में"
},

{
    question: "कवि कुँवर नारायण ने घर लौटने पर किसे नहीं देखा?",
    option:["पिता को",
            "माता को",
            "भाई को",
            "वृक्ष को"],
    answer:"वृक्ष को"
},

{
    question: "गुणाकर मूले ने विभिन्न विषयों पर कितने निबंध लिखें?",
    option:["1500 से अधिक",
            "2500 से अधिक",
            "3500 से अधिक",
            "4500 से अधिक"],
    answer:"2500 से अधिक"
},

{
    question: "‘घनानंद’ की मृत्यु कब हुई?",
    option:["1737 ई. में",
            "1739 ई. में",
            "1741 ई. में",
            "1743 ई. में"],
    answer:"1739 ई. में"
},

{
    question: "कहानीकार के छोटे भाई का नाम क्या है?",
    option:["भग्गू",
            "जग्गू",
            "संतू",
            "दीनू"],
    answer:"संतू"
},

{
question: "आधुनिक सभ्य समाज में कार्य-कुशलता के लिए किसको आवश्यक माना गया है?",
option:["जाति-प्रथा",
        "कार्य-कुशलता",
        "वर्ण-विभाजन",
        "श्रम-विभाजन"],
answer:"श्रम-विभाजन"
},

{
    question: "‘पंत’ का जन्म कहाँ हुआ था?",
    option:["पटना साहिब, पटना",
            "कौसानी, अल्मोड़ा",
            "सारण, वैशाली",
            "बुटाटी, राजस्थान"],
    answer:"कौसानी, अल्मोड़ा"
},

{
    question: "एस० रंगराजन का वास्तविक नाम है-",

    option:["साँवर दइया का",
            "सुजाता का",
            "श्रीनिवास का",
            "घनानंद का"],

    answer:"सुजाता का"
},

{
    question: "‘आंद्रे ब्रेतां’ क्या है?",
    option:["कवि",
            "कथाकार",
            "रंगकर्मी",
            "रंग-संगीतकार"],
    answer:"कवि"
},

{
    question: "अमरकांत ने किस दैनिक पत्रिका के संपादकीय विभाग में नौकरी की?",
    option:["अमर सेनानी",
            "सैनिक",
            "पाञ्चजन्य",
            "शंखनाद"],
    answer:"सैनिक"
},

{
    question: "जब पं० बिरजू महाराज को संगीत नाटक अकादेमी अवार्ड मिला तब उनकी उम्र क्या थी?",
    option:["27 वर्ष",
            "26 वर्ष",
            "25 वर्ष",
            "24 वर्ष"],
    answer:"27 वर्ष"
},

{
question: "सेन साहब किस समाज के प्रतिनिधि हैं?",
option:["गरीब वर्ग",
        "अमीर वर्ग",
        "मध्यम वर्ग",
        "मजदूर वर्ग"],
answer:"अमीर वर्ग"
},

{
    question: "शेखर : एक जीवनी अज्ञेय का प्रसिद्ध है",
    option:["निबंध",
            "उपन्यास",
            "कहानी संग्रह",
            "नाटक"],
    answer:"उपन्यास"
},

{
    question: "बिरजू महाराज को ‘संगीत नाटक अकादमी पुरस्कार कब प्राप्त हुआ?",
    option:["1965 ई० में",
            "1968 ई० में",
            "1970 ई० में",
            "1972 ई० में"],
    answer:"1968 ई० में"
},

{
    question: "कौन-सी कृति रसखान की नहीं है?",
    option:["प्रेम-फुलवारी",
            "प्रेम वाटिका",
            "अष्टधाम",
            "सुजान रसखान"],
    answer:"प्रेम-फुलवारी"
},

{
    question: "मंगम्मा के अनुसार, “दवा करने से तो मशान ही जगता है” यह किसके संदर्भ में कहा गया था?",
    option:["पोते को वश में करने के लिए",
            "बहू को वश में करने के लिए",
            "पति/घरवाले को वश में करने के लिए",
            "रंगप्पा को दूर रखने के लिए"],
    answer:"पति/घरवाले को वश में करने के लिए"
},

{
    question: "‘मदुरै’ को युनानी लोगों द्वारा क्या कहा जाता है?",

    option:["मंदारा",
            "मेदोरा",
            "मदिरा",
            "मंदिरा"],

    answer:"मेदोरा"
},

{
    question: "‘शरदेंदुहासिनी’ कौन है?",
    option:["जनता",
            "प्रजा",
            "माता",
            "भारतमाता"],
    answer:"भारतमाता"
},

{
    question: "बिरजू महाराज को संगीत नाटक अकादमी अवार्ड कब मिला?",
    option:["27 साल की उम्र में",
            "31 साल की उम्र में",
            "29 साल की उम्र में",
            "30 साल की उम्र में"],
    answer:"27 साल की उम्र में"
},

{
    question: "घनानंद कवि हैं",
    option:["पीर के",
            "सुख के",
            "द्वेष के",
            "चित्त के"],
    answer:"पीर के"
},

{
    question: "‘तप-संयम’ कौन-सा समास है?",
    option:["दिगु",
            "तत्पुरुष",
            "कर्मधारय",
            "द्वन्द्व"],
    answer:"द्वन्द्व"
},

{
    question: "‘लगभग जयहिन्द’ शुक्लजी की रचना है",
    option:["काव्य-संग्रह",
            "उपन्यास",
            "कहानी-संग्रह",
            "इनमें से कोई नहीं"],
    answer:"काव्य-संग्रह"
},

{
    question: "गलत पते की चिट्ठी किनकी रचना है?",
    option:["वीरेन डंगवाल की",
            "यतीन्द्र मिश्र की",
            "अज्ञेय की",
            "अनामिका की"],
    answer:"अनामिका की"
},

{
    question: "अज्ञेय ने सम्पादन किया।",
    option:["रूपांबरा",
            "पुष्करिणी",
            "तार सप्तक",
            "इनमें सभी"],
    answer:"इनमें सभी"
},

{
    question: "माँ जी के पास आँगन में बैठकर मंगम्मा क्या खाती थी?",
    option:["दही",
            "मिठाई",
            "पान-सुपारी",
            "रोटी-सब्जी"],
    answer:"पान-सुपारी"
},

{
    question: "‘नख’ किसका प्रतीक है?",
    option:["मानवता का",
            "पशुता का",
            "(A) और (B) दोनों का",
            "इनमें से कोई नहीं"],
    answer:"पशुता का"
},

{
    question: "जीवनानंद दास का जन्म कब हुआ था?",
    option:["1899 ई. में",
            "1952 ई. में",
            "1953 ई. में",
            "1955 ई. में"],
    answer:"1899 ई. में"
},

{
    question: "मनुष्य को सुखी बनने हेतु भौतिक संसाधनों की वृद्धि करने की सलाह कौन लोग देते हैं?",
    option:["संत",
            "विद्वान",
            "नेता",
            "अभिनेता"],
    answer:"नेता"
},

{
    question: "कवि ने ‘परजन्य’ किसे कहा है?",
    option:["कृष्ण",
            "सुजान",
            "बादल",
            "हवा"],
    answer:"बादल"
},

{
    question: "‘क्रिस्तान’ का अर्थ है",
    option:["मुस्लिम",
            "सिख",
            "रेगिस्तान",
            "क्रिश्चियन"],
    answer:"क्रिश्चियन"
},

{
    question: "‘नेकु’ का आधुनिक मानक रूप है",
    option:["अच्छा",
            "तनिक भी",
            "कुछ नहीं",
            "सबसे सुन्दर"],
    answer:"तनिक भी"
},

{
question: "‘भारत से हम क्या सीखें’ गद्य पाठ का जर्मन भाषा से हिन्दी में भाषान्तरण किसने किया है?",
option:["रामविलास शर्मो",
        "गुणाकर मूल",
        "अशोक वाजपेयी",
        "भवानीशंकर त्रिवेदी"],
answer:"भवानीशंकर त्रिवेदी"
},

{
    question: "लेखक सुजाता का जन्म कब हुआ था?",

    option:["1936 ई० में",
            "1935 ई० में",
            "1937 ई० में",
            "1938 ई० में"],

    answer:"1935 ई० में"
},

{
    question: "तीन बेटे की माँ है -",

    option:["मंगम्मा",
            "सीता",
            "लक्ष्मी",
            "पाप्पाति"],

    answer:"सीता"
},

{
    question: "‘पाप्पाति’ ……. कहानी की पात्र है।",

    option:["ढहते विश्वास",
            "नगर",
            "धरती कब तक घूमेगी",
            "माँ"],

    answer:"नगर"
},

{
    question: "किसका वातावरण वल्लि अम्माल को भयभीत कर दिया था?",

    option:["रेलवे स्टेशन का",
            "बस अड्डा का",
            "अस्पताल का",
            "गाँव का"],

    answer:"अस्पताल का"
},

{
    question: "लेखक के घर में किसकी नितांत आवश्यकता थी?",
    option:["नौकर की",
            "चापलूस की",
            "चपरासी की",
            "पहरेदार की"],
    answer:"नौकर की"
},

{
    question: "मानव का रचा हुआ सूरज किसको भाप बना कर सोख गया?",
    option:["बादल",
            "पत्थरों",
            "पानी",
            "मानव"],
    answer:"मानव"
},

{
    question: "जीवनानंद दास की किस कविता को प्रबुद्ध आलोचकों द्वारा रवींद्रोत्तर युग की श्रेष्ठतम प्रेम कविता की संज्ञा दी गई है?",
    option:["मनविहंगम",
            "वनलता सेन",
            "रूपसी बंग्ला",
            "झरा पालक"],
    answer:"वनलता सेन"
},

{
    question: "शुक्लजी की कहानी-संग्रह है",
    option:["नौकर की कमीज",
            "दीवार में एक खिड़की रहती थी",
            "खिलेगा तो देखेंगे",
            "पेड़ पर कमरा"],
    answer:"पेड़ पर कमरा"
},

{
    question: "‘मस्का’ का शाब्दिक अर्थ है",
    option:["मक्खन",
            "मलाई",
            "दूध",
            "मिठाई"],
    answer:"मक्खन"
},

{
question: "कमीने किसके गुण हैं जो कहानी में दिखाए गए हैं?",
option:["सेन साहब के",
        "मदन के",
        "गिरधर के",
        "काशू के"],
answer:"काशू के"
},

{
    question: "‘प्रेमघन’ किस युग के कवि थे?",
    option:["आदिकाल",
            "भक्तिकाल",
            "भारतेन्दु युग",
            "छायावाद युग"],
    answer:"भारतेन्दु युग"
},

{
question: "लेखक की दृष्टि में आदर्श समाज कैसा होना चाहिए?",
option:["जिसमें स्वतंत्रता, समता और भ्रातृत्व का भाव हो",
        "जिसमें सभी धनी हों",
        "जिसमें सभी पढ़े-लिखे हों",
        "जिसमें सभी स्वस्थ हों।"],
answer:"जिसमें स्वतंत्रता, समता और भ्रातृत्व का भाव हो"
},

{
    question: "अंत में दही बेचने का काम किसने संभाल लिया?",
    option:["मंगम्मा ने",
            "मंगम्मा की बहू ने",
            "मंगम्मा के बेटे ने",
            "कथावाचक ने"],
    answer:"मंगम्मा की बहू ने"
},

{
    question: "हिरोशिमा में बम विस्फोट के बाद छायाएँ कैसी थीं?",
    option:["दिशाहीन",
            "छायायुक्त",
            "दिशायुक्त",
            "उपयुक्त सभी"],
    answer:"दिशाहीन"
},

{
    question: "भारतीय संस्कृति किसकी प्रतीक है ?",

    option:["एकता की",
            "विविधता की",
            "मानवता की",
            "भिन्न-भिन्न संस्कृतियों के सामंजस्य की"],

    answer:"भिन्न-भिन्न संस्कृतियों के सामंजस्य की"
},

{
question: "सेन साहब के घर में क्या विशेष है?",
option:["समानता और प्रेम",
        "वर्ग भेद और भेदभाव",
        "गरीबी",
        "सौहार्द"],
answer:"वर्ग भेद और भेदभाव"
},

{
    question: "कवि मृत्योपरान्त कहाँ आने की लालसा रखता है?",
    option:["मातृभूमि बंगाल में",
            "मातृभूमि की नदियों किनारे",
            "(A) और (B) दोनों",
            "इनमें कोई नहीं"],
    answer:"मातृभूमि बंगाल में"
},

{
    question: "‘प्रेम-वरन’ का अर्थ है",
    option:["प्रेम का वर्णन करना",
            "प्रेम के रंग",
            "प्रेम की पूजा करना",
            "प्रेम का अंधा होना"],
    answer:"प्रेम के रंग"
},

{
    question: "‘एक वृक्ष की हत्या’ पाठ में कवि किसकी रक्षा को कविता का केन्द्र मानते हैं?",
    option:["वृक्ष की रक्षा",
            "मानवता की रक्षा",
            "पृथ्वी की रक्षा",
            "वायुमंडल की रक्षा"],
    answer:"मानवता की रक्षा"
},

{
    question: "‘पंतजी’ ने प्रवासिनी किसे कहा है?",
    option:["भारतीय जनता को",
            "भारतमाता को",
            "भारत माँ की संतान को",
            "इनमें से कोई नहीं"],
    answer:"भारतमाता को"
},

{
    question: "‘सुलक्षणी’ कौन थी?",
    option:["गुरुनानक की बहन",
            "गुरुनानक की माँ",
            "गुरुनानक की मौसी",
            "गुरुनानक की पत्नी"],
    answer:"गुरुनानक की पत्नी"
},

{
    question: "बिस्मिल्ला खाँ और शहनाई के साथ किस मुस्लिम पर्व का नाम जुड़ा है?",
    option:["बकरीद",
            "ईद",
            "मुहर्रम",
            "इनमें से कोई नहीं"],
    answer:"मुहर्रम"
},

{
    question: "‘कुँवर नारायण’ का काव्य-संग्रह है",
    option:["आत्मजयी",
            "चक्रव्यूह",
            "परिवेश",
            "इनमें सभी"],
    answer:"इनमें सभी"
},

{
    question: "‘माँ’ शीर्षक कहानी में किसने अपने बड़े पुत्र को घर आने के लिए पत्र लिखवाया ?",

    option:["माँ जी ने",
            "छोटे पुत्र ने",
            "कम्मू ने",
            "पड़ोसी ने"],

    answer:"माँ जी ने"
},

{
    question: "कवि प्रेमघन को भारत में क्या दिखाई नहीं देता है?",
    option:["धन",
            "शिक्षा",
            "स्वाधीनता",
            "भारतीयता"],
    answer:"भारतीयता"
},

{
    question: "‘पंत’ के पिताजी का क्या नाम था?",
    option:["रामानन्द पंत",
            "रामादत्त पंत",
            "गणेश पंत",
            "गंगादत्त पंत"],
    answer:"गंगादत्त पंत"
},

{
question: "डॉ० भीमराव अम्बेदकर के माता का क्या नाम था?",
option:["रानी बाई",
        "कुन्ती बाई",
        "शीला बाई",
        "भीमा बाई"],
answer:"भीमा बाई"
},

{
    question: "अमरकांत की कौन सी कहानी अखिल भारतीय कहानी प्रतियोगिता में पुरस्कृत हुई थी?",
    option:["मौत का नगर",
            "देश के लोग",
            "डिप्टी कलक्टरी",
            "कुहासा"],
    answer:"डिप्टी कलक्टरी"
},

{
question: "डॉ० अम्बेदकर ने पी-एच०डी० की उपाधि कब धारण की?",
option:["1920 ई० में",
        "1918 ई० में",
        "1916 ई० में",
        "1914 ई० में"],
answer:"1916 ई० में"
},

{
    question: "‘अमरकांत’ का जन्म किस स्थान पर हुआ?",
    option:["मध्य प्रदेश",
            "आन्ध्र प्रदेश",
            "उत्तर प्रदेश",
            "बिहार"],
    answer:"उत्तर प्रदेश"
},

{
    question: "गलत पते की चिट्ठी किस विधा की कृति है?",
    option:["उपन्यास",
            "काव्य संकलन",
            "निबंध",
            "कहानी"],
    answer:"काव्य संकलन"
},

{
question: "भीमराव अम्बेडकर के प्रेरकों के क्या-क्या नाम थे?",
option:["राम, कबीर, महात्मा गाँधी",
        "बुद्ध, रहीम, कबीर",
        "बुद्ध, कबीर ज्योतिबा फुले",
        "कबीर, बुद्ध, महादेवी वर्मा"],
answer:"बुद्ध, कबीर ज्योतिबा फुले"
},

{
    question: "किस वर्ष की क्रांति के बाद रूसी और गैर-रूसी जातियों के आपसी संबंध में बहुत बड़ा परिवर्तन हुआ?",
    option:["1915 की क्रांति",
            "1916 की क्रांति",
            "1917 की क्रांति",
            "1918 की क्रांति"],
    answer:"1917 की क्रांति"
},

{
question: "जाति-प्रथा स्वाभाविक श्रम-विभाजन नहीं है, क्योंकि",
option:["यह मनुष्य की रूचि पर आधारित है।",
        "यह पैतृक पेशा से सम्बद्ध नहीं है।",
        "इसमें मनुष्य सहजता से रोजगारयुक्त हो जाता है।",
        "यह मनुष्य की रूचि पर आधारित नहीं है।"],
answer:"यह मनुष्य की रूचि पर आधारित नहीं है।"
},

{
    question: "‘ढहते विश्वास‘ शीर्षक पाठ के रचनाकार का नाम क्या है?",

    option:["श्रीनिवास",
            "ईश्वर पेटलीकर",
            "सुजाता",
            "सातकोड़ी होता"],

    answer:"सातकोड़ी होता"
},

{
    question: "‘लड़का अगर कुछ उधम करता है तो उसे मना करने का हक मुझे नहीं?’- यह किसने कहा?",
    option:["मंगम्मा",
            "मंगम्मा का बेटा",
            "नंजम्मा",
            "रंगप्पा"],
    answer:"नंजम्मा"
},

{
    question: "‘दिनकरजी’ किस हाईस्कूल में प्रधानाध्यापक रहे?",
    option:["मोकामा घाट रेलवे हाईस्कूल",
            "एच. ई. स्कूल बरबीघा",
            "सर गणेश दत्त उ. मा. वि. पटना",
            "पटना कॉलेजिएट हाईस्कूल पटना"],
    answer:"एच. ई. स्कूल बरबीघा"
},

{
    question: "‘ढहते विश्वास‘ कहानी में स्कूल कहाँ है?",

    option:["पठार के नीचे",
            "टीले के नीचे",
            "पहाड़ के नीचे",
            "पेड़ के नीचे"],

    answer:"टीले के नीचे"
},

{
    question: "गुरुनानक के जन्म-स्थान को क्या कहते हैं?",
    option:["नानकाना साहेब",
            "गुरु ग्रंथसाहेब",
            "फतह साहेब",
            "जन्म-स्थली"],
    answer:"नानकाना साहेब"
},

{
    question: "पहले दिन पापापति को क्या था ?",

    option:["खाँसी",
            "शरीर में दर्द",
            "सिरदर्द",
            "बुखार"],

    answer:"खाँसी"
},

{
    question: "‘आत्मजयी’ किसकी रचना है?",
    option:["कुँवर नारायण की",
            "सर्वेश्वरदयाल सक्सेना की",
            "मुक्तिबोध की",
            "रघुवीर सहाय की"],
    answer:"कुँवर नारायण की"
},

{
question: "भारत की जाति-प्रथा की विशेषता है",
option:["यह श्रमिकों का अस्वाभाविक विभाजन है।",
        "यह श्रमिकों का स्वाभाविक विभाजन है।",
        "यह रोजगारवर्धक है।",
        "यह वर्ग-विभेद दूर करता है।"],
answer:"यह श्रमिकों का अस्वाभाविक विभाजन है।"
},

{
    question: "यतीन्द्र मिश्र को किस पुरस्कार से सम्मानित किया गया?",
    option:["रजा पुरस्कार",
            "भारत भूषण अग्रवाल पुरस्कार",
            "ऋतुराज सम्मान",
            "इनमें सभी"],
    answer:"इनमें सभी"
},

{
question: "मैक्समूलर को ‘वेदांतियों का वेदांती’ किसने कहा?",
option:["स्वामी सहजानन्द",
        "स्वामी वल्लभाचार्य",
        "स्वामी विवेकानन्द",
        "स्वामी दयानन्द"],
answer:"स्वामी विवेकानन्द"
},

{
question: "प्लेटो का सम्बन्ध किस देश से है?",
option:["इटली से",
        "स्पेन से",
        "भारत से",
        "यूनान से"],
answer:"यूनान से"
},

{
question: "मैक्समूलर में सर्वविद् सम्पदा और प्राकृतिक सौंदर्य से परिपूर्ण किस देश को माना है?",
option:["जापान को",
        "श्रीलंका को",
        "भारत को",
        "कनाडा को"],
answer:"भारत को"
},

{
    question: "शिक्षा और संस्कृति किसकी रचना है?",

    option:["टॉलस्टॉय",
            "शेक्शपीयर",
            "महात्मा गाँधी",
            "सभी"],

    answer:"महात्मा गाँधी"
},

{
    question: "मंगु को अस्पताल में भर्ती करने के लिए माँ के पुत्र ने किसका आदेश प्राप्त किया ?",

    option:["डॉक्टर से",
            "मजिस्ट्रेट से",
            "सिविल सर्जन से",
            "पुलिस से"],

    answer:"मजिस्ट्रेट से"
},

{
    question: "श्रीनिवास जी का जन्म कब हुआ था?",
    option:["6 जून 1991 ई० में",
            "6 जून 1891 ई० में",
            "12 जुलाई 1895 ई० में",
            "18 जून 1900 ई० में"],
    answer:"6 जून 1891 ई० में"
},

{
    question: "मुहर्रम की कौन-सी तारीख बिस्मिल्ला खाँ के लिए खास महत्त्व की होती थी?",
    option:["आठवीं",
            "नौवीं",
            "सातवीं",
            "दसवीं"],
    answer:"आठवीं"
},

{
    question: "‘प्रेमघन’ ने किस समाज की रचना की?",
    option:["धनी समाज",
            "कलावंत समाज",
            "रसिक समाज",
            "भक्त समाज"],
    answer:"रसिक समाज"
},

{
    question: "‘बहादुर’ शीर्षक कहानी के कहानीकार हैं",
    option:["अमरकांत",
            "राजेन्द्र यादव",
            "कमलेश्वर",
            "ज्ञान रंजन"],
    answer:"अमरकांत"
},

{
    question: "रीतिमुक्त काव्यधारा के सिरमौर कवि किसे कहा जाता है?",
    option:["बिहारी को",
            "घनानन्द को",
            "पद्माकर को",
            "मतिराम को"],
    answer:"घनानन्द को"
},

{
    question: "बिरजू महाराज किस कला से संबंधित हैं?",
    option:["नाट्य कला से",
            "नृत्य कला से",
            "संगीत कला से",
            "चित्रकला से"],
    answer:"नृत्य कला से"
},

{
    question: "रेनर मारिया रिल्के किस देश के कवि हैं?",

    option:["इंगलैंड",
            "जर्मनी",
            "चीन",
            "जापान"],

    answer:"जर्मनी"
},

{
    question: "‘जो नर दुख में दुख नहिं मानै’ किस लेखक की कृति है?",
    option:["कबीरदास की",
            "गुरुनानक की",
            "कालिदास की",
            "सूरदास की"],
    answer:"गुरुनानक की"
},

{
    question: "अज्ञेय के नाम से हिन्दी साहित्य के इतिहास में कौन-सा वाद जुड़ा हुआ है?",
    option:["प्रगतिवाद",
            "छायावाद",
            "प्रयोगवाद",
            "हालावाद"],
    answer:"प्रयोगवाद"
},

{
    question: "‘तुलनात्मक व्याकरण’ किसकी रचना है?",

    option:["सातकोड़ी होता की",
            "सुजाता की",
            "काल्डवेल की",
            "साँवर दइया की"],

    answer:"काल्डवेल की"
},

{
    question: "दिनकरजी का जन्म कब हुआ था?",
    option:["20 सितंबर 1908 को",
            "21 सितंबर 1908 को",
            "22 सितंबर 1908 को",
            "23 सितंबर 1908 को"],
    answer:"23 सितंबर 1908 को"
},

{
question: "डॉ. अम्बेदकर का ‘वाङ्मय’ हिन्दी के कितने खण्डों में प्रकाशित हो चुकी है?",
option:["15 खण्डों में",
        "17 खण्डों में",
        "19 खण्डों में",
        "21 खण्डों में"],
answer:"21 खण्डों में"
},

{
    question: "अज्ञेय के पिता का क्या नाम था?",
    option:["रघुवीर शास्त्री",
            "हीरानंद शास्त्री",
            "परमानंद शास्त्री",
            "उषानंद शास्त्री"],
    answer:"हीरानंद शास्त्री"
},

{
    question: "गांधीजी की दृष्टि में उदात्त और बढ़िया शिक्षा क्या है ?",

    option:["अहिंसक प्रतिरोध",
            "अक्षर ज्ञान",
            "अनुवाद",
            "अंग्रेजी की शिक्षा"],

    answer:"अहिंसक प्रतिरोध"
},

{
question: "आर्थिक पहलू से भी जाति-प्रथा ………… है।",
option:["लाभदायक",
        "हानिकारक",
        "अनुकूल",
        "इनमें से सभी"],
answer:"हानिकारक"
},

{
    question: "‘दिनकर’ की प्रमुख काव्य-कृति है",
    option:["रेणुका",
            "रसवंती",
            "कुरुक्षेत्र",
            "इनमें से सभी"],
    answer:"इनमें से सभी"
},

{
    question: "‘दानलीला’ में कितने छन्द संकलित हैं?",
    option:["नौ",
            "ग्यारह",
            "तेरह",
            "पन्द्रह"],
    answer:"ग्यारह"
},

{
question: "हकर्स थे",
option:["वनस्पति वैज्ञानिक",
        "भूगर्भशास्त्री",
        "प्राणिवैज्ञानिक",
        "पुरातत्त्वविद्"],
answer:"वनस्पति वैज्ञानिक"
},

{
    question: "‘ला शत्रूज’ क्या है?",
    option:["इमारत",
            "पर्वत",
            "ईसाई मठ",
            "मेरा शत्रु"],
    answer:"ईसाई मठ"
},

{
    question: "‘ढहते विश्वास‘ में किस बाँध के टूटने का प्रसंग आया है?",

    option:["दलेइ बाँध",
            "फरक्का बाँध",
            "सिरकुरा बाँध",
            "भीमताल बाँध"],

    answer:"दलेइ बाँध"
},

{
question: "डॉ० अम्बेदकर ने किस पत्रिका का सम्पादन किया?",
option:["उज्ज्वल भारत",
        "उड़ता भारत",
        "बहिष्कृत भारत",
        "पुरस्कृत भारत"],
answer:"बहिष्कृत भारत"
},

{
    question: "किस देश के लोग बड़े-बड़े नख पसंद करते थे?",
    option:["गौड़ देश",
            "कैकय देश",
            "वाह्लीक देश",
            "गांधार देश"],
    answer:"गौड़ देश"
},

{
question: "मदन का कौन-सा गुण कहानी में प्रमुख रूप से दिखाया गया है?",
option:["स्वाभिमान",
        "डर",
        "विद्रोह",
        "अहंकार"],
answer:"स्वाभिमान"
},

{
    question: "‘नागरी लिपि’ शीर्षक पाठ किस पुस्तक से लिया गया है?",
    option:["‘अक्षरों की कहानी’",
            "‘भारतीय लिपियों की कहानी’",
            "‘अक्षर कथा’",
            "इनमें कोई नहीं"],
    answer:"‘भारतीय लिपियों की कहानी’"
},

{
question: "मैक्समूलर कौन-सी भाषा में बाल्यकाल में ही निपुण होकर कविता लिखने लगे थे?",
option:["संस्कृत",
        "लैटिन",
        "अंग्रेजी",
        "अमेरिकन"],
answer:"लैटिन"
},

{
    question: "सुमित्रानंदन पंत का जन्म कहाँ हुआ था?",
    option:["कौसानी",
            "श्यामली",
            "चम्पारण",
            "मेरठ"],
    answer:"कौसानी"
},

{
    question: "अक्षर-ज्ञान में खालिस बेचैनी किसकी है?",
    option:["खरगोश",
            "गिलहरी",
            "कबूतर",
            "तोता"],
    answer:"खरगोश"
},

{
    question: "‘गंगा-यमुना’ को कवि ने किसके रूपक के रूप में प्रस्तुत किया है?",
    option:["भारतमाता के दो हाथों",
            "भारतमाता के दो पैरों",
            "भारतमाता की दो आँखें",
            "इनमें से सभी"],
    answer:"भारतमाता की दो आँखें"
},

{
    question: "कवि घनानंद ने किस मार्ग को सबसे सरल कहा है?",
    option:["प्रेममार्ग को",
            "साधना के मार्ग को",
            "कर्मपंथ को",
            "ज्ञानमार्ग को"],
    answer:"प्रेममार्ग को"
},

{
    question: "बहू को देखकर मंगम्मा को कैसी लगती थी जब वे अलग-अलग रहते थे?",
    option:["बहुत ही झगड़ालू",
            "बहुत ही दुखी",
            "बड़ी सुंदर",
            "सामान्य"],
    answer:"बड़ी सुंदर"
},

{
    question: "कथाकार मछली लेकर घर जाने के दरम्यान क्यों दौड़ रहे थे?",
    option:["मछली खाने की जल्दी थी",
            "मछली मर जाने का डर था",
            "पिताजी ने दौड़कर जाने को कहा था",
            "वर्षा के कारण"],
    answer:"मछली मर जाने का डर था"
},

{
    question: "“संस्कृति के चार अध्याय” कर “दिनकर” जी को कौन सा पुरस्कार मिल चुका है?",
    option:["ज्ञान पीठ",
            "पद्म विभूषण",
            "पद्म श्री",
            "साहित्य अकादमी"],
    answer:"साहित्य अकादमी"
},

{
    question: "किसने जीवनानंद दास की बहुप्रशंसित और प्रसिद्ध कविता का हिन्दी में अनुवाद किया?",
    option:["अनामिका",
            "रामधारी सिंह दिनकर",
            "सुमित्रानंदन पंत",
            "प्रयाग शुक्ल"],
    answer:"प्रयाग शुक्ल"
},

{
    question: "पाप्पाति किस पर लेटी हुई थी?",

    option:["चौकी पर",
            "स्ट्रेचर पर",
            "खटिया पर",
            "पलंग पर"],

    answer:"स्ट्रेचर पर"
},

{
    question: "‘हमारी नींद’ के रचयिता कौन हैं?",
    option:["सुमित्रानंदन पंत",
            "वीरेन डंगवाल",
            "रामधारी सिंह दिनकर",
            "कुँवर नारायण"],
    answer:"वीरेन डंगवाल"
},

{
    question: "सुलोचना कौन थी?",
    option:["अभिनेत्री",
            "मंत्री",
            "गायिका",
            "नर्तकी"],
    answer:"अभिनेत्री"
},

{
    question: "साहित्य के निर्माण में प्रतिभाशाली मनुष्यों की भूमिका है।",
    option:["नगण्य",
            "निर्णायक",
            "नकारात्मक",
            "इनमें से कोई नहीं"],
    answer:"निर्णायक"
},

{
    question: "हरी घास पर क्षणभर के रचनाकार हैं।",
    option:["वीरेन डंगवाल",
            "अज्ञेय",
            "अनामिका",
            "जीवनानंद दास"],
    answer:"अज्ञेय"
},

{
    question: "‘आविन्यों’ दक्षिण फ्रांस का एक मध्ययुगीन रहा है",
    option:["हिन्दू मठ",
            "मुस्लिम मठ",
            "सिक्ख मठ",
            "ईसाई मठ"],
    answer:"ईसाई मठ"
},

{
    question: "“कुँवर नारायण” का “आत्मजयी” कैसा काव्य है?",
    option:["प्रबंधकाव्य",
            "गीतिकाव्य",
            "नीतिकाव्य",
            "करुणाकाव्य"],
    answer:"प्रबंधकाव्य"
},

{
    question: "कवि ने अपने आपको क्या कहा है?",

    option:["जलपात्र",
            "जलधारा",
            "जलमात्र",
            "जलीय जीव"],

    answer:"जलपात्र"
},

{
    question: "रसखान के इष्ट थे",
    option:["भगवान श्रीराम",
            "भगवान शिव",
            "भगवान श्रीकृष्ण",
            "भगवान विष्णु"],
    answer:"भगवान श्रीकृष्ण"
},

{
    question: "रसखान ने ‘प्रेम-अयनि’ किसे कहा है?",
    option:["कृष्ण",
            "सरस्वती",
            "राधा",
            "यशोदा"],
    answer:"राधा"
},

{
question: "‘श्रम-विभाजन और जाति-प्रथा’ के लेखक हैं",
option:["रामविलास शर्मा",
        "भीमराव अंबेदकर",
        "गुणाकर मुले",
        "महात्मा गाँधी"],
answer:"भीमराव अंबेदकर"
},

{
    question: "कितने वर्ष पहले का भारतवासी नाखूनों को जमकर सँवारता था?",
    option:["एक हजार वर्ष पहले का",
            "दो हजार वर्ष पहले का",
            "पाँच सौ वर्ष पहले का",
            "दो सौ वर्ष पहले का"],
    answer:"दो हजार वर्ष पहले का"
},

{
    question: "शहनाई के रीड किस तरह के पौधे से तैयार की जाती है?",
    option:["कास",
            "नरकट",
            "बाँस",
            "सरी"],
    answer:"नरकट"
},

{
    question: "‘नागरी’ नाम अस्तित्व में कब आया?",
    option:["1000 ई. के आसपास",
            "1500 ई. के आसपास",
            "1600 ई. के आसपास",
            "1700 ई. के आसपास"],
    answer:"1000 ई. के आसपास"
},

{
    question: "बहादुर कहाँ से भागकर आया था?",
    option:["पूना से",
            "इंदौर से",
            "पटना से",
            "नेपाल से"],
    answer:"नेपाल से"
},

{
    question: "“मदुरै पांडिय लोगों की दूसरी राजधानी है।” यह कहाँ लिखा हुआ है?",

    option:["हिन्दी काव्य में",
            "अंग्रेजी नाटक में",
            "तुलनात्मक व्याकरण में",
            "तमिल उपन्यास में"],

    answer:"तुलनात्मक व्याकरण में"
},

{
    question: "कवयित्री अनामिका ने इनमें से किसका संपादन किया?",
    option:["कहती हैं औरतें",
            "गलत पते की चिट्ठी",
            "बीजाक्षर",
            "अनुष्टुप"],
    answer:"कहती हैं औरतें"
},

{
question: "मैक्समूलर ने उपनिषदों “कठ तथा केन” का किस भाषा में अनुवाद किया था?",
option:["जर्मन",
        "अरबी",
        "संस्कृत",
        "हिन्दी"],
answer:"जर्मन"
},

{
    question: "बिस्मिल्ला खाँ का निधन कब हुआ?",
    option:["14 जुलाई, 2005",
            "27 मई, 2006",
            "18 जनवरी, 2004",
            "21 अगस्त, 2006"],
    answer:"21 अगस्त, 2006"
},

{
    question: "‘उदात्त’ का शाब्दिक अर्थ है :",

    option:["श्रेष्ठ",
            "जागरण",
            "व्यवहार",
            "पालन"],

    answer:"श्रेष्ठ"
},

{
    question: "कुँवर नारायण की समीक्षात्मक कृति है",
    option:["मेरे साक्षात्कार",
            "आज और आज से पहले",
            "हम तुम",
            "कोई दूसरा नहीं"],
    answer:"आज और आज से पहले"
},

{
    question: "मंगम्मा के अनुसार, घरवाले को अपने वश में रखने के लिए कितने गुर होते हैं?",
    option:["एक-दो",
            "तीन-चार",
            "पाँच-छह",
            "दस"],
    answer:"तीन-चार"
},

{
    question: "‘मछली’ कहानी में किस वर्ग का जीवन वर्णित है?",
    option:["उच्च वर्ग",
            "मध्यम वर्ग",
            "निम्न वर्ग",
            "मजदूर वर्ग"],
    answer:"मध्यम वर्ग"
},

{
    question: "“घर में घुसे तो साले के हाथ-पैर तोड़कर बाहर फेंक देना”- ऐसा किसने कहा था?",
    option:["भग्गू",
            "संतू",
            "माँ",
            "पिताजी"],
    answer:"पिताजी"
},

{
    question: "पहले के मनुष्य नाखून क्यों बढ़ाते थे?",
    option:["अपनी रक्षा के लिए",
            "सुन्दर लगने के लिए",
            "कुरूप लगने के लिए",
            "दूसरों की रक्षा के लिए"],
    answer:"अपनी रक्षा के लिए"
},

{
    question: "‘मोहरा’ क्या है?",
    option:["इमारत",
            "जंगल",
            "पर्वत",
            "नदी"],
    answer:"नदी"
},

{
    question: "‘देवनगरी’ किसे कहा गया है?",
    option:["काशी",
            "मथुरा",
            "हरिद्वार",
            "बनारस"],
    answer:"काशी"
},

{
    question: "इस्लामी शासक का आरंभ काल है",
    option:["12वीं सदी से",
            "13वीं सदी से",
            "14वीं सदी से",
            "15वीं सदी से"],
    answer:"12वीं सदी से"
},

{
question: "जाति-प्रथा भारत में बेरोजगारी का एक …………… कारण बनी हुई।",
option:["प्रत्यक्ष",
        "प्रमुख",
        "(क) और (ख) दोनों",
        "इनमें कोई नहीं"],
answer:"(क) और (ख) दोनों"
},

{
    question: "‘कुँवर नारायण’ की काव्य-संग्रह है",
    option:["आत्मजयी",
            "चक्रव्यूह",
            "परिवेश",
            "इनमें सभी"],
    answer:"इनमें सभी"
},

{
question: "भारतीय संविधान के निर्माण में महत्त्वपूर्ण भूमिका किसकी है?",
option:["भीमराव अंबेदकर",
        "ज्योतिबा फुले",
        "राजगोपालाचारी",
        "महात्मा गाँधी"],
answer:"भीमराव अंबेदकर"
},

{
    question: "दूर से कौन ललकारता है?",
    option:["दुश्मन",
            "डाकू",
            "चौकीदार",
            "वृक्ष चौकीदार"],
    answer:"वृक्ष चौकीदार"
},

{
    question: "हम जब नींद में होते हैं, तब किसका जीवन-चक्र पूरा हो जाता है?",
    option:["मकड़ी का",
            "मछली का",
            "मक्खी का",
            "मच्छर का"],
    answer:"मक्खी का"
},

{
    question: "गुणाकर मूले का जन्म कब हुआ?",
    option:["1935 ई० में",
            "1936 ई० में",
            "1937 ई० में",
            "1938 ई० में"],
    answer:"1935 ई० में"
},

{
    question: "दिनकर की प्रारंभिक शिक्षा कहाँ से हुई थी?",
    option:["घर से",
            "पिताजी से",
            "गाँव और आसपास से",
            "जिला स्कूल से"],
    answer:"गाँव और आसपास से"
},

{
    question: "गुरु नानक देव की रचनाओं का संग्रह किस नाम से प्रसिद्ध हुआ?",
    option:["साहिब ग्रंथ",
            "गुरु साहिब ग्रंथ",
            "गुरु ग्रंथ साहिब",
            "गुरु ग्रंथावली"],
    answer:"गुरु ग्रंथ साहिब"
},

{
    question: "वीरेन डंगवाल ने किस विश्वविद्यालय से एम०ए० की डिग्री प्राप्त की?",
    option:["पटना विश्वविद्यालय",
            "इलाहाबाद विश्वविद्यालय",
            "बरेली विश्वविद्यालय",
            "लाहौर विश्वविद्यालय"],
    answer:"इलाहाबाद विश्वविद्यालय"
},

{
    question: "घनानंद किसके द्वारा मारे गये?",
    option:["शिष्य के",
            "राजा के",
            "दूसरे कवि के",
            "नादिरशाह के सैनिक के"],
    answer:"नादिरशाह के सैनिक के"
},

{
    question: "गाँधी के दो हथियार थे।",

    option:["लाठी और हिंसा",
            "हिंसा और अहिंसा",
            "हिंसा और सत्याग्रह",
            "अहिंसा और सत्याग्रह"],

    answer:"अहिंसा और सत्याग्रह"
},

{
question: "संस्कृत का ‘अग्नि’ शब्द लैटिन में किस रूप में मिलता है?",
option:["एग्निस",
        "आग्निस",
        "इग्निस",
        "ओग्निस"],
answer:"इग्निस"
},

{
    question: "‘घनानंद’ ने विरक्त होने पर स्थायी रूप से कहाँ निवास किया?",
    option:["हरिद्वार",
            "अयोध्या",
            "काशी",
            "वृन्दावन"],
    answer:"वृन्दावन"
},

{
question: "आधुनिक सभ्य समाज ‘कार्यकुशलता’ के लिए किसे आवश्यक मानता है?",
option:["श्रम-विभाजन",
        "धन-विभाजन",
        "जन-विभाजन",
        "जाति-विभाजन"],
answer:"श्रम-विभाजन"
},

{
question: "खोखा किस वर्ग का प्रतीक है?",
option:["अमीर और उच्च वर्ग",
        "गरीब",
        "मजदूर वर्ग",
        "मध्यम वर्ग"],
answer:"अमीर और उच्च वर्ग"
},

{
    question: "साहित्य सापेक्ष रूप में होता है-",
    option:["पराधीन",
            "स्वाधीन",
            "कालाधीन",
            "राज्याधीन"],
    answer:"स्वाधीन"
},

{
    question: "हिरोशिमा कविता किसका चित्रण करती है?",
    option:["प्राचीन सभ्यता की खुशहाली का",
            "आधुनिक सभ्यता के विकास का",
            "प्राचीन सभ्यता की मानवीय विभीषिका का",
            "आधुनिक सभ्यता की दुर्दांत मानवीय विभीषिका का"],
    answer:"आधुनिक सभ्यता की दुर्दांत मानवीय विभीषिका का"
},

{
    question: "अनवरत सीखने की कोशिश में बेटे से क्या नहीं समझता है?",
    option:["क",
            "ग",
            "ङ",
            "ख"],
    answer:"क"
},

{
    question: "गुरुनानक का जन्म कब हुआ था?",
    option:["1467 ई. में",
            "1468 ई. में",
            "1469 ई. में",
            "1470 ई. में"],
    answer:"1469 ई. में"
},

{
    question: "नौबतखाने में इबादत किस विधा में रचित है?",
    option:["निबंध",
            "कहानी",
            "आलोचना",
            "व्यक्तिचित्र"],
    answer:"व्यक्तिचित्र"
},

{
    question: "‘प्रेमधन’ ने इनमें से किस मासिक पत्रिका का सम्पादन किया?",
    option:["नागरी नीरद",
            "प्रयाग रामागमन",
            "आनंदकादम्बिनी",
            "आनन्द अरुणोदय"],
    answer:"आनंदकादम्बिनी"
},

{
    question: "‘वर्दी’ कौन-सा कारक है?",
    option:["कर्म",
            "अधिकरण",
            "करण",
            "इनमें कोई नहीं"],
    answer:"करण"
},

{
    question: "‘बहादुर’ कहानी के कथाकार की पत्नी है",
    option:["लीला",
            "निर्मला",
            "कमला",
            "विमला"],
    answer:"निर्मला"
},

{
    question: "मन अर्जुन मन कृष्ण किसकी कृति है?",
    option:["विवेकी राय",
            "मरकान्त",
            "निरूपमा सेवती",
            "अनामिका"],
    answer:"अनामिका"
},

{
    question: "‘प्रेमघन’ की मृत्यु कब हुई?",
    option:["1918 ई. में",
            "1920 ई. में",
            "1922 ई. में",
            "1924 ई. में"],
    answer:"1922 ई. में"
},

{
question: "मदन का पिता किस वर्ग का है?",
option:["अमीर",
        "गरीब",
        "मजदूर",
        "लेखक"],
answer:"मजदूर"
},

{
question: "मैक्समूलर ने मानव सभ्यता का मूल स्रोत किसे माना?",
option:["भौतिक ज्ञान को.",
        "पाश्चात्य सभ्यता के ज्ञान को तत्वज्ञान को",
        "वैदिक तत्वज्ञान को",
        "विश्व इतिहास के ज्ञान को"],
answer:"वैदिक तत्वज्ञान को"
},

{
    question: "लेखक के अनुसार मनुष्य के नाखून किसके जीवंत प्रतीक हैं?",
    option:["मनुष्यता के",
            "सभ्यता के",
            "पाशवी वृत्ति के",
            "सौन्दर्य के"],
    answer:"पाशवी वृत्ति के"
},

{
    question: "पंडित बिरजू महाराज की गुरुवाइन कौन थीं?",
    option:["उनकी माँ",
            "उनकी चाची",
            "उनकी बहन",
            "उनकी मौसी"],
    answer:"उनकी माँ"
},

{
    question: "‘गुरुनानक’ किस भक्ति धारा के कवि हैं?",
    option:["सगुण",
            "निर्गुण",
            "बहुगुण",
            "इनमें से कोई नहीं"],
    answer:"निर्गुण"
},

{
    question: "वीरेन डंगवाल का जन्म कब हुआ?",
    option:["5 अगस्त, 1947 को",
            "15 अगस्त, 1948 को",
            "5 अगस्त, 1949 को",
            "15 अगस्त, 1950 को"],
    answer:"5 अगस्त, 1947 को"
},

{
question: "मैक्समूलर का जन्म कहाँ हुआ?",
option:["रत्नापार्क, नेपाल",
        "डेसाउ, जर्मनी",
        "वाशिंगटन, अमेरिका",
        "दिल्ली, भारत"],
answer:"डेसाउ, जर्मनी"
},

{
    question: "गांधीजी शिक्षा का उद्देश्य क्या मानते थे ?",

    option:["नौकरी पाना",
            "वैज्ञानिक बनना",
            "चरित्र-निर्माण",
            "यांत्रिक दक्षता"],

    answer:"चरित्र-निर्माण"
},

{
    question: "भारतमाता के मुख की तुलना किससे की गई है?",
    option:["कलंकित चन्द्रमा",
            "कलंकित सूर्य",
            "दुल्हन",
            "गाँव की नारी से"],
    answer:"कलंकित चन्द्रमा"
},

{
    question: "हजारी प्रसाद द्विवेदी कब ‘पद्मभूषण’ की उपाधि से सम्मानित किए गए?",
    option:["1953 ई० में",
            "1957 ई० में",
            "1959 ई० में",
            "1961 ई० में"],
    answer:"1957 ई० में"
},

{
    question: "कौन फुदक जाता है?",
    option:["तोता",
            "खरगोश",
            "मैना",
            "कबूतर"],
    answer:"कबूतर"
},

{
    question: "नागरी लिपि के आरंभिक लेख हमें कहाँ से मिले हैं?",
    option:["पूर्वी भारत",
            "पश्चिमी भारत",
            "दक्षिणी भारत",
            "उत्तरी भारत"],
    answer:"दक्षिणी भारत"
},

{
    question: "इन्हें किस लेखन के लिए ‘साहित्य अकादमी पुरस्कार’ से सम्मानित किया गया?",
    option:["संस्कृति के चार अध्याय",
            "अर्धनारीश्वर",
            "दिनकर की डायरी",
            "वट पीपल"],
    answer:"संस्कृति के चार अध्याय"
},

{
    question: "बच्चा कहाँ आकर थमक जाता है?",
    option:["ख पर",
            "क पर",
            "घ पर",
            "ङ पर"],
    answer:"ङ पर"
},

{
    question: "हिरोशिमा के कवि कौन हैं?",
    option:["रामधारी सिंह दिनकर",
            "कुंवर नारायण",
            "अज्ञेय",
            "जीवनानंद दास"],
    answer:"अज्ञेय"
},

{
    question: "‘खाकी वर्दी’ में कौन हमेशा चौकन्ना रहता है?",
    option:["पहरेदार",
            "नौकर",
            "वृक्ष",
            "भाई"],
    answer:"वृक्ष"
},

{
    question: "कवि के अंदेशों में कौन था?",
    option:["एक जानी-दुश्मन",
            "एक नेता",
            "एक संन्यासी",
            "एक दोस्त"],
    answer:"एक जानी-दुश्मन"
},

{
    question: "जापान के हिरोशिमा नामक नगर पर अणुबम किसने गिराई?",
    option:["अमेरिका",
            "रूस",
            "चीन",
            "इंग्लैण्ड"],
    answer:"अमेरिका"
},

{
    question: "किसे ‘देवनगरी’ की संज्ञा दी गई है?",
    option:["प्रयाग",
            "काशी",
            "मथुरा",
            "उज्जैन"],
    answer:"काशी"
},

{
    question: "विफलता पर छलक पड़ते हैं।",
    option:["आँसू",
            "क",
            "पानी",
            "ख"],
    answer:"आँसू"
},

{
    question: "“कुँवर नारायण” को कौन सा पुरस्कार प्राप्त है?",
    option:["ज्ञानपीठ",
            "पद्म विभूषण",
            "पद्म श्री",
            "लोहिया सम्मान"],
    answer:"लोहिया सम्मान"
},

{
    question: "रसखान को गोस्वामी विट्ठलनाथ ने किस मार्ग में दीक्षा दी?",
    option:["प्रेम मार्ग में",
            "भक्ति मार्ग में",
            "पुष्टि मार्ग में",
            "संतमार्ग में"],
    answer:"पुष्टि मार्ग में"
},

{
    question: "रश्मि बाजपेयी संपादक हैं",
    option:["नटरंग पत्रिका की",
            "रंगकर्म पत्रिका की",
            "नटराज पत्रिका की",
            "रंगमंच पत्रिका की"],
    answer:"नटरंग पत्रिका की"
},

{
    question: "ईश्वर पेटलीकर कहाँ के लोकप्रिय कथाकार हैं ?",

    option:["राजस्थान के",
            "उड़ीसा के",
            "गुजरात के",
            "कर्नाटक के"],

    answer:"गुजरात के"
},

{
    question: "“कुँवर नारायण” का जन्म कब हुआ था?",
    option:["1928",
            "1827",
            "1927",
            "1828"],
    answer:"1927"
},

{
    question: "“घनआनंद जीवनदायक हो कछू मेरियौ पीर हिएँ परसौ” में किस कवि का नाम आया है?",
    option:["प्रेमघन",
            "घनानंद",
            "धन याम",
            "बिहारीलाल"],
    answer:"घनानंद"
},

{
    question: "गुरुनानक की रचनाओं के संग्रह का क्या नाम है?",
    option:["वाहे गुरु",
            "गुरु ग्रंथसाहिब",
            "नानकाना साहब",
            "फतह साहब"],
    answer:"गुरु ग्रंथसाहिब"
},

{
    question: "रेनर मारिया रिल्के ने किस विश्वविद्यालय से शिक्षा प्राप्त की?",

    option:["इलाहाबाद",
            "प्राग और म्यूनिख",
            "लिपजिंग",
            "आगरा"],

    answer:"प्राग और म्यूनिख"
},

{
    question: "पिताजी किससे नाराज थे?",
    option:["संतू",
            "भग्गू",
            "नरेन",
            "मछली"],
    answer:"भग्गू"
},

{
    question: "कौन-सी रचना हजारी प्रसाद द्विवेदी की नहीं है?",
    option:["अशोक के फूल",
            "माटी की मूरतें",
            "वाणभट्ट की आत्मकथा",
            "हिन्दी साहित्य का आदिकाल"],
    answer:"माटी की मूरतें"
},

{
    question: "मंगम्मा को किसके साथ विवाद था ?",

    option:["पोते के साथ",
            "नंजनम्मा के साथ",
            "मालकिन के साथ",
            "पड़ोसी के साथ"],

    answer:"नंजनम्मा के साथ"
},

{
    question: "‘रसखान’ का जन्म कब हुआ?",
    option:["1531 ई० में",
            "1533 ई० में",
            "1535 ई० में",
            "1537 ई० में"],
    answer:"1533 ई० में"
},

{
    question: "बिरजू महाराज की प्रारंभिक नृत्य शिक्षा किनसे प्राप्त हुई?",
    option:["पिताजी से",
            "माताजी से",
            "कपिलाजी से",
            "इनमें से सभी"],
    answer:"पिताजी से"
},

{
    question: "वीरेन डंगवाल किस अखबार के संपादकीय सलाहकार थे?",
    option:["जनएकता",
            "अमर उजाला",
            "नवभारत टाइम्स",
            "हिन्दुस्तान"],
    answer:"अमर उजाला"
},

{
    question: "गाँधीजी दक्षिण अफ्रीका में कब से कब तक रहे ?",

    option:["1893 से 1914 तक",
            "1895 से 1916 तक",
            "1897 से 1918 तक",
            "1899 से 1920 तक"],

    answer:"1893 से 1914 तक"
},

{
    question: "वीरेन डंगवाल को किस कृति के लिए साहित्य अकादमी पुरस्कार मिला है?",
    option:["इसी दुनिया में",
            "दुष्चक्र में सृष्टा",
            "पहल पुस्तिका",
            "कवि ने कहा"],
    answer:"दुष्चक्र में सृष्टा"
},

{
    question: "“प्रेम अयनि श्री राधिका” में कितने दोहे संकलित हैं?",
    option:["दो",
            "तीन",
            "चार",
            "पाँच"],
    answer:"चार"
},

{
    question: "‘अमरकांत’ का जन्म कब हुआ?",
    option:["जुलाई 1925",
            "जुलाई 1926",
            "जुलाई 1924",
            "जुलाई 1927"],
    answer:"जुलाई 1925"
},

{
    question: "रामविलास शर्मा ने बी० ए० कब पास किया?",
    option:["1932 ई. में",
            "1934 ई. में",
            "1933 ई. में",
            "1931 ई. में"],
    answer:"1932 ई. में"
},

{
    question: "गुरुनानक का कथन किस कवि के कथन से मिलता है?",
    option:["रविदास",
            "कालिदास",
            "सूरदास",
            "कबीरदास"],
    answer:"कबीरदास"
},

{
    question: "काथूसियन सम्प्रदाय का ईसाई मठ था",
    option:["शत्रूज लॉ",
            "ला शत्रु गृह",
            "ला शत्रूज",
            "लाल शत्रु ला"],
    answer:"ला शत्रूज"
},

{
    question: "‘प्रभु के पादुका’ की संज्ञा किसे दी गई है?",

    option:["खड़ाऊँ को",
            "पद-चिह्न को",
            "दास को",
            "इनमें से कोई नहीं"],

    answer:"दास को"
},

{
    question: "कौन ठंड से काँप रहा था?",
    option:["कथाकार",
            "संतू",
            "भग्गू",
            "कथाकार की बहन"],
    answer:"संतू"
},

{
    question: "कवयित्री अनामिका की आलोचनात्मक लेखन है।",
    option:["कहती हैं औरतें",
            "स्त्रीत्व का मानचित्र",
            "मातृत्व",
            "आज की नारी"],
    answer:"स्त्रीत्व का मानचित्र"
},

{
    question: "अवलूर के पास किसी गाँव की रहनेवाली निम्न में से कौन है?",
    option:["मंगम्मा",
            "लेखक",
            "लक्ष्मी",
            "मुखिया"],
    answer:"मंगम्मा"
},

{
    question: "अन्तर्राष्ट्रीय अहिंसा दिवस के रूप में मनाया जाता है :",

    option:["2 अक्टूबर को",
            "5 अक्टूबर को",
            "6 अक्टूबर को",
            "7 अक्टूबर को"],

    answer:"2 अक्टूबर को"
},

{
    question: "‘प्रेम अयनि श्री राधिका’ में कितने दोहे संकलित हैं?",
    option:["दो",
            "तीन",
            "चार",
            "पाँच"],
    answer:"चार"
},

{
question: "लेखक बेरोजगारी का प्रमुख और प्रत्यक्ष कारण किसे मानते हैं?",
option:["अशिक्षा को",
        "जनसंख्या को",
        "जाति-प्रथा को",
        "उद्योग-धंधों की कमी को"],
answer:"जाति-प्रथा को"
},

{
    question: "किस साधन के ऊपर रखकर मछली काटी जाती थी?",
    option:["पत्थर के ऊपर",
            "लोहे के ऊपर",
            "पाटे के ऊपर",
            "चौकी के ऊपर"],
    answer:"पाटे के ऊपर"
},

{
    question: "‘अरे, अपनी अमीरी दिखाने के लिए रसमलाई भेजी है क्या!’ यह किसने कहा ?",

    option:["नारायण की पत्नी भँवरी",
            "कैलास की पत्नी राधा",
            "बिज्जू की पत्नी पुष्पा",
            "इनमें से कोई नहीं"],

    answer:"बिज्जू की पत्नी पुष्पा"
},

{
    question: "किसने कहा था- ‘इन मुसलमान हरिजनन पै कोटि हिन्दू वारिये’?",
    option:["निराला",
            "भारतेन्दु हरिश्चन्द्र",
            "रामविलास शर्मा",
            "रामचन्द्र शुक्ल"],
    answer:"भारतेन्दु हरिश्चन्द्र"
},

{
    question: "बहादुर अपने घर से क्यों भाग गया था?",
    option:["गरीबी के कारण",
            "माँ की मार के कारण",
            "शहर घूमने के लिए",
            "भ्रमवश"],
    answer:"माँ की मार के कारण"
},

{
question: "सर विलियम जोन्स ने भारत की यात्रा कब की थी?",
option:["1957 ई. में",
        "1750 ई. में",
        "1790 ई. में",
        "1783 ई. में"],
answer:"1783 ई. में"
},

{
    question: "‘नाखून क्यों बढ़ते हैं’ निबंध में लेखक ने किस बूढ़े का जिक्र किया है?",
    option:["बालकृष्ण गोखले",
            "सरदार पटेल",
            "महात्मा गाँधी",
            "कृष्णचंद्र गाँधी"],
    answer:"महात्मा गाँधी"
},

{
    question: "‘विरहलीला’ रचित है",
    option:["रसखान द्वारा",
            "घनानंद द्वारा",
            "सूरदास द्वारा",
            "मीराबाई द्वारा"],
    answer:"घनानंद द्वारा"
},

{
    question: "‘शरतेन्दु’ का शाब्दिक अर्थ है",
    option:["शरद् ऋतु की वर्षा",
            "शरद् ऋतु का सूर्योदय",
            "शरद् ऋतु का सूर्यास्त",
            "शरद् ऋतु का चन्द्रमा"],
    answer:"शरद् ऋतु का चन्द्रमा"
},

{
    question: "हिरोशिमा कहाँ अवस्थित है?",
    option:["चीन में",
            "जर्मनी में",
            "नेपाल में",
            "जापान में"],
    answer:"जापान में"
},

{
    question: "अमरकांत का जन्म कहाँ हुआ?",
    option:["बलिया, उत्तरप्रदेश",
            "बलिया, बिहार",
            "इलाहाबाद, उत्तरप्रदेश",
            "खगड़िया, बिहार"],
    answer:"बलिया, उत्तरप्रदेश"
},

{
    question: "कौन-सा ऐसा गुलाम देश था जिसकी सभ्यता ने सारे यूरोप को प्रभावित किया?",
    option:["भारत",
            "अमेरिका",
            "दक्षिण अफ्रीका",
            "एथेन्स"],
    answer:"एथेन्स"
},

{
    question: "अमोघवर्ष कौन था?",
    option:["एक विद्वान",
            "प्रख्यात राष्ट्रकूट राजा",
            "एक कवि",
            "राजवैद्य"],
    answer:"प्रख्यात राष्ट्रकूट राजा"
},

{
    question: "‘मेरा धर्म कैदखाने का धर्म नहीं है।’ यह पंक्ति किस शीर्षक पाठ की है ?",

    option:["नौबतखाने में इबादत",
            "आविन्यों",
            "शिक्षा और संस्कृति",
            "जित-जित में निरखत हूँ"],

    answer:"शिक्षा और संस्कृति"
},

{
question: "\"विष के दाँत\" कहानी के लेखक कौन हैं?",
option:["नलिन विलोचन शर्मा",
        "भगवतीचरण वर्मा",
        "रामधारी सिंह दिनकर",
        "हरिवंश राय बच्चन"],
answer:"नलिन विलोचन शर्मा"
},

{
    question: "“यतींद्र मिश्र” का जन्म किस प्रदेश में हुआ?",
    option:["मध्यप्रदेश",
            "उत्तर प्रदेश",
            "बिहार",
            "राजस्थान"],
    answer:"उत्तर प्रदेश"
},

{
    question: "वीरेन डंगवाल किस विचारधारा के कवि हैं?",
    option:["जनवादी",
            "रहस्यवादी",
            "रीतिवादी",
            "सूफी"],
    answer:"जनवादी"
},

{
    question: "‘प्रेमघन’ का जन्म कब हुआ?",
    option:["1853 ई० में",
            "1855 ई० में",
            "1857 ई० में",
            "1859 ई० में"],
    answer:"1855 ई० में"
},

{
    question: "आचार्य हजारी प्रसाद द्विवेदी की मृत्यु कब हुई?",
    option:["सन् 1980 ई.",
            "सन् 1979 ई.",
            "सन् .......",
            "सन् 1985 ई."],
    answer:"सन् 1979 ई."
},

{
question: "मैक्समूलर को ‘वेदांतियों का विदांती’ कहा है?",
option:["स्वामी सहजानन्द",
        "स्वामी वल्लभाचार्य",
        "स्वामी विवेकानन्द",
        "स्वामी दयानन्द"],
answer:"स्वामी विवेकानन्द"
},

{
    question: "यतींद्र मिश्र विमला देवी फाउंडेशन का संचालन कब से कर रहे हैं?",
    option:["1998",
            "1999",
            "1915",
            "1917"],
    answer:"1999"
},

{
    question: "बालक को आँसू कब छलके?",
    option:["पिटाई लगने पर",
            "खिलौने नहीं मिलने पर",
            "मिठाई नहीं मिलने पर",
            "पहली विफलता पर"],
    answer:"पहली विफलता पर"
},

{
    question: "मछलियाँ कहाँ रखी हुई थीं?",
    option:["नहान घर में",
            "कुआँ में",
            "आँगन में",
            "कमरा में"],
    answer:"नहान घर में"
},

{
question: "मैक्समूलर ने संस्कृत भाषा का अध्ययन कौन-सा विश्वविद्यालय में प्रारंभ किया?",
option:["लिपजिंग विश्वविद्यालय",
        "कैम्ब्रिज विश्वविद्यालय",
        "लंदन विश्वविद्यालय",
        "ऑक्सफोर्ड विश्वविद्यालय"],
answer:"लिपजिंग विश्वविद्यालय"
},

{
    question: "रूपसा क्या है?",
    option:["बंगाल की नदी",
            "बंगाल की एक सुंदर स्त्री",
            "बंगाल का मंदिर",
            "बंगाल का चौराहा"],
    answer:"बंगाल की नदी"
},

{
    question: "इनमें कौन पंडित बिरजू महाराज की शिष्या नहीं थी?",
    option:["शाश्वती",
            "अनुराधा",
            "दुर्गा",
            "रश्मि वाजपेयी"],
    answer:"अनुराधा"
},

{
    question: "विनोद कुमार शुक्ल को साहित्य अकादमी पुरस्कार कब मिला था?",
    option:["1992 ई.",
            "1837 ई.",
            "1937 ई.",
            "1990 ई."],
    answer:"1990 ई."
},

{
question: "भाषा विज्ञान के द्वारा भाषा के संदर्भ में अबतक जो निष्कर्ष निकाला गया है उसमें कौन-सी भाषा सबसे अहम है?",
option:["अंग्रेजी",
        "ग्रीक",
        "संस्कृत",
        "लैटिन"],
answer:"संस्कृत"
},

{
    question: "‘प्रेमघन’ जी किस युग के महत्वपूर्ण कवि थे?",
    option:["द्विवेदी युग",
            "भारतेन्दु युग",
            "भक्ति युग",
            "आधुनिक युग"],
    answer:"भारतेन्दु युग"
},

{
    question: "बिस्मिल्ला खाँ का जन्म हुआ था",
    option:["उत्तर प्रदेश में",
            "पश्चिम बंगाल में",
            "महाराष्ट्र में",
            "डुमराँव, बिहार में"],
    answer:"डुमराँव, बिहार में"
},

{
    question: "‘इसी दुनिया में’ किसकी कृति है?",
    option:["रघुवीर सहाय",
            "मुक्तिबोध",
            "केदारनाथ अग्रवाल",
            "वीरेन डंगवाल"],
    answer:"वीरेन डंगवाल"
},

{
    question: "‘कल्पलता’ किसकी रचना है?",
    option:["हजारी प्रसाद द्विवेदी",
            "गुणाकर मूले",
            "अशोक वाजपेयी",
            "महात्मा गाँधी"],
    answer:"हजारी प्रसाद द्विवेदी"
},

{
    question: "अनामिका जी ने पी.एच.डी. की उपाधि कहाँ से प्राप्त की?",
    option:["दिल्ली",
            "पटना",
            "लखनऊ",
            "उत्तर प्रदेश"],
    answer:"दिल्ली"
},

{
    question: "बिस्मिल्ला खाँ के पिताजी कहाँ शहनाई बजाते थे?",
    option:["मंदिर में",
            "मस्जिद में",
            "गुरुद्वारा में",
            "चर्च में"],
    answer:"मंदिर में"
},

{
    question: "“रामधारी सिंह दिनकर” के अनुसार आज के देवता कहाँ मिलेंगे?",
    option:["घर-द्वार में",
            "महलों में",
            "मंदिर-मस्जिद",
            "खेतों-खलिहान"],
    answer:"खेतों-खलिहान"
},

{
    question: "‘बहादुर’ कहानी के कहानीकार कौन हैं?",
    option:["नलिन विलोचन शर्मा",
            "अमरकांत",
            "विनोद कुमार शुक्ल",
            "अशोक वाजपेयी"],
    answer:"अमरकांत"
},

{
    question: "“जित-जित मैं निरखत हूँ” साहित्य की कौन-सी विद्या है?",
    option:["साक्षात्कार",
            "निबंध",
            "आत्मकथा",
            "संस्मरण"],
    answer:"साक्षात्कार"
},

{
    question: "पंतजी विरोधी थे",
    option:["मानवतावाद का",
            "अतिवादिता का",
            "समाजवादिता का",
            "इनमें से कोई नहीं"],
    answer:"अतिवादिता का"
},

{
    question: "“बायरन” किस भाषा के कवि थे?",
    option:["हिन्दी",
            "संस्कृत",
            "अंग्रेजी",
            "फ्रेंच"],
    answer:"अंग्रेजी"
},

{
    question: "कुँवर नारायण ने बूढ़ा चौकीदार किसे कहा है?",
    option:["पहाड़",
            "व्यक्ति",
            "वृक्ष",
            "सैनिक"],
    answer:"वृक्ष"
},

{
    question: "भग्गू संतू के पीछे-पीछे क्यों भागा?",
    option:["संतू को मारने के लिए",
            "संतू को बुलाने के लिए",
            "मछली छीनने के लिए",
            "संतू को समझाने के लिए"],
    answer:"मछली छीनने के लिए"
},

{
question: "कौन प्राचीनतम भाषा है?",
option:["हिन्दी",
        "मराठी",
        "संस्कृत",
        "उर्दू"],
answer:"संस्कृत"
},

{
    question: "अशोक वाजपेयी का 24 अक्टूबर से 10 नवम्बर, 1994 तक कुल कितनी रचनाएँ की?",
    option:["5 कविता, 7 गद्य",
            "15 कविता, 17 गद्य",
            "25 कविता, 27 गद्य",
            "35 कविता, 27 गद्य"],
    answer:"35 कविता, 27 गद्य"
},

{
    question: "रेनर मारिया रिल्के किस भाषा के कवि हैं?",

    option:["जर्मन",
            "फ्रेंच",
            "स्पेनिश",
            "ग्रीक"],

    answer:"जर्मन"
},

{
question: "“भारत से हम क्या सीखें” के लेखक कौन हैं?",
option:["भीमराव अंबेदकर",
        "मैक्समूलर",
        "अमरकांत",
        "बिरजू महाराज"],
answer:"मैक्समूलर"
},

{
    question: "शहर को बचाना है",
    option:["गंदगी से",
            "भ्रष्टाचार से",
            "नादिरों से",
            "शोर-गुल से"],
    answer:"नादिरों से"
},

{
    question: "कवि के अनुसार भारतीय को क्या अच्छा लगने लगा था?",
    option:["विदेशी चाल-चलन",
            "विदेशी वेशभूषा",
            "विदेशी रहन-सहन",
            "इनमें सभी"],
    answer:"इनमें सभी"
},

{
    question: "“क्यों री राक्षसी, इस छोटे से बच्चे को क्यों पीट रही है?” किसने कहा?",
    option:["मंगम्मा ने",
            "पाप्पाति ने",
            "लक्ष्मी ने",
            "सीता ने"],
    answer:"मंगम्मा ने"
},

{
question: "विश्व में कौन ऐसा देश है जिसे मैक्समूलर ने सर्वविद्य सम्पदा से परिपूर्ण कहा है?",
option:["अमेरिका",
        "जापान",
        "चीन",
        "भारत"],
answer:"भारत"
},

{
    question: "दधीचि की हड्डी से क्या बना था?",
    option:["त्रिशूल",
            "इन्द्र का वज्र",
            "तलवार",
            "कुछ भी नहीं"],
    answer:"इन्द्र का वज्र"
},

{
    question: "झोले में कितनी मछलियाँ थीं?",
    option:["पाँच",
            "तीन",
            "दो",
            "छः"],
    answer:"तीन"
},

{
    question: "‘नगर’ शीर्षक कहानी के लेखक कौन हैं?",

    option:["सुजाता",
            "साँवर दइया",
            "श्रीनिवास",
            "सातकोड़ी होता"],

    answer:"सुजाता"
},

{
    question: "‘प्रेमघन’ की काव्य कृति है",
    option:["अरुणोदय",
            "हर्षादर्श",
            "जीर्ण जनपद",
            "इनमें सभी"],
    answer:"इनमें सभी"
},

{
    question: "वीरेन डंगवाल का जन्म कहाँ हुआ?",
    option:["राँची, झारखण्ड",
            "बिहटा, बिहार",
            "आसनसोल, पश्चिम बंगाल",
            "उत्तराखंड"],
    answer:"उत्तराखंड"
},

{
    question: "विनोद कुमार शुक्ल का जन्म कब हुआ था?",
    option:["5 फरवरी 1827 ई.",
            "6 जनवरी 1937 ई.",
            "14 नवम्बर 1867 ई.",
            "1 जनवरी 1937 ई."],
    answer:"1 जनवरी 1937 ई."
},

{
    question: "रुपये खोने का प्रपंच किसने रचा था?",
    option:["कहानीकार के मित्र ने",
            "कहानीकार के भाई ने",
            "कहानीकार के रिश्तेदार ने",
            "कहानीकार के साले ने"],
    answer:"कहानीकार के रिश्तेदार ने"
},

{
    question: "‘मदुरै’ को यूनानी लोगों द्वारा क्या कहा जाता है?",

    option:["मंदारा",
            "मेदोरा",
            "मदिरा",
            "मंदिरा"],

    answer:"मेदोरा"
},

{
    question: "बिरजू महाराज की शादी कितने वर्ष की उम्र में हुई थी?",
    option:["18 साल में",
            "19 साल में",
            "20 साल में",
            "21 साल में"],
    answer:"18 साल में"
},

{
    question: "मंगम्मा को मखमल का जाकिट पहनने पर सबसे पहले किसने टोका?",
    option:["गाँव के एक लड़के ने",
            "बहू ने",
            "कथावाचक ने",
            "उसके बेटे ने"],
    answer:"गाँव के एक लड़के ने"
},

{
    question: "उत्तर भारत से नागरी लिपि के लेख कब से मिलने लगते हैं?",
    option:["आठवीं सदी",
            "छठी सदी",
            "नौवीं सदी",
            "चौथी सदी"],
    answer:"नौवीं सदी"
},

{
    question: "‘युगवाणी’ किनकी रचना है?",
    option:["महादेवी वर्मा की",
            "सूर्यकान्त त्रिपाठी ‘निराला’ की",
            "सुमित्रानंदन पंत की",
            "इनमें से कोई नहीं"],
    answer:"सुमित्रानंदन पंत की"
},

{
    question: "‘मेरे बिना तुम प्रभु’ कविता किनके द्वारा हिन्दी में रूपांतरित है?",

    option:["दिनकर",
            "निराला",
            "धर्मवीर भारती",
            "प्रयाग शुक्ल"],

    answer:"धर्मवीर भारती"
},

{
    question: "कौन अपना अर्थ खो बैठेगा?",

    option:["भगवान",
            "भक्त",
            "मानव",
            "दानव"],

    answer:"भगवान"
},

{
    question: "‘दिनकर’ की किस रचना में कर्ण को नायक बनाया गया है?",
    option:["उर्वशी",
            "रश्मिरथी",
            "हुंकार",
            "हारे को हरिनाम"],
    answer:"रश्मिरथी"
},

{
    question: "मंगम्मा किस भाषा की कहानी है?",
    option:["तेलुगु",
            "उड़िया",
            "हिन्दी",
            "कन्नड़"],
    answer:"कन्नड़"
},

{
    question: "रेनर मारिया रिल्के का निधन कब हुआ?",

    option:["अप्रैल 1987",
            "दिसंबर 1926",
            "दिसंबर 1977",
            "जनवरी 1948"],

    answer:"दिसंबर 1926"
},

{
    question: "बहादुर को लेखक के घर कौन लेकर आया था?",
    option:["लेखक का भाई",
            "लेखक का पड़ोसी",
            "लेखक का साला",
            "लेखक की बहन"],
    answer:"लेखक का साला"
},

{
    question: "‘सुजान रसखान’ के रचनाकार हैं",
    option:["घनानंद",
            "रसखान",
            "प्रेमघन",
            "अज्ञेय"],
    answer:"रसखान"
},

{
    question: "अमराई का कुआँ कहाँ है?",
    option:["शहर में",
            "बाजार में",
            "रास्ते में",
            "रंगप्पा के खेत में"],
    answer:"रास्ते में"
},

{
    question: "अक्षर-ज्ञान शीर्षक कविता में किस मनोविज्ञान का आधार लिया गया है?",
    option:["स्त्री मनोविज्ञान",
            "बाल मनोविज्ञान",
            "वृद्ध मनोविज्ञान",
            "किशोर मनोविज्ञान"],
    answer:"बाल मनोविज्ञान"
},

{
    question: "‘नगर’ शीर्षक पाठ में अमलराज को कितना नंबर कमरा दिखलाने के लिए कहा गया?",

    option:["49",
            "50",
            "48",
            "51 नंबर"],

    answer:"48"
},

{
    question: "‘शाहनेय’ की उपाधि किसे दी गई?",
    option:["बिस्मिल्ला खाँ को",
            "सादिक हुसैन को",
            "शम्सुद्दीन को",
            "शहनाई को"],
    answer:"शहनाई को"
},

{
    question: "कवि ने ‘राइफल’ की संज्ञा किसे दी है?",
    option:["सिपाही के कंधे में लटकते हुए राइफल को",
            "लेखक के घर में रखे हुए राइफल को",
            "वृक्ष की सूखी डाल को",
            "इनमें से किसी को नहीं"],
    answer:"वृक्ष की सूखी डाल को"
},

{
    question: "निम्न में कौन-सा ग्रंथ रसखान का है?",
    option:["जपुजी",
            "प्रेमवाटिका",
            "सोहिला",
            "विरहलीला"],
    answer:"प्रेमवाटिका"
},

{
question: "कहानी के अंत में गिरधर का व्यवहार कैसा होता है?",
option:["नरम और संरक्षक",
        "कठोर",
        "उदासीन",
        "क्रूर"],
answer:"नरम और संरक्षक"
},

{
    question: "फिनिक्स था :",

    option:["आश्रम",
            "विद्यालय",
            "चिड़ियाँ घर",
            "कैद खाना"],

    answer:"आश्रम"
},

{
    question: "‘प्रेमघन’ की प्रसिद्ध नाट्यकृति कौन-सी है?",
    option:["हार्दिक हर्षादर्श",
            "जीर्णजनपद",
            "बृजचन्द पंचक",
            "प्रयाग रामागमन"],
    answer:"प्रयाग रामागमन"
},

{
    question: "पागलों के अस्पताल में उपद्रवी मरीजों को कैसे रखा जाता था ?",

    option:["बाँधकर",
            "स्वतंत्र",
            "कमरे में बंदकर",
            "ऊँचे स्थान पर"],

    answer:"कमरे में बंदकर"
},

{
    question: "कवि रसखान ने प्रेम-बरन किसे कहा है?",
    option:["नंद बाबा को",
            "यशोदा मैया को",
            "गोपियों को",
            "श्रीकृष्ण को"],
    answer:"श्रीकृष्ण को"
},

{
    question: "कवि को वृक्ष कैसा लगता है?",
    option:["युवा चौकीदार की तरह",
            "शान से खड़े चौकीदार की तरह",
            "बूढ़ा चौकीदार की तरह",
            "नतमस्तक चौकीदार की तरह"],
    answer:"बूढ़ा चौकीदार की तरह"
},

{
    question: "उत्तर भारत की विशेष स्थापत्य शैली को क्या कहते हैं?",
    option:["ललित शैली",
            "अभिनागर शैली",
            "विभाट शैली",
            "नागर शैली"],
    answer:"नागर शैली"
},

{
    question: "घनानंद की कीर्ति का आधार है",
    option:["सुजानहित",
            "घन आनंद कवित्त",
            "(A) और (B) दोनों",
            "इनमें कोई नहीं"],
    answer:"(A) और (B) दोनों"
},

{
    question: "कवि पंतजी को किसका हास भी राहुग्रसित दिखाई पड़ता है?",
    option:["अंग्रेजों का",
            "भारतीयों का",
            "भारत माता का",
            "इनमें से कोई नहीं"],
    answer:"भारत माता का"
},

{
    question: "‘भारतमाता’ कविता कवि के किस काव्य ग्रंथ से संकलित है?",
    option:["वीणा",
            "ग्रंथि",
            "ग्राम्या",
            "उच्छवास"],
    answer:"ग्राम्या"
},

{
    question: "‘हिन्दी साहित्य का आदिकाल’ के रचनाकार हैं",
    option:["नलिन विलोचन शर्मा",
            "आचार्य हजारी प्रसाद द्विवेदी",
            "हजारी प्रसाद द्विवेदी",
            "देवेन्द्रनाथ शर्मा"],
    answer:"आचार्य हजारी प्रसाद द्विवेदी"
},

{
    question: "पराधीन भारत में चारों वर्गों में चाह थी",
    option:["कलावृत्ति",
            "दासवृत्ति",
            "(A) और (B) दोनों",
            "इनमें से कोई नहीं"],
    answer:"दासवृत्ति"
},

{
    question: "कवि ने घर लौटने पर दरवाजे पर क्या नहीं देखा?",
    option:["माँ को",
            "पिताजी को",
            "तुलसी के पौधे को",
            "बूढ़े चौकीदार वृक्ष को"],
    answer:"बूढ़े चौकीदार वृक्ष को"
},

{
    question: "'लौटकर आऊँगा फिर' कविता किस कवि द्वारा भावांतरित की गई?",
    option:["जीवनानंद दास",
            "विनोद कुमार शुक्ल",
            "प्रयाग शुक्ल",
            "कुँवर नारायण"],
    answer:"प्रयाग शुक्ल"
},

{
    question: "‘गीता प्रकाशिनी’ किसके लिए प्रयुक्त है?",
    option:["धरतीमाता",
            "पृथ्वीमाता",
            "सीतामाता",
            "भारतमाता"],
    answer:"भारतमाता"
},

{
    question: "भक्त कवि अपने को भगवान का क्या मानता है?",

    option:["जलपात्र",
            "सेवक",
            "भक्त",
            "अनुयायी"],

    answer:"जलपात्र"
},

{
    question: "रसखान ने चितचोर किसे कहा है?",
    option:["गोपियों को",
            "कृष्णभक्तों को",
            "ग्वाल-बाल को",
            "श्रीकृष्ण को"],
    answer:"श्रीकृष्ण को"
},

{
    question: "लड़के की नाव कैसी है?",
    option:["बड़ी",
            "छोटी",
            "पुरानी",
            "नई"],
    answer:"पुरानी"
},

{
    question: "इनमें कौन नाट्यकृति है?",
    option:["मानसरोवर",
            "विपथगा",
            "मृगनयनी",
            "भारत सौभाग्य"],
    answer:"भारत सौभाग्य"
},

{
    question: "“गुणाकर मुले” का निधन कब हुआ?",
    option:["2009",
            "2008",
            "2010",
            "2011"],
    answer:"2009"
},

{
    question: "‘प्रेमघन’ ने इनमें से किस मासिक पत्रिका का सम्पादन किया?",
    option:["नागरी नीरद",
            "प्रयाग रामागमन",
            "आनंदकादम्बिनी",
            "आनन्द अरुणोदय"],
    answer:"आनंदकादम्बिनी"
},

{
    question: "लौटकर आऊँगा फिर शीर्षक कविता में उल्लू कहाँ बोलता है?",
    option:["आम के पेड़ पर",
            "कपास के पेड़ पर",
            "कचनार के पेड़ पर",
            "अमरूद के पेड़ पर"],
    answer:"कपास के पेड़ पर"
},

{
question: "वारेन हेस्टिंग्स था",
option:["भारत का गवर्नर जेनरल",
        "फारस का राजा",
        "महान दार्शनिक",
        "प्रसिद्ध समाज सुधारक"],
answer:"भारत का गवर्नर जेनरल"
},

{
    question: "पंत को किस रचना पर ज्ञानपीठ पुरस्कार प्राप्त हुआ है?",
    option:["चिदंबरा",
            "सत्यकाम",
            "लोकायतन",
            "स्वर्ण किरण"],
    answer:"चिदंबरा"
},

{
    question: "‘नटरंग’ पत्रिका का सम्बन्ध है",
    option:["नाटक",
            "रंगकर्म",
            "कहानी",
            "खेल जगत"],
    answer:"रंगकर्म"
},

{
    question: "दक्षिण भारत के पांड्य प्रदेश से किस राजा के पालियम ताम्रपत्र मिले हैं?",
    option:["महेन्द्रपाल",
            "राजा वरगुण",
            "राजा भोज",
            "श्रीगंग राजा"],
    answer:"राजा वरगुण"
},

{
    question: "‘मौत का नगर’ किस लेखक का कहानी-संग्रह है?",
    option:["अनामिका",
            "महादेवी वर्मा",
            "डॉ. रामविलास",
            "अमरकांत"],
    answer:"अमरकांत"
},

{
    question: "काशी हिन्दू विश्वविद्यालय से हजारी प्रसाद द्विवेदी को कौन-सी उपाधि दी गई?",
    option:["पद्मभूषण",
            "अशोक चक्र",
            "विजय चक्र",
            "ज्योतिषाचार्य"],
    answer:"ज्योतिषाचार्य"
},

{
    question: "किसका शानदार लबादा गिर जाएगा?",

    option:["प्रभु का",
            "राजा का",
            "देवता का",
            "भक्त का"],

    answer:"प्रभु का"
},

{
question: "बाबा साहेब (भीमराव अम्बेदकर) का विख्यात भाषण इनमें से कौन सा है?",
option:["भारत भक्त ऑफ कास्ट",
        "नकेन के प्रपद्य",
        "एनीहिलेशन ऑफ कास्ट",
        "इनमें से कोई नहीं"],
answer:"एनीहिलेशन ऑफ कास्ट"
},

{
    question: "‘धूप’ कौन-सा कारक है?",
    option:["कर्म",
            "अधिकरण",
            "करण",
            "इनमें कोई नहीं"],
    answer:"अधिकरण"
},

{
    question: "असुरों के पास नहीं थे",
    option:["विद्याएँ",
            "शक्ति",
            "युद्ध कौशल",
            "लोहे के अस्त्र"],
    answer:"लोहे के अस्त्र"
},

{
    question: "बिरजू महाराज के किस उम्र के पड़ाव पर उनके पिताजी की मृत्यु हो गई?",
    option:["11 वर्ष की",
            "10 वर्ष की",
            "9 वर्ष की",
            "8 वर्ष की"],
    answer:"9 वर्ष की"
},

{
    question: "कवि कुँवर नारायण ने ‘चौकीदार’ की संज्ञा किसे दी है?",
    option:["देश की सेना को",
            "घर के बाहर खड़े वृक्ष को",
            "घर के पहरेदार को",
            "इनमें से कोई नहीं"],
    answer:"घर के बाहर खड़े वृक्ष को"
},

{
    question: "‘शेक्सपीयर’ को किस रूप में जाना जाता है ?",

    option:["कवि",
            "नाटककार",
            "(क) और (ख) दोनों",
            "इनमें से कोई नहीं"],

    answer:"(क) और (ख) दोनों"
},

{
    question: "बहादुर किसके मार से भागकर लेखक के घर आया था?",
    option:["पिता",
            "माँ",
            "निर्मला",
            "किशोर"],
    answer:"माँ"
},

{
    question: "जनतंत्र में कवि के अनुसार राजदण्ड क्या होंगे?",
    option:["ढाल और तलवार",
            "फूल और भौरे",
            "फावड़े और हल",
            "बाघ और भालू"],
    answer:"फावड़े और हल"
},

{
    question: "कौन प्रेम कर सकते हैं?",
    option:["छली और कपटी ही",
            "निश्छल और निष्कपट ही",
            "(A) और (B) दोनों ही",
            "इनमें से कोई नहीं"],
    answer:"निश्छल और निष्कपट ही"
},

{
    question: "रेनर मारिया रिल्के का जन्म कब हुआ था?",

    option:["1899",
            "1875",
            "1961",
            "1947"],

    answer:"1875"
},

{
question: "मैक्समूलर ने हितोपदेश का अनुवाद कौन-सी भाषा में करवाया?",
option:["अंग्रेजी",
        "उर्दू",
        "जर्मन",
        "फ्रेंच"],
answer:"जर्मन"
},

{
    question: "धनानंद की महत्त्वपूर्ण रचना है",
    option:["सुधा",
            "वैराग्य",
            "सुजानसागर",
            "इनमें सभी"],
    answer:"सुजानसागर"
},

{
    question: "‘ढहते विश्वास‘ कहानी में कैसी समस्या का वर्णन है?",

    option:["दहेज की समस्या",
            "अकाल की समस्या",
            "बाढ़ की समस्या",
            "घूसखोरी की समस्या"],

    answer:"बाढ़ की समस्या"
},

{
    question: "घनानंद किनके द्वारा मारे गये?",
    option:["सुजान के पहरेदार द्वारा",
            "मुहम्मदशाह के सैनिकों द्वारा",
            "नादिरशाह के सैनिकों द्वारा",
            "इनमें कोई नहीं"],
    answer:"नादिरशाह के सैनिकों द्वारा"
},

{
    question: "‘नंजम्मा’ मंगम्मा की कौन थी?",
    option:["बेटी",
            "मौसी",
            "बहू",
            "सौतन"],
    answer:"बहू"
},

{
    question: "हिन्दी भाषा की लिपि है",
    option:["ब्राह्मी लिपि",
            "रोमन लिपि",
            "देवनागरी लिपि",
            "गुरूमुखी लिपि"],
    answer:"देवनागरी लिपि"
},

{
    question: "‘जित-जित मैं निरखत हूँ’ किस विधा की रचना है?",
    option:["व्यक्ति चित्र",
            "निबंध",
            "आत्मकथा",
            "साक्षात्कार"],
    answer:"साक्षात्कार"
},

{
    question: "‘भारतेन्दु हरिश्चन्द्र’ किसकी रचना है?",
    option:["हरिश्चन्द्र की",
            "गुणाकर मूले की",
            "नलिन विलोचन शर्मा की",
            "डॉ. रामविलास शर्मा की"],
    answer:"डॉ. रामविलास शर्मा की"
},

{
    question: "बिरजू महाराज ने गण्डा बाँधने पर बाबूजी को गुरु दक्षिणा के रूप में कितनी राशि अर्पित की?",
    option:["200 रु.",
            "300 रु.",
            "400 रु.",
            "500 रु."],
    answer:"500 रु."
},

{
    question: "लक्ष्मी के पति का क्या नाम है?",

    option:["वीरेन्द्र",
            "लक्ष्मण",
            "राजनेश",
            "महेश"],

    answer:"लक्ष्मण"
},

{
    question: "‘प्रेमघन’ ने किस संस्था की स्थापना की?",
    option:["विद्वत् समाज का",
            "रसिक समाज का",
            "कवि समाज का",
            "साहित्य समाज का"],
    answer:"रसिक समाज का"
},

{
    question: "स्वामी विट्ठलनाथ ने रसखान को कहाँ दीक्षा दी?",
    option:["वाटिका में",
            "झोपड़ी में",
            "पुष्टिमार्ग में",
            "गुफा में"],
    answer:"पुष्टिमार्ग में"
},

{
    question: "हिरोशिमा कविता में सूरज की संज्ञा किसे दी गई है?",
    option:["जापान बम को",
            "अणुबम को",
            "हाइड्रोजन बम को",
            "रडार को"],
    answer:"अणुबम को"
},

{
    question: "मंगु की माँ अस्पताल की तुलना किससे करती थी ?",

    option:["धर्मशाला",
            "गौशाला",
            "पाठशाला",
            "नृत्यशाला"],

    answer:"गौशाला"
},

{
    question: "चिंता अज्ञेय की किस प्रकार की रचना है?",
    option:["काव्य",
            "कहानी",
            "निबंध",
            "नाटक"],
    answer:"काव्य"
},

{
    question: "नाश्ता-पानी के बाद बातों की क्या छनने लगी?",
    option:["पूरी",
            "पुआ",
            "जलेबी",
            "इनमें सभी"],
    answer:"जलेबी"
},

{
    question: "“इन मुसलमान हरिजन पै, कोटिन हिन्दू वारिये” यह किस कवि के लिए कहा गया है?",
    option:["कबीरदास",
            "मलिक मुहम्मद जायसी",
            "रहीम",
            "रसखान"],
    answer:"रसखान"
},

{
    question: "अशोक वाजपेयी का जन्म कब हुआ था?",
    option:["16 जनवरी 1941",
            "18 अप्रैल 1861",
            "15 जनवरी 1885",
            "20 मार्च 1912"],
    answer:"16 जनवरी 1941"
},

{
    question: "पाप्पाति बेहोश क्यों पड़ी थी?",

    option:["सिर दर्द के कारण",
            "तेज बुखार के कारण",
            "चोट लगने के कारण",
            "पेट दर्द के कारण"],

    answer:"तेज बुखार के कारण"
},

{
    question: "श्रीनिवास जी का पूरा नाम क्या है?",
    option:["सण्णा कथेगुलु",
            "बी० आर० नारायण",
            "मास्ती वेंकटेश अय्यंगार",
            "रघुनाथ प्रसाद"],
    answer:"मास्ती वेंकटेश अय्यंगार"
},

{
    question: "मुगल बादशाह मुहम्मदशाह रँगीले के यहाँ क्या काम करते थे?",
    option:["सलाहकार का",
            "मीरमुंशी का",
            "कोषाध्यक्ष का",
            "मजदूरी का"],
    answer:"मीरमुंशी का"
},

{
    question: "जातीय अस्मिता की दृष्टि से इतिहास का प्रवाह कैसा है?",
    option:["विच्छिन्न",
            "अविच्छिन्न",
            "(A) और (B) दोनों",
            "इनमें से कोई नहीं"],
    answer:"(A) और (B) दोनों"
},

{
    question: "‘मेरे बिना तुम प्रभु’ किस कवि की रचना है?",

    option:["जीवनानंद दास",
            "रवीन्द्रनाथ ठाकुर",
            "रेनर मारिया रिल्के",
            "वीरेन डंगवाल"],

    answer:"रेनर मारिया रिल्के"
},

{
question: "डॉ. भीमराव अम्बेदकर के माता का क्या नाम था?",
option:["रानी बाई",
        "कुन्ती बाई",
        "शीला बाई",
        "भीमा बाई"],
answer:"भीमा बाई"
},

{
    question: "कवि प्रेमघन समाज के किस वर्ग की आलोचना करता है?",
    option:["दुःख भोगी",
            "विलासिता भोगी",
            "सुविधा भोगी",
            "आलस भोगी"],
    answer:"सुविधा भोगी"
},

{
question: "खोखा किसका पुत्र है?",
option:["गिरधर",
        "सेन साहब",
        "मदन",
        "काशू"],
answer:"सेन साहब"
},

{
question: "मैक्समूलर की मृत्यु कब हुई?",
option:["16 अक्टूबर, 1901",
        "20 अक्टूबर, 1901",
        "24 अक्टूबर, 1900",
        "28 अक्टूबर, 1900"],
answer:"28 अक्टूबर, 1900"
},

{
    question: "कौन-सी कृति अज्ञेय की नहीं है?",
    option:["बावरा अहेरी",
            "आँगन के पार द्वार",
            "एक बूंद सहसा उछली",
            "मिलनयामिनी"],
    answer:"मिलनयामिनी"
},

{
    question: "‘मछली’ शीर्षक कहानी कहानीकार विनोद कुमार शुक्ल के किस कहानी-संग्रह से ली गई है?",
    option:["पेड़ पर कमरा",
            "महाविद्यालय",
            "मानसरोवर",
            "कोठरी की बात"],
    answer:"महाविद्यालय"
},

{
    question: "आविन्यों दक्षिणी फ्रांस का एक पुराना ‘…’ है।",
    option:["बौद्ध मठ",
            "शहर",
            "सनातन मठ",
            "गुरुकुल"],
    answer:"शहर"
},

{
    question: "गुणाकर मूले का जन्म किस राज्य में हुआ था?",
    option:["बिहार",
            "उत्तरप्रदेश",
            "महाराष्ट्र",
            "मध्यप्रदेश"],
    answer:"महाराष्ट्र"
},

{
    question: "कहानीकार सुजाता का असली नाम क्या है?",

    option:["एम० रंगराजन",
            "एस० रंगराजन",
            "एल० रंगराजन",
            "एन० रंगराजन"],

    answer:"एस० रंगराजन"
},

{
question: "मदन किस कारण विवाद में पड़ता है?",
option:["खोखा के साथ लड़ाई के कारण",
        "चोरी के लिए",
        "नौकरी न करने के लिए",
        "पढ़ाई छोड़ने के लिए"],
answer:"खोखा के साथ लड़ाई के कारण"
},

{
    question: "‘मनमानिक’ में कौन-सा अलंकार है?",
    option:["उपमा",
            "उत्प्रेक्षा",
            "रूपक",
            "श्लेष"],
    answer:"रूपक"
},

{
    question: "‘घरवाले के रहते एक अच्छी साड़ी नसीब नहीं हुई’- ऐसा किसने कहा?",
    option:["मंगम्मा",
            "नंजम्मा",
            "लेखक की पत्नी",
            "इनमें से कोई नहीं"],
    answer:"मंगम्मा"
},

{
    question: "कथावाचक मंगम्मा को किस चीज के लिए पान-सुपारी देती थी?",
    option:["जब वह आती थी",
            "जब वह नहीं लाती थी, तब माँगने पर",
            "हर बार दही लेने पर",
            "झगड़ा निबटने पर"],
    answer:"जब वह नहीं लाती थी, तब माँगने पर"
},

{
question: "‘श्रम-विभाजन और जाति-प्रथा’ के लेखक कौन हैं?",
option:["डॉ० राममनोहर लोहिया",
        "बाबा साहब भीमराव अम्बेदकर",
        "महात्मा गाँधी",
        "डॉ० सम्पूर्णानन्द"],
answer:"बाबा साहब भीमराव अम्बेदकर"
},

{
    question: "हजारी प्रसाद द्विवेदी का जन्म कहाँ हुआ?",
    option:["समस्तीपुर, बिहार",
            "बलिया, बिहार",
            "बलिया, उत्तर प्रदेश",
            "इलाहाबाद, उत्तर प्रदेश"],
    answer:"बलिया, उत्तर प्रदेश"
},

{
    question: "जीवनानंद दास किस भाषा के रचनाकार हैं?",
    option:["गुजराती",
            "हिन्दी",
            "बाँग्ला",
            "संस्कृत"],
    answer:"बाँग्ला"
},

{
    question: "कथावाचक के अनुसार, किसकी दशा पानी में खड़े बच्चे का पाँव खींचने वाले मगरमच्छ की सी है?",
    option:["मंगम्मा (सास) की",
            "नंजम्मा (बहू) की",
            "मंगम्मा के बेटे की",
            "रंगप्पा की"],
    answer:"नंजम्मा (बहू) की"
},

{
question: "सेन साहब की धर्मपत्नी की अवधारणा क्या है?",
option:["बेटियों के प्रति भेदभाव",
        "उदार स्वभाव",
        "मित्रवत व्यवहार",
        "न्यायप्रिय"],
answer:"बेटियों के प्रति भेदभाव"
},

{
    question: "प्रेमघन ने 1874 में किस समाज की स्थापना की?",
    option:["आर्य समाज",
            "ब्रह्म समाज",
            "रसिक समाज",
            "इनमें कोई नहीं"],
    answer:"रसिक समाज"
},

{
    question: "इस पाठ में ‘चितचोर’ किसे कहा गया है?",
    option:["राधा को",
            "श्रीकृष्ण को",
            "रसखान को",
            "भारतेन्दु हरिश्चन्द्र को"],
    answer:"श्रीकृष्ण को"
},

{
    question: "वल्लि अम्माल किस शीर्षक कहानी की पात्रा है?",

    option:["माँ",
            "नगर",
            "ढहते विश्वास",
            "दही वाली मंगम्मा"],

    answer:"नगर"
},

{
    question: "‘प्रेमघन’ जी किस राज्य के निवासी थे?",
    option:["बिहार",
            "मध्यप्रदेश",
            "उत्तरप्रदेश",
            "राजस्थान"],
    answer:"उत्तरप्रदेश"
},

{
    question: "अशोक वाजपेयी ‘ला शत्रूज’ में कितने दिनों तक रहे?",
    option:["उन्नीस दिन",
            "सात दिन",
            "एक महीना",
            "बीस दिन"],
    answer:"उन्नीस दिन"
},

{
    question: "रीति मुक्त काव्यधारा के सिरमौर कवि किन्हें माना जाता है?",
    option:["प्रेमघन",
            "घनानंद",
            "रसखान",
            "कबीर"],
    answer:"घनानंद"
},

{
    question: "मंगम्मा को किसके साथ विवाद था?",
    option:["पोते के साथ",
            "नंजम्मा के साथ",
            "मालकिन के साथ",
            "पड़ोसी के साथ"],
    answer:"नंजम्मा के साथ"
},

{
    question: "अमरकांत की रचना है",
    option:["बड़े भाई",
            "कुहासा",
            "नौकर की कमीज",
            "सूर्य"],
    answer:"कुहासा"
},

{
    question: "दिनकर किस विश्वविद्यालय के उपकुलपति (कुलपति) बनाये गये थे?",
    option:["बिहार विश्वविद्यालय",
            "पटना विश्वविद्यालय",
            "भागलपुर विश्वविद्यालय",
            "मगध विश्वविद्यालय"],
    answer:"भागलपुर विश्वविद्यालय"
},

{
    question: "प्रेमघन ने ‘रसिक समाज’ की स्थापना कब की?",
    option:["1870",
            "1872",
            "1873",
            "1874"],
    answer:"1874"
},

{
    question: "बिस्मिल्ला खाँ प्रसिद्ध …… थे।",
    option:["सितारवादक",
            "सदोदवादक",
            "गिटारवादक",
            "शहनाईवादक"],
    answer:"शहनाईवादक"
},

{
    question: "अज्ञेय का जन्म कब हुआ था?",
    option:["8 मार्च 1911",
            "9 मार्च 1911",
            "7 मार्च 1911",
            "10 मार्च 1911"],
    answer:"7 मार्च 1911"
},

{
    question: "अंग्रेजी भाषा के पत्र ‘इण्डिपेण्डेन्स’ की घोषणा कब हुई?",
    option:["16 अगस्त",
            "15 अगस्त",
            "16 सितम्बर",
            "17 अगस्त"],
    answer:"15 अगस्त"
},

{
    question: "‘एक वृक्ष की हत्या’ में कवि शहर को किससे बचाने की बात करता है?",
    option:["लुटेरों से",
            "देश के दुश्मनों से",
            "नादिरों से",
            "इनमें से कोई नहीं"],
    answer:"नादिरों से"
},

{
    question: "किनके जन्म दिवस को अहिंसा दिवस के रूप में मनाया जाता है ?",

    option:["महात्मा गाँधी",
            "डॉ. राजेन्द्र प्रसाद",
            "जवाहरलाल नेहरू",
            "बाल गंगाधर तिलक"],

    answer:"महात्मा गाँधी"
},

{
    question: "‘ढहते विश्वास‘ किस भाषा से अनुदित है?",

    option:["कन्नड़",
            "तमिल",
            "उड़िया",
            "गुजराती"],

    answer:"उड़िया"
},

{
    question: "‘कालिदास की लालित्य योजना’ किनकी रचना है?",
    option:["रामविलास शर्मा की",
            "नलिन विलोचन शर्मा की",
            "हजारी प्रसाद द्विवेदी की",
            "अशोक वाजपेयी की"],
    answer:"हजारी प्रसाद द्विवेदी की"
},

{
    question: "कथावाचक के अनुसार, किसकी दशा बच्चे को ऊपर से बाँह पकड़कर बचाने की-सी है?",
    option:["मंगम्मा (माँ) की",
            "नंजम्मा (बहू) की",
            "मंगम्मा के बेटे की",
            "रंगप्पा की"],
    answer:"मंगम्मा (माँ) की"
},

{
question: "‘शाहनामा’ का रचनाकाल है",
option:["सातवीं-आठवीं सदी",
        "दसवीं-ग्यारहवीं सदी",
        "चौथी-पाँचवीं सदी",
        "पाँचवीं-छठी सदी"],
answer:"दसवीं-ग्यारहवीं सदी"
},

{
    question: "इस्लामी शासक का आरंभ काल है?",
    option:["12वीं सदी से",
            "13वीं सदी से",
            "14वीं सदी से",
            "15वीं सदी से"],
    answer:"12वीं सदी से"
},

{
    question: "निर्मला आँखों पर क्या रखकर रोने लगी?",
    option:["रूमाल",
            "हाथ",
            "आँचल",
            "इनमें से कोई नहीं"],
    answer:"आँचल"
},

{
question: "‘मूक नायक’ क्या है?",
option:["अखबार",
        "पत्रिका",
        "पुस्तक",
        "कहानी संग्रह"],
answer:"पत्रिका"
},

{
    question: "‘नाखून क्यों बढ़ते हैं’ गद्य की कौन-सी विधा है?",
    option:["वैचारिक निबंध",
            "शोधपरक निबंध",
            "आलोचनात्मक निबंध",
            "ललित निबंध"],
    answer:"ललित निबंध"
},

{
    question: "शंभू महाराज बिरजू महाराज के कौन थे?",
    option:["मौसा",
            "भाई",
            "पिता",
            "चाचा"],
    answer:"चाचा"
},

{
    question: "गाँधी जी अफ्रीका से लौटकर कब आए थे ?",

    option:["1916 ई० में",
            "1915 ई० में",
            "1917 ई० में",
            "1914 ई० में"],

    answer:"1915 ई० में"
},

{
    question: "‘घनानंद’ अपने आँसूओं को कहाँ पहुँचाना चाहते हैं?",
    option:["समाज में",
            "बादल के पास",
            "वृन्दावन में",
            "सुजान के आँगन में"],
    answer:"सुजान के आँगन में"
},

{
    question: "वीरेन डंगवाल की प्रारंभिक शिक्षा कहाँ से हुई?",
    option:["मुजफ्फरनगर",
            "सहारनपुर",
            "कानपुर",
            "इनमें सभी"],
    answer:"इनमें सभी"
},

{
    question: "‘निराला सृजन पीठ’ में अतिथि साहित्यकार के रूप में कब-से-कब तक रहे?",
    option:["1988 से 1990",
            "1990 से 1992",
            "1992 से 1994",
            "1994 से 1996"],
    answer:"1994 से 1996"
},

{
    question: "भारत माँ के श्रेष्ठ मुख की तुलना कवि ने किससे की है?",
    option:["सूर्य",
            "कंचन",
            "पुष्प",
            "छाया युक्त चंद्र"],
    answer:"छाया युक्त चंद्र"
},

{
    question: "रामविलास शर्मा ने लखनऊ विश्वविद्यालय के किस विभाग में अध्यापन कार्य किया था?",
    option:["संस्कृत",
            "हिन्दी",
            "इतिहास",
            "अंग्रेजी"],
    answer:"अंग्रेजी"
},

{
question: "डॉ० भीमराव अम्बेदकर का जन्म कब हुआ?",
option:["14 अप्रैल, 1888",
        "14 अप्रैल, 1889",
        "14 अप्रैल, 1890",
        "14 अप्रैल, 1891"],
answer:"14 अप्रैल, 1891"
},

{
question: "“मैक्समूलर” के पिता का क्या नाम था?",
option:["फैडरिक",
        "डैविड",
        "विल्हेल्म मूलर",
        "फणनवीस मूलर"],
answer:"विल्हेल्म मूलर"
},

{
    question: "पंक्ति से कौन-सा अक्षर उतर जाता है?",
    option:["अ",
            "ब",
            "ख",
            "क"],
    answer:"ख"
},

{
question: "डॉ. अम्बेदकर ने किस पत्रिका का सम्पादन किया था?",
option:["उज्ज्वल भारत",
        "उड़ता भारत",
        "बहिष्कृत भारत",
        "पुरस्कृत भारत"],
answer:"बहिष्कृत भारत"
},

{
    question: "झरा पालक किनकी रचना है?",
    option:["अनामिका",
            "जीवनानंद दास",
            "वीरेन डंगवाल",
            "कुँवर नारायण"],
    answer:"जीवनानंद दास"
},

{
    question: "वीरेन डंगवाल को कौन-सी उपाधि दी गई?",
    option:["डी. लिट्",
            "पद्मभूषण",
            "भारत रत्न",
            "इनमें से कोई नहीं"],
    answer:"डी. लिट्"
},

{
    question: "आदिम का अर्थ है।",
    option:["आदमी",
            "अति प्राचीन",
            "अर्वाचीन",
            "वनमानुष"],
    answer:"अति प्राचीन"
},

{
    question: "‘ल मादामोजेल द आविन्यों’ किसकी कृति है?",
    option:["लियोनार्दो द विंची",
            "पिकासो",
            "रवीन्द्रनाथ टैगोर",
            "विन्सेंट वैन गो"],
    answer:"पिकासो"
},

{
    question: "‘मालिन-माली’ किसे कहा गया है?",
    option:["राधा-कृष्ण",
            "सीता-राम",
            "पार्वती-शिव",
            "लक्ष्मी-विष्णु"],
    answer:"राधा-कृष्ण"
},

{
    question: "‘कविता के नये प्रतिमान’ के लेखक कौन हैं?",
    option:["वीरेन डंगवाल",
            "श्रीकांत वर्मा",
            "प्रेमधन",
            "घनानन्द"],
    answer:"नामवर सिंह"
},

{
    question: "मछली पाठ के लेखक कौन है?",
    option:["रामधारी सिंह दिनकर",
            "रामचंद्र शुक्ल",
            "विनोद कुमार शुक्ल",
            "प्रेमचंद"],
    answer:"विनोद कुमार शुक्ल"
},

{
    question: "‘द नोटबुक ऑफ माल्टे लॉरिड्स ब्रिज’ किसका उपन्यास है?",

    option:["सुमित्रानंदन पंत",
            "भीमराव अम्बेदकर",
            "रेनर मारिया रिल्के",
            "नलिन विलोचन शर्मा"],

    answer:"रेनर मारिया रिल्के"
},

{
    question: "संतू मछली लेकर क्यों भागा?",
    option:["बेचने के लिए",
            "खाने के लिए",
            "कुएँ में डालने के लिए",
            "काटने के लिए"],
    answer:"कुएँ में डालने के लिए"
},

{
    question: "कवि के अनुसार जनतंत्र के देवता कौन हैं?",
    option:["नेता",
            "शिक्षक",
            "किसान-मजदूर",
            "मंत्री"],
    answer:"किसान-मजदूर"
},

{
    question: "सर्वोदय का कार्यक्रम किसने चलाया ?",

    option:["गोपाल कृष्ण गोखले ने",
            "नेहरू जी ने",
            "महात्मा गाँधी ने",
            "अबुल कलाम आजाद ने"],

    answer:"महात्मा गाँधी ने"
},

{
question: "लेखक की दृष्टि में विडम्बना की बात क्या है?",
option:["जातिवाद के पोषकों की कमी नहीं है",
        "जातिवाद के पोषक नगण्य हैं",
        "आर्थिक दृष्टि के जातिवाद उचित है",
        "जातिवाद लोकतंत्र के विरुद्ध नहीं है"],
answer:"जातिवाद के पोषकों की कमी नहीं है"
},

{
    question: "अनामिका का जन्म कहाँ पर हुआ था?",
    option:["बिहार",
            "उत्तर प्रदेश",
            "उड़ीसा",
            "बंगाल"],
    answer:"बिहार"
},

{
    question: "बिरजू महाराज का संबंध किस घराने से है?",
    option:["लखनऊ",
            "डुमराँव",
            "बनारस",
            "किसी भी नहीं"],
    answer:"लखनऊ"
},

{
    question: "पुओं हो जाने से किसे बचाना है?",
    option:["घर को",
            "शहर को",
            "हवा को",
            "पृथ्वी को"],
    answer:"हवा को"
},

{
    question: "‘करील के कुंजन ऊपर वारौं’ के अन्तर्गत कितने सवैया संकलित हैं?",
    option:["एक",
            "दो",
            "तीन",
            "चार"],
    answer:"एक"
},

{
    question: "‘प्रेमघन’ ने मुख्य रूप से किस भाषा में काव्य रचना की?",
    option:["ब्रज",
            "देवनागरी",
            "भोजपुरी",
            "कन्नड़"],
    answer:"ब्रज"
},

{
    question: "‘प्रेमघन’ अपना आदर्श किसे मानते थे?",
    option:["महात्मा गाँधी",
            "विवेकानंद",
            "रवीन्द्रनाथ टैगोर",
            "भारतेन्दु हरिश्चन्द्र"],
    answer:"भारतेन्दु हरिश्चन्द्र"
},

{
    question: "पिताजी ने बाजार से कितनी मछलियाँ खरीदी थीं?",
    option:["तीन",
            "चार",
            "दो",
            "पाँच"],
    answer:"तीन"
},

{
    question: "‘श्रवणबेलगोल’ जैन तीर्थ-स्थल कहाँ है?",
    option:["कर्नाटक",
            "सिकन्दराबाद",
            "इलाहाबाद",
            "वैशाली"],
    answer:"कर्नाटक"
},

{
question: "आधुनिक मनु कहा गया है",
option:["डॉ. राजेन्द्र प्रसाद को",
        "महात्मा गाँधी को",
        "सच्चिदानंद सिन्हा को",
        "डॉ. भीमराव अंबेदकर को"],
answer:"डॉ. भीमराव अंबेदकर को"
},

{
    question: "कवि कितने सिंहासन तैयार करने की बात करते हैं?",
    option:["33 करोड़",
            "32 करोड़",
            "34 करोड़",
            "31 करोड़"],
    answer:"33 करोड़"
},

{
    question: "शेक्सपीयर किस भाषा के कवि हैं ?",

    option:["ग्रीक",
            "अँगरेजी",
            "फ्रेंच",
            "संस्कृत"],

    answer:"अँगरेजी"
},

{
    question: "बहादुर के नाम से ‘दिल’ शब्द किसने उड़ा दिया?",
    option:["लेखक ने",
            "लेखक के साले साहब ने",
            "निर्मला ने",
            "बहादुर की माँ ने"],
    answer:"निर्मला ने"
},

{
    question: "यतीन्द्र मिश्र ने किस अर्द्धवार्षिक पत्रिका का सम्पादन किया?",
    option:["सत्या",
            "सहित",
            "सुकून",
            "सुगन्ध"],
    answer:"सहित"
},

{
    question: "मंगम्मा मिठाई किसके लिए ले जा रही थी?",
    option:["पोते के लिए",
            "पोती के लिए",
            "भाँजी के लिए",
            "बहू के लिए"],
    answer:"पोते के लिए"
},

{
    question: "‘हमारी नींद’ में ‘नींद’ किसका प्रतीक है?",
    option:["गफलत",
            "बेहोशी",
            "पागलपन",
            "मदहोशी"],
    answer:"गफलत"
},

{
    question: "जीवनानंद दास का काव्य संकलन है",
    option:["महा पृथिवी",
            "झरा पालक",
            "मनविहंगम",
            "इनमें सभी"],
    answer:"इनमें सभी"
},

{
    question: "बहू (नंजम्मा) के अनुसार ‘घर चलाना किस काम का’ यदि वह क्या न कर सके?",
    option:["रसोई का काम",
            "दही बेचने का काम",
            "एक बात न कह सकूँ, एक थप्पड़ न लगा सकूँ",
            "पति से बात न कर सकूँ"],
    answer:"एक बात न कह सकूँ, एक थप्पड़ न लगा सकूँ"
},

{
question: "संस्कृत भाषा के साहित्य का विस्तार लगभग कितने लम्बे काल तक",
option:["एक हजार",
        "दो हजार",
        "तीन हजार",
        "चार हजार"],
answer:"तीन हजार"
},

{
    question: "‘दही वाली मंगम्मा’ पाठ के लेखक हैं-",
    option:["श्रीनिवास",
            "साँवर दइया",
            "सुजाता",
            "इनमें से कोई नहीं"],
    answer:"श्रीनिवास"
},

{
question: "‘दारिस क्या है?",
option:["एक धार्मिक ग्रंथ",
        "सोने का प्राचीनकालीन सिक्का",
        "एक देवता",
        "चाँदी. का प्राचीनकालीन सिक्का"],
answer:"सोने का प्राचीनकालीन सिक्का"
},

{
    question: "घर के अंदर की तरफ से किसके जोर-जोर से चिल्लाने की आवाज आ रही थी?",
    option:["भग्गू की",
            "माँ की",
            "भाई की",
            "पिताजी की"],
    answer:"पिताजी की"
},

{
    question: "अशोक वाजपेयी का जन्म कहाँ हुआ था?",
    option:["उत्तर प्रदेश",
            "छत्तीसगढ़",
            "असम",
            "मध्य प्रदेश"],
    answer:"छत्तीसगढ़"
},

{
question: "कहानी में उद्घाटित सामाजिक समस्या कौन-सी है?",
option:["आर्थिक विभाजन",
        "जाति प्रथा",
        "शिक्षा की कमी",
        "चिकित्सा में असमानता"],
answer:"आर्थिक विभाजन"
},

{
    question: "कवि किसके पालने की बात करता है?",
    option:["सोने के",
            "चंदन के",
            "कुहरे के",
            "रेशम के"],
    answer:"कुहरे के"
},

{
question: "डॉ० भीमराव अम्बेदकर की मृत्यु कब और कहाँ हुई?",
option:["1956, दिल्ली",
        "1957, मध्यप्रदेश",
        "1958, वाराणसी",
        "1959, बिहार"],
answer:"1956, दिल्ली"
},

{
    question: "रेनर मारिया रिल्के का जन्म कब हुआ?",

    option:["4 नवम्बर, 1873 को",
            "4 जनवरी, 1874 को",
            "4 दिसम्बर, 1875 को",
            "4 फरवरी, 1876 को"],

    answer:"4 दिसम्बर, 1875 को"
},

{
    question: "‘आविन्यों’ के रचनाकार हैं",
    option:["कैलाश वाजपेयी",
            "अटल बिहारी वाजपेयी",
            "किशोरीदास वाजपेयी",
            "अशोक वाजपेयी"],
    answer:"अशोक वाजपेयी"
},

{
    question: "‘एक पतंग अनंत में’ किनकी रचना है?",
    option:["गुणाकर मूले",
            "यतीन्द्र मिश्र",
            "हजारी प्रसाद द्विवेदी",
            "अशोक वाजपेयी"],
    answer:"अशोक वाजपेयी"
},

{
    question: "अज्ञेय को किस भाषा का ज्ञान था?",
    option:["अंग्रेजी",
            "फारसी",
            "तमिल",
            "उपर्युक्त सभी"],
    answer:"उपर्युक्त सभी"
},

{
question: "भारत कहाँ बसता है?",
option:["दिल्ली के पास",
        "गाँवों में",
        "शहरों में",
        "लोगों के मन में"],
answer:"गाँवों में"
},

{
    question: "नेपाली भाषा की लिपि है",
    option:["नेपाली",
            "खसकुरा",
            "नेवारी",
            "देवनागरी"],
    answer:"देवनागरी"
},

{
    question: "‘दही वाली मंगम्मा’ किस भाषा से अनूदित कहानी है?",
    option:["कन्नड़",
            "संस्कृत",
            "अंग्रेजी",
            "उड़िया"],
    answer:"कन्नड़"
},

{
    question: "‘दिनकर’ किस कॉलेज के हिन्दी विभागाध्यक्ष के रूप में रहे?",
    option:["कॉमर्स कॉलेज पटना",
            "लंगट सिंह कॉलेज भागलपुर",
            "पटना कॉलेज पटना",
            "इनमें कोई नहीं"],
    answer:"लंगट सिंह कॉलेज भागलपुर"
},

{
question: "'विष के दाँत' में कहानी का मुख्य लक्ष्य क्या है?",
option:["अमीरों के अत्याचार का विरोध",
        "दोस्ती की महत्ता",
        "शिक्षा का विकास",
        "प्राकृतिक सौंदर्य"],
answer:"अमीरों के अत्याचार का विरोध"
},

{
    question: "धनानंद कवि होने के साथ और क्या थे?",
    option:["गायक",
            "वादक",
            "नर्तक",
            "वक्ता"],
    answer:"गायक"
},

{
    question: "दिनकर को ज्ञानपीठ पुरस्कार किस रचना पर प्राप्त हुआ?",
    option:["रश्मिरथी",
            "उर्वशी",
            "परशुराम की प्रतीक्षा",
            "नीलकुसुम"],
    answer:"उर्वशी"
},

{
    question: "‘हरिजन’ के संपादक कौन थे ?",

    option:["माखनलाल चतुर्वेदी",
            "महात्मा गाँधी",
            "डॉ. विद्यानिवास मिश्र",
            "अज्ञेय"],

    answer:"महात्मा गाँधी"
},

{
question: "मदन जिससे लड़ाई करता है वह कौन है?",
option:["काशू",
        "गिरधर",
        "सेन साहब",
        "खोखा"],
answer:"काशू"
},

{
    question: "रिल्के की कहानी-संग्रह है?",

    option:["लाइफ एण्ड सोंग्स",
            "टेल्स ऑफ आलमाइटी",
            "लॉरेंस सेक्रिफाइस",
            "एडवेंट"],

    answer:"टेल्स ऑफ आलमाइटी"
},

{
    question: "वीरेन डंगवाल का पहला कविता-संग्रह ‘इसी दुनिया में’ किस वर्ष प्रकाशित हुआ?",
    option:["1992",
            "1891",
            "1991",
            "1892"],
    answer:"1991"
},

{
    question: "बालक ङ के ड को क्या समझता है?",
    option:["माँ",
            "बालक",
            "कवि",
            "इनमें कोई नहीं"],
    answer:"माँ"
},

{
    question: "कवि ने पगड़ी का प्रतीक किसे माना है?",
    option:["घर के मुँडेर को",
            "वृक्ष की ऊपरी डाल को",
            "वृक्ष के ऊपरी भाग में फूल-पत्तेदार युक्त टहनियों को",
            "इनमें से कोई नहीं"],
    answer:"वृक्ष के ऊपरी भाग में फूल-पत्तेदार युक्त टहनियों को"
},

{
    question: "“तुरई के फूल की तरह खिल-खिलाकर हँसते लोग सहसा मुरझा गये” यह पंक्ति किस कहानी की है?",

    option:["धरती कब तक घुमेगी कहानी",
            "नगर कहानी",
            "माँ कहानी",
            "ढहते विश्वास कहानी"],

    answer:"ढहते विश्वास कहानी"
},

{
question: "गिरधर और मदन का रिश्ता क्या था?",
option:["पिता-पुत्र",
        "मालिक-नौकर",
        "मित्र",
        "कोई नहीं"],
answer:"पिता-पुत्र"
},

{
    question: "दक्षिण भारत के पांड्य प्रदेश से किस राजा के पलियम ताम्रपत्र मिले?",
    option:["महेन्द्रपाल",
            "राजा वरगुण",
            "राजा भोज",
            "श्रीगंग राजा"],
    answer:"राजा वरगुण"
},

{
    question: "‘रसवंती’ के रचनाकार हैं",
    option:["सुमित्रानंदन पंत",
            "रामधारी सिंह ‘दिनकर’",
            "अज्ञेय",
            "सूर्यकांत त्रिपाठी ‘निराला’"],
    answer:"रामधारी सिंह ‘दिनकर’"
},

{
    question: "गुरुनानक के पिताजी का नाम क्या था?",
    option:["गुरु तेगबहादुर",
            "गुरु अर्जुनदेव",
            "कालचन्द खत्री",
            "लालचन्द खत्री"],
    answer:"कालचन्द खत्री"
},

{
    question: "‘नागरी लिपि’ पाठ किस लिपि में रचित है?",
    option:["ब्राह्मी",
            "खरोष्ठी",
            "देवनागरी",
            "इनमें से कोई नहीं"],
    answer:"देवनागरी"
},

{
question: "लाहौर का वार्षिक सम्मेलन कब हुआ था?",
option:["1935",
        "1936",
        "1835",
        "1836"],
answer:"1936"
},

{
    question: "‘रसखान’ किस काल के कवि हैं?",
    option:["आदिकाल",
            "रीतिकाल",
            "आधुनिककाल",
            "भक्तिकाल"],
    answer:"भक्तिकाल"
},

{
question: "मदन की लड़ाई से समाज को क्या सीखना चाहिए?",
option:["शक्ति का दुरुपयोग",
        "स्वाभिमान और न्याय के लिए लड़ना",
        "अहंकार त्यागना",
        "संघर्ष से बचना"],
answer:"स्वाभिमान और न्याय के लिए लड़ना"
},

{
question: "‘विष के दाँत’ कहानी में कौन-सी दो सामाजिक व्यवस्थाओं का विरोध दर्शाया गया है?",
option:["अमीर-गरीब वर्ग और जाति प्रथा",
        "धार्मिक भेदभाव और शिक्षा प्रणाली",
        "राजनीतिक भ्रष्टाचार और शिक्षा",
        "आर्थिक विकास और राजनीति"],
answer:"अमीर-गरीब वर्ग और जाति प्रथा"
},

{
question: "‘श्रम विभाजन और जाति प्रथा’ गद्य की कौन-सी विधा है?",
option:["कहानी",
        "निबंध",
        "शब्द-चित्र",
        "डायरी"],
answer:"निबंध"
},

{
    question: "गाँधीजी को ‘महात्मा’ किसने कहा :",

    option:["शेक्सपीयर ने",
            "रविन्द्रनाथ ने",
            "विवेकानन्द ने",
            "गोपाल कृष्ण गोखले ने"],

    answer:"रविन्द्रनाथ ने"
},

{
question: "‘दारिस’ क्या है?",
option:["चाँदी का प्राचीनकालीन सिक्का",
        "सोने का प्राचीनकालीन सिक्का",
        "एक देवता",
        "एक धार्मिक ग्रंथ"],
answer:"सोने का प्राचीनकालीन सिक्का"
},

{
    question: "किसे महसूस हुआ कि पृथ्वी और आकाश के बीच घुटन भरी हुई है?",

    option:["सीता को",
            "पुष्पा को",
            "नारायण को",
            "भँवरी को"],

    answer:"सीता को"
},

{
    question: "वीरेन डंगवाल को कौन-सा पुरस्कार प्राप्त है?",
    option:["स्मृति पुरस्कार",
            "रघुवर सहाय स्मृति पुरस्कार",
            "ज्ञानपीठ पुरस्कार",
            "श्रीकांत वर्मा पुरस्कार"],
    answer:"रघुवर सहाय स्मृति पुरस्कार"
},

{
    question: "‘देवी जागरण’ कौन-सा कारक है?",
    option:["कर्म",
            "कर्ता",
            "सम्प्रदान",
            "अपादान"],
    answer:"कर्ता"
},

{
    question: "‘दिनकर’ ने अपनी पढ़ाई कहाँ तक की?",
    option:["इंटरमीडियट",
            "बी. ए. ऑनर्स",
            "एम० ए० ऑनर्स",
            "पी. एच. डी."],
    answer:"बी. ए. ऑनर्स"
},

{
    question: "लक्ष्मी के बड़े लड़के का नाम क्या था?",

    option:["आदित्य",
            "अमित",
            "अमर",
            "अच्युत"],

    answer:"अच्युत"
},

{
    question: "भगवान की कृपादृष्टि कहाँ विश्राम करती थी?",

    option:["कवि के भाल पर",
            "कवि के ओठों पर",
            "कवि के नयनों पर",
            "कवि के कपोलों पर"],

    answer:"कवि के कपोलों पर"
},

{
    question: "‘माँ’ शीर्षक पाठ के लेखक कौन हैं?",

    option:["श्रीनिवास दास",
            "ईश्वरचंद्र विद्यासागर",
            "सातकोड़ी होता",
            "साँवर लाला"],

    answer:"सातकोड़ी होता"
},

{
    question: "हल किराये पर लेकर बीघे भर जमीन में खेती कौन करवायी थी?",

    option:["सरपंच",
            "मुखिया",
            "तहसीलदार",
            "लक्ष्मी"],

    answer:"लक्ष्मी"
},

{
    question: "गुरुनानक के पिता थे",
    option:["दीनबन्धु खत्री",
            "मूलचंद खत्री",
            "कालूचंद खत्री",
            "दयालचंद खत्री"],
    answer:"कालूचंद खत्री"
},

{
    question: "‘घनानंद’ किस काल के कवि थे?",
    option:["भक्ति काल के",
            "वीरगाथा काल के",
            "छायावाद युग के",
            "रीति युग के"],
    answer:"रीति युग के"
},

{
question: "“मैक्समूलर” का जन्म कब हुआ था?",
option:["1916",
        "1823",
        "1824",
        "1919"],
answer:"1823"
},

{
question: "कालिदास रचित ‘मेघदूतम्’ का पद्यानुवाद किसने किया?",
option:["रवीन्द्रनाथ ठाकुर",
        "स्वामी विट्ठलनाथ",
        "कालिदास",
        "मैक्समूलर"],
answer:"मैक्समूलर"
},

{
question: "‘श्रम विभाजन और जाति प्रथा’ पाठ बाबा साहेब के किस भाषण का संपादित अंश है?",
option:["द कास्ट्स इन इंडिया : देयर मैकेनिज्म",
        "जेनेसिस एंड डेवलपमेंट",
        "एनीहिलेशन ऑफ कास्ट",
        "हू आर शूद्राज"],
answer:"एनीहिलेशन ऑफ कास्ट"
},

{
    question: "रसखान के रचनाकाल के समय किसका राज्यकाल था?",
    option:["अकबर",
            "हुमायूँ",
            "जहाँगीर",
            "औरंगजेब"],
    answer:"जहाँगीर"
},

{
    question: "‘आविन्यों में उन्नीस दिनों के प्रवास के दौरान लेखक ने कितने गद्य की रचना की?",
    option:["27",
            "28",
            "29",
            "30"],
    answer:"27"
},

{
    question: "“गुणाकर मुले” का जन्म कहाँ पर हुआ?",
    option:["दिल्ली",
            "कर्नाटक",
            "महाराष्ट्र",
            "मध्यप्रदेश"],
    answer:"महाराष्ट्र"
},

{
    question: "बहादुर को कितने रुपये की चोरी का इल्जाम लगा था?",
    option:["10 रुपये",
            "11 रुपये",
            "12 रुपये",
            "13 रुपये"],
    answer:"11 रुपये"
},

{
    question: "बहादुर लेखक की पत्नी निर्मला को किस रूप में देखता था?",
    option:["देवी के रूप में",
            "बहन के रूप में",
            "भाभी के रूप में",
            "माँ के रूप में"],
    answer:"माँ के रूप में"
},

{
    question: "बिरजू महाराज का साक्षात्कार किसने लिया है?",
    option:["अर्चना",
            "शाश्वती",
            "दीपा",
            "रश्मि वाजपेयी"],
    answer:"रश्मि वाजपेयी"
},

{
    question: "उल्लू की बोली किस पेड़ पर सुनने की बात कवि ने कही है?",
    option:["कटहल",
            "कपास",
            "बरगद",
            "आम"],
    answer:"कपास"
},

{
    question: "‘मछली’ कहानी शुक्लजी के किस संकलन से ली गई है?",
    option:["महाविद्यालय से",
            "सब कुछ होना बचा रहेगा से",
            "पेड़ पर कमरा से",
            "खिलेगा तो देखेंगे से"],
    answer:"महाविद्यालय से"
},

{
    question: "रेनर मारिया रिल्के की काव्य शैली कैसी है?",

    option:["गद्यात्मक",
            "रचनात्मक",
            "पद्यात्मक",
            "गीतात्मक"],

    answer:"गीतात्मक"
},

{
    question: "कवि रिल्के के अनुसार मनुष्य के बिना किसका अस्तित्व न रहेगा?",

    option:["ईश्वर",
            "पर्वत",
            "प्रकृति",
            "हवा"],

    answer:"ईश्वर"
},

{
    question: "मिहिरभोज की ग्वालियर प्रशस्ति किस भाषा में है?",
    option:["प्राकृत में",
            "अपभ्रंश में",
            "संस्कृत में",
            "हिन्दी में"],
    answer:"संस्कृत में"
},

{
    question: "कितने वर्ष की उम्र में बिरजू महाराज नवाब साहब को पसंद आ गये थे?",
    option:["चार साल",
            "पाँच साल",
            "छः साल",
            "सात साल"],
    answer:"छः साल"
},

{
question: "डॉ० भीमराव अम्बेदकर के पिता का क्या नाम था?",
option:["रामदेव सकपाल।",
        "रामजी सकपाल",
        "रामकिशुन सकपाल",
        "राधेराम सकपाल"],
answer:"रामजी सकपाल"
},

{
question: "मदन ने खोखा के दाँत क्यों तोड़ दिए?",
option:["लड़ाई के कारण",
        "स्वाभिमान की रक्षा के लिए",
        "मजाक करने के लिए",
        "गलती से"],
answer:"स्वाभिमान की रक्षा के लिए"
},

{
    question: "भग्गू कौन था?",
    option:["लेखक का चाचा",
            "लेखक का भाई",
            "पड़ोसी",
            "घर का नौकर"],
    answer:"घर का नौकर"
},

{
    question: "शाम की हवा के साथ किस पक्षी के उड़ने की कल्पना की गई है?",
    option:["तोता",
            "बगूला",
            "चिड़ियाँ",
            "उल्लू"],
    answer:"उल्लू"
},

{
    question: "एक वृक्ष की हत्या में किसके विनाश की अंतर्व्यथा अभिव्यक्त है?",
    option:["शिक्षा",
            "पर्यावरण, मनुष्य और सभ्यता",
            "देश",
            "धर्म"],
    answer:"पर्यावरण, मनुष्य और सभ्यता"
},

{
question: "डॉ. भीमराव अम्बेदकर के अनुसार जाति-प्रथा श्रम-विभाजन के साथ-साथ और किसके विभाजन का रूप लिए हुए है?",
option:["श्रमिक विभाजन",
        "दलित विभाजन",
        "सभ्यजनों का विभाजन",
        "श्रमिकों का विभाजन"],
answer:"श्रमिकों का विभाजन"
},

{
    question: "‘कामसूत्र’ किसकी रचना है?",
    option:["वात्स्यायन",
            "हजारी प्रसाद द्विवेदी",
            "गुणाकर मूले",
            "भीमराव अंबेडकर"],
    answer:"वात्स्यायन"
},

{
    question: "“यतींद्र मिश्र के अब तक कितने काव्य संग्रह प्रकाशित हो चुके हैं?",
    option:["एक",
            "तीन",
            "सात",
            "पाँच"],
    answer:"तीन"
},

{
question: "नृवंश विद्या का शब्दार्थ है",
option:["काव्यशास्त्र",
        "व्याकरणशास्त्र",
        "प्राणिशास्त्र",
        "मानवशास्त्र"],
answer:"मानवशास्त्र"
},

{
    question: "‘घनानंद’ ने जीवनदायक किसे कहा है?",
    option:["सुजान को",
            "ईश्वर को",
            "बादल को",
            "इनमें से कोई नहीं"],
    answer:"बादल को"
},

{
    question: "देवनागरी लिपि के टाइप लगभग कितने पहले बने?",
    option:["दो सदी",
            "तीन सदी",
            "एक सदी",
            "इनमें से कोई नहीं"],
    answer:"दो सदी"
},

{
    question: "रिल्के के पिता का नाम क्या था?",

    option:["विल्हेल्म मूलर",
            "गंगादत्त पंत",
            "परमानंद वाजपेयी",
            "जोसेफ रिल्के"],

    answer:"जोसेफ रिल्के"
},

{
    question: "अनामिका का जन्म कब हुआ था?",
    option:["1915",
            "1916",
            "1914",
            "1917"],
    answer:"1961"
},

{
    question: "मरी हुई मछली की आँखों में नजर आ रही थी",
    option:["परछाईं",
            "कालापन",
            "लालिमा",
            "श्वेत"],
    answer:"परछाईं"
},

{
    question: "कपोल का अर्थ है?",

    option:["सिर",
            "ललाट",
            "गाल",
            "चेहरा"],

    answer:"गाल"
},

{
    question: "लौटकर आऊँगा फिर कविता को हिन्दी में रूपांतर कौन किए हैं?",
    option:["अज्ञेय",
            "प्रयाग शुक्ल",
            "यतीन्द्र मिश्र",
            "इनमें से कोई नहीं"],
    answer:"प्रयाग शुक्ल"
},

{
    question: "बिस्मिल्ला खाँ के बड़े भाई का नाम क्या था?",
    option:["सादिक हुसैन",
            "शम्सुद्दीन",
            "अमीरुद्दीन",
            "इनमें कोई नहीं"],
    answer:"शम्सुद्दीन"
},

{
    question: "अशोक वाजपेयी के पिता का नाम क्या है?",
    option:["श्यामानन्द वाजपेयी",
            "रामानन्द वाजपेयी",
            "परमानन्द वाजपेयी",
            "देवानन्द वाजपेयी"],
    answer:"परमानन्द वाजपेयी"
},

{
    question: "‘प्रकृति का सुकुमार कवि’ कहा जाता है?",
    option:["निराला को",
            "भारतेन्दु को",
            "जयशंकर प्रसाद को",
            "पंत को"],
    answer:"पंत को"
},

{
    question: "वल्लि अम्माल से कहाँ के डॉक्टर ने पाण्णाति को लेकर मदुरै जाने को कहा था ?",

    option:["शहर के",
            "गाँव के",
            "पड़ोस के",
            "मैसूर के"],

    answer:"शहर के"
},

{
    question: "“बिदेसी’ से कवि का क्या तात्पर्य है?",
    option:["अंगरेजी",
            "अमेरिका",
            "फ्रांस",
            "डेनमार्क"],
    answer:"अंगरेजी"
},

{
    question: "इन्होंने 1874 ई० में किस समाज की स्थापना की?",
    option:["आर्य समाज",
            "ब्रह्म समाज",
            "रसिक समाज",
            "इनमें कोई नहीं"],
    answer:"रसिक समाज"
},

{
    question: "गुप्तकाल से किस लिपि का सम्बन्ध है?",
    option:["सिद्धम",
            "ब्राह्मी",
            "देवनागरी",
            "गुजराती"],
    answer:"ब्राह्मी"
},

{
question: "भीमराव अम्बेदकर का जन्म कब हुआ?",
option:["15 अप्रैल 1819",
        "14 अप्रैल 1891",
        "18 फरवरी 1918",
        "14 जनवरी 1919"],
answer:"14 अप्रैल 1891"
},

{
    question: "बिरजू महाराज के बाबूजी हनुमान जी का प्रसाद क्यों माँगे थे?",
    option:["नौकरी मिलने हेतु",
            "नौकरी छूटने हेतु",
            "नृत्य में सफलता हेतु",
            "बालक के स्वास्थ्य हेतु"],
    answer:"नौकरी छूटने हेतु"
},

{
    question: "गाँधी ने बच्चों को किस ढंग की तालीम देने की भरसक कोशिश की थी ?",

    option:["हिंसक प्रतिरोध",
            "अहिंसक प्रतिरोध",
            "सहनशील प्रतिरोध",
            "आक्रामक प्रतिरोध"],

    answer:"अहिंसक प्रतिरोध"
},

{
    question: "‘यंग इंडिया’ क्या है ?",

    option:["पत्रिका",
            "नौजवानों का समूह",
            "संस्था",
            "पुरस्कार"],

    answer:"पत्रिका"
},

{
    question: "ग अक्षर की समानता किससे दिखाई गई है?",
    option:["गदहा से",
            "गणेश से",
            "गमले से",
            "इनमें से कोई नहीं"],
    answer:"गमले से"
},

{
    question: "‘महाभारत’ क्या है?",
    option:["उपन्यास",
            "कहानी",
            "शास्त्र",
            "पुराण"],
    answer:"पुराण"
},

{
    question: "लौटकर आऊँगा फिर कविता है",
    option:["राष्ट्रीय चेतना की",
            "राष्ट्रीय धरोहर की",
            "राष्ट्रीय आवाम की",
            "राष्ट्रीय सत्ता की"],
    answer:"राष्ट्रीय चेतना की"
},

{
    question: "‘जीर्ण जनपद’ किसकी कृति है?",
    option:["प्रेमघन की",
            "श्रीधर पाठक की",
            "रामनरेश त्रिपाठी की",
            "नागार्जुन की"],
    answer:"प्रेमघन की"
},

{
question: "मदन का स्वभाव कैसा है?",
option:["अहंकारी और क्रूर",
        "स्वाभिमान से भरा और साहसी",
        "डरपोक",
        "उदासीन"],
answer:"स्वाभिमान से भरा और साहसी"
},

{
question: "कौन-सा पात्र अमीर वर्ग का प्रतिनिधि है?",
option:["गिरधर",
        "मदन",
        "सेन साहब",
        "काशू"],
answer:"सेन साहब"
},

{
    question: "‘वानर सेना’ अमरकांत की किस प्रकार की रचना है?",
    option:["निबंध",
            "कहानी",
            "उपन्यास",
            "जीवनी"],
    answer:"उपन्यास"
},

{
    question: "रंगीन बादलों के बीच कौन लौटते होंगे?",
    option:["बगुले",
            "चिड़ियाँ",
            "सारस",
            "उल्लू"],
    answer:"सारस"
},

{
    question: "‘सातकोड़ी होता‘ कथाकार हैं-", 

    option:["पंजाबी के",
            "गुजराती के",
            "उड़िया के",
            "हिन्दी के"],

    answer:"उड़िया के"
},

{
    question: "गुरुनानक की माता का क्या नाम था?",
    option:["तृप्ता",
            "तप्ता",
            "सीता",
            "अनुराधा"],
    answer:"तृप्ता"
},

{
question: "डॉ० अम्बेदकर की दृष्टि में भाईचारे का वास्तविक रूप कैसा होता है?",
option:["दूध और शक्कर के मिश्रण की तरह",
        "दूध और पानी के मिश्रण की तरह",
        "तिल और तंडुल के मिश्रण की तरह",
        "पानी और नमक के मिश्रण की तरह"],
answer:"दूध और पानी के मिश्रण की तरह"
},

{
    question: "नेकर का अर्थ है",
    option:["नौकर",
            "जोकर",
            "पैंट",
            "कमीज"],
    answer:"पैंट"
},

{
    question: "‘मो अँसुवानिहिं लै बरसौ’ में किसकी बात कही गई है?",
    option:["प्रेम वेदना की",
            "विरह वेदना की",
            "(A) और (B) दोनों की",
            "इनमें कोई नहीं"],
    answer:"विरह वेदना की"
},

{
    question: "घड़े-सा लुढ़कता हुआ किस अक्षर को कहा गया है?",
    option:["ख",
            "क",
            "घ",
            "ब"],
    answer:"घ"
},

{
    question: "कवि ने प्रेम मार्ग को बताया है",
    option:["सरल एवं निश्छल",
            "जटिल",
            "नीरस",
            "अहंकारयुक्त"],
    answer:"सरल एवं निश्छल"
},

{
    question: "विनोद कुमार शुक्ल का जन्म किस राज्य में हुआ था?",
    option:["हरियाणा",
            "राजस्थान",
            "उत्तरप्रदेश",
            "छत्तीसगढ़"],
    answer:"छत्तीसगढ़"
},

{
    question: "खालिस (खरा या शुद्ध) बेचैनी किसकी है?",
    option:["माँ की",
            "पिता की",
            "बेटे को",
            "इनमें कोई नहीं"],
    answer:"बेटे को"
},

{
    question: "संतू क्यों उदास हो गया?",
    option:["मछली के कटने से",
            "मछली के मर जाने से",
            "मछली के चोरी हो जाने से",
            "मछली के भाग जाने से"],
    answer:"मछली के कटने से"
},

{
    question: "रंगप्पा मंगम्मा से क्या माँगता है?",
    option:["दही",
            "पोते के लिए मिठाई",
            "कर्ज",
            "पान"],
    answer:"कर्ज"
},

{
    question: "‘महीअल’ का मानक आधुनिक शब्द है",
    option:["महान आत्मा",
            "महामानव",
            "धरती पर",
            "पहाड़ पर"],
    answer:"धरती पर"
},

{
    question: "हिरोशिमा अज्ञेय की किस कविता संग्रह से लिया गया है?",
    option:["सदानीरा से",
            "कितनी नावों में कितनी बार से",
            "आँगन के पार द्वार से",
            "छोड़ा हुआ रास्ता से"],
    answer:"सदानीरा से"
},

{
question: "‘मुण्डा’ किस देश की जाति है?",
option:["मंगोल",
        "चीन",
        "मुल्तान",
        "भारत"],
answer:"भारत"
},

{
    question: "बिस्मिल्ला खाँ को किस चीज का बुखार था?",
    option:["शहनाई बजाने का",
            "ढोल बजाने का",
            "गाना गाने का",
            "फिल्म देखने का"],
    answer:"फिल्म देखने का"
},

{
    question: "‘प्रेमघन’ ने किस मासिक पत्रिका का सम्पादन किया?",
    option:["आनंद कादंबिनी",
            "साहित्य सरिता",
            "साहित्य सागर",
            "सरस कादंबिनी"],
    answer:"आनंद कादंबिनी"
},

{
    question: "‘कुँवर’ को किस पुरस्कार से सम्मानित किया गया?",
    option:["प्रेमचन्द पुरस्कार",
            "साहित्य अकादमी पुरस्कार",
            "(A) और (B) दोनों",
            "इनमें से कोई नहीं"],
    answer:"(A) और (B) दोनों"
},

{
    question: "‘ढहते विश्वास‘ कहानी का प्रमुख पात्र है-", 

    option:["मंगम्मा",
            "सीता",
            "लक्ष्मी",
            "पाप्पाति"],

    answer:"लक्ष्मी"
},

{
    question: "‘हमारी नींद’ कविता में कवि ने किसका उल्लेख किया है?",
    option:["गरीब किसानों का",
            "शहर में चैन से सोने वालों का",
            "गरीब बस्तियों का",
            "इनमें से कोई नहीं"],
    answer:"गरीब बस्तियों का"
},

{
    question: "पाप्पाति को कौन-सा रोग था?",

    option:["टिटनेस",
            "हैजा",
            "कैंसर",
            "मेनिनजाइटिस"],

    answer:"मेनिनजाइटिस"
},

{
    question: "समाजवादी व्यवस्था किस संस्कृति से नाता नहीं तोड़ती?",
    option:["पाश्चात्य संस्कृति",
            "अर्वाचीन संस्कृति",
            "प्राचीन संस्कृति",
            "नगरीय संस्कृति"],
    answer:"प्राचीन संस्कृति"
},

{
    question: "‘डफाली’ का अर्थ क्या है?",
    option:["गानेवाला",
            "भाषाविद्",
            "बाजा बजानेवाला",
            "नर्तक"],
    answer:"बाजा बजानेवाला"
},

{
    question: "‘हरिरास’ किसकी रचना है?",
    option:["गुरु गोविन्द सिंह",
            "गुरुनानक",
            "नानक",
            "घनानंद"],
    answer:"गुरुनानक"
},

{
    question: "‘ढहते विश्वास‘ शीर्षक पाठ में किस बाँध के टूटने की बात कही गयी है?",

    option:["दलेई बाँध",
            "टिहरी बाँध",
            "सरदार सरोवर बाँध",
            "फरक्का बाँध"],

    answer:"दलेई बाँध"
},

{
    question: "“रसखान” जी किसकी भक्ति किया करते थे?",
    option:["कृष्ण",
            "राम",
            "विष्णु",
            "शंकर"],
    answer:"कृष्ण"
},

{
    question: "हमारी राष्ट्रीय आवश्यकता है",
    option:["समाजवाद",
            "पूँजीवाद",
            "जातिवाद",
            "परिवारवाद"],
    answer:"समाजवाद"
},

{
    question: "सभ्यता का हर स्तर क्या नहीं होता?",
    option:["धर्मयुद्ध",
            "कर्मयुद्ध",
            "वर्गयुद्ध",
            "द्वंद्वयुद्ध"],
    answer:"वर्गयुद्ध"
},

{
    question: "लेखक कितने वर्ष पहले आविन्यों गए थे?",
    option:["5 साल पहले",
            "8 साल पहले",
            "10 साल पहले",
            "2 साल पहले"],
    answer:"10 साल पहले"
},

{
    question: "बिस्मिल्ला खाँ के साथ किस मुस्लिम पर्व का नाम जुड़ा हुआ है?",
    option:["ईद",
            "बकरीद",
            "शबे बारात",
            "मुहर्रम"],
    answer:"मुहर्रम"
},

{
    question: "‘ढहते विश्वास‘ कहानी में किस राज्य की बाढ़ एवं सूखा से प्रभावित दिखाया गया है?",

    option:["उड़ीसा",
            "बिहार",
            "नेपाल",
            "केरल"],

    answer:"उड़ीसा"
},

{
    question: "इन्हें किस पुरस्कार से पुरस्कृत किया गया?",
    option:["पद्मभूषण",
            "साहित्य अकादमी पुरस्कार",
            "भारत रत्न",
            "इनमें कोई नहीं"],
    answer:"साहित्य अकादमी पुरस्कार"
},

{
question: "भारतीय संविधान के निर्माता के रूप में हम किन्हें जानते हैं?",
option:["महात्मा गाँधी को",
        "भीमराव अम्बेदकर को",
        "जवाहरलाल नेहरू को",
        "सुभाषचन्द्र बोस को"],
answer:"भीमराव अम्बेदकर को"
},

{
    question: "रसखान द्वारा रचित ग्रंथ है",
    option:["वाटिका",
            "प्रेमवाटिका",
            "आनंद वाटिका",
            "रस वाटिका"],
    answer:"प्रेमवाटिका"
},

{
    question: "इनकी माता का क्या नाम था?",
    option:["वन्दना देवी",
            "सरस्वती देवी",
            "राधा देवी",
            "विद्यावती देवी"],
    answer:"सरस्वती देवी"
},

{
question: "किसे वाराणसी के पास सोने के सिक्कों से भरा एक घड़ा मिला था?",
option:["वारेन हेस्टिग्स को",
        "विल्हेल्म मूलर को",
        "फ्रेड्रिक मैक्समूलर को",
        "इनमें कोई नहीं"],
answer:"वारेन हेस्टिग्स को"
},

{
    question: "घनानंद किस नर्तकी को प्यार करते थे?",
    option:["रश्मि बाई को",
            "रसूलन बाई को",
            "सृजन को",
            "सुजान को"],
    answer:"सुजान को"
},

{
    question: "उस्ताद बिस्मिल्ला खाँ के बचपन का नाम है",
    option:["जफरुद्दीन",
            "महामुद्दीन",
            "कमरुद्दीन",
            "शम्सुद्दीन"],
    answer:"कमरुद्दीन"
},

{
    question: "अज्ञेय का पूरा नाम है",
    option:["सच्चिदानंद हीरानंद अज्ञेय",
            "सच्चिदानंद हीरानंद वात्स्यायन अज्ञेय",
            "हीरानंद वात्स्यायन अज्ञेय",
            "सच्चिदानंद वात्स्यायन अज्ञेय"],
    answer:"सच्चिदानंद हीरानंद वात्स्यायन अज्ञेय"
},

{
    question: "गौतम ने कहा था कि मनुष्य की मनुष्यता है",
    option:["सभी के दुःख-सुख को सहानुभूति के साथ देखना",
            "सभी के प्रति असमानता का भाव रखना",
            "स्वार्थ का भाव रखना",
            "भौतिक विकास करना"],
    answer:"सभी के दुःख-सुख को सहानुभूति के साथ देखना"
},

{
    question: "मंगम्मा के मन में किस बात को लेकर ‘जान का खतरा’ होने का डर पैदा हो गया था?",
    option:["बहू के साथ झगड़ा",
            "रंगप्पा का कर्ज माँगना",
            "कौवे द्वारा मिठाई की पुड़िया ले जाना",
            "पोते का घर छोड़कर आना"],
    answer:"कौवे द्वारा मिठाई की पुड़िया ले जाना"
},

{
question: "संचारित का शब्दार्थ है",
option:["आरोहित",
        "चालित",
        "प्रवाहित",
        "स्वचालित"],
answer:"प्रवाहित"
},

{
    question: "कवि ने माली-मालिन किसे कहा है?",
    option:["शंकर-पार्वती",
            "गणेश-लक्ष्मी",
            "कृष्ण-राधा",
            "राम-सीता"],
    answer:"कृष्ण-राधा"
},

{
    question: "अनामिका किस विभाग में प्राध्यापिका हैं?",
    option:["हिन्दी",
            "संस्कृत",
            "अंग्रेजी",
            "इतिहास"],
    answer:"अंग्रेजी"
},

{
question: "सेन साहब की संपत्ति कैसी है?",
option:["गरीब",
        "अमीर और प्रभावशाली",
        "मध्यवर्गीय",
        "मजदूर वर्ग की"],
answer:"अमीर और प्रभावशाली"
},

{
    question: "पंतजी किस युग के कवि थे?",
    option:["भारतेन्दु युग के",
            "रीति युग के",
            "छायावाद युग के",
            "इनमें से कोई नहीं"],
    answer:"छायावाद युग के"
},

{
    question: "किसने पोप की गतिविधियों पर नजर रखने के लिए किला बनवाया था?",
    option:["डच शासकों ने",
            "फ्रेंच शासकों ने",
            "यूनानी शासकों ने",
            "एथेन्स शासकों ने"],
    answer:"फ्रेंच शासकों ने"
},

{
    question: "‘शिक्षा और संस्कृति’ के लेखक कौन हैं ?",

    option:["महात्मा गाँधी",
            "शेक्शपीयर",
            "टॉलस्टॉय",
            "इनमें कोई नहीं"],

    answer:"महात्मा गाँधी"
},

{
    question: "मंगु कब से पागल है ?",

    option:["पाँच साल से",
            "तीन साल से",
            "दो साल से",
            "जन्म से"],

    answer:"जन्म से"
},

{
    question: "भारत सरकार द्वारा इन्हें सम्मानित किया गया-",
    option:["पद्मविभूषण से",
            "भारत भूषण अग्रवाल पुरस्कार",
            "भारत रत्न से",
            "ऋतरात सम्मान से"],
    answer:"पद्मविभूषण से"
},

{
    question: "‘हरिरस’ किसे कहा गया है?",
    option:["वनस्पति रस को",
            "सांसारिक आनंद को",
            "ब्रह्मानंद को",
            "मधुर रस को"],
    answer:"ब्रह्मानंद को"
},

{
    question: "गुरुनानक का जन्म स्थान है",
    option:["नन्द ग्राम",
            "तलबन्डी ग्राम",
            "गुरु ग्राम",
            "बेलसन्डी ग्राम"],
    answer:"तलबन्डी ग्राम"
},

{
    question: "‘नौबतखाना’ का अर्थ है",
    option:["नमाज पढ़ने की जगह",
            "प्रवेश द्वार के ऊपर मंगल ध्वनि बजाने का स्थान",
            "दहलीज",
            "नवीन घर"],
    answer:"प्रवेश द्वार के ऊपर मंगल ध्वनि बजाने का स्थान"
},

{
    question: "कुमार गंधर्व क्या है?",
    option:["गीतकार",
            "शास्त्रीय गायक",
            "कलाकार",
            "चित्रकार"],
    answer:"शास्त्रीय गायक"
},

{
    question: "‘प्रेम की पीर’ का कवि किन्हें कहा गया है?",
    option:["रसखान को",
            "प्रेमघन को",
            "मंझन को",
            "घनानंद को"],
    answer:"घनानंद को"
},

{
    question: "आविन्यों किस नदी के किनारे है?",
    option:["सोन",
            "रोन",
            "झेलम",
            "माइन्स"],
    answer:"रोन"
},

{
    question: "कवि के अनुसार कई लोग ऐसे हैं जो नहीं भूले हैं",
    option:["पढ़ाई करना",
            "परिश्रम करना",
            "आदर करना",
            "इनकार करना"],
    answer:"इनकार करना"
},

{
question: "सेन साहब की पत्नी किसकी आलोचना करती हैं?",
option:["मदन की",
        "गिरधर की",
        "खोखा की",
        "काशू की"],
answer:"मदन की"
},

{
    question: "घर पर दो लड़कियों और सालभर के लड़के को लेकर कौन अकेली है?",

    option:["पड़ोसन",
            "लक्ष्मी",
            "शंकर की बहन",
            "गुणनिधि की माँ"],

    answer:"लक्ष्मी"
},

{
    question: "‘नौबतखाने में इबादत’ पाठ के लेखक कौन हैं?",
    option:["विनोद कुमार शुक्ल",
            "यतीन्द्र मिश्र",
            "अशोक वाजपेयी",
            "अमरकांत"],
    answer:"यतीन्द्र मिश्र"
},

{
    question: "कथाकार की पत्नी के नौकर को लेकर कौन आए थे?",
    option:["कथाकार के भाई",
            "कथाकार के मित्र",
            "कथाकार के पुत्र",
            "कथाकार के साले साहब"],
    answer:"कथाकार के साले साहब"
},

{
    question: "लक्ष्मी अपनी दोनों लड़कियों और छोटे बेटे को सुलाकर कहाँ गयी?",

    option:["खलिहान में",
            "गुहाल में",
            "रसोई में",
            "कमरे में"],

    answer:"गुहाल में"
},

{
    question: "‘प्रकृति का सुकुमार कवि’ किसे कहा जाता है?",
    option:["निराला को",
            "भारतेन्दु को",
            "जयशंकर प्रसाद को",
            "पंत को"],
    answer:"पंत को"
},

{
    question: "जीवनानंद दास का जन्म कब हुआ?",
    option:["1897 ई. में",
            "1898 ई. में",
            "1899 ई. में",
            "1900 ई. में"],
    answer:"1899 ई. में"
},

{
    question: "देवताओं के राजा का वज्र कौन-से मुनि की हड्डियों से बना है?",
    option:["राधे-श्याम मुनि",
            "नारद मुनि",
            "दधीचि मुनि",
            "कपिल मुनि"],
    answer:"दधीचि मुनि"
},

{
    question: "भक्त रिल्के प्रभु (ईश्वर) से क्या कहता है?",

    option:["प्रश्न",
            "सजदा",
            "प्रार्थना",
            "इनमें सभी"],

    answer:"प्रश्न"
},

{
    question: "अगले दिन सीता ने क्या किया ?",

    option:["घर छोड़ दी",
            "रोने लगी",
            "काम करने लगी",
            "बिज्जू के पास चली गई"],

    answer:"घर छोड़ दी"
},

{
    question: "किस मुगल सम्राट से गुरुनानक की भेंट हुई थी?",
    option:["अकबर",
            "शाहजहाँ",
            "औरंगजेब",
            "बाबर"],
    answer:"बाबर"
},

{
    question: "बिरजू महाराज की पहली शिष्या थी",
    option:["दुर्गा",
            "अनुराधा",
            "रश्मि",
            "रमा"],
    answer:"रश्मि"
},

{
    question: "धनानंद की कविताओं की भाषा क्या थी?",
    option:["पंजाबी",
            "खड़ी बोली",
            "ब्रज भाषा",
            "अवधी"],
    answer:"ब्रज भाषा"
},

{
    question: "‘ङ’ में बालक ‘ड’ को क्या समझता है?",
    option:["माँ",
            "बेटा",
            "बेटी",
            "पिता"],
    answer:"बेटा"
},

{
question: "सेन साहब की संपत्ति किस प्रकार है?",
option:["मामूली",
        "बड़ी और प्रतिष्ठित",
        "गरीब मजदूर की",
        "अनजान"],
answer:"बड़ी और प्रतिष्ठित"
},

{
    question: "जीवनानंद दास का निधन कितनी आयु में हुआ?",
    option:["45",
            "54",
            "55",
            "56"],
    answer:"55"
},

{
    question: "‘दही वाली मंगम्मा’ शीर्षक कहानी किस कहानी से साभार ली गई है?",
    option:["‘गुजराती कहानियाँ’ से",
            "‘तमिल कहानियाँ’ से",
            "‘उड़िया कहानियाँ’ से",
            "‘कन्नड़ कहानियाँ’ से"],
    answer:"‘कन्नड़ कहानियाँ’ से"
},

{
    question: "वीरेन डंगवाल ने किस विश्वविद्यालय से एम०ए० किया?",
    option:["काशी",
            "लखनऊ",
            "इलाहाबाद",
            "कानपुर"],
    answer:"इलाहाबाद"
},

{
    question: "‘पाप्पाति’ किस कहानी की पात्र है?",

    option:["ढहते विश्वास",
            "नगर",
            "धरती कब तक घूमेगी",
            "माँ"],

    answer:"नगर"
},

{
    question: "लक्ष्मी कहानी का केंद्रीय पात्र है",

    option:["ढहते विश्वास",
            "धरती कब तक घुमेगी",
            "माँ",
            "नगर"],

    answer:"ढहते विश्वास"
},

{
    question: "रसखान किस प्रकार की रचना में सिद्ध थे?",
    option:["दोहा",
            "सोरठा",
            "कवित्त",
            "सवैया छंद"],
    answer:"सवैया छंद"
},

{
    question: "कवयित्री अनामिका को किस सम्मान से सम्मानित किया गया?",
    option:["राष्ट्रभाषा परिषद् पुरस्कार",
            "भारत भूषण अग्रवाल पुरस्कार",
            "गिरिजा कुमार माथुर पुरस्कार",
            "इनमें सभी"],
    answer:"इनमें सभी"
},

{
    question: "पंतजी को किस रचना पर ‘भारतीय ज्ञानपीठ’ पुरस्कार मिला?",
    option:["उच्छवास",
            "ग्रंथि",
            "चिदंबरा",
            "गुंजेन"],
    answer:"चिदंबरा"
},

{
    question: "अशोक वाजपेयी की रचनात्मक प्रतिभा कौन है?",
    option:["प्रतीक्षा करते हैं पत्थर",
            "नदी के किनारे भी नदी है",
            "(A) और (B) दोनों",
            "इनमें कोई नहीं"],
    answer:"(A) और (B) दोनों"
},

{
    question: "इन्होंने किस पुस्तक में पुरानी लिपियों की विस्तृत जानकारी दी है?",
    option:["संस्कृति",
            "अक्षर कथा",
            "प्राचीन भारत का इतिहास",
            "पुरालिपिशास्त्र"],
    answer:"अक्षर कथा"
},

{
    question: "बारी-बारी से गाँव के लड़के किसकी निगरानी कर रहे हैं?",

    option:["दलेइ बाँध की",
            "गाँव की",
            "नदी की",
            "मंदिर की"],

    answer:"दलेइ बाँध की"
},

{
    question: "‘नगर’ कहानी किस भाषा से अनूदित है?",

    option:["उड़िया",
            "तमिल",
            "गुजराती",
            "कन्नड़"],

    answer:"तमिल"
},

{
question: "गिरधर किस वर्ग का सदस्य है?",
option:["उच्च वर्ग",
        "मजदूर वर्ग",
        "मध्यम वर्ग",
        "अमीर वर्ग"],
answer:"मध्यम वर्ग"
},

{
    question: "ब्रह्म का निवास स्थान है।",
    option:["मंदिर",
            "जंगल",
            "तीर्थ",
            "संत-हृदय"],
    answer:"संत-हृदय"
},

{
    question: "आजकल भारत के लोग किस भाषा में बोलना पसन्द करते हैं?",
    option:["हिन्दी",
            "मातृभाषा",
            "अंग्रेजी",
            "फ्रेंच"],
    answer:"अंग्रेजी"
},

{
    question: "‘भारतीय लिपियों की कहानी’ किनकी प्रसिद्ध रचना है?",
    option:["गुणाकर मूले",
            "नलिन विलोचन शर्मा",
            "महादेवी वर्मा",
            "सुमित्रानन्दन पंत"],
    answer:"गुणाकर मूले"
},

{
    question: "रोन नदी कहाँ है?",
    option:["दक्षिण फ्रांस",
            "भारत",
            "जापान",
            "अमेरिका"],
    answer:"दक्षिण फ्रांस"
},

{
    question: "‘दिनकरजी’ ने बी० ए० ऑनर्स कब किया था?",
    option:["1930 ई. में",
            "1931 ई. में",
            "1932 ई. में",
            "1933 ई. में"],
    answer:"1932 ई. में"
},

{
question: "जाति प्रथा भारत में क्यों एक प्रमुख कारण बनी है?",
option:["उत्पीड़न",
        "बेरोजगारी",
        "अमीरी",
        "गरीबी"],
answer:"बेरोजगारी"
},

{
    question: "अज्ञेय के माताजी का क्या नाम था?",
    option:["जयंती देवी",
            "वंदना देवी",
            "ज्योति देवी",
            "सरला देवी"],
    answer:"ज्योति देवी"
},

{
question: "‘प्रत्न मानव’ का अर्थ है",
option:["लघु मानव ।",
        "महामानव",
        "प्राचीन मानव",
        "निर्धन मानव"],
answer:"प्राचीन मानव"
},

{
    question: "बहू ने पोते को पीटा था क्योंकि वह:",
    option:["अपनी दादी के साथ गया था",
            "घर का काम नहीं कर रहा था",
            "कुछ उधम कर रहा था",
            "दही बेचकर आया था"],
    answer:"कुछ उधम कर रहा था"
},

{
    question: "इस पाठ में “चितचोर” किसे कहा गया है?",
    option:["राधा को",
            "कृष्ण को",
            "रसखान को",
            "भारतेन्दु हरिश्चन्द्र को"],
    answer:"कृष्ण को"
},

{
    question: "महात्मा गाँधी का निधन कब हुआ ?",

    option:["30 जनवरी, 1947",
            "30 जनवरी, 1948 को",
            "30 जनवरी, 1947 को",
            "30 जनवरी, 1950 को"],

    answer:"30 जनवरी, 1948 को"
},

{
    question: "‘भारतमाता’ कविता में भारत का कैसा चित्र प्रस्तुत किया गया है?",
    option:["आदर्श",
            "काल्पनिक",
            "यथातथ्य",
            "इनमें से कोई नहीं"],
    answer:"यथातथ्य"
},

{
    question: "‘प्रेमघन’ की रचनाएँ किस नाम से संग्रहीत हैं?",
    option:["सर्वस्व सरिता",
            "प्रेमधन काव्य",
            "प्रेमघन सर्वस्व",
            "प्रेमघन साहित्य"],
    answer:"प्रेमघन सर्वस्व"
},

{
    question: "‘जिंदगी और जोंक’ किसकी कहानी है?",
    option:["प्रेमचन्द की",
            "सुदर्शन की",
            "महीप सिंह की",
            "अमरकांत की"],
    answer:"अमरकांत की"
},

{
question: "‘भारत से हम क्या सीखें’ पाठ में ‘नए सिकन्दर’ विशेषण किसके लिए प्रयुक्त हुआ है?",
option:["भारत के वीरों के लिए",
        "युवा अंग्रेज अधिकारियों के लिए",
        "यूरोप के वीरों के लिए",
        "इनमें से कोई नहीं"],
answer:"युवा अंग्रेज अधिकारियों के लिए"
},

{
    question: "पिताजी ने किसको मारा था?",
    option:["दीदी को",
            "माँ को",
            "संतू को",
            "भग्गू को"],
    answer:"दीदी को"
},

{
    question: "भारत सौभाग्य’ के रचनाकार हैं",
    option:["रामधारी सिंह ‘दिनकर’",
            "बदरी नारायण चौधरी ‘प्रेमघन’",
            "जयशंकर प्रसाद",
            "भारतेन्दु हरिशचन्द्र"],
    answer:"बदरी नारायण चौधरी ‘प्रेमघन’"
},

{
    question: "‘प्रेमघन’ का जन्म कहाँ हुआ था?",
    option:["मिर्जापुर में",
            "लखनऊ में",
            "इलाहाबाद में",
            "बनारस में"],
    answer:"मिर्जापुर में"
},

{
    question: "बिस्मिल्ला खाँ के परदादा का नाम था",
    option:["उस्ताद सलार हुसैन",
            "अब्दुल हुसैन",
            "महताब हुसैन",
            "एकबाल हुसैन"],
    answer:"उस्ताद सलार हुसैन"
},

{
    question: "सिद्धम क्या है?",
    option:["योगी",
            "सिद्ध किया गया कार्य",
            "महात्मा",
            "एक प्रकार की लिपि"],
    answer:"एक प्रकार की लिपि"
},

{
    question: "‘सत्य के साथ मेरे प्रयोग’ किसकी पुस्तक है ?",

    option:["डॉ. राजेन्द्र प्रसाद",
            "डॉ. संपूर्णानंद",
            "महर्षि अरविंद",
            "महात्मा गाँधी"],

    answer:"महात्मा गाँधी"
},

{
    question: "‘नौबतखाने में इबादत’ साहित्य की कौन-सी विधा है?",
    option:["निबंध",
            "कहानी",
            "व्यक्तिचित्र",
            "साक्षात्कार"],
    answer:"व्यक्तिचित्र"
},

{
    question: "‘सुजानसागर’ के रचनाकार हैं",
    option:["रसखान",
            "गुरुनानक",
            "प्रेमघन",
            "घनानंद"],
    answer:"घनानंद"
},

{
    question: "कुँवर नारायण का जन्म कहाँ हुआ था?",
    option:["मध्य प्रदेश",
            "उत्तर प्रदेश",
            "बिहार",
            "उड़ीसा"],
    answer:"उत्तर प्रदेश"
},

{
    question: "रिल्के की कविता ‘मेरे बिना तुम प्रभु’ है?",

    option:["भावात्मक रहस्यवाद",
            "भक्ति भावात्मक",
            "हास्यात्मक",
            "इनमें सभी"],

    answer:"भावात्मक रहस्यवाद"
},

{
    question: "गुणाकर मुले की शिक्षा की भाषा क्या थी?",
    option:["हिन्दी",
            "मराठी",
            "बांग्ला",
            "गुजराती"],
    answer:"मराठी"
},

{
    question: "‘मिट्टी की ओर’ इनकी कृति है।",
    option:["पद्य",
            "गद्य",
            "काव्य",
            "इनमें से सभी"],
    answer:"गद्य"
},

{
    question: "कवि हमें क्या सलाह देता है?",
    option:["नींद में सोने की",
            "नींद से जगने की",
            "पैर पसारकर सोने की",
            "इनमें से कोई नहीं"],
    answer:"नींद से जगने की"
},

{
    question: "‘मेरे बिना तुम प्रभु’ किस भाषा से अनुवादित है?",

    option:["अंग्रेजी",
            "जर्मन",
            "रूसी",
            "फ्रांसीसी"],

    answer:"जर्मन"
},

{
    question: "अज्ञेयजी की प्रारंभिक शिक्षा कहाँ हुई थी?",
    option:["बनारस",
            "लखनऊ",
            "मुंबई",
            "पटना"],
    answer:"लखनऊ"
},

{
    question: "“स्वदेशी’ के लेखक हैं",
    option:["घनानंद",
            "प्रेमघन",
            "गुणाकर मूले",
            "इनमें कोई नहीं"],
    answer:"प्रेमघन"
},

{
    question: "पाप्पाति बेहोश क्यों पड़ी थी ?",

    option:["दवा के कारण",
            "डर के कारण",
            "तेज बुखार के कारण",
            "कमजोरी के कारण"],

    answer:"तेज बुखार के कारण"
},

{
    question: "आविन्यों क्या है?",
    option:["प्रसिद्ध शहर",
            "प्राचीन शहर",
            "छोटा शहर",
            "इनमें से सभी"],
    answer:"प्राचीन शहर"
},

{
    question: "एस० रंगराजन किस लेखक का पूरा नाम है?",

    option:["सुजाता",
            "सातकोड़ी होता",
            "श्रीनिवास",
            "ईश्वर पेटलीकर"],

    answer:"सुजाता"
},

{
    question: "‘हमारी नींद’ कविता किस कविता-संग्रह से ली गई है?",
    option:["दुष्चक्र में स्रष्टा",
            "पहल पुस्तिका",
            "इसी दुनिया में",
            "सदानीरा"],
    answer:"दुष्चक्र में स्रष्टा"
},

{
    question: "मछलियाँ घर लाने के बाद बच्चों ने क्या किया?",
    option:["बाल्टी में डाल दिया",
            "कुआँ में डाल दिया",
            "मछली बनाकर खा गये",
            "इनमें से कोई नहीं"],
    answer:"बाल्टी में डाल दिया"
},

{
    question: "जीवनानंद दास की रचना है।",
    option:["झरा पालक",
            "बीजाक्षर",
            "छोड़ा हुआ रास्ता",
            "नदी के द्वीप"],
    answer:"झरा पालक"
},

{
    question: "गुरुनानक के ‘पद’ किस भाषा में रचित है?",
    option:["हिन्दीमिश्रित ब्रजभाषा",
            "अरबीमिश्रित ब्रजभाषा",
            "पंजाबीमिश्रित ब्रजभाषा",
            "तमिलमिश्रित ब्रजभाषा"],
    answer:"पंजाबीमिश्रित ब्रजभाषा"
},

{
    question: "किसने अपने कोमल सींगों से धकेलना शुरू किया?",
    option:["बैल ने",
            "हिरण ने",
            "अंकुर ने",
            "बछड़े ने"],
    answer:"अंकुर ने"
},

{
question: "श्रम-विभाजन और जाति-प्रथा शीर्षक किनके द्वारा हिंदी में रूपांतरित है?",
option:["भीमराव अंबेदकर",
        "रामचन्द्र शुक्ल",
        "ललई सिंह यादव",
        "नलिन विलोचन शर्मा"],
answer:"ललई सिंह यादव"
},

{
    question: "कटक शहर को बाढ़ की चपेट से बचाने के लिए किसने पत्थर का बाँध बँधवाया था?",

    option:["राजा खारवेल ने",
            "राजा ओड ने",
            "महाराज ययाति केशरी ने",
            "राजा स्कन्दवर्मन ने"],

    answer:"महाराज ययाति केशरी ने"
},

{
    question: "कुलसुम कौन थी?",
    option:["लेखिका",
            "गायिका",
            "हलवाइन",
            "नर्तकी"],
    answer:"हलवाइन"
},

{
    question: "वाणी कब विष के समान हो जाती है?",
    option:["राम नाम के बिना",
            "तीर्थ यात्रा के बिना",
            "ज्ञान के बिना",
            "इनमें से कोई नहीं"],
    answer:"राम नाम के बिना"
},

{
    question: "बिस्मिल्ला खाँ के खानदान का कोई भी सदस्य किस दिन शहनाई नहीं बजाता था?",
    option:["दुर्गापूजा के दिन",
            "दीपावली के दिन",
            "मुहर्रम के दिन",
            "ईद के दिन"],
    answer:"मुहर्रम के दिन"
},

{
    question: "‘टिहरी-गढ़वाल’ कहाँ अवस्थित है?",
    option:["असम में",
            "पश्चिम बंगाल में",
            "बिहार में",
            "उत्तराखंड में"],
    answer:"उत्तराखंड में"
},

{
    question: "दिल्ली में हिन्दुस्तानी डान्स म्यूजिक स्कूल किनका था?",
    option:["निर्मलाजी का",
            "विमलाजी का",
            "श्यामाजी का",
            "प्रतिभाजी का"],
    answer:"निर्मलाजी का"
},

{
question: "‘विष के दाँत’ में गरीबों के प्रति अमीरों का व्यवहार कैसा दर्शाया गया है?",
option:["दयनीय और समर्थनकारी",
        "अत्याचारी और भेदभावपूर्ण",
        "उदार और सभ्य",
        "समान"],
answer:"अत्याचारी और भेदभावपूर्ण"
},

{
question: "रानी विक्टोरिया द्वारा प्रदत्त कौन-सी पदवी को मैक्समूलर ने तुच्छ समझकर वापस कर दिया?",
option:["नाइट",
        "जनरल",
        "सर",
        "किंग"],
answer:"नाइट"
},

{
    question: "बाढ़ की समस्या कहानी के केंद्र में है।",

    option:["माँ",
            "ढहते विश्वास",
            "नगर",
            "धरती कब तक घुमेगी"],

    answer:"ढहते विश्वास"
},

{
    question: "‘नाखून क्यों बढ़ते हैं’ निबंध में निबंधकार का कौन-सा दृष्टिकोण प्रकट होता है?",
    option:["पशुवादी",
            "मानववादी",
            "देववादी",
            "दानववादी"],
    answer:"मानववादी"
},

{
question: "भीमराव अम्बेडकर के चिंतन और रचनात्मकता के मुख्यतः कितने प्रेरक व्यक्ति रहे?",
option:["5",
        "8",
        "10",
        "3"],
answer:"3"
},

{
    question: "“अक्षर कथा” किसके द्वारा लिखी गई पुस्तक है?",
    option:["अमरकांत",
            "हजारी प्रसाद द्विवेदी",
            "गुणाकर मुले",
            "महात्मा गाँधी"],
    answer:"गुणाकर मुले"
},

{
    question: "‘परम्परा का मूल्यांकन’ पाठ के रचनाकार हैं-",
    option:["यतीन्द्र मिश्र",
            "रवीन्द्रनाथ टैगोर",
            "रामविलास शर्मा",
            "गुणाकर मूले"],
    answer:"रामविलास शर्मा"
},

{
    question: "‘गवाक्ष’ का अर्थ है",
    option:["गौ की सींग",
            "गौ की आँखें",
            "बड़ी खिड़की",
            "इनमें से कोई नहीं"],
    answer:"बड़ी खिड़की"
},

{
    question: "‘इबादत’ का अर्थ है",
    option:["उपासना",
            "गायन",
            "स्वागत",
            "अभिवादन"],
    answer:"उपासना"
},

{
    question: "हजारी प्रसाद द्विवेदी किस निबंध के रचयिता हैं?",
    option:["नागरी लिपि",
            "नाखून क्यों बढ़ते हैं",
            "परंपरा का मूल्यांकन",
            "शिक्षा और संस्कृति"],
    answer:"नाखून क्यों बढ़ते हैं"
},

{
question: "सेन साहब के घर में लड़कियों का क्या स्थान है?",
option:["समान",
        "कमतर",
        "प्रमुख",
        "व्यावसायिक"],
answer:"कमतर"
},

{
    question: "अक्षर-ज्ञान किस कवि की रचना है?",
    option:["सुमित्रानंदन पंत",
            "रामधारी सिंह दिनकर",
            "रेनर मारिया रिल्के",
            "अनामिका"],
    answer:"अनामिका"
},

{
    question: "अक्षर-ज्ञान कविता बच्चों के किस स्तर की शिक्षण-प्रक्रिया से संबंधित है?",
    option:["प्रारंभिक शिक्षण प्रक्रिया",
            "मध्य शिक्षण प्रक्रिया",
            "माध्यमिक शिक्षण प्रक्रिया",
            "उच्च माध्यमिक शिक्षण"],
    answer:"प्रारंभिक शिक्षण प्रक्रिया"
},

{
    question: "आचार्य हजारी प्रसाद द्विवेदी ने साहित्य की किस विद्या में लेखन नहीं किया है?",
    option:["आलोचना",
            "उपन्यास",
            "कहानी",
            "निबंध"],
    answer:"कहानी"
},

{
    question: "कवि किसके बीच अँधेरे में होने की बात करता है?",
    option:["धान",
            "गेहूँ",
            "चना",
            "सारस"],
    answer:"सारस"
},

{
    question: "कवि रिल्के के अनुसार ईश्वर को सर्वशक्तिमान के रूप में किसने प्रतिष्ठित किया है?",

    option:["ईश्वर ने",
            "सृष्टि ने",
            "मनुष्य ने",
            "किसी ने नहीं"],

    answer:"मनुष्य ने"
},

{
    question: "सातकोड़ी होता का जन्म कब हुआ था?",

    option:["24 अक्टूबर, 1927 ई०",
            "11 अक्टूबर, 1928 ई०",
            "29 अक्टूबर, 1929 ई०",
            "30 अक्टूबर, 1930 ई०"],

    answer:"29 अक्टूबर, 1929 ई०"
},

{
    question: "वीरेन डंगवाल का जन्म किस राज्य में हुआ?",
    option:["उत्तर प्रदेश",
            "उत्तराखंड",
            "हिमाचल प्रदेश",
            "मध्य प्रदेश"],
    answer:"उत्तराखंड"
},

{
    question: "रामविलास शर्मा ने बी० ए० किस विश्वविद्यालय से किया?",
    option:["दिल्ली विश्वविद्यालय से",
            "लखनऊ विश्वविद्यालय से",
            "प्रयाग विश्वविद्यालय से",
            "पटना विश्वविद्यालय से"],
    answer:"लखनऊ विश्वविद्यालय से"
},

{
    question: "लेखक सुजाता रचित कहानी का नाम क्या है?",

    option:["माँ",
            "नगर",
            "ढहते विश्वास",
            "धरती कब तक घूमेगी"],

    answer:"नगर"
},

{
    question: "“बिरजू महाराज” का जन्म कब हुआ?",
    option:["1937",
            "1938",
            "1838",
            "1837"],
    answer:"1938"
},

{
    question: "उत्तर प्रियदर्शी किस विधा की रचना है?",
    option:["नाटक",
            "उपन्यास",
            "प्रबंधकाव्य",
            "कहानी"],
    answer:"नाटक"
},

{
    question: "‘भारतमाता’ किस कवि की रचना है?",
    option:["रामधारी सिंह दिनकर",
            "प्रेमधन",
            "सुमित्रानन्दन पंत",
            "कुंवर नारायण"],
    answer:"सुमित्रानन्दन पंत"
},

{
    question: "पंडित बिरजू महाराज लखनऊ घराने की किस पीढ़ी के कलाकार हैं?",
    option:["छठी पीढ़ी",
            "सातवीं पीढ़ी",
            "नौवीं पीढ़ी",
            "आठवीं पीढ़ी"],
    answer:"सातवीं पीढ़ी"
},

{
    question: "‘क्रंदन’ का अर्थ है-",
    option:["रोना",
            "हँसना",
            "गाना",
            "कन्द-मूल खाना"],
    answer:"रोना"
},

{
    question: "वल्लि अम्माल के गाँव का नाम क्या था?",

    option:["मूनांडिप्पट्टि",
            "अंजुग्रामम",
            "अतिपट्टु",
            "थुथुकुडी"],

    answer:"मूनांडिप्पट्टि"
},

{
    question: "लौटकर आऊँगा फिर किसकी कविता है?",
    option:["अनामिका",
            "जीवनानंद दास",
            "वीरेन डंगवाल",
            "सुमित्रानंदन पंत"],
    answer:"जीवनानंद दास"
},

{
    question: "लहुलुहान कौन भटकेंगे?",

    option:["भक्त",
            "भगवान",
            "दानव",
            "भगवान के पैर"],

    answer:"भगवान के पैर"
},

{
    question: "मिट्टी की अबोध मूरतें कौन हैं?",
    option:["नेता",
            "जनता",
            "अधिकारी",
            "मंत्री"],
    answer:"जनता"
},

{
    question: "पंतजी का निधन कब हुआ था?",
    option:["29 दिसंबर, 1977 को",
            "30 दिसंबर, 1977 को",
            "31 दिसंबर, 1977 को",
            "1 जनवरी, 1978 को"],
    answer:"29 दिसंबर, 1977 को"
},

{
    question: "अक्षर-ज्ञान किनकी काव्य कृति है?",
    option:["अर्चना वर्मा",
            "कृष्णा सोबती",
            "स्नेहलता",
            "अनामिका"],
    answer:"अनामिका"
},

{
    question: "इनका जन्म कहाँ हुआ?",
    option:["समस्तीपुर बिहार",
            "मुजफ्फरपुर बिहार",
            "सोनपुर बिहार",
            "धरमपुर बिहार"],
    answer:"मुजफ्फरपुर बिहार"
},

{
    question: "जारशाही …….. में थी।",
    option:["सोवियत रूस",
            "फ्रांस",
            "नेपाल",
            "चीन"],
    answer:"सोवियत रूस"
},

{
    question: "पिकासो की प्रसिद्ध रचना का शीर्षक है",
    option:["वीलनव्व ल आविन्यों",
            "ल मादामोजेल द आविन्यों",
            "ला शत्रूज",
            "नदी के किनारे भी नदी है"],
    answer:"ल मादामोजेल द आविन्यों"
},

{
question: "सेन साहब किस वर्ग से संबंध रखते हैं?",
option:["गरीब",
        "अमीर",
        "मझोला",
        "मजदूर"],
answer:"अमीर"
},

{
    question: "रामविलास शर्मा को किस कृति के लिए साहित्य अकादमी पुरस्कार प्राप्त हुआ है?",
    option:["प्रेमचंद और उनका युग",
            "नयी कविता और अस्तित्ववाद",
            "निराला की साहित्य साधना",
            "भारतेन्दु हरिश्चन्द्र"],
    answer:"निराला की साहित्य साधना"
},

{
    question: "पं० बिरजू महाराज का जन्म कब हुआ?",
    option:["4 फरवरी 1938",
            "4 फरवरी 1937",
            "4 फरवरी 1936",
            "4 फरवरी 1935"],
    answer:"4 फरवरी 1938"
},

{
question: "सेन साहब द्वारा गरीबों के साथ कैसा व्यवहार किया गया?",
option:["उचित",
        "कठोर और उत्पीड़क",
        "सहयोगी",
        "सम्मानजनक"],
answer:"कठोर और उत्पीड़क"
},

{
    question: "‘मंगु’ की बड़ी बहन का क्या नाम था ?",

    option:["कमु",
            "निमी",
            "गीता",
            "लक्ष्मी"],

    answer:"कमु"
},

{
    question: "कविता अक्षर-ज्ञान में ङ को क्या कहा गया है?",
    option:["भाई-बहन",
            "माँ-बेटा",
            "पिता-पुत्र",
            "इनमें कोई नहीं"],
    answer:"माँ-बेटा"
},

{
    question: "“बिरजू महाराज” किस पीढ़ी के वंशज हैं?",
    option:["दूसरी",
            "चौथी",
            "तीसरी",
            "सातवीं"],
    answer:"सातवीं"
},

{
    question: "संतू-नरेन आपस में कौन हैं?",
    option:["भाई-भाई",
            "चाचा-भतीजा",
            "भाई-बहन",
            "जीजा-साला"],
    answer:"भाई-भाई"
},

{
    question: "पंडित बिरजू महाराज का जन्म कब हुआ था?",
    option:["4 जनवरी, 1938",
            "4 फरवरी, 1938",
            "4 मार्च, 1938",
            "4 अप्रैल, 1938"],
    answer:"4 फरवरी, 1938"
},

{
    question: "अल्पज्ञ पिता कैसा जीव होता है?",
    option:["दयनीय",
            "बहादुर",
            "अल्पभाषी",
            "मृदुभाषी"],
    answer:"दयनीय"
},

{
    question: "देश की आजादी के लिए हजारी प्रसाद द्विवेदी ने अपने निबंध में किस शब्द को उपयुक्त बताया है?",
    option:["अनधीनता",
            "स्वाधीनता",
            "उन्मुक्त",
            "उच्छृंखलता"],
    answer:"स्वाधीनता"
},

{
    question: "आचार्य हजारी प्रसाद द्विवेदी का जन्म कहाँ हुआ था?",
    option:["उत्तर प्रदेश",
            "मध्य प्रदेश",
            "कर्नाटक",
            "छत्तीसगढ़"],
    answer:"उत्तर प्रदेश"
},

{
    question: "काशी किसकी पाठशाला है?",
    option:["विद्या की",
            "संस्कृति",
            "अज्ञानता",
            "अंधविश्वास"],
    answer:"संस्कृति"
},

{
    question: "‘मछली’ कहानी में किस वर्ग का चित्रण है?",
    option:["उच्चवर्गीय परिवार",
            "निम्नवर्गीय परिवार",
            "निम्नमध्यवर्गीय परिवार",
            "मध्यवर्गीय परिवार"],
    answer:"निम्नमध्यवर्गीय परिवार"
},

{
    question: "महात्मा गाँधी का जन्म हुआ ?",

    option:["2 अक्टूबर, 1867 को",
            "2 अक्टूबर, 1869 को",
            "2 अक्टूबर, 1877 को",
            "2 अक्टूबर, 1879 को"],

    answer:"2 अक्टूबर, 1869 को"
},

{
    question: "‘दिनकर’ का जन्म कहाँ हुआ?",
    option:["अल्गोड़ा जहानाबाद",
            "सोनपुर वैशाली",
            "दानापुर पटना",
            "सिमरिया बेगूसराय"],
    answer:"सिमरिया बेगूसराय"
},

{
    question: "परिवार के नौकर का क्या नाम था?",
    option:["संतू",
            "महंतू",
            "भग्गू",
            "नरेन"],
    answer:"भग्गू"
},

{
    question: "घनानंद किस बादशाह के यहाँ मीरमुंशी का काम करते थे?",
    option:["अकबर के",
            "औरंगजेब के",
            "बाबर के",
            "मोहम्मदशाह रंगीले के"],
    answer:"मोहम्मदशाह रंगीले के"
},

{
    question: "सातटि तारार तिमिर किसकी कृति है?",
    option:["राजीव सेठ",
            "जीवनानंद दास",
            "मणिका मोहिनी",
            "कुसुम अंसल"],
    answer:"जीवनानंद दास"
},

{
question: "कहानी का शीर्षक ‘विष के दाँत’ किससे प्रेरित है?",
option:["साँप के विष की कहानी से",
        "बच्चों के झगड़े से",
        "अमीरों के अत्याचार से",
        "खेल के दौरान चोट से"],
answer:"साँप के विष की कहानी से"
},

{
    question: "‘पंत’ का जन्म कब हुआ था?",
    option:["1900 ई० में",
            "1901 ई० में",
            "1902 ई० में",
            "1903 ई० में"],
    answer:"1900 ई० में"
},

{
    question: "कौन-सी कृति अज्ञेय की है?",
    option:["निशीथ",
            "सुबह का तारा",
            "अरे यायावर रहेगा याद",
            "गुंजन"],
    answer:"अरे यायावर रहेगा याद"
},

{
    question: "‘सिद्धम’ क्या है?",
    option:["मंत्र",
            "सिद्ध योगी",
            "साधु",
            "एक प्रकार की लिपि"],
    answer:"एक प्रकार की लिपि"
},

{
question: "भीमराव अम्बेदकर ने निम्न में से किसकी रचना की?",
option:["बहादुर",
        "नाखून क्यों बढ़ते हैं",
        "जाति प्रथा और श्रम-विभाजन",
        "भारत से हम क्या सीखें"],
answer:"जाति प्रथा और श्रम-विभाजन"
},

{
    question: "‘सुजानसागर’ किसकी कृति है?",
    option:["मतिराम",
            "घनानन्द",
            "देव",
            "केशवदास"],
    answer:"घनानन्द"
},

{
    question: "बारिश होते देख किसे लग रहा था जैसे इस बार भी बाढ़ आयेगी?",

    option:["रानी को",
            "लक्ष्मी को",
            "आरती को",
            "राधा को"],

    answer:"लक्ष्मी को"
},

{
    question: "कवयित्री अनामिका का जन्म कब हुआ?",
    option:["1961 ई.",
            "1962 ई.",
            "1963 ई.",
            "1965 ई."],
    answer:"1961 ई."
},

{
    question: "अशोक वाजपेयी की माता का नाम है",
    option:["कमला देवी",
            "विमला देवी",
            "निर्मला देवी",
            "लीला देवी"],
    answer:"निर्मला देवी"
},

{
question: "जाति-प्रथा के अनुसार श्रम-विभाजन का आधार क्या है?",
option:["मनुष्य की रूचि",
        "रोजगार सृजन",
        "पैतृक पेशा",
        "कौशल क्षमता"],
answer:"पैतृक पेशा"
},

{
    question: "नरेन कौन था?",
    option:["नौकर",
            "कथाकार का भाई",
            "कथाकार का दोस्त",
            "दीदी का प्रेमी"],
    answer:"दीदी का प्रेमी"
},

{
    question: "अशोक वाजपेयी का जन्म कहाँ हुआ?",
    option:["दुर्ग, छत्तीसगढ़",
            "करमलीचक, बिहार",
            "इलाहाबाद, उत्तरप्रदेश",
            "इनमें कोई नहीं"],
    answer:"दुर्ग, छत्तीसगढ़"
},

{
    question: "बेटे के लिए ‘ङ’ क्या है?",
    option:["बाप-बेटा",
            "बाप-बेटी",
            "माँ-बेटी",
            "माँ-बेटा"],
    answer:"माँ-बेटा"
},

{
    question: "गुरुनानक ने किन्हें सम्मान दिया?",
    option:["कविता को",
            "लेखन को",
            "स्त्री को",
            "पुरुष को"],
    answer:"स्त्री को"
},

{
    question: "आविन्यों फ्रांस का एक प्रमुख रहा है",
    option:["संगीत केन्द्र",
            "कला केन्द्र",
            "नृत्य केन्द्र",
            "श्रवण केन्द्र"],
    answer:"कला केन्द्र"
},

{
    question: "दिनकरजी के पिता थे",
    option:["प्रभाकर सिंह",
            "सूर्यदेव सिंह",
            "रवि सिंह",
            "दिनेश सिंह"],
    answer:"रवि सिंह"
},

{
    question: "‘शहर अब भी संभावना है’ कृति किसकी है?",
    option:["विमल मिश्र की",
            "उपेन्द्रनाथ ‘अश्क’ की",
            "गिरिधर गोपाल की",
            "अशोक वाजपेयी की"],
    answer:"अशोक वाजपेयी की"
},

{
    question: "साखी का अर्थ है।",
    option:["मित्र",
            "गवाही",
            "बन्धु",
            "विश्वासी"],
    answer:"गवाही"
},

{
    question: "मराठी भाषा की लिपि कौन-सी है?",
    option:["ब्राह्मी",
            "नंदिनागरी",
            "देवनागरी",
            "मराठी लिपि"],
    answer:"देवनागरी"
},

{
    question: "हिन्दी के आदिकवि कौन हैं?",
    option:["सरहपाद",
            "तुलसी",
            "वाल्मीकि",
            "निराला"],
    answer:"सरहपाद"
},

{
    question: "कवि अगले जन्म में क्या-क्या बनने की संभावना व्यक्त करता है?",
    option:["कौवा, मोर, उल्लू, सारस",
            "कौवा, हंस, उल्लू, सारस",
            "कौवा, हंस, कोयल, मोर",
            "कौवा, हंस, उल्लू, बाज"],
    answer:"कौवा, हंस, उल्लू, सारस"
},

{
    question: "कवि को हमेशा घर के दरवाजे पर तैनात कौन मिलता था?",
    option:["सिपाही",
            "नौकर",
            "बूढ़ा वृक्ष",
            "बूढ़ा आदमी"],
    answer:"बूढ़ा वृक्ष"
},

{
    question: "टॉलस्टॉय किस देश के साहित्यकार थे ?",

    option:["अमेरिका",
            "इटली",
            "रूस",
            "दक्षिण अफ्रीका"],

    answer:"रूस"
},

{
    question: "‘लकुटी’ का अर्थ है",
    option:["मुरली",
            "माखन",
            "छोटी लाठी",
            "लट्ट"],
    answer:"छोटी लाठी"
},

{
question: "भीमराव अम्बेदकर की मृत्यु कब हुई थी?",
option:["जनवरी 1965",
        "दिसम्बर 1956",
        "फरवरी 1914",
        "मार्च 1865"],
answer:"दिसम्बर 1956"
},

{
    question: "यतींद्र मिश्र ने गायिका गिरिजा देवी के जीवन और संगीत साधना पर कौन-सी पुस्तक लिखी?",
    option:["गिरिजा",
            "देवप्रिया",
            "सुजान रस",
            "रश्मिप्रिय"],
    answer:"गिरिजा"
},

{
    question: "“बिरजू महाराज” किस घराने के वंशज हैं?",
    option:["लखनऊ",
            "दिल्ली",
            "वनारसी",
            "पटना"],
    answer:"लखनऊ"
},

{
    question: "कवि प्रेमघन ने नेताओं से क्या अपेक्षा नहीं करने की बात कही है?",
    option:["देश प्रबंधन",
            "समाज सेवा",
            "परमार्थ",
            "स्वाधीनता जागृति"],
    answer:"देश प्रबंधन"
},

{
question: "‘जातिवाद’ के पोषकों द्वारा श्रम-विभाजन किसका दूसरा रूप माना जाता है?",
option:["मजदूरी प्रथा",
        "जाति प्रथा",
        "बाल मजदूरी प्रथा",
        "समरसता"],
answer:"जाति प्रथा"
},

{
    question: "‘दिनकरजी’ मैट्रिक पास कब किये थे?",
    option:["1927 ई. में",
            "1928 ई. में",
            "1929 ई. में",
            "1930 ई. में"],
    answer:"1928 ई. में"
},

{
    question: "मंगम्मा को किससे विवाद था?",
    option:["बेटे से",
            "बहू से",
            "पोते से",
            "सास से"],
    answer:"बहू से"
},

{
question: "किनके प्रोत्साहन पर बाब साहेब उच्चतर शिक्षा हेतु न्यूयार्क गए?",
option:["काशी नरेश",
        "पाटियाला नरेश",
        "बड़ौदा नरेश",
        "दरभंगा नरेश"],
answer:"बड़ौदा नरेश"
},

{
    question: "प्रगतिशील साहित्य का संबंध है-",
    option:["बौद्ध दर्शन से",
            "वेदान्त दर्शन से",
            "मार्क्स के विचारों से",
            "इनमें से कोई नहीं"],
    answer:"मार्क्स के विचारों से"
},

{
    question: "‘जनतंत्र का जन्म’ के कवि कौन हैं?",
    option:["कुँवर नारायण",
            "रामधारी सिंह दिनकर",
            "प्रेमघन",
            "सुमित्रानंदन पंत"],
    answer:"रामधारी सिंह दिनकर"
},

{
    question: "गुणाकर मूले की प्रारंभिक शिक्षा किस परिवेश में हुई थी?",
    option:["नगरीय",
            "ग्रामीण",
            "उच्चस्तरीय",
            "इनमें से कोई नहीं"],
    answer:"ग्रामीण"
},

{
    question: "गाँधीजी वकालत की पढ़ाई के लिए कहाँ गए ?",

    option:["दक्षिण अफ्रीका",
            "अमेरिका",
            "लंदन",
            "श्रीलंका"],

    answer:"लंदन"
},

{
    question: "कवि क्या बनकर तैरते रहने की कामना करते हैं?",
    option:["बत्तख",
            "हंस",
            "मछली",
            "साँप"],
    answer:"हंस"
},

{
question: "डॉ. अम्बेदकर किस वर्ग के परिवार में जन्म लिए थे?",
option:["पिछड़ा वर्ग",
        "सामान्य वर्ग",
        "दलित वर्ग",
        "मध्यम वर्ग"],
answer:"दलित वर्ग"
},

{
    question: "लेखक के रिश्तेदार ने कितने रुपये चोरी होने की बात कही?",
    option:["दस रुपये",
            "ग्यारह रुपये",
            "बीस रुपये",
            "बारह रुपये"],
    answer:"ग्यारह रुपये"
},

{
question: "कहानी में प्रासंगिक सामाजिक समस्या क्या है?",
option:["जाति प्रथा",
        "धार्मिक भेदभाव",
        "वर्ग भेद और अमीरी-गरीबी",
        "शिक्षा की कमी"],
answer:"वर्ग भेद और अमीरी-गरीबी"
},

{
    question: "‘लबादा’ का शाब्दिक अर्थ है?",

    option:["घोंगा",
            "पुतला",
            "मूरत",
            "खाल"],

    answer:"घोंगा"
},

{
    question: "कहानीकार के लड़के का क्या नाम था?",
    option:["किसलय",
            "काशू",
            "केशू",
            "किशोर"],
    answer:"किशोर"
},

{
    question: "मंगम्मा क्या बेचती थी?",
    option:["घी",
            "दही",
            "पनीर",
            "खोवा"],
    answer:"दही"
},

{
question: "भारत को कैसे स्वप्नदर्शियों की आवश्यकता है?",
option:["वारेन हेस्टिंग्स",
        "सर विलियम जोन्स",
        "संत पॉल",
        "जनरल कनिंघम"],
answer:"सर विलियम जोन्स"
},

{
question: "विडंबना का अर्थ क्या है?",
option:["उपेक्षा",
        "उपहास",
        "अवलंबन",
        "आडम्बर"],
answer:"उपहास"
},

{
    question: "‘नौकर की कमीज’ किस विधा की रचना है?",
    option:["निबंध",
            "कहानी",
            "नाटक",
            "उपन्यास"],
    answer:"उपन्यास"
},

{
    question: "गुणाकर मूले का जन्म कहाँ हुआ?",
    option:["केरल",
            "तमिलनाडु",
            "महाराष्ट्र",
            "उत्तरप्रदेश"],
    answer:"महाराष्ट्र"
},

{
    question: "‘भारतमाता’ कविता के रचनाकार हैं।",
    option:["सुमित्रानंदन पंत",
            "सूर्यकांत त्रिपाठी ‘निराला’",
            "रामधारी सिंह ‘दिनकर’",
            "प्रेमघन"],
    answer:"सुमित्रानंदन पंत"
},

{
    question: "‘मसाला’ कौन पीस रही थी?",
    option:["लेखक की बहन",
            "लेखक की माँ",
            "लेखक की दादी",
            "लेखक की बुआ"],
    answer:"लेखक की माँ"
},

{
    question: "पाठ्यात्री लगभग कितने साल की थी ?",

    option:["दस साल",
            "ग्यारह साल",
            "बारह साल",
            "चौदह साल"],

    answer:"बारह साल"
},

{
    question: "गुणाकर मूले ने विभिन्न विषयों पर कितने निबंध लिखे?",
    option:["1500 से अधिक",
            "2500 से अधिक",
            "3500 से अधिक",
            "4500 से अधिक"],
    answer:"2500 से अधिक"
},

{
question: "मैक्समूलर का जन्म कहाँ हुआ था?",
option:["पटना",
        "जर्मनी",
        "दिल्ली",
        "छपरा"],
answer:"जर्मनी"
},

{
    question: "फूंककर बजाए जाने वाले वाद्यों में शाह की उपाधि किसे दिया गया है?",
    option:["बाँसुरी को",
            "नागस्वरम् को",
            "शंख को",
            "शहनाई को"],
    answer:"शहनाई को"
},

{
question: "डॉ. अम्बेदकर ने पी०एच०डी० की उपाधि कब प्राप्त की?",
option:["1920 ई. में",
        "1918 ई. में",
        "1916 ई. में",
        "1914 ई. में"],
answer:"1916 ई. में"
},

{
    question: "गुरुनानक की रचना है ……….?",
    option:["अति सधो सलेट को मारता है",
            "मो अँसुवा निहि लै बरसो",
            "जो नर दुख में दुख नहिं मानै",
            "स्वदेश"],
    answer:"जो नर दुख में दुख नहिं मानै"
},

{
    question: "कवि क्या सूखने की बात कहता है?",

    option:["पानी",
            "नदी",
            "कपड़ा",
            "मदिरा"],

    answer:"मदिरा"
},

{
    question: "‘ला शत्रूज’ का धार्मिक उपयोग कब से कब तक होता रहा?",
    option:["ग्यारहवीं सदी से फ्रेंच क्रांति तक",
            "बारहवीं सदी से फ्रेंच क्रांति तक",
            "तेरहवीं सदी से फ्रेंच क्रांति तक",
            "चौदहवीं सदी से फ्रेंच क्रांति तक"],
    answer:"चौदहवीं सदी से फ्रेंच क्रांति तक"
},

{
question: "वारेन हेस्टिग्स था",
option:["फारस का राजा",
        "भारत का गवर्नर-जेनरल",
        "महान दार्शनिक",
        "प्रसिद्ध समाज सुधारक"],
answer:"भारत का गवर्नर-जेनरल"
},

{
    question: "बिरजू महाराज की शिष्या हैं",
    option:["रेशमी बाजपेयी",
            "रश्मि वाजपेयी",
            "रेशमा बाजपेयी",
            "कल्पना बाजपेयी"],
    answer:"रश्मि वाजपेयी"
},

{
    question: "बालाजी मंदिर तक जाने के लिए कितने रास्ते हैं?",
    option:["दो",
            "चार",
            "एक",
            "छः"],
    answer:"दो"
},

{
    question: "“परम्परा का मूल्यांकन” किसकी कृति है?",
    option:["रामविलास शर्मा",
            "रामधारी सिंह दिनकर",
            "अशोक वाजपेयी",
            "यतीन्द्र मिश्र"],
    answer:"रामविलास शर्मा"
},

{
    question: "मछली काटने का काम किसके द्वारा किया जाता था?",
    option:["पिताजी के द्वारा",
            "लेखक के द्वारा",
            "पड़ोसी के द्वारा",
            "भग्गू के द्वारा"],
    answer:"भग्गू के द्वारा"
},

{
    question: "अज्ञेय ने अपनी शिक्षा कहाँ तक ग्रहण की थी?",
    option:["भवंती",
            "बी. ए. ऑनर्स",
            "एम. ए.",
            "पी० एच० डी०"],
    answer:"एम. ए."
},

{
    question: "बहादुर लेखक के घर से अचानक क्यों चला गया?",
    option:["दूसरी नौकरी मिल जाने के कारण",
            "माँ की याद आने के कारण",
            "स्वयं के प्रति लेखक तथा उसके घरवालों के व्यवहार में आए परिवर्तन के कारण",
            "उपर्युक्त सभी"],
    answer:"स्वयं के प्रति लेखक तथा उसके घरवालों के व्यवहार में आए परिवर्तन के कारण"
},

{
    question: "“बेतमा” कहाँ पर है?",
    option:["पूणे",
            "पटना",
            "इंदौर के पास",
            "इलाहाबाद"],
    answer:"इंदौर के पास"
},

{
    question: "बहादुर घर से चलते समय कितनी राशि लेकर चला था?",
    option:["एक रुपया",
            "दो रुपये",
            "तीन रुपये",
            "चार रुपये"],
    answer:"दो रुपये"
},

{
    question: "कवि अज्ञेय का माना हुआ सूरज किस दिशा से निकलता है?",
    option:["पूरब से",
            "दक्षिण से",
            "आकाश से",
            "नगर के बीचों बीच से"],
    answer:"नगर के बीचों बीच से"
},

{
    question: "साहित्य सापेक्ष रूप में क्या होता है?",
    option:["पराधीन",
            "जड़",
            "परतंत्र",
            "स्वाधीन"],
    answer:"स्वाधीन"
},

{
    question: "‘अशोक के फूल’ किनकी रचना है?",
    option:["दिनकर की",
            "सुमित्रानन्दन पंत की",
            "हजारी प्रसाद द्विवेदी की",
            "गुणाकर मूले की"],
    answer:"हजारी प्रसाद द्विवेदी की"
},

{
    question: "किस मछली की आँखों में झाँकने से अपनी परछाई नहीं दिखती?",
    option:["जीवित मछली",
            "मृत मछली",
            "तैरती हुई मछली",
            "रोहू मछली"],
    answer:"मृत मछली"
},

{
    question: "‘चक्रव्यूह’ के रचनाकार हैं",
    option:["कुँवर नारायण",
            "नागार्जुन",
            "धर्मवीर भारती",
            "नरेन्द्र शर्मा"],
    answer:"कुँवर नारायण"
},

{
    question: "किसके बिना संसार में जन्म लेना व्यर्थ है?",
    option:["यश के बिना",
            "दान पुण्य के बिना",
            "तीर्थाटन के बिना",
            "भगवत् नाम के बिना"],
    answer:"भगवत् नाम के बिना"
},

{
    question: "घनानन्द किस भाषा के कवि हैं?",
    option:["अवधी",
            "ब्रजभाषा",
            "भोजपुरी",
            "गुजराती"],
    answer:"ब्रजभाषा"
},

{
    question: "अशोक वाजपेयी को ‘फ्रेंच सरकार द्वारा दिया जानेवाला पुरस्कार’ है",
    option:["ऑफिसर आव् द ऑर्डर आव् क्रॉस",
            "साहित्य अकादमी पुरस्कार",
            "दयावती मोदी कवि शेखर सम्मान",
            "इनमें सभी"],
    answer:"ऑफिसर आव् द ऑर्डर आव् क्रॉस"
},

{
    question: "हजारी प्रसाद द्विवेदी का जन्म कब हुआ?",
    option:["1907 ई.",
            "1906 ई.",
            "1905 ई.",
            "1904 ई."],
    answer:"1907 ई."
},

{
    question: "शहनाई को संगीतशास्त्र के अंतर्गत किन वाद्य यंत्रों में गिना जाता है?",
    option:["शिषिर वाद्य",
            "तुषार वाद्य",
            "सुषिर वाद्य",
            "यांत्रिक वाद्य"],
    answer:"सुषिर वाद्य"
},

{
    question: "मंगम्मा के कहानी-संकलन ‘सण्णा कथेगुलु’ को साहित्य अकादमी ने कब पुरस्कृत किया?",
    option:["सन् 1986 में",
            "सन् 1978 में",
            "सन् 1968 में",
            "सन् 1998 में"],
    answer:"सन् 1968 में"
},

{
    question: "कथक और कौन एक-दूसरे के पर्यायवाची हैं?",
    option:["रामविलास शर्मा",
            "अमरकांत",
            "बिरजू महाराज",
            "महात्मा गाँधी"],
    answer:"बिरजू महाराज"
},

{
    question: "बिरजू महाराज के शागिर्द हैं",
    option:["शाश्वती",
            "भानुमती",
            "सरस्वती",
            "स्वाती"],
    answer:"शाश्वती"
},

{
    question: "गुरुनानक ने प्रचार किया",
    option:["कर्मकांड का",
            "निर्गुण ब्रह्म की भक्ति का",
            "पूजा-पाठ का",
            "सगुण ब्रह्म की भक्ति का"],
    answer:"निर्गुण ब्रह्म की भक्ति का"
},

{
    question: "‘प्रेमघन’ जी का जन्म कब हुआ था?",
    option:["1850 ई. में",
            "1851 ई. में",
            "1854 ई. में",
            "1855 ई. में"],
    answer:"1855 ई. में"
},

{
    question: "कवि समाज की किस वर्ग की आलोचना करता है?",
    option:["दु:ख भोगी",
            "विलासिता भोगी",
            "सुविधा भोगी",
            "आलस भोगी"],
    answer:"सुविधा भोगी"
},

{
    question: "‘रहिरास’ किसकी रचना है?",
    option:["मंझन",
            "गुरुनानक",
            "कबीर",
            "रहीम"],
    answer:"गुरुनानक"
},

{
question: "रानी विक्टोरिया ने मैक्समूलर को किस उपाधि के लिए बुलाया था?",
option:["कवि",
        "नाइट",
        "गायक",
        "डॉक्टर"],
answer:"नाइट"
},

{
    question: "कुँवर नारायण की प्रसिद्ध कृति कौन-सी है?",
    option:["आत्मजयी",
            "कालजयी",
            "(A) और (B) दोनों",
            "इनमें कोई नहीं"],
    answer:"आत्मजयी"
},

{
    question: "पंतजी ने हाइस्कूल की शिक्षा कहाँ पाई?",
    option:["मुगलसराय में",
            "बनारस में",
            "हरिद्वार में",
            "पाटलिपुत्र में"],
    answer:"बनारस में"
},

{
    question: "‘दिनकर’ की गद्य-कृति है",
    option:["अर्धनारीश्वर",
            "दिनकर की डायरी",
            "वट पीपल",
            "इनमें सभी"],
    answer:"इनमें सभी"
},

{
    question: "अमरकांत ने बी० ए० कब पास किया?",
    option:["1950 ई. में",
            "1947 ई. में",
            "1946 ई. में",
            "1945 ई. में"],
    answer:"1947 ई. में"
},

{
    question: "रिश्तेदार की पत्नी के कितने रुपये खो गये थे?",
    option:["ग्यारह रुपये",
            "पच्चास रुपये",
            "बीस रुपये",
            "सौ रुपये"],
    answer:"ग्यारह रुपये"
},

{
question: "लेखक बेरोजगारी प्रमुख और प्रत्यक्ष कारण किसे मानते हैं?",
option:["अशिक्षा को",
        "जनसंख्या को",
        "जाति-प्रथा को",
        "उद्योग-धंधों की कमी को"],
answer:"जाति-प्रथा को"
},

{
    question: "माँ जी के पास आँगन में बैठकर मंगल्या क्या खाती थी ?",

    option:["दही",
            "मिठाई",
            "पान-सुपारी",
            "रोटी सब्जी"],

    answer:"दही"
},

{
    question: "पंडित बिरजू महाराज हैं",
    option:["गायक",
            "लेखक",
            "नर्तक",
            "कहानीकार"],
    answer:"नर्तक"
},

{
question: "…………..पेशे का दोषपूर्ण पूर्व निर्धारण करती है",
option:["श्रम-विभाजन",
        "जाति-प्रथा",
        "प्रत्यक्ष",
        "लोकतंत्र"],
answer:"जाति-प्रथा"
},

{
question: "कहानी में अमीरों का स्वभाव कैसा दर्शाया गया है?",
option:["दयालु",
        "अत्याचारी और अहंकारी",
        "उदार",
        "मध्यम वर्गीय"],
answer:"अत्याचारी और अहंकारी"
},

{
    question: "नदियों को बचाना है",
    option:["नाला हो जाने से",
            "बाढ़ आने से",
            "सूख जाने से",
            "इनमें से कोई नहीं"],
    answer:"नाला हो जाने से"
},

{
    question: "‘जनतंत्र का जन्म’ कविता में कवि ने किसे शक्तिशाली कहा है?",
    option:["जनता को",
            "राजा को",
            "देवता को",
            "राक्षस को"],
    answer:"जनता को"
},

{
    question: "कौन छोटे नखों को पसंद करते थे?",
    option:["दाक्षिणात्य",
            "पौर्वात्य",
            "मालव",
            "मध्यदेशीय"],
    answer:"दाक्षिणात्य"
},

{
    question: "आध्यात्मिक शिक्षा में गांधीजी का क्या अभिप्राय है ?",

    option:["पुस्तक की शिक्षा",
            "यंत्रों की शिक्षा",
            "बुद्धि की शिक्षा",
            "हृदय की शिक्षा"],

    answer:"हृदय की शिक्षा"
},

{
    question: "हिरोशिमा किस देश में है?",
    option:["इटली",
            "फ्रांस",
            "जापान",
            "जर्मनी"],
    answer:"जापान"
},

{
question: "‘भारत से हम क्या सीखें’ के रचनाकार कौन हैं?",
option:["विवेकानन्द",
        "मैक्समूलर",
        "रवीन्द्रनाथ ठाकुर",
        "दयानन्द सरस्वती"],
answer:"मैक्समूलर"
},

{
    question: "‘तारसप्तक’ में कितने कवियों की कविताएँ संगृहीत हैं?",
    option:["चार",
            "पाँच",
            "छह",
            "सात"],
    answer:"सात"
},

{
    question: "मंगम्मा ने बहू को ब्याह में कौन-कौन से गहने दिए थे?",
    option:["केवल कड़े और कर्णफूल",
            "कर्णफूल, कड़े, झुमकी, कान की जंजीर, कंठी और तगड़ी",
            "केवल सोने की चेन और अंगूठी",
            "मंगलसूत्र और पाँव की पायल"],
    answer:"कर्णफूल, कड़े, झुमकी, कान की जंजीर, कंठी और तगड़ी"
},

{
    question: "‘मित्र-मिलन’ के रचनाकार हैं-",
    option:["गुणाकर मूले",
            "महात्मा गाँधी",
            "यतीन्द्र मिश्र",
            "अमरकान्त"],
    answer:"अमरकान्त"
},

{
    question: "सीता रो आँसू क्यों बहाने लगी ?",

    option:["बेटों के दुत्कार से",
            "बहुओं की कलह से",
            "अपना काला ओढ़ना देखकर",
            "अपनी गरीबी पर"],

    answer:"अपना काला ओढ़ना देखकर"
},

{
    question: "पंतजी के पिताजी का नाम है",
    option:["गंगादत्त",
            "गंगाधर",
            "श्रीधर",
            "शिवदत्त"],
    answer:"गंगादत्त"
},

{
    question: "‘आकारों के आसपास’ कुँवर नारायण की कृति है",
    option:["कहानी-संग्रह",
            "काव्य-संग्रह",
            "समीक्षात्मक",
            "उपन्यास"],
    answer:"कहानी-संग्रह"
},

{
    question: "घर-शहर और देश के बाद कवि किन चीजों को बचाने की बात कुँवर नारायण करते हैं?",
    option:["नदी",
            "नाला",
            "हवा",
            "खाना"],
    answer:"नदी"
},

{
    question: "किस सम्राट से गुरुनानक की भेंट हुई थी?",
    option:["मुगल सम्राट बाबर से",
            "मुगल बादशाह",
            "मोहम्मद शाह",
            "अकबर"],
    answer:"मुगल सम्राट बाबर से"
},

{
    question: "शुक्लजी ‘इंदिरा गाँधी कृषि विश्वविद्यालय’ में किस पद पर थे?",
    option:["किरानी",
            "एसोसिएट प्रोफेसर",
            "मेंटेनेंस इनचार्ज",
            "इनमें कोई नहीं"],
    answer:"एसोसिएट प्रोफेसर"
},

{
    question: "दिनकर की किस कृति के लिए ज्ञानपीठ पुरस्कार मिला है?",
    option:["रश्मिरथी",
            "संस्कृति के चार अध्याय",
            "उर्वशी",
            "रेणुका"],
    answer:"उर्वशी"
},

{
question: "‘मुण्डा’ किस देश की जनजाति है?",
option:["मंगोल",
        "चीन",
        "मुल्तान",
        "भारत"],
answer:"भारत"
},

{
    question: "अज्ञेय का जन्म किस प्रदेश में हुआ था?",
    option:["मध्यप्रदेश",
            "उत्तरप्रदेश",
            "छत्तीसगढ़",
            "पंजाब"],
    answer:"उत्तरप्रदेश"
},

{
    question: "घनानंद के सुजान कहकर किसे संबोधित किया है?",
    option:["प्रीतम को",
            "सामान्य जल को",
            "साधुओं को",
            "विद्वानों को"],
    answer:"प्रीतम को"
},

{
    question: "पंडित बिरजू महाराज का जन्म कहाँ हुआ था?",
    option:["इलाहाबाद",
            "लखनऊ",
            "कानपुर",
            "पटना"],
    answer:"लखनऊ"
},

{
    question: "जंगल को किससे बचाना है?",
    option:["मरुस्थल होने से",
            "वन्य प्राणियों के आतंक से",
            "आग लगने से",
            "काँटेदार झाड़ियों से"],
    answer:"मरुस्थल होने से"
},

{
    question: "‘पक्का महाल’ क्या है?",
    option:["संगीतकार का नाम",
            "काशी विश्वनाथ से लगा हुआ इलाका",
            "अभिनेता का नाम",
            "लेखक का नाम"],
    answer:"काशी विश्वनाथ से लगा हुआ इलाका"
},

{
    question: "प्रेमघन की रचना है",
    option:["प्रयाग रामागमन",
            "प्रयागराज",
            "प्रयाग भरत आगमन",
            "प्रयागकथा"],
    answer:"प्रयाग रामागमन"
},

{
    question: "कौन नाखून को जिलाए जा रहा है?",
    option:["मनुष्य",
            "राक्षस",
            "प्रकृति",
            "पशु"],
    answer:"प्रकृति"
},

{
question: "कहानी में \"विष के दाँत\" का प्रतीक क्या है?",
option:["अमीरों की शक्ति",
        "अमीरों के अत्याचार का विरोध",
        "गरीबी",
        "मित्रता"],
answer:"अमीरों के अत्याचार का विरोध"
},

{
    question: "‘बहादुर’ पर चोरी का इल्जाम किसने लगाया?",
    option:["लेखक की पत्नी",
            "लेखक",
            "लेखक का पुत्र",
            "लेखक का अतिथि"],
    answer:"लेखक का अतिथि"
},

{
    question: "कुँवर नारायण का जन्म कब हुआ?",
    option:["17 अगस्त, 1925",
            "19 सितम्बर, 1927",
            "21 अक्टूबर, 1929",
            "23 नवम्बर, 1931"],
    answer:"19 सितम्बर, 1927"
},

{
    question: "गुप्तों की राजधानी पटना को क्या कहा जाता होगा?",
    option:["पाटलिपुत्र",
            "कुसुमपुर",
            "विलासपुर",
            "देवनगर"],
    answer:"देवनगर"
},

{
    question: "लक्ष्मी अपनी दोनों लड़कियों और छोटे बेटे को सुलाकर कहाँ गयी ?",

    option:["खलिहान में",
            "गुहाल में",
            "रसोई में",
            "कमरे में"],

    answer:"गुहाल में"
},

{
    question: "‘हमारी नींद’ कैसी कविता है?",
    option:["समकालीन",
            "नकेनवादी",
            "हालावादी",
            "छायावादी"],
    answer:"समकालीन"
},

{
    question: "बालाजी मंदिर काशी में किस घाट पर अवस्थित है?",
    option:["अस्सी घाट",
            "पंचगंगा घाट",
            "हरिश्चंद्र घाट",
            "दशाश्वमेघ घाट"],
    answer:"पंचगंगा घाट"
},

{
    question: "‘दंगे, आगजनी और बमबारी’ से किसका चित्रण हुआ है?",
    option:["सामाजिक यथार्थ का",
            "सामाजिक गंदगी का",
            "असामाजिक तत्त्वों का",
            "इनमें से कोई नहीं"],
    answer:"सामाजिक यथार्थ का"
},

{
    question: "भारतमाता को मिट्टी की प्रतिमा जैसी क्या बताया गया है?",
    option:["खुशहाल",
            "उदासिनी",
            "मिट्टी की",
            "प्रवासिनी"],
    answer:"उदासिनी"
},

{
question: "डॉ० अम्बेदकर का वाङ्मय हिन्दी के कितने खण्डों में प्रकाशित हो चुकी है?",
option:["15 खण्डों में",
        "17 खण्डों में",
        "19 खण्डों में",
        "21 खण्डों में"],
answer:"21 खण्डों में"
},

{
    question: "‘दो सौ बावन वैष्णवन की वार्ता’ के आधार पर रसखान का जन्म कहाँ हुआ था?",
    option:["पंजाब",
            "लाहौर",
            "उत्तर प्रदेश",
            "दिल्ली"],
    answer:"दिल्ली"
},

{
question: "मदन का क्या कार्य था?",
option:["विद्यार्थी",
        "मजदूर",
        "खेल-कूद का प्रेमी",
        "नौकरीपेशा"],
answer:"नौकरीपेशा"
},

{
question: "जाति-प्रथा मनुष्य के पेशे को किस प्रकार प्रभावित करती है?",
option:["यह मनुष्य के पेशे में बढ़ावा देती है।",
        "यह मनुष्य को जीवन भर के लिए एक पेशे में बाँध देती है।",
        "यह मनुष्य को रोजगारोन्मुखी बनाती है।",
        "यह मनुष्य को पेशे के लिए दक्ष बनाती है।"],
answer:"यह मनुष्य को जीवन भर के लिए एक पेशे में बाँध देती है।"
},

{
    question: "‘मराठी’ कौन-सी लिपि है?",
    option:["ग्रीक",
            "रोमन",
            "देवनागरी",
            "अरबी"],
    answer:"देवनागरी"
},

{
    question: "“चक्रव्यूह” किसकी रचना है?",
    option:["अनामिका",
            "रसखान",
            "कुँवर नारायण",
            "प्रेमघन"],
    answer:"कुँवर नारायण"
},

{
question: "लेखक आज के उद्योगों में गरीबी और उत्पीड़न से भी बड़ी समस्या किसे मानते हैं?",
option:["निर्धारित कार्य को अरुचि के साथ विवशतावश करना",
        "अनुभवहीनता",
        "कार्य-कुशलता का अभाव",
        "एकता का अभाव"],
answer:"निर्धारित कार्य को अरुचि के साथ विवशतावश करना"
},

{
    question: "आखिरी प्रोग्राम के समय बिरजू महाराज के बाबूजी कितने साल के थे?",
    option:["53 साल",
            "54 साल",
            "55 साल",
            "56 साल"],
    answer:"54 साल"
},

{
    question: "‘यदा-कदा’ किस लेखक का काव्य-संग्रह है?",
    option:["यतीन्द्र मिश्र",
            "बिस्मिल्ला खाँ",
            "शम्सुद्दीन",
            "गुणाकर मूले"],
    answer:"यतीन्द्र मिश्र"
},

{
    question: "यतींद्र मिश्र ने कहाँ से हिन्दी भाषा और साहित्य में एम०ए० किया?",
    option:["लखनऊ",
            "पटना",
            "बक्सर",
            "उड़ीसा"],
    answer:"लखनऊ"
},

{
    question: "घनानंद की भाषा क्या है?",
    option:["अवधी",
            "ब्रजभाषा",
            "प्राकृत",
            "पाली"],
    answer:"ब्रजभाषा"
},

{
    question: "‘प्रेमघन’ का जन्म कहाँ हुआ?",
    option:["मिर्जापुर में",
            "लखनऊ में",
            "इलाहाबाद में",
            "बनारस में"],
    answer:"मिर्जापुर में"
},

{
    question: "बिस्मिल्ला खाँ बाल्यकाल में कितने वर्ष डुमराँव में बिताकर काशी में रहने के लिए गये?",
    option:["3-4 वर्ष",
            "4-5 वर्ष",
            "5-6 वर्ष",
            "6-7 वर्ष"],
    answer:"5-6 वर्ष"
},

{
    question: "‘एक वृक्ष की हत्या’ किससे जुड़ी हुई है?",
    option:["मौत से",
            "पेड़-पौधों से",
            "पर्यावरण से",
            "इनमें से कोई नहीं"],
    answer:"पर्यावरण से"
},

{
    question: "बहादुर को किसकी याद नहीं आती थी?",
    option:["माँ की",
            "बहन की",
            "भाई की",
            "पिता की"],
    answer:"माँ की"
},

{
    question: "“हिन्दुस्तानी डान्स म्यूजिक” अकादमी कहाँ है?",
    option:["दिल्ली",
            "आगरा",
            "मुम्बई",
            "कलकत्ता"],
    answer:"दिल्ली"
},

{
    question: "‘एक वृक्ष की हत्या’ में वृक्ष को किस रूप में कवि ने प्रस्तुत किया है?",
    option:["वृक्ष के रूप में",
            "घर के रूप में",
            "मानव के रूप में",
            "पशु के रूप में"],
    answer:"मानव के रूप में"
},

{
    question: "कवयित्री द्वारा अंग्रेजी में लिखी गई आलोचनात्मक लेखन है",
    option:["मेमोरिबल पोएट्री",
            "पोस्ट-एलिएट पोएट्री",
            "टूथ पोएट्री",
            "इनमें सभी"],
    answer:"पोस्ट-एलिएट पोएट्री"
},

{
    question: "‘एक वृक्ष की हत्या’ कविता किस काव्य-संग्रह से संकलित है?",
    option:["दीपशिखा",
            "ग्राम्या",
            "इन दिनों",
            "चिंता"],
    answer:"इन दिनों"
},

{
    question: "बिरजू महाराज किसके पर्यायवाची बन गये हैं?",
    option:["राजस्थानी नृत्य",
            "शास्त्रीय संगीत",
            "कथक",
            "भाँगड़ा"],
    answer:"कथक"
},

{
    question: "‘देवताओं का राजा’ से किन्हें सम्बोधित किया जाता है?",
    option:["महादेव को",
            "विष्णु को",
            "इन्द्र को",
            "ब्रह्मा को"],
    answer:"इन्द्र को"
},

{
    question: "डॉ. विजयेन्द्र के अनुसार, रसखान की मृत्यु कब हुई?",
    option:["1616 ई० में",
            "1618 ई० में",
            "1620 ई० में",
            "1622 ई० में"],
    answer:"1618 ई० में"
},

{
question: "‘बुद्धा एण्ड हिज धम्म’ के लेखक कौन हैं?",
option:["हजारी प्रसाद द्विवेदी",
        "बिरजू महाराज",
        "महात्मा गाँधी",
        "भीमराव अंबेदकर"],
answer:"भीमराव अंबेदकर"
},

{
question: "मैक्समूलर ने विश्व की सबसे प्राचीन भाषा कौन-सी भाषा को कहा है?",
option:["ग्रीक को",
        "लैटिन को",
        "संस्कृत को",
        "फारसी को"],
answer:"संस्कृत को"
},

{
    question: "‘परजन्य’ का पर्याय है",
    option:["दूसरा व्यक्ति",
            "परोपकार",
            "बादल",
            "इनमें से कोई नहीं"],
    answer:"बादल"
},

{
    question: "कौन हल्ला कर बाढ़ से सबको सचेत कर रहे थे?",

    option:["चंदरा",
            "गुणनिधि, अच्युत",
            "शंकर, मकरा",
            "इनमें से सभी"],

    answer:"गुणनिधि, अच्युत"
},

{
    question: "बिस्मिल्ला खाँ के मामा का नाम था",
    option:["रियाजुल हुसैन",
            "असगर खाँ",
            "सादिक हुसैन",
            "आफताब अली"],
    answer:"सादिक हुसैन"
},

{
question: "मैक्समूलर को स्वामी विवेकानंद ने क्या कहा था?",
option:["वेदांतियों का भी वेदांती",
        "पंडित",
        "ज्ञानी",
        "विद्वान"],
answer:"वेदांतियों का भी वेदांती"
},

{
question: "डॉ. भीमराव अम्बेदकर का जन्म कहाँ हुआ?",
option:["महू, मध्यप्रदेश",
        "गोरखपुर, उत्तरप्रदेश",
        "डुमराँव, बिहार",
        "दानकुनी, पश्चिम बंगाल"],
answer:"महू, मध्यप्रदेश"
},

{
    question: "‘नाखून क्यों बढ़ते हैं’ निबंध नई पीढ़ी में कैसा भाव जगाता है?",
    option:["सांस्कृतिक आत्मगौरव",
            "स्वाधीनता",
            "देशभक्ति",
            "देवत्व"],
    answer:"सांस्कृतिक आत्मगौरव"
},

{
    question: "पाठ्यपुस्तक में संकलित जीवनानंद दास की कविता का हिन्दी अनुवाद किसने किया है?",
    option:["प्रयाग शुक्ल",
            "पंकज विष्ट",
            "वीरेन्द्र सक्सेना",
            "मणिका मोहिनी"],
    answer:"प्रयाग शुक्ल"
},

{
    question: "बाबूजी की मृत्यु के समय बिरजू महाराजजी की उम्र क्या थी?",
    option:["नौ साल का",
            "दस साल का",
            "छह साल का",
            "साढ़े नौ साल का"],
    answer:"साढ़े नौ साल का"
},

{
    question: "घनानंद के अनुसार, ‘प्रेम का मार्ग’ कैसा होता है?",
    option:["सीधा और सरल",
            "कठिन और जटिल",
            "सीधा और सुखदायी",
            "कठिन और दुखदायी"],
    answer:"सीधा और सरल"
},

{
    question: "पंतजी का जन्म कब हुआ था?",
    option:["1899 ई. में",
            "1900 ई. में",
            "1901 ई. में",
            "1902 ई. में"],
    answer:"1900 ई. में"
},

{
    question: "‘दही वाली मंगम्मा’ शीर्षक पाठ में बहू ने सास से समझौता क्यों कर लिया?",
    option:["डर से",
            "प्रेम से",
            "मजबूरी से",
            "शौक से"],
    answer:"मजबूरी से"
},

{
    question: "‘जहाँ प्रतिष्ठा नहीं वहाँ क्या रहना।’ यह बात किसके मन में उत्पन्न हुई?",
    option:["किशोर",
            "निर्मला",
            "बहादुर",
            "लेखक"],
    answer:"बहादुर"
},

{
    question: "कौन पहले संत हैं जिन्होंने विदेशी आक्रमणकारियों के विरोध में आवाज उठाई?",
    option:["गुरु तेगबहादुर",
            "गुरु अर्जुनदेव",
            "गुरु ग्रंथसाहेब",
            "गुरुनानक"],
    answer:"गुरुनानक"
},

{
    question: "‘आकारों के आसपास’ किस प्रकार की रचना है?",
    option:["प्रबंध काव्य",
            "समीक्षा",
            "कहानी संग्रह",
            "काव्य संग्रह"],
    answer:"कहानी संग्रह"
},

{
    question: "‘सिक्थक’ का अर्थ होता है",
    option:["साबुन",
            "महावर",
            "दर्पण",
            "मोम"],
    answer:"मोम"
},

{
    question: "आविन्यों पाठ के लेखक का क्या नाम है?",
    option:["हजारी प्रसाद द्विवेदी",
            "बिरजू महाराज",
            "अशोक वाजपेयी",
            "भीमराव अंबेदकर"],
    answer:"अशोक वाजपेयी"
},

{
    question: "दिनकरजी की रचना है",
    option:["उर्वशी",
            "साकेत",
            "ग्राम्या",
            "गुंजन"],
    answer:"उर्वशी"
},

{
    question: "‘पंत’ ने महाकाव्य लिखा",
    option:["उच्छ्वास",
            "बादल",
            "लोकायतन",
            "युगवाणी"],
    answer:"लोकायतन"
},

{
    question: "इनके पिता का नाम था",
    option:["श्यामनंदन किशोर",
            "रामानन्द तिवारी",
            "बृजानन्द माथुर",
            "दामोदर अग्रवाल"],
    answer:"श्यामनंदन किशोर"
},

{
    question: "इनमें से कौन-सी कृति जीवनानंद दास की नहीं है?",
    option:["झरा पालक",
            "धूसर पांडुलिपि",
            "वनलता सेन",
            "भूमिजा"],
    answer:"भूमिजा"
},

{
    question: "रश्मि बाजपेयी हैं",
    option:["नृत्यांगना",
            "अभिनेत्री",
            "गायिका",
            "कवयित्री"],
    answer:"नृत्यांगना"
},

{
    question: "मंगम्मा ने अपने बेटे-बहू से अलग होने के बाद कौन-सी चीज पहनने की इच्छा जताई थी?",
    option:["मखमल की ब्लाउज",
            "रेशम की साड़ी",
            "ऊन का शॉल",
            "सोने की चूड़ी"],
    answer:"मखमल की ब्लाउज"
},

{
    question: "सातकोड़ी होता किस भाषा के प्रमुख कथाकार हैं?",

    option:["पंजाबी",
            "अंग्रेजी",
            "उड़िया",
            "हिन्दी"],

    answer:"उड़िया"
},

{
    question: "‘पंत’ ने काव्य लिखा था",
    option:["उच्छ्वास",
            "बादल",
            "युगवाणी",
            "लोकायतन"],
    answer:"लोकायतन"
},

{
    question: "बालक किसे माँ समझता है?",
    option:["ड",
            "म",
            "ख",
            "ज"],
    answer:"ड"
},

{
    question: "‘अरे कहावत है, दवा करने से तो शान ही जगता है।’ यह कथन किसका है?",

    option:["मंगल्या का",
            "माँ जी का",
            "नजम्मा का",
            "रगप्पा का"],

    answer:"नजम्मा का"
},

{
    question: "घृणा को जीता जा सकता है :",

    option:["प्रेम से",
            "असत्य से",
            "सत्य से",
            "कष्ट से"],

    answer:"प्रेम से"
},

{
    question: "कुछ क्षण का वह उदय-अस्त! इसमें कौन-सा अलंकार है?",
    option:["उपमा",
            "रूपक",
            "विरोधाभास एवं विभावना",
            "संदेह"],
    answer:"विरोधाभास एवं विभावना"
},

{
    question: "बहादुर का पूरा नाम क्या था?",
    option:["वीर बहादुर",
            "शेरबहादुर",
            "जंग बहादुर",
            "दिल बहादुर"],
    answer:"दिल बहादुर"
},

{
    question: "मूले जी ने मिडिल स्तर तक किस भाषा को पढ़ाया?",
    option:["गुजराती",
            "संस्कृत",
            "मराठी",
            "हिन्दी"],
    answer:"मराठी"
},

{
    question: "“जित-जित मैं निरखत हूँ” किसकी रचना है?",
    option:["अमरकांत",
            "बिरजू महाराज",
            "रामविलास शर्मा",
            "मैक्समूलर"],
    answer:"बिरजू महाराज"
},

{
    question: "मछली काटने वाला पाटा कहाँ रखा रहता था?",
    option:["ड्रम के पीछे",
            "टेबल के नीचे",
            "बेड के पीछे",
            "छत के ऊपर"],
    answer:"ड्रम के पीछे"
},

{
    question: "किन लोगों के लिए साहित्य की परम्परा का ज्ञान सबसे आवश्यक है?",
    option:["जो रूढ़िवादी हैं।",
            "जो लकीर के फकीर हैं।",
            "जो साहित्यकार बनना चाहते हैं।",
            "जो साहित्य में युग परिवर्तन करना चाहते हैं।"],
    answer:"जो साहित्य में युग परिवर्तन करना चाहते हैं।"
},

{
    question: "‘नाखून क्यों बढ़ते हैं’ किस प्रकार का निबंध है?",
    option:["भावात्मक",
            "विवरणात्मक",
            "ललित",
            "विवेचनात्मक"],
    answer:"ललित"
},

{
    question: "इस नश्वर जीवन के बाद जीवनानंद दास कहाँ की धरती पर आने की लालसा प्रकट की है?",
    option:["बिहार",
            "बंगाल",
            "उत्तर प्रदेश",
            "उड़ीसा"],
    answer:"बंगाल"
},

{
    question: "दिनकरजी को साहित्य अकादमी पुरस्कार किस रचना पर दिया गया?",
    option:["संस्कृति के चार अध्याय",
            "कुरुक्षेत्र",
            "अर्धनारीश्वर",
            "मिट्टी की ओर"],
    answer:"संस्कृति के चार अध्याय"
},

{
    question: "रसखान हिन्दी के लोकप्रिय कवि हैं",
    option:["सामाजिक",
            "धार्मिक",
            "व्यंग्यात्मक",
            "जातीय"],
    answer:"जातीय"
},

{
    question: "श्रीनिवास जी का जन्म कहाँ हुआ था?",
    option:["मयूरभंज, उड़ीसा",
            "कोलार, कर्नाटक",
            "अमृतवेल, गुजरात",
            "अजेरी, राजस्थान"],
    answer:"कोलार, कर्नाटक"
},

{
    question: "भारतमाता का आँचल कैसा है?",
    option:["नीला",
            "लाल",
            "गीला",
            "धूल भरा"],
    answer:"धूल भरा"
},

{
    question: "मंगम्मा किस साहित्य की सर्वाधिक प्रतिष्ठित रचनाकारों में से एक हैं?",
    option:["गुजराती",
            "कन्नड़",
            "तमिल",
            "ओड़िया"],
    answer:"कन्नड़"
},

{
    question: "लखनऊ में बिरजू महाराज की मुलाकात किनसे हुई थी?",
    option:["भाई से",
            "पिताजी से",
            "कपिलाजी से",
            "इनमें कोई नहीं"],
    answer:"कपिलाजी से"
},

{
    question: "द्विवेदीजी ने ‘निर्लज्ज अपराधी’ किसे कहा है?",
    option:["नाखून को",
            "चोर को",
            "डाकू को",
            "बदमाश को"],
    answer:"नाखून को"
},

{
    question: "किसने कहा था- “इन मुसलमान हरिजनन पै कोटि हिन्दू वारिये”?",
    option:["निराला",
            "भारतेन्दु हरिश्चन्द्र",
            "रामविलास शर्मा",
            "रामचन्द्र शुक्ल"],
    answer:"भारतेन्दु हरिश्चन्द्र"
},

{
    question: "नींद के दौरान कुछ इंच कौन बढ़ गए?",
    option:["लघु जीव",
            "पुष्प-वृन्द",
            "पेड़",
            "लता-जाल"],
    answer:"पेड़"
},

{
    question: "‘देवी जागरण’ कहाँ हुआ?",
    option:["गरीब बस्तियों में",
            "मंदिरों में",
            "शहरों में",
            "गाँवों में"],
    answer:"गरीब बस्तियों में"
},

{
    question: "बहादुर कौन था?",
    option:["चपरासी",
            "पहरेदार",
            "नौकर",
            "फौजी"],
    answer:"नौकर"
},

{
question: "दारिस नामक सोने के सिक्कों से भरा घड़ा किसे मिला था?",
option:["हेकल",
        "हकर्स",
        "वारेन हेस्टिंग्स",
        "विलियम जोन्स"],
answer:"वारेन हेस्टिंग्स"
},

{
    question: "रेनर मारिया रिल्के की माता का नाम क्या था?",

    option:["रत्नावती",
            "निर्मला",
            "सोफिया",
            "तृप्ता"],

    answer:"सोफिया"
},

{
    question: "“नागरी लिपि” गुणाकर मुले की किस पुस्तक से लिया गया है?",
    option:["अक्षरों की कहानी",
            "अक्षर कथा",
            "अक्षरज्ञान",
            "भारतीय लिपियों की कहानी"],
    answer:"भारतीय लिपियों की कहानी"
},

{
    question: "लक्ष्मण कहाँ नौकरी करता था?",

    option:["बम्बई में",
            "मद्रास में",
            "कलकत्ता में",
            "दिल्ली में"],

    answer:"कलकत्ता में"
},

{
    question: "“यतींद्र मिश्र” का जन्म कब हुआ था?",
    option:["1977",
            "1897",
            "1918",
            "1919"],
    answer:"1977"
},

{
    question: "हमारी नींद के दौरान पौधे कितनी वृद्धि कर गए?",
    option:["कुछ इंच",
            "कुछ सेंटीमीटर",
            "कुछ सूत",
            "इनमें से कोई नहीं"],
    answer:"कुछ सूत"
},

{
    question: "सुमित्रानंदन पंत ने ‘मिट्टी की प्रतिमा उदासिनी’ किसे कहा है?",
    option:["मूर्ति",
            "माता",
            "विमाता",
            "भारतमाता"],
    answer:"भारतमाता"
},

{
    question: "‘भारतमाता’ शीर्षक प्रगीत पंत के किस काव्य संकलन से लिया गया है?",
    option:["गुंजन",
            "ग्राम्या",
            "युगवाणी",
            "युगान्त"],
    answer:"ग्राम्या"
},

{
    question: "कौन मनुष्य का आदर्श नहीं बन सकती?",
    option:["शेर",
            "बंदरियाँ",
            "भालू",
            "हाथी"],
    answer:"बंदरियाँ"
},

{
    question: "“परंपरा का मूल्यांकन” किस विधा की रचना है?",
    option:["कहानी",
            "निबंध",
            "संस्मरण",
            "लघु कथा"],
    answer:"निबंध"
},

{
question: "मदन ने खोखा के दाँत कितने तोड़े?",
option:["एक",
        "दो",
        "तीन",
        "चार"],
answer:"दो"
},

{
    question: "अपने ही अधीन रहना को अंग्रेजी में हम क्या कहते हैं?",
    option:["इण्डिपेण्डेन्स",
            "स्वाधीनता",
            "डिपेन्डेन्ट",
            "सेल्फडिपेण्डेन्स"],
    answer:"सेल्फडिपेण्डेन्स"
},

{
question: "डॉ. अम्बेदकर का जन्म किस राज्य में हुआ था?",
option:["उत्तर प्रदेश",
        "मध्यप्रदेश",
        "हिमाचल प्रदेश",
        "बिहार"],
answer:"मध्यप्रदेश"
},

{
    question: "‘ढहते विश्वास‘ कहानी के सम्पादक कौन हैं?",

    option:["ईश्वर पेटलीकर",
            "सातकोड़ी होता",
            "श्रीनिवास",
            "सुजाता"],

    answer:"सातकोड़ी होता"
},

{
    question: "निर्वासित का अर्थ है?",

    option:["प्रवास",
            "आवास",
            "बेघर",
            "घर"],

    answer:"बेघर"
},

{
    question: "रामविलास शर्मा का जन्म कब हुआ था?",
    option:["10 अक्टूबर, 1912 को",
            "20 सितम्बर, 1913 को",
            "25 नवम्बर, 1914 को",
            "10 अक्टूबर, 1911 को"],
    answer:"10 अक्टूबर, 1912 को"
},

{
    question: "जीवनानंद दास को जाना जाता है",
    option:["बाँग्ला के आधुनिक कवि के रूप में",
            "हिन्दी के साहित्यकार के रूप में",
            "मराठी के हास्य कवि के रूप में",
            "इनमें से सभी"],
    answer:"बाँग्ला के आधुनिक कवि के रूप में"
},

{
    question: "कवि कुँवर नारायण ने किसके शरीर को पुराने चमड़े से निर्मित कहा है?",
    option:["वृद्ध आदमी",
            "वृद्ध पशु",
            "पुराना वृक्ष",
            "इनमें से कोई नहीं"],
    answer:"पुराना वृक्ष"
},

{
    question: "पहले दिन पाप्पाति को क्या था?",

    option:["सर्दी",
            "जुकाम",
            "बुखार",
            "दर्द"],

    answer:"बुखार"
},

{
    question: "किसे घर में मछली या माँस बनना अच्छा नहीं लगता था?",
    option:["पिताजी को",
            "भग्गू को",
            "मग्गू को",
            "माँ को"],
    answer:"माँ को"
},

{
    question: "जन्म से ही पागल है -",

    option:["लक्ष्मी",
            "पाप्पाति",
            "सीता",
            "मंगु"],

    answer:"मंगु"
},

{
question: "डॉ. भीमराव अम्बेदकर की रचनात्मकता के प्रेरक व्यक्ति थे।",
option:["महात्मा गाँधी",
        "ज्योतिबा फूले",
        "गोपालकृष्ण गोखले",
        "विवेकानन्द"],
answer:"ज्योतिबा फूले"
},

{
    question: "‘सुजान रसखान’ किस प्रकार की रचना है?",
    option:["सुजान संबंधी",
            "प्रेम-निरूपण संबंधी",
            "सगुण-भक्ति संबंधी",
            "कृष्ण की भक्ति संबंधी"],
    answer:"कृष्ण की भक्ति संबंधी"
},

{
    question: "कवि के अनुसार घर को किससे बचाना है?",
    option:["धनहीनता से",
            "भूकंप से",
            "लुटेरों से",
            "झंझट से"],
    answer:"लुटेरों से"
},

{
question: "मदन की गिरफ्तारी किस कारण से हो सकती है?",
option:["चोरी",
        "लड़ाई-झगड़ा",
        "नौकरी छोड़ना",
        "कोई कारण नहीं"],
answer:"लड़ाई-झगड़ा"
},

{
    question: "किस देश में फूंककर बजाए जाने वाले वाद्ययंत्र ‘नथ’ बोलते हैं?",
    option:["भारत",
            "अरब",
            "नेपाल",
            "चीन"],
    answer:"अरब"
},

{
    question: "विनोद कुमार शुक्ल ‘दयावती मोदी कवि शेखर सम्मान’ से कब सम्मानित किया गया?",
    option:["1993 ई. में",
            "1995 ई. में",
            "1997 ई. में",
            "1999 ई. में"],
    answer:"1997 ई. में"
},

{
    question: "बहू ने पोते को किसके पास नहीं जाने के लिए सिखाया था?",
    option:["अपने पिता के पास",
            "दादी के पास",
            "कथावाचक के पास",
            "रंगप्पा के पास"],
    answer:"दादी के पास"
},

{
    question: "जीवनानंद दास किस भाषा के कवि हैं?",
    option:["हिन्दी",
            "उड़िया",
            "बाँगला",
            "मराठी"],
    answer:"बाँगला"
},

{
    question: "देवनागरी लिपि में मुद्रण के टाइप कब बने?",
    option:["दो सदी पहले",
            "दो दशक पहले",
            "बीसवीं सदी में",
            "11वीं सदी में"],
    answer:"दो सदी पहले"
},

{
    question: "बिरजू महाराज को तालीम किनसे मिली थी?",
    option:["माताजी से",
            "पिताजी से",
            "पड़ोसी से",
            "मित्र से"],
    answer:"पिताजी से"
},

{
    question: "मराठी भाषा की लिपि है",
    option:["देवनागरी",
            "मराठी",
            "ब्राह्मी",
            "इनमें से कोई नहीं"],
    answer:"देवनागरी"
},

{
    question: "‘हमारी नींद’ कविता के अनुसार किसका जीवन-क्रम पूरा हुआ?",
    option:["एक मच्छर का",
            "मछली का",
            "एक मक्खी का",
            "तोते का"],
    answer:"एक मक्खी का"
},

{
    question: "अज्ञेय ने सूत्रपात किया",
    option:["मानवतावाद",
            "अतिवाद",
            "प्रयोगवाद",
            "समाजवाद"],
    answer:"प्रयोगवाद"
},

{
    question: "बहादुर स्वभावतः कैसा था?",
    option:["हँसमुख एवं मेहनती",
            "क्रोधी एवं आलसी",
            "ईर्ष्यालु एवं कामचोर",
            "लड़ाकू एवं चोर"],
    answer:"हँसमुख एवं मेहनती"
},

{
    question: "बाबूजी के साथ बिरजू महाराज का आखिरी प्रोग्राम कहाँ था?",
    option:["मैनपुरी में",
            "इन्द्रपुरी में",
            "देवपुरी में",
            "जनकपुरी में"],
    answer:"मैनपुरी में"
},

{
    question: "कवि प्रेमधन के अनुसार देश के नेताओं से क्या नहीं संभल रही है?",
    option:["देश",
            "समाज",
            "स्वदेशी परिधान",
            "राज-काज"],
    answer:"स्वदेशी परिधान"
},

{
    question: "“बिदेशी’ से कवि का क्या तात्पर्य है?",
    option:["ब्रिटेन",
            "अमेरिका",
            "फ्रांस",
            "डेनमार्क"],
    answer:"ब्रिटेन"
},

{
    question: "‘यतींद्र मिश्र’ रचनाकार के रूप में मूलतः क्या थे?",
    option:["कवि",
            "लेखक",
            "चित्रकार",
            "गायक"],
    answer:"कवि"
},

{
    question: "दिनकर को साहित्य अकादमी पुरस्कार किस कृति पर मिला?",
    option:["सामधेनी पर",
            "संस्कृति के चार अध्याय पर",
            "उर्वशी पर",
            "द्वंद्वगीत पर"],
    answer:"संस्कृति के चार अध्याय पर"
},

{
    question: "“आई वांट दैट गर्ल एडमिटेड नाउ” किसने कहा था?",

    option:["छोटे डॉक्टर ने",
            "बड़े डॉक्टर ने",
            "प्रशिक्षु डॉक्टर ने",
            "नर्स ने"],

    answer:"बड़े डॉक्टर ने"
},

{
    question: "बिरजू महाराज को ‘संगीत-भारती’ से जोड़ने में किनका योगदान था?",
    option:["पिताजी का",
            "माताजी का",
            "कपिलाजी का",
            "इनमें किसी का नहीं"],
    answer:"कपिलाजी का"
},

{
    question: "‘एक वृक्ष की हत्या’ के कवि कौन हैं?",
    option:["अज्ञेय",
            "पंत",
            "कुँवर नारायण",
            "जीवनानंद दास"],
    answer:"कुँवर नारायण"
},

{
    question: "‘हमारी नींद’ कविता में हठीला किसे कहा गया है?",
    option:["बालक को",
            "श्रमिक को",
            "प्रकृति को",
            "जीवन को"],
    answer:"जीवन को"
},

{
    question: "दक्षिण भारत की नागरी लिपि को क्या कहते हैं?",
    option:["देवनागरी",
            "नंदिनागरी",
            "मराठी",
            "मेवारी"],
    answer:"नंदिनागरी"
},

{
question: "फ्रेड्रिक मैक्समूलर किस पाठ के रचयिता हैं?",
option:["श्रम-विभाजन और जाति-प्रथा ।",
        "नागरी लिपि",
        "भारत से हम क्या सीखें",
        "पंरपरा का मूल्यांकन"],
answer:"भारत से हम क्या सीखें"
},

{
    question: "‘अहिंसा दिवस’ किस तारीख को मनाया जाता है?",

    option:["20 जनवरी",
            "18 फरवरी",
            "2 अक्टूबर",
            "15 अगस्त"],

    answer:"2 अक्टूबर"
},

{
    question: "आविन्यों कहाँ का एक मध्ययुगीन ईसाई मठ है?",
    option:["उत्तरी फ्रांस",
            "दक्षिणी फ्रांस",
            "उत्तरी अमेरिका",
            "इनमें से कोई नहीं"],
    answer:"दक्षिणी फ्रांस"
},

{
    question: "वीरेन डंगवाल का कौन-कौन सा काव्य-संग्रह है?",
    option:["दुष्चक्र में स्रष्टा",
            "इसी दुनिया में",
            "(A) और (B) दोनों",
            "इनमें से कोई नहीं"],
    answer:"(A) और (B) दोनों"
},

{
    question: "कवि कुछ देर के लिए बैठ जाते हैं?",
    option:["मंदिर में",
            "घर में",
            "पड़ोस में",
            "वृक्ष की छाया में"],
    answer:"वृक्ष की छाया में"
},

{
    question: "‘आकाशपक्षी’ किस विधा की रचना है?",
    option:["कहानी",
            "निबंध",
            "उपन्यास",
            "नाटक"],
    answer:"उपन्यास"
},

{
    question: "हिरोशिमा शीर्षक कविता में सूरज का प्रतीक अर्थ क्या है?",
    option:["खगोलीय पिण्ड",
            "प्रशंसित व्यक्ति",
            "प्रचण्ड क्रोध",
            "अणुबम"],
    answer:"अणुबम"
},

{
    question: "बिरजू महाराज के पिता क्या थे?",
    option:["प्रसिद्ध संगीतज्ञ",
            "प्रसिद्ध नाट्यकार",
            "प्रसिद्ध कलाप्रेमी",
            "प्रसिद्ध नर्तक"],
    answer:"प्रसिद्ध नर्तक"
},

{
    question: "‘हिंद स्वराज’ के रचनाकार हैं :",

    option:["महात्मा गाँधी",
            "सुभाषचंद्र बोस",
            "प्रेमचंद",
            "राष्ट्रकवि ‘दिनकर’"],

    answer:"महात्मा गाँधी"
},

{
    question: "साहित्य के निर्माण में किनकी भूमिका निर्णायक है?",
    option:["प्रतिभाशाली मनुष्यों की",
            "भाग्यवादी मनुष्यों की",
            "परिश्रमी मनुष्यों की",
            "पूँजीपति मनुष्यों की"],
    answer:"प्रतिभाशाली मनुष्यों की"
},

{
    question: "रसूलनबाई थी",
    option:["नर्तकी",
            "गायिका",
            "कवयित्री",
            "लेखिका"],
    answer:"गायिका"
},

{
    question: "रिल्के का ‘काव्य-संग्रह’ है?",

    option:["लॉरेंस सक्रिफाइस",
            "लाइफ एण्ड सौंग्स",
            "एडवेंट",
            "इनमें सभी"],

    answer:"इनमें सभी"
},

{
question: "शक्तिशाली वर्ग का क्या स्वभाव दिखाई गई कहानी में?",
option:["प्रगतिशील",
        "अहंकारी और अत्याचारी",
        "संघर्षशील",
        "दयालु"],
answer:"अहंकारी और अत्याचारी"
},

{
question: "भारत की प्राचीनतम भाषा कौन-सी है?",
option:["मगही",
        "प्राकृत",
        "संस्कृत",
        "हिन्दी"],
answer:"संस्कृत"
},

{
    question: "बिस्मिल्ला खाँ को बालाजी मंदिर में शहनाई बजाने पर कितनी मेहनताना मिलती थी?",
    option:["चार आना",
            "आठ आना",
            "बारह आना",
            "सोलह आना"],
    answer:"आठ आना"
},

{
    question: "पाठ्यपुस्तक में संकलित रिल्के की कविता किस भाव की है?",

    option:["शृंगार",
            "वीर",
            "भक्ति",
            "अद्भुत"],

    answer:"भक्ति"
},

{
    question: "‘दही वाली मंगम्मा’ शीर्षक कहानी में, रास्ते में क्या है?",
    option:["अमराई का कुआँ",
            "आम का बगीचा",
            "खेल का मैदान",
            "मंदिर"],
    answer:"अमराई का कुआँ"
},

{
    question: "‘माली-मालिन’ कौन-सा समास है?",
    option:["द्विगु",
            "अव्ययीभाव",
            "तत्पुरुष",
            "द्वन्द्व"],
    answer:"द्वन्द्व"
},

{
    question: "द्विवेदीजी को ‘आलोकपर्व’ पर कौन-सा पुरस्कार मिला?",
    option:["प्रेमचन्द पुरस्कार",
            "कुमारन आशान पुरस्कार",
            "ज्ञानपीठ पुरस्कार",
            "साहित्य अकादमी पुरस्कार"],
    answer:"साहित्य अकादमी पुरस्कार"
},

{
    question: "गुरुनानक की मृत्यु कब हुई?",
    option:["1540 ई. में",
            "1560 ई. में",
            "1539 ई. में",
            "1565 ई. में"],
    answer:"1539 ई. में"
},

{
    question: "कवि ‘प्रेमघन’ के अनुसार भारत में आज कौन-सी वस्तु दिखाई नहीं पड़ती?",
    option:["भारतीयता",
            "कदाचारिता",
            "पत्रकारिता",
            "अंग्रेजी भाषा"],
    answer:"भारतीयता"
},

{
    question: "‘स्वदेशी’ शीर्षक पाठ्यपुस्तक में संकलित कविता किस छन्द में है?",
    option:["चौपाई",
            "दोहा",
            "सोरठा",
            "छप्पय"],
    answer:"दोहा"
},

{
    question: "‘राधा-कृष्ण’ के संवाद को किस पद्य-प्रबंध में संकलित किया गया है?",
    option:["सुजान रसखान",
            "अष्टयाम",
            "दानलीला",
            "इनमें कोई नहीं"],
    answer:"दानलीला"
},

{
question: "मैक्समूलर की मृत्यु कब हुई थी?",
option:["18 फरवरी 1916 ई.",
        "सितंबर 1961 ई.",
        "28 अक्टूबर 1900 ई.",
        "6 दिसम्बर 1907 ई."],
answer:"28 अक्टूबर 1900 ई."
},

{
    question: "‘पंत’ की मृत्यु कब हुई?",
    option:["25 नवम्बर, 1975 को",
            "29 दिसम्बर, 1977 को",
            "26 जनवरी, 1979 को",
            "30 फरवरी, 1981 को"],
    answer:"29 दिसम्बर, 1977 को"
},

{
    question: "‘नाखून क्यों बढ़ते हैं’ के निबंधकार कौन हैं?",
    option:["गुलाब राय",
            "शांति प्रिय द्विवेदी",
            "प्रतापनारायण मिश्र",
            "आचार्य हजारी प्रसाद द्विवेदी"],
    answer:"आचार्य हजारी प्रसाद द्विवेदी"
},

{
    question: "वीरेन डंगवाल का जन्म कब हुआ था?",
    option:["1947",
            "1943",
            "1942",
            "1847"],
    answer:"1947"
},

{
    question: "‘अयनि’ का अर्थ है",
    option:["आँख",
            "प्रेम",
            "सखी",
            "खजाना"],
    answer:"खजाना"
},

{
    question: "किसने बहादुर को डंडे से पिटाई कर दी?",
    option:["कहानीकार",
            "किशोर",
            "फौजी",
            "पहरेदार"],
    answer:"किशोर"
},

{
    question: "सिख धर्म का प्रवर्तन किसने किया?",
    option:["गुरुनानक",
            "गुरु गोविंद सिंह",
            "गुरु तेगबहादुर",
            "गुरु अर्जुनदेव"],
    answer:"गुरुनानक"
},

{
    question: "“प्रेमघन’ ने साप्ताहिक किस पत्रिका का सम्पादन किया?",
    option:["लालित्य-लहरी",
            "नागरी नीरद",
            "आनन्द अरुणोदय",
            "मयंक महिमा"],
    answer:"नागरी नीरद"
},

{
question: "सभ्य समाज श्रम विभाजन के लिए किसको आवश्यक मानता है?",
option:["कार्य-कुशलता",
        "जाति प्रथा",
        "वर्ण-विभाजन",
        "उपरोक्त कोई नहीं"],
answer:"कार्य-कुशलता"
},

{
    question: "चौखटे में बेटे का क्या नहीं अँटता?",
    option:["क",
            "ख",
            "ग",
            "घ"],
    answer:"क"
},

{
    question: "गुरुनानक की रचनाओं का संग्रह किनके द्वारा किया गया?",
    option:["गुरु गोविंद सिंह",
            "बंदा वैरागी",
            "गुरु अर्जुनदेव",
            "ज्ञानदेव"],
    answer:"गुरु अर्जुनदेव"
},

{
    question: "किस नदी के बाँध के नीचे लक्ष्मी का घर था?",

    option:["गंगा",
            "यमुना",
            "सरस्वती",
            "देवी"],

    answer:"देवी"
},

{
    question: "किसने शास्त्रीय नृत्य कला को गति और चमक प्रदान की?",
    option:["रश्मि वाजपेयी",
            "बिरजू महाराज",
            "कपिलाजी",
            "इनमें से कोई नहीं"],
    answer:"बिरजू महाराज"
},

{
question: "कौन-सी व्यवस्था मनुष्य के प्रशिक्षण अथवा उसकी निजी क्षमता का विचार किए बिना ही उसका पेशा निर्धारित कर देती है?",
option:["जाति-व्यवस्था",
        "शासन-व्यवस्था",
        "मध्ययुगीन-व्यवस्था",
        "आधुनिक व्यवस्था"],
answer:"जाति-व्यवस्था"
},

{
    question: "‘तुम्हारी माँ’ किसकी रचना है?",

    option:["सिद्धकोड़ी होता की",
            "सुजाता की",
            "काल्डवेल की",
            "सावित्री दयमा की"],

    answer:"सिद्धकोड़ी होता की"
},

{
question: "आधुनिक सभ्य समाज कार्यकुशलता के लिए किसे आवश्यक मानता है?",
option:["श्रम-विभाजन",
        "धन-विभाजन",
        "जन-विभाजन",
        "जाति-विभाजन"],
answer:"श्रम-विभाजन"
},

{
    question: "‘ढहते विश्वास‘ कहानी किस लेखक द्वारा अनुदित है?",

    option:["राजेन्द्र प्रसाद मिश्र",
            "वी० आर० नारायण",
            "गोपाल दास नागर",
            "के० ए० जमुना"],

    answer:"राजेन्द्र प्रसाद मिश्र"
},

{
    question: "मंगम्मा के अनुसार, घरवाली ऐसा करे तो घरवाला घर में किसकी तरह रहता है?",
    option:["राजा की तरह",
            "नौकर की तरह",
            "कुत्ते की तरह",
            "बच्चे की तरह"],
    answer:"कुत्ते की तरह"
},

{
    question: "अज्ञेय की मृत्यु कब हुई थी?",
    option:["1987",
            "1986",
            "1887",
            "1886"],
    answer:"1987"
},

{
    question: "सुमित्रानंदन पंत की माता का नाम क्या है?",
    option:["सरस्वती देवी",
            "लक्ष्मी देवी",
            "बुधिया देवी",
            "सुमित्रा देवी"],
    answer:"सरस्वती देवी"
},

{
    question: "‘बेतमा’ कहाँ है?",
    option:["इंदौर के पास",
            "इलाहाबाद के पास",
            "पुणे के पास",
            "पटना के पास"],
    answer:"इंदौर के पास"
},

{
    question: "आर्य कहाँ रहते थे?",

    option:["चीन में",
            "भारत में",
            "फ्रांस में",
            "स्वीडेन में"],

    answer:"भारत में"
},

{
    question: "‘नानकाना साहब’ कहाँ अवस्थित है?",
    option:["भारत में",
            "पाकिस्तान में",
            "श्रीलंका में",
            "नेपाल में"],
    answer:"पाकिस्तान में"
},

{
    question: "बिरजू महाराज की कितनी संतानें थीं?",
    option:["दो",
            "तीन",
            "चार",
            "कोई नहीं"],
    answer:"दो"
},

{
question: "डॉ० भीमराव अम्बेदकर का जन्म कहाँ हुआ?",
option:["महू, मध्यप्रदेश",
        "गोरखपुर, उत्तरप्रदेश",
        "डुमराँव, बिहार",
        "दानकुनी, पश्चिम बंगाल"],
answer:"महू, मध्यप्रदेश"
},

{
    question: "अमोधवर्ष कौन था?",
    option:["राष्ट्रकूट राजा",
            "राज वैध",
            "विद्वान",
            "कवि"],
    answer:"राष्ट्रकूट राजा"
},

{
    question: "‘सरसों’ का हिन्दी मानक शब्द है",
    option:["सरस",
            "सरसों का पौधा",
            "रस बरसाओ",
            "सरकना"],
    answer:"रस बरसाओ"
},

{
question: "कहानी \"विष के दाँत\" का मुख्य पात्र कौन है?",
option:["काशू",
        "मदन",
        "सेन साहब",
        "गिरधर"],
answer:"काशू"
},

{
    question: "नागरी लिपि किस विद्या की रचना है?",
    option:["कहानी",
            "निबंध",
            "उपन्यास",
            "संस्मरण"],
    answer:"निबंध"
},

{
question: "‘विष के दाँत’ किस प्रकार का साहित्य है?",
option:["कहानी",
        "कविता",
        "नाटक",
        "निबंध"],
answer:"कहानी"
},

{
    question: "‘पेड़ पर कमरा’ किनकी रचना है?",
    option:["वीरेन डंगवाल",
            "रामविलास शर्मा",
            "रामचन्द्र शुक्ल",
            "विनोद कुमार शुक्ल"],
    answer:"विनोद कुमार शुक्ल"
},

{
    question: "‘अब’ नाम से इन्होंने किस भाषा में कविता की रचना की?",
    option:["अरबी",
            "हिन्दी",
            "उर्दू",
            "मलयालम"],
    answer:"उर्दू"
},

{
    question: "कुँवर नारायण का जन्म किस शहर में हुआ था?",
    option:["कानपुर",
            "इलाहाबाद",
            "लखनऊ",
            "पटना"],
    answer:"लखनऊ"
},

{
    question: "‘अनामदास का पोथा’ साहित्य की किस विधा की रचना है?",
    option:["कहानी",
            "उपन्यास",
            "निबंध",
            "नाटक"],
    answer:"उपन्यास"
},

{
    question: "पाप्पाति की उम्र क्या थी?",

    option:["12 वर्ष",
            "15 वर्ष",
            "18 वर्ष",
            "20 वर्ष"],

    answer:"12 वर्ष"
},

{
question: "मैक्समूलर के पिता का क्या नाम था?",
option:["विल्हेल्म मूलर",
        "हेस्टिंग्स, मूलर",
        "जॉनसन मूलर",
        "पीटर मूलर"],
answer:"विल्हेल्म मूलर"
},

{
    question: "वनलता सेन किसका काव्य संकलन है?",
    option:["अज्ञेय",
            "प्रेमघन",
            "रामधारी सिंह दिनकर",
            "जीवनानंद दास"],
    answer:"जीवनानंद दास"
},

{
    question: "अज्ञेय की निबंध कृति है",
    option:["भवंती",
            "अंतरा",
            "त्रिशंकु",
            "इनमें से सभी"],
    answer:"इनमें से सभी"
},

{
    question: "संतू भीगने से बचने के लिए कहाँ खड़ा था?",
    option:["पेड़ के नीचे",
            "मकान के नीचे",
            "झोपड़ी के नीचे",
            "इनमें से कोई नहीं"],
    answer:"मकान के नीचे"
},

{
    question: "‘शरविंदुहासिनी’ कौन है?",
    option:["जनता",
            "प्रजा",
            "माता",
            "भारतमाता"],
    answer:"भारतमाता"
},

{
    question: "सवैये में रसखान की कैसी आकांक्षा प्रकट है?",
    option:["मुक्ति की",
            "भगवत्-प्राप्ति की",
            "ब्रजभूमि निवास की",
            "स्वर्ग-प्राप्ति की"],
    answer:"ब्रजभूमि निवास की"
},

{
    question: "रसखान ने श्रीकृष्ण का लीलागान किसमें किया है?",
    option:["सवैयों में",
            "सोरठों में",
            "पदों में",
            "इन सभी में"],
    answer:"सवैयों में"
},

{
    question: "हजारी प्रसाद द्विवेदी की मृत्यु कब और कहाँ हुई?",
    option:["1979, दिल्ली",
            "1984, अजमेर",
            "1989, उत्तर प्रदेश",
            "1994, कानपुर"],
    answer:"1979, दिल्ली"
},

{
    question: "मंगम्मा ने कथावाचक को मर्दों को बस में रखने के कितने ‘गुर’ बताए थे?",
    option:["एक-दो",
            "तीन-चार",
            "पाँच",
            "दस"],
    answer:"तीन-चार"
},

{
    question: "‘स्वेच्छा सेवक दल‘ का गठन किसने किया?",

    option:["गुणनिधि ने",
            "लक्ष्मी ने",
            "सरपंच ने",
            "केशव ने"],

    answer:"गुणनिधि ने"
},

{
    question: "किसे सिंहासन खाली करने की बात कही गई है?",
    option:["राजतंत्र को",
            "सामंतवाद को",
            "(A) और (B) दोनों",
            "इनमें से कोई नहीं"],
    answer:"(A) और (B) दोनों"
},

{
    question: "कुँवर नारायण कैसे कवि हैं?",
    option:["रहस्यवादी",
            "छायावादी",
            "हालावादी",
            "संवेदनशील"],
    answer:"संवेदनशील"
},

{
    question: "‘झगड़ा-फसाद’ कौन-सा समास है?",
    option:["द्विगु",
            "अव्ययीभाव",
            "द्वन्द्व",
            "तत्पुरुष"],
    answer:"द्वन्द्व"
},

{
question: "कठ और केन’ आदि उपनिषदों का अनुवाद मैक्समूलर ने किस भाषा में किया?",
option:["अंग्रेजी",
        "उर्दू",
        "जापानी",
        "जर्मन"],
answer:"जर्मन"
},

{
    question: "गांधीजी के अनुसार शिक्षा सहायक होती है :",

    option:["शरीर के विकास में",
            "बुद्धि के विकास में",
            "शरीर, बुद्धि और आत्मा के विकास में",
            "आत्मा के विकास में"],

    answer:"शरीर, बुद्धि और आत्मा के विकास में"
},

{
    question: "‘प्रेमघन’ जी अपना आदर्श किसे मानते थे?",
    option:["राजा हरिशचन्द्र",
            "रामविलास शर्मा",
            "भारतेन्दु हरिश्चंद्र",
            "अमरकांत"],
    answer:"भारतेन्दु हरिश्चंद्र"
},

{
    question: "इनमें किसका सम्पादन अशोक वाजपेयी ने किया?",
    option:["थोड़ी-सी जगह",
            "कविता का गल्प",
            "बहुरि अकेला",
            "पहचान"],
    answer:"पहचान"
},

{
    question: "नानकदेव ने जगत् का सार किसे कहा है?",
    option:["धनार्जन",
            "सांसारिक सुख",
            "पूजा-पाठ",
            "भगवत् नाम के बिना"],
    answer:"पूजा-पाठ"
},

{
    question: "पंतजी का अंतिम काव्य था",
    option:["लोकायतन",
            "पल्लव",
            "वीणा",
            "युगपथ"],
    answer:"लोकायतन"
},

{
    question: "सुमित्रानंदन पंत किस युग के कवि हैं?",
    option:["द्विवेदी युग के",
            "भारतेन्दु युग के",
            "छायावाद युग के",
            "इनमें से कोई नहीं"],
    answer:"छायावाद युग के"
},

{
    question: "‘नागरी लिपि’ शीर्षक निबंध के निबंधकार हैं",
    option:["गुणाकर मूले",
            "रामचन्द्र शुक्ल",
            "डॉ० भोलानाथ तिवारी",
            "बाबूराम सक्सेना"],
    answer:"गुणाकर मूले"
},

{
    question: "‘अमरकांत’ ने सतीशचंद्र कॉलेज बलिया से इंटरमीडिएट कब किया?",
    option:["1945",
            "1946",
            "1846",
            "1845"],
    answer:"1946"
},

{
    question: "‘उर्वशी’ किसकी कृति है?",
    option:["निराला की",
            "दिनकर की",
            "महादेवी वर्मा की",
            "सुमित्रानंदन पंत की"],
    answer:"दिनकर की"
},

{
    question: "‘बी० आर० नारायण’ ने किस कहानी का अनुवाद किया है?",
    option:["ढहते विश्वास",
            "दही वाली मंगम्मा",
            "नगर",
            "माँ"],
    answer:"दही वाली मंगम्मा"
},

{
    question: "‘अक्षरों की कहानी’ किनकी रचना है?",
    option:["अनामिका की",
            "गुणाकर मूले की",
            "हजारी प्रसाद द्विवेदी की",
            "इनमें से कोई नहीं"],
    answer:"गुणाकर मूले की"
},

{
    question: "‘बारी’ किसे कहते हैं?",
    option:["रोज आकर दही देना और महीने के बाद पैसे लेने को",
            "एक दिन दही देना और अगले दिन पैसे लेना",
            "हर हफ्ते दही बेचना",
            "महीने में एक बार दही बेचना"],
    answer:"रोज आकर दही देना और महीने के बाद पैसे लेने को"
},

{
question: "भारतीय संविधान का निर्माता के रूप में हम किन्हें जानते हैं?",
option:["महात्मा गाँधी",
        "भीमराव अम्बेदकर",
        "पंडित जवाहरलाल नेहरू",
        "सुभाषचन्द्र बोस"],
answer:"भीमराव अम्बेदकर"
},

{
    question: "किस लेखक के कथा साहित्य में उड़ीसा का जीवन गहरी आंतरिकता के साथ प्रकट हुआ है?",

    option:["सातकोड़ी होता",
            "श्रीनिवास",
            "सुजाता",
            "ईश्वर पेटलीकर"],

    answer:"सातकोड़ी होता"
},

{
    question: "सिख धर्म के प्रवर्तक थे",
    option:["बंदा वैरागी",
            "गुरुनानक",
            "अर्जुनदेव",
            "गुरुगोविंद सिंह"],
    answer:"गुरुनानक"
},

{
question: "मैक्समूलर का जन्म कब हुआ?",
option:["6 सितम्बर, 1823",
        "6 अक्टूबर, 1823",
        "6 नवम्बर, 1823",
        "6 दिसम्बर, 1823"],
answer:"6 दिसम्बर, 1823"
},

{
    question: "कवि जीवनानंद दास ने लौटकर आऊँगा फिर में किसके गंदे पानी का जिक्र किया है?",
    option:["गंगा",
            "सोन",
            "रूपसा",
            "कोसी"],
    answer:"रूपसा"
},

{
    question: "रेनर मारिया रिल्के का जन्म कहाँ हुआ था?",

    option:["जर्मनी में प्राग",
            "आस्ट्रेलिया",
            "जापान",
            "जर्मनी में डेसाउ"],

    answer:"जर्मनी में प्राग"
},

{
    question: "‘मदुरै’ को अंग्रेज किस नाम से पुकारते थे?",

    option:["मेढ़क",
            "मिंडारा",
            "मदुरा",
            "मदौरा"],

    answer:"मदुरा"
},

{
    question: "साहित्य की परम्परा का मूल्यांकन करते हुए सबसे पहले हम किस साहित्य का मूल्य निर्धारित करते हैं?",
    option:["जो श्रमिक जनता के हितों को प्रतिबिम्बित करता है",
            "जो पूँजीपतियों के हितों को प्रतिबिम्बित करता है।",
            "जो श्रम-विभाजन को बढ़ावा देता है।",
            "जो जातिवाद का पोषक है।"],
    answer:"जो श्रमिक जनता के हितों को प्रतिबिम्बित करता है"
},

{
    question: "वल्लि अम्माल से कहाँ के डॉक्टर ने पाप्पाति को लेकर मदुरै जाने को कहा था?",

    option:["शहर के",
            "गाँव के",
            "पड़ोस के",
            "मैसूर के"],

    answer:"गाँव के"
},

{
question: "कहानी में खोखा का स्वभाव कैसा है?",
option:["निरीह और अनुकम्पाशील",
        "अवज्ञाकारी और झूठा",
        "पालन-पोषण से मुक्त",
        "स्वतंत्र और उदार"],
answer:"निरीह और अनुकम्पाशील"
},

{
    question: "‘तरु-तल-निवासिनी’ के माध्यम से कवि ने भारत के निवासियों का कैसा चित्रण किया है?",
    option:["दीनता का",
            "धर्मात्मा का",
            "कटुता का",
            "इनमें से कोई नहीं"],
    answer:"दीनता का"
},

{
question: "मदन के पिता को नौकरी से क्यों निकाला गया?",
option:["चोरी के कारण",
        "सेन साहब के आदेश पर",
        "गिरधर की शिकायत से",
        "गलती से"],
answer:"सेन साहब के आदेश पर"
},

{
    question: "यतीन्द्र मिश्र का जन्म कहाँ हुआ?",
    option:["अयोध्या, उत्तर प्रदेश",
            "इलाहाबाद, उत्तर प्रदेश",
            "डुमराँव, बिहार",
            "भागलपुर, बिहार"],
    answer:"अयोध्या, उत्तर प्रदेश"
},

{
    question: "‘ढहते विश्वास‘ शीर्षक कहानी में, तूफान में किसका घर टूट गया था?",

    option:["गुणनिधि का",
            "सरपंच का",
            "तहसीलदार का",
            "लक्ष्मी का"],

    answer:"लक्ष्मी का"
},

{
    question: "परहित के लिए देह धारण कौन करता है?",
    option:["राजा",
            "साधु",
            "बादल",
            "पशु"],
    answer:"बादल"
},

{
    question: "मनुष्य को नाखून की जरूरत कब थी?",
    option:["जंगली जीवन में",
            "शिक्षित जीवन में",
            "अशिक्षित जीवन में",
            "अविकसित जीवन में"],
    answer:"जंगली जीवन में"
},

{
    question: "जीवनानंद दास हैं",
    option:["कथाकार",
            "नाट्यकार",
            "उपन्यासकार",
            "साहित्यकार"],
    answer:"साहित्यकार"
},

{
    question: "बचाना है ‘नदियों को’",
    option:["तालाब हो जाने से",
            "कुआँ हो जाने से",
            "नाला हो जाने से",
            "समुद्र हो जाने से"],
    answer:"नाला हो जाने से"
},

{
    question: "‘पृथ्वीराज रासो’ किनका सम्पादन है?",
    option:["हजारी प्रसाद द्विवेदी का",
            "मैक्समूलर का",
            "सुमित्रानन्दन पंत का",
            "नलिन विलोचन शर्मा का"],
    answer:"हजारी प्रसाद द्विवेदी का"
},

{
    question: "कवि किसके आमंत्रण पर आने की बात कहता है?",
    option:["खेत और खलिहानों के",
            "मजदूर और किसानों के",
            "नदियों और मैदानों के",
            "पिता और पुत्र के"],
    answer:"नदियों और मैदानों के"
},

{
    question: "पंत ने 1916 में किस शीर्षक से कविता लिखी?",
    option:["गिरजे का घंटा",
            "मंदिर की घंटी",
            "दरगाह की चादर",
            "इनमें कोई नहीं"],
    answer:"गिरजे का घंटा"
},

{
    question: "‘ग्राम्या’ काव्य-संकलन की कविताओं पर किसका प्रभाव है?",
    option:["यथार्थवाद का",
            "अरविन्द का",
            "गाँधी का",
            "अध्यात्मवाद का"],
    answer:"यथार्थवाद का"
},

{
question: "‘द कास्ट्स इन इंडिया : वेयर मैकेनिज्म’ किनकी रचना है?",
option:["भीमराव अम्बेदकर की",
        "राममनोहर लोहिया की",
        "महात्मा गाँधी की",
        "इनमें से कोई नहीं"],
answer:"भीमराव अम्बेदकर की"
},

{
    question: "‘रसखान’ को किसने दीक्षा दी?",
    option:["वल्लभाचार्य",
            "गोकुलनाथ",
            "गोस्वामी विट्ठलनाथ",
            "गोरखनाथ"],
    answer:"गोस्वामी विट्ठलनाथ"
},

{
    question: "दिनकर ने ‘जनतंत्र का जन्म’ शीर्षक कविता में ‘दुधमुंही’ शब्द का प्रयोग किसके लिए किया है?",
    option:["अपनी बेटी के लिए",
            "समाज की किसी बालिका के लिए",
            "जनता के लिए",
            "पड़ोस की बच्ची के लिए"],
    answer:"जनता के लिए"
},

{
    question: "बहादुर की माँ स्वभावतः कैसी थी?",
    option:["शांत",
            "गुस्सैल",
            "स्नेही",
            "मिलनसार"],
    answer:"गुस्सैल"
},

{
    question: "‘अविच्छिन्न’ का शाब्दिक अर्थ है-",
    option:["खण्डित",
            "अटूट",
            "प्रवाहित",
            "ठहराव"],
    answer:"अटूट"
},

{
    question: "रामधारी सिंह ‘दिनकर’ किस गाँव के निवासी थे?",
    option:["मोकामा",
            "बक्सर",
            "मुजफ्फरपुर",
            "सिमरिया"],
    answer:"सिमरिया"
},

{
    question: "‘दुष्चक्र में स्रष्टा’ पुस्तक पर वीरेन डंगवाल को कौन-सा पुरस्कार प्राप्त हुआ?",
    option:["ज्ञानपीठ",
            "सोवियत लैंड नेहरू पुरस्कार",
            "साहित्य अकादमी",
            "नोबेल पुरस्कार"],
    answer:"साहित्य अकादमी"
},

{
    question: "गुरुनानक की रचनाओं का संग्रह किस वर्ष किया गया?",
    option:["1603 ई. में",
            "1604 ई. में",
            "1605 ई. में",
            "1606 ई. में"],
    answer:"1604 ई. में"
},

{
    question: "‘स्वदेशी’ किस कवि की रचना है?",
    option:["घनानंद",
            "सुमित्रानंदन पंत",
            "रामधारी सिंह ‘दिनकर’",
            "प्रेमधन"],
    answer:"प्रेमधन"
},

{
    question: "आधुनिक काल के साहित्यकार हैं",
    option:["रसखान",
            "रैदास",
            "विट्ठलनाथ",
            "भारतेन्दु हरिश्चन्द्र"],
    answer:"भारतेन्दु हरिश्चन्द्र"
},

{
    question: "‘दिनकरजी’ का निधन कब हुआ था?",
    option:["21 जनवरी 1971",
            "22 फरवरी 1972",
            "23 मार्च 1973",
            "24 अप्रैल 1974"],
    answer:"24 अप्रैल 1974"
},

{
    question: "धनानंद कैसे कवि थे?",
    option:["प्रेम के पीर",
            "दया के",
            "दुःख के पीर",
            "मानवता के"],
    answer:"प्रेम के पीर"
},

{
    question: "अमरकांत ने बी०ए० कब किया?",
    option:["1950 ई.",
            "1947 ई.",
            "1946 ई.",
            "1945 ई."],
    answer:"1947 ई."
},

{
    question: "रिल्के ने कहाँ के साहित्य को संवेदनात्मक भाषा से प्रभावित किया है?",

    option:["यूरोप",
            "एशिया",
            "अफ्रीका",
            "आस्ट्रेलिया"],

    answer:"यूरोप"
},

{
    question: "गुरुनानक की रचना है।",
    option:["सोहिला",
            "जपुजी",
            "आसादीवार",
            "इनमें सभी"],
    answer:"इनमें सभी"
},

{
    question: "‘मित्र-मिलन’ के रचनाकार हैं",
    option:["गुणाकर मूले",
            "महात्मा गाँधी",
            "यतीन्द्र मिश्र",
            "अमरकांत"],
    answer:"अमरकांत"
},

{
question: "कहानी में मदन का क्या वर्णन किया गया है?",
option:["स्वाभिमानी और शांतिप्रिय",
        "अहंकारी और समस्या पैदा करने वाला",
        "स्वाभिमान और विरोधी",
        "घृणित"],
answer:"स्वाभिमान और विरोधी"
},

{
    question: "‘अरे कहावत है, ‘दवा करने से तो मशान ही जगता है।’- यह कथन है।",
    option:["मंगम्मा का",
            "माँ जी का",
            "नंजम्मा का",
            "रंगप्पा का"],
    answer:"मंगम्मा का"
},

{
    question: "गुणकर मूले ने किस लिपि को प्राचीन नागरी लिपि की बहन की संज्ञा दी है?",
    option:["गुजराती",
            "बँगला",
            "तमिल",
            "मलयालम"],
    answer:"बँगला"
},

{
    question: "गरीब बस्तियों में क्या हुआ?",
    option:["कई शिशु पैदा हुए",
            "दंगे, आगजनी और बमबारी",
            "धमाके से देवी जागरण",
            "इनमें से कोई नहीं"],
    answer:"धमाके से देवी जागरण"
},

{
    question: "कवि किसके स्वादहीन होने की बात करता है?",

    option:["फल",
            "दूध",
            "मिठाई",
            "मदिरा"],

    answer:"मदिरा"
},

{
    question: "अज्ञेय का मूल निवास कहाँ पर था?",
    option:["पंजाब",
            "हरियाणा",
            "राजस्थान",
            "दिल्ली"],
    answer:"पंजाब"
},

{
    question: "महात्मा गाँधी के पिता का क्या नाम था ?",

    option:["भरमचंद गाँधी",
            "भोरचंद गाँधी",
            "हरचंद गाँधी",
            "करमचंद गांधी"],

    answer:"करमचंद गांधी"
},

{
question: "डॉ. भीमराव अम्बेदकर के पिता का क्या नाम था?",
option:["रामदेव सकपाल",
        "रामजी सकपाल",
        "रामकिशुन सकपाल",
        "राधेराम सकपाल"],
answer:"रामजी सकपाल"
},

{
    question: "पीटर बुक की कौन-सी विवादास्पद रचना की प्रस्तुति आविन्यों में किया जानेवाला था?",
    option:["रामायण",
            "महाभारत",
            "गीता",
            "पुराण"],
    answer:"महाभारत"
},

{
question: "“बाबा साहेब अम्बेडकर संपूर्ण वाड्मय” नाम की पुस्तक कितने खण्डों में प्रकाशित हो गई है?",
option:["22",
        "48",
        "21",
        "20"],
answer:"21"
},

{
    question: "जीवनानंद दास के निधनोपरांत लगभग कितनी कहानियाँ प्रकाशित हुईं?",
    option:["एक सौ",
            "पचास",
            "पचहत्तर",
            "पच्चीस"],
    answer:"एक सौ"
},

{
    question: "कितने वर्ष की आयु में वह नवाब के यहाँ नाचने जाते थे?",
    option:["5 वर्ष",
            "6 वर्ष",
            "4 वर्ष",
            "7 वर्ष"],
    answer:"6 वर्ष"
},

{
    question: "अनामिका किस काल की कवयित्री हैं?",
    option:["रीतिकाल",
            "भक्तिकाल",
            "समकालीन",
            "आदिकाल"],
    answer:"समकालीन"
},

{
    question: "‘दूर-चट्टानों की ठंडी गोद में’ किस कवि की पंक्ति है?",

    option:["जीवनानंद दास",
            "अनामिका",
            "सुमित्रानंदन पंत",
            "रेनर मारिया रिल्के"],

    answer:"रेनर मारिया रिल्के"
},

];

// --- Helper: Shuffle and get random questions ---
const getRandomQuestions = (count) => {
  const shuffled = [...hindiQuestions].sort(() => Math.random() - 0.5);
  return shuffled.slice(0, count);
};

// --- Build the complete question paper (100 questions) ---
const buildQuestionPaper = () => {
  return getRandomQuestions(100);
};

// --- Component ---
export default function BSEBClass10HindiMockTest() {
  const [started, setStarted] = useState(false);
  const [submitted, setSubmitted] = useState(false);
  const [timer, setTimer] = useState(3600); // 1 hour = 3600 seconds
  const [questions] = useState(buildQuestionPaper);
  const [current, setCurrent] = useState(0);
  const [answers, setAnswers] = useState({});
  const [score, setScore] = useState(0);
  const [resultDetails, setResultDetails] = useState([]);
  const [showTimerWarning, setShowTimerWarning] = useState(false);

  useEffect(() => {
    if (started && !submitted && timer > 0) {
      const t = setInterval(() => {
        setTimer((p) => {
          if (p <= 60) setShowTimerWarning(true);
          return p - 1;
        });
      }, 1000);
      return () => clearInterval(t);
    }
    if (timer === 0 && started && !submitted) {
      submitExam();
    }
  }, [started, submitted, timer]);

  const startExam = () => {
    setStarted(true);
  };

  const submitExam = () => {
    let s = 0;
    const details = questions.map((q, i) => {
      const isCorrect = answers[i] === q.answer;
      if (isCorrect) s++;
      return {
        question: q.question,
        option: q.option,
        correctAnswer: q.answer,
        userAnswer: answers[i] || "Not Attempted",
        isCorrect: isCorrect,
      };
    });
    setScore(s);
    setResultDetails(details);
    setSubmitted(true);
  };

  // Home Page - Mobile Optimized
  if (!started) {
    return (
      <div style={{
        minHeight: "100vh",
        display: "flex",
        justifyContent: "center",
        alignItems: "center",
        background: "linear-gradient(135deg, #4a148c 0%, #6a1b9a 50%, #8e24aa 100%)",
        fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif",
        padding: "20px"
      }}>
        <div style={{
          backgroundColor: "white",
          padding: "25px 20px",
          borderRadius: "16px",
          boxShadow: "0 20px 60px rgba(0,0,0,0.6)",
          textAlign: "center",
          maxWidth: "500px",
          width: "100%"
        }}>
          <div style={{ fontSize: "48px", marginBottom: "5px" }}>📖</div>
          <h1 style={{ 
            color: "#4a148c", 
            marginBottom: "3px", 
            fontSize: "22px",
            fontWeight: "700"
          }}>
            हिंदी मॉक टेस्ट
          </h1>
          <p style={{ color: "#666", fontSize: "12px", marginBottom: "15px" }}>
            बिहार विद्यालय परीक्षा समिति - कक्षा 10
          </p>
          <div style={{
            height: "3px",
            background: "linear-gradient(90deg, #4a148c, #8e24aa)",
            margin: "10px auto",
            width: "60px"
          }}></div>
          
          <div style={{
            display: "grid",
            gridTemplateColumns: "1fr 1fr",
            gap: "10px",
            marginTop: "15px"
          }}>
            <div style={{ 
              backgroundColor: "#f3e5f5", 
              padding: "12px", 
              borderRadius: "10px"
            }}>
              <div style={{ fontSize: "11px", color: "#666" }}>📝 Questions</div>
              <div style={{ fontSize: "22px", fontWeight: "bold", color: "#4a148c" }}>100</div>
            </div>
            <div style={{ 
              backgroundColor: "#f3e5f5", 
              padding: "12px", 
              borderRadius: "10px"
            }}>
              <div style={{ fontSize: "11px", color: "#666" }}>⏱️Time</div>
              <div style={{ fontSize: "22px", fontWeight: "bold", color: "#4a148c" }}>60 min</div>
            </div>
          </div>

          <div style={{
            backgroundColor: "#fff3e0",
            padding: "12px",
            borderRadius: "10px",
            marginTop: "15px",
            fontSize: "12px",
            color: "#e65100",
            textAlign: "left"
          }}>
            <strong>📋 निर्देश:</strong>
            <ul style={{ margin: "5px 0 0 0", paddingLeft: "18px" }}>
              <li>सभी प्रश्न अनिवार्य हैं</li>
              <li>प्रत्येक प्रश्न <strong>1 अंक</strong> का है</li>
              <li><strong>कोई नकारात्मक अंकन नहीं</strong></li>
              <li>समय समाप्त होने से पहले जमा करें</li>
            </ul>
          </div>

          <button
            onClick={startExam}
            style={{
              padding: "14px 40px",
              fontSize: "18px",
              fontWeight: "bold",
              background: "linear-gradient(135deg, #4a148c 0%, #8e24aa 100%)",
              color: "white",
              border: "none",
              borderRadius: "50px",
              cursor: "pointer",
              marginTop: "20px",
              width: "100%",
              transition: "transform 0.3s, box-shadow 0.3s",
              boxShadow: "0 4px 15px rgba(142, 36, 170, 0.4)"
            }}
          >
            🚀 Start
          </button>
        </div>
      </div>
    );
  }

  // Result Page - Mobile Optimized
  if (submitted) {
    const percentage = ((score / questions.length) * 100).toFixed(2);
    const isPassed = percentage >= 33;

    return (
      <div style={{
        minHeight: "100vh",
        background: "#f5f7fa",
        padding: "15px",
        fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif"
      }}>
        <div style={{
          maxWidth: "900px",
          margin: "0 auto"
        }}>
          {/* Result Card */}
          <div style={{
            backgroundColor: "white",
            borderRadius: "16px",
            padding: "25px 20px",
            boxShadow: "0 10px 40px rgba(0,0,0,0.1)",
            textAlign: "center",
            marginBottom: "20px"
          }}>
            <h1 style={{ 
              fontSize: "24px", 
              marginBottom: "5px",
              color: "#2d3748"
            }}>
              {isPassed ? "🎉 अभिनन्दन!" : "📖 अभ्यास जारी रखें!"}
            </h1>
            <p style={{ color: "#888", fontSize: "12px" }}>हिंदी मॉक टेस्ट - कक्षा 10</p>
            <div style={{
              width: "80px",
              height: "80px",
              borderRadius: "50%",
              background: isPassed ? "#d4edda" : "#f8d7da",
              display: "flex",
              alignItems: "center",
              justifyContent: "center",
              margin: "15px auto",
              fontSize: "32px"
            }}>
              {isPassed ? "✅" : "📝"}
            </div>
            <div style={{ fontSize: "40px", fontWeight: "bold", color: "#4a148c" }}>
              {score} <span style={{ fontSize: "20px", color: "#888" }}>/ {questions.length}</span>
            </div>
            <div style={{ 
              fontSize: "18px", 
              color: isPassed ? "#28a745" : "#dc3545", 
              marginTop: "5px",
              fontWeight: "600"
            }}>
              {percentage}% {isPassed ? "✔️ उत्तीर्ण" : "❌ सुधार की आवश्यकता"}
            </div>
            {isPassed && (
              <div style={{
                marginTop: "10px",
                padding: "8px",
                backgroundColor: "#d4edda",
                borderRadius: "8px",
                color: "#155724",
                fontSize: "13px"
              }}>
                🎯 आपने मॉक टेस्ट उत्तीर्ण किया!
              </div>
            )}
          </div>

          {/* Answer Review */}
          <div style={{
            backgroundColor: "white",
            borderRadius: "16px",
            padding: "20px 15px",
            boxShadow: "0 10px 40px rgba(0,0,0,0.1)"
          }}>
            <h2 style={{ 
              borderBottom: "2px solid #eee", 
              paddingBottom: "12px", 
              marginBottom: "15px",
              fontSize: "18px",
              color: "#2d3748"
            }}>
              📋 उत्तर समीक्षा
            </h2>
            {resultDetails.map((item, index) => (
              <div
                key={index}
                style={{
                  backgroundColor: item.isCorrect ? "#f0fff4" : "#fff5f5",
                  borderLeft: `4px solid ${item.isCorrect ? "#48bb78" : "#fc8181"}`,
                  padding: "12px 15px",
                  marginBottom: "12px",
                  borderRadius: "8px"
                }}
              >
                <div style={{ display: "flex", justifyContent: "space-between", alignItems: "flex-start" }}>
                  <h4 style={{ 
                    margin: "0", 
                    fontSize: "14px", 
                    color: "#2d3748",
                    flex: 1,
                    marginRight: "10px"
                  }}>
                    प्रश्न {index + 1}. {item.question}
                  </h4>
                  <span style={{ fontSize: "18px", flexShrink: 0 }}>
                    {item.isCorrect ? "✅" : "❌"}
                  </span>
                </div>
                <div style={{ marginTop: "8px", marginLeft: "5px", fontSize: "13px" }}>
                  <p style={{ margin: "3px 0" }}>
                    <strong>आपका उत्तर:</strong>{" "}
                    <span style={{ color: item.isCorrect ? "#48bb78" : "#fc8181" }}>
                      {item.userAnswer}
                    </span>
                  </p>
                  {!item.isCorrect && (
                    <p style={{ margin: "3px 0" }}>
                      <strong>सही उत्तर:</strong>{" "}
                      <span style={{ color: "#48bb78" }}>{item.correctAnswer}</span>
                    </p>
                  )}
                </div>
              </div>
            ))}
          </div>

          <div style={{ textAlign: "center", marginTop: "20px" }}>
            <button
              onClick={() => {
                setStarted(false);
                setSubmitted(false);
                setAnswers({});
                setResultDetails([]);
                setTimer(3600);
                setShowTimerWarning(false);
                window.location.reload();
              }}
              style={{
                padding: "14px 35px",
                fontSize: "16px",
                fontWeight: "bold",
                background: "linear-gradient(135deg, #4a148c 0%, #8e24aa 100%)",
                color: "white",
                border: "none",
                borderRadius: "50px",
                cursor: "pointer",
                width: "100%",
                maxWidth: "300px",
                boxShadow: "0 4px 15px rgba(142, 36, 170, 0.4)"
              }}
            >
              🔄 नया मॉक टेस्ट लें
            </button>
          </div>
        </div>
      </div>
    );
  }

  // Exam Page - Mobile Optimized
  const q = questions[current];
  const answeredCount = Object.keys(answers).length;

  return (
    <div style={{
      minHeight: "100vh",
      background: "#f5f7fa",
      padding: "10px",
      fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif"
    }}>
      <div style={{
        maxWidth: "800px",
        margin: "0 auto"
      }}>
        {/* Header - Mobile Optimized */}
        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "10px 14px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginBottom: "10px",
          display: "flex",
          justifyContent: "space-between",
          alignItems: "center"
        }}>
          <div style={{ flex: 1 }}>
            <p style={{ 
              margin: "0", 
              fontSize: "11px", 
              color: "#718096"
            }}>
              प्रश्न {current + 1}/{questions.length}
            </p>
            <p style={{ 
              margin: "2px 0 0", 
              fontSize: "10px", 
              color: "#a0aec0"
            }}>
              उत्तर दिए: {answeredCount}/{questions.length}
            </p>
          </div>
          <div style={{
            fontSize: "20px",
            fontWeight: "bold",
            color: timer < 60 ? "#fc8181" : "#4a148c",
            display: "flex",
            alignItems: "center",
            gap: "6px"
          }}>
            <span style={{ fontSize: "16px" }}>⏱️</span>
            <span>{Math.floor(timer / 60)}:{String(timer % 60).padStart(2, "0")}</span>
          </div>
        </div>

        {/* Question Card */}
        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "16px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginBottom: "10px"
        }}>
          <div style={{
            display: "inline-block",
            backgroundColor: "#f3e5f5",
            padding: "2px 10px",
            borderRadius: "12px",
            fontSize: "11px",
            color: "#4a148c",
            marginBottom: "12px"
          }}>
            📌 प्रश्न {current + 1}
          </div>
          <h3 style={{
            fontSize: "16px",
            color: "#4a148c",
            marginBottom: "16px",
            fontWeight: "600",
            lineHeight: "1.5",
            fontFamily: "'Noto Sans Devanagari', 'Segoe UI', sans-serif"
          }}>
            {q.question}
          </h3>

          <div style={{ marginTop: "5px" }}>
            {q.option.map((op, idx) => (
              <div
                key={idx}
                style={{
                  padding: "10px 12px",
                  margin: "5px 0",
                  backgroundColor: answers[current] === op ? "#f3e5f5" : "#f7fafc",
                  border: answers[current] === op ? "2px solid #4a148c" : "2px solid transparent",
                  borderRadius: "8px",
                  cursor: "pointer",
                  transition: "all 0.2s",
                  display: "flex",
                  alignItems: "center"
                }}
                onClick={() => setAnswers({ ...answers, [current]: op })}
              >
                <input
                  type="radio"
                  id={`q${current}-opt${idx}`}
                  name={`question-${current}`}
                  checked={answers[current] === op}
                  onChange={() => {}}
                  style={{ marginRight: "10px", width: "16px", height: "16px", flexShrink: 0 }}
                />
                <label
                  htmlFor={`q${current}-opt${idx}`}
                  style={{
                    fontSize: "14px",
                    cursor: "pointer",
                    flex: 1,
                    margin: "0",
                    color: "#2d3748",
                    fontFamily: "'Noto Sans Devanagari', 'Segoe UI', sans-serif"
                  }}
                >
                  {op}
                </label>
              </div>
            ))}
          </div>
        </div>

        {/* Navigation */}
        <div style={{
          display: "flex",
          gap: "8px",
          flexWrap: "wrap",
          justifyContent: "space-between"
        }}>
          <div style={{ display: "flex", gap: "8px" }}>
            <button
              onClick={() => setCurrent(Math.max(0, current - 1))}
              disabled={current === 0}
              style={{
                padding: "8px 14px",
                fontSize: "13px",
                backgroundColor: current === 0 ? "#e2e8f0" : "#4a148c",
                color: current === 0 ? "#a0aec0" : "white",
                border: "none",
                borderRadius: "8px",
                cursor: current === 0 ? "not-allowed" : "pointer",
                fontWeight: "600",
                transition: "all 0.2s"
              }}
            >
              ⬅Previous
            </button>
            <button
              onClick={() => setCurrent(Math.min(questions.length - 1, current + 1))}
              disabled={current === questions.length - 1}
              style={{
                padding: "8px 14px",
                fontSize: "13px",
                backgroundColor: current === questions.length - 1 ? "#e2e8f0" : "#4a148c",
                color: current === questions.length - 1 ? "#a0aec0" : "white",
                border: "none",
                borderRadius: "8px",
                cursor: current === questions.length - 1 ? "not-allowed" : "pointer",
                fontWeight: "600",
                transition: "all 0.2s"
              }}
            >
              Next ➡
            </button>
          </div>

          <button
            onClick={submitExam}
            style={{
              padding: "8px 18px",
              fontSize: "13px",
              backgroundColor: "#f57c00",
              color: "white",
              border: "none",
              borderRadius: "8px",
              cursor: "pointer",
              fontWeight: "600",
              transition: "all 0.2s",
              boxShadow: "0 2px 8px rgba(245, 124, 0, 0.3)"
            }}
          >
            📤 Submit
          </button>
        </div>

        {/* Question Navigator */}
        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "12px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginTop: "10px"
        }}>
          <p style={{ 
            margin: "0 0 8px 0", 
            color: "#718096", 
            fontSize: "11px", 
            fontWeight: "600" 
          }}>
            प्रश्न नेविगेटर - {answeredCount}/{questions.length} उत्तर दिए
          </p>
          <div style={{
            display: "flex",
            flexWrap: "wrap",
            gap: "5px"
          }}>
            {questions.map((_, idx) => (
              <button
                key={idx}
                onClick={() => setCurrent(idx)}
                style={{
                  width: "32px",
                  height: "32px",
                  fontSize: "11px",
                  backgroundColor: answers[idx] ? "#48bb78" : 
                                   current === idx ? "#4a148c" : "#e2e8f0",
                  color: answers[idx] ? "white" :
                         current === idx ? "white" : "#4a5568",
                  border: current === idx ? "2px solid #4a148c" : "none",
                  borderRadius: "6px",
                  cursor: "pointer",
                  fontWeight: "bold",
                  transition: "all 0.2s"
                }}
              >
                {idx + 1}
              </button>
            ))}
          </div>
          <div style={{
            display: "flex",
            gap: "12px",
            marginTop: "8px",
            fontSize: "10px",
            color: "#4a5568",
            flexWrap: "wrap"
          }}>
            <span>🟢 उत्तर दिया</span>
            <span>🔵 वर्तमान</span>
            <span>⚪ उत्तर नहीं दिया</span>
          </div>
        </div>

        {/* Timer Warning */}
        {showTimerWarning && (
          <div style={{
            position: "fixed",
            bottom: "15px",
            right: "15px",
            left: "15px",
            backgroundColor: "#fc8181",
            color: "white",
            padding: "12px 18px",
            borderRadius: "10px",
            boxShadow: "0 4px 15px rgba(252, 129, 129, 0.4)",
            textAlign: "center",
            fontSize: "14px",
            fontWeight: "600",
            animation: "pulse 1.5s ease-in-out infinite",
            maxWidth: "400px",
            margin: "0 auto"
          }}>
            ⚠️ १ मिनट से कम समय शेष!
          </div>
        )}
      </div>
      <style>
        {`
          @keyframes pulse {
            0% { opacity: 1; }
            50% { opacity: 0.6; }
            100% { opacity: 1; }
          }
        `}
      </style>
    </div>
  );
}