// BSEBClass10MathMockTest.jsx
import React, { useState, useEffect } from "react";

// --- BSEB Class 10 Math Question Bank (100 questions) ---
const mathQuestions = [
  {
question: "किसी घटना की प्रायिकता नहीं होती है :",

option:["1",
        "0.1",
        "-7",
        "0.2"],

answer:"-7"
},

{
question: "sin²45° – cos²45° का मान है:",

option:["1",
        "0",
        "2",
        "√2"],

answer:"0"
},

{
    question: "अनुक्रम 5, 7, 9, 11, ….. का कौन-सा पद 27 है?",

    option:["13वाँ",
            "12वाँ",
            "11वाँ",
            "10वाँ"],

    answer:"12वाँ"
},

{
    question: "दो संख्याओं का LCM उनके HCF का 14 गुना है, LCM और HCF का योग 600 है, यदि एक संख्या 280 है तो दूसरी संख्या कितनी होगी?",
    option:["40",
            "80",
            "120",
            "20"],
    answer:"80"
},

{
    question: "निम्न में से कौन x + 2y = 0 तथा 3x + 4y = 10 का हल है?",
    option:["x = 2, y = 1",
            "x = 1, y = 1",
            "x = 2, y = 2",
            "x = 3, y = 1"],
    answer:"x = 2, y = 1"
},

{
question: "यदि बिंदुएँ (k, 2), (-3, -4) तथा (7, -5) संरेख हों, तो k =",
option:["-60","60","-63","63"],
answer:"-63"
},

{
question: "यदि 2sinθ = 1, तो (3cot²θ + 3) का मान होगा:",

option:["12",
        "15",
        "9",
        "8"],

answer:"15"
},

{
    question: "सबसे छोटी भाज्य संख्या और सबसे छोटी अभाज्य संख्या का HCF कितना होगा?",
    option:["0",
            "2",
            "4",
            "6"],
    answer:"2"
},

{
question: "44 मी परिधि वाले वृत्त की त्रिज्या होगी :",
option:["14 मी",
        "7 मी",
        "5 मी",
        "44 मी"],
answer:"7 मी"
},

{
    question: "निम्नलिखित में कौन समांतर श्रेणी में है?",

    option:["2, 4, 8, 16 …",
            "-10, -6, -2, 2 …",
            "3, 5, 4, 2 …",
            "√3, √6, √9/12 …"],

    answer:"-10, -6, -2, 2 …"
},

{
    question: "एक समबाहु त्रिभुज ABC की एक भुजा 12 cm हो, तो इसकी ऊँचाई होगी:",
    option:["6√2 cm",
            "6√3 cm",
            "3√6 cm",
            "6√6 cm"],
    answer:"6√3 cm"
},

{
question: "दो बिंदु P (2, -2) और Q (-2, 2) को मिलाने वाले रेखाखंड के मध्य बिंदु के निर्देशांक हैं:",
option:["(0, 1)","(1, 0)","(0, 0)","(0, 2)"],
answer:"(0, 0)"
},

{
    question: "यदि n एक प्राकृत संख्या है तब √n क्या है?",
    option:["परिमेय",
            "अपरिमेय",
            "कभी परिमेय संख्या और कभी अपरिमेय संख्या",
            "इनमें से कोई नहीं"],
    answer:"कभी परिमेय संख्या और कभी अपरिमेय संख्या"
},

{
question: "cot(90° – θ) बराबर है:",

option:["cosecθ",
        "tanθ",
        "secθ",
        "cosθ"],

answer:"tanθ"
},

{
question: "एक घनाभ के तीन संलग्न फलकों के क्षेत्रफल क्रमशः x², y² एवं z² हैं, तो उसका आयतन V बराबर होगा:",
option:["x²y²z²",
        "x² + y² + z²",
        "2xyz",
        "xyz"],
answer:"xyz"
},

{
    question: "द्विघात समीकरण ax² + bx – c = 0 के मूल वास्तविक और बराबर होने की शर्त क्या है?",
    option:["b² + 4ac = 0",
            "b² – 4ac = 0",
            "b² + 4ac = 1",
            "b² – 4ac < 0"],
    answer:"b² + 4ac = 0"
},

{
    question: "दो समकोणिक त्रिभुजों में उनकी संगत भुजाओं का अनुपात सदैव समान रहता है, किसने कहा?",
    option:["आर्यभट्ट",
            "यूक्लिड",
            "थेल्स",
            "पाइथागोरस"],
    answer:"थेल्स"
},

{
question: "sin²θ + cos²θ = ?",

option:["1",
        "2",
        "0",
        "-1"],

answer:"1"
},

{
    question: "96 का अभाज्य गुणनखंड ज्ञात करें:",
    option:["2⁵×3",
            "2¹⁶×3",
            "2⁴×3",
            "2⁶×3"],
    answer:"2⁵×3"
},

{
question: "ताश के 52 पत्तों की अच्छी तरह फेंटी गई गड्डी से एक पत्ता निकाला जाता है, तो एक तस्वीर वाला पत्ता प्राप्त होने की क्या प्रायिकता है ?",

option:["3/13",
        "3/26",
        "1/26",
        "4/13"],

answer:"3/13"
},

{
question: "किसी वृत्ताकार क्षेत्र की परिधि 4π मीटर है तो उसकी त्रिज्या होगी :",
option:["1 मीटर",
        "2 मीटर",
        "π मीटर",
        "इनमें से कोई नहीं"],
answer:"2 मीटर"
},

{
question: "एक घन का किनारा 10 सेमी है, तो उसका कुल पृष्ठीय क्षेत्रफल है:",
option:["200 वर्ग सेमी",
        "300 वर्ग सेमी",
        "400 वर्ग सेमी",
        "600 वर्ग सेमी"],
answer:"600 वर्ग सेमी"
},

{
    question: "दो समरूप त्रिभुजों की भुजाएँ 1 : 2 के अनुपात में हैं, तब इन त्रिभुजों के क्षेत्रफलों का अनुपात है:",
    option:["1 : 2",
            "2 : 1",
            "4 : 1",
            "1 : 4"],
    answer:"1 : 4"
},

{
question: "उस बिंदु के निर्देशांक जो बिंदु (1, 1) तथा (2, 3) को जोड़ने वाले रेखाखंड को 2 : 3 के अनुपात में विभाजित करता है:",
option:["(7/5, 9/5)","(7, 9)","(7/3, 3)","कोई नहीं"],
answer:"(7/5, 9/5)"
},

{
    question: "सबसे छोटी पूर्ण-वर्ग संख्या जो 16, 20 तथा 24 से पूर्णतः भाज्य हो, वह संख्या है?",
    option:["3600",
            "1200",
            "1600",
            "2400"],
    answer:"3600"
},

{
    question: "द्विघात बहुपद 4x² – 4x + 1 के मूलों का गुणनफल होगा।",
    option:["-1",
            "1",
            "1/4",
            "0"],
    answer:"1/4"
},

{
question: "प्रथम अमान्य संख्याओं का माध्यक है:",
option:["4",
        "5",
        "6",
        "7"],
answer:"6"
},

{
question: "निम्न में से कौन-सी संख्या किसी घटना की प्रायिकता नहीं हो सकती ?",

option:["2/3",
        "-15",
        "15%",
        "0.7%"],

answer:"-15"
},

{
question: "निम्नलिखित में से कौन-सा बिंदु तृतीय चतुर्थांश में स्थित है?",
option:["(4, 6)","(-4, -6)","(4, -6)","(-4, 6)"],
answer:"(-4, -6)"
},

{
question: "6 सेमी त्रिज्या वाले वृत्त के केन्द्र से 10 सेमी दूर स्थित एक बिन्दु से वृत्त पर खींची गई स्पर्श रेखा की लम्बाई होगी:",
option:["7 cm",
        "8 cm",
        "9 cm",
        "6 cm"],
answer:"8 cm"
},

{
    question: "65 तथा 117 का HCF 65m - 117 के रूप में है, तो m का मान क्या होगा?",
    option:["1",
            "2",
            "3",
            "4"],
    answer:"2"
},

{
question: "21 cm त्रिज्या वाले वृत्त के उस चाप की लंबाई क्या होगी जो वृत्त के केन्द्र पर 60° का कोण अंतरित करता है?",
option:["21 cm",
        "22 cm",
        "23 cm",
        "इनमें से कोई नहीं"],
answer:"22 cm"
},

{
question: "त्रिभुज का क्षेत्रफल वर्ग इकाई में, जिसके शीर्ष (-4, 0), (0, 3) तथा (0, 0) हैं, होगा:",
option:["36","12","6","1"],
answer:"6"
},

{
question: "1, 3, 0, 3, 1, 3 का बहुलक होगा :",
option:["0",
        "1",
        "2",
        "3"],
answer:"3"
},

{
    question: "समांतर श्रेणी 72, 63, 54 …….. का कौन-सा पद शून्य है?",

    option:["8वाँ",
            "9वाँ",
            "10वाँ",
            "11वाँ"],

    answer:"9वाँ"
},

{
question: "एक घन का सम्पूर्ण पृष्ठीय क्षेत्रफल 216 cm² है तो इसका आयतन है:",
option:["144 cm³",
        "196 cm³",
        "212 cm³",
        "216 cm³"],
answer:"216 cm³"
},

{
question: "किसी बिंदु की y-अक्ष से दूरी उस बिंदु का क्या कहलाती है?",
option:["y-निर्देशांक","x-निर्देशांक","कोटि","y-अक्ष"],
answer:"x-निर्देशांक"
},

{
    question: "निम्नलिखित में से कौन सी संख्या विजातीय है?",
    option:["√11",
            "2/3",
            "√25/√49",
            "7/3"],
    answer:"√11"
},

{
    question: "अगर 0.3x – 0.37 = 0.37x – 0.3 तो x का मान क्या होगा?",
    option:["-1",
            "-2",
            "+1",
            "+2"],
    answer:"-1"
},

{
question: "दी गई आकृति में BC वृत्त का व्यास है तथा AB = AC है। तब ∠ABC का मान है:",
option:["30°",
        "60°",
        "45°",
        "90°"],
answer:"45°"
},

{
    question: "यदि 2x + y = 2x – y = √8, तो y का मान है:",
    option:["1/2",
            "3/2",
            "0",
            "इनमें से कोई नहीं"],
    answer:"0"
},

{
question: "दो पासे एक साथ उछाले गए तो दोनों एक ही संख्या आने की प्रायिकता होगी:",

option:["1/2",
        "1/3",
        "1/6",
        "1/12"],

answer:"1/6"
},

{
question: "6 cm त्रिज्या वाले अर्धवृत्त की कुल परिमिति होगी :",
option:["(π + 1) 6 cm",
        "(π + 2) 6 cm",
        "(π + 3) 6 cm",
        "6π cm"],
answer:"(π + 2) 6 cm"
},

{
question: "tan60° का मान होगा:",

option:["√3",
        "1/√3",
        "2/√3",
        "1"],

answer:"√3"
},

{
question: "आँकड़ों को आरोही या अवरोही क्रम में रखने पर बीच वाले पद का मान कहलायेगा:",
option:["माध्य",
        "माध्यिका",
        "बहुलक",
        "कुछ नहीं"],
answer:"माध्यिका"
},

{
    question: "बहुपद 2 – x(x – 1) के शून्यकों का गुणनफल है:",
    option:["-2",
            "2",
            "7",
            "1"],
    answer:"-2"
},

{
    question: "0 और 50 के बीच विषम संख्याओं की संख्या कितनी है?",
    option:["26",
            "25",
            "27",
            "24"],
    answer:"25"
},

{
question: "यदि एक बिन्दु P से O केन्द्र वाले किसी वृत्त पर PA और PB स्पर्श रेखाएँ परस्पर 80° के कोण पर झुकी हों, तो ∠POA बराबर है:",
option:["50°",
        "60°",
        "70°",
        "80°"],
answer:"50°"
},

{
question: "tan45° का मान है:",

option:["0",
        "1",
        "2",
        "3"],

answer:"1"
},

{
question: "यदि किसी वृत्त की त्रिज्या K गुनी कर दी जाए तो पुराने और नए वृत्तों के क्षेत्रफलों का अनुपात निम्नलिखित में कौन-सा होगा?",
option:["1 : K",
        "1 : K³",
        "1 : K²",
        "K² : 1"],
answer:"1 : K²"
},

{
    question: "यदि 173x + 197y = 149 और 197x + 173y = 221 तो (x, y) होगा:",
    option:["(3, -2)",
            "(2, 1)",
            "(1, -2)",
            "(2, -1)"],
    answer:"(2, -1)"
},

{
    question: "A.P. 4, 10, 16, 22, 28…… का सार्व अंतर है?",

    option:["4",
            "6",
            "2",
            "8"],

    answer:"6"
},

{
question: "sec²θ – tan²θ का मान होगा:",

option:["1",
        "-1",
        "0",
        "कोई नहीं"],

answer:"1"
},

{
question: "x-अक्ष पर वह बिंदु जो A (-1, 0) और B (5, 0) से समान दूरी पर है, है:",
option:["(0, 2)","(2, 0)","(3, 0)","(0, 3)"],
answer:"(2, 0)"
},

{
    question: "दो समद्विबाहु त्रिभुज के कोण बराबर हैं तथा उनके क्षेत्रफलों का अनुपात 16 : 25 है। उनकी ऊँचाइयों का अनुपात क्रमशः है:",
    option:["4 : 5",
            "5 : 4",
            "3 : 2",
            "1 : 4"],
    answer:"4 : 5"
},

{
question: "9, 10, 11, 9, 10, 11, 11, 5, 6, 7, 11, 9 का बहुलक है:",
option:["9",
        "10",
        "11",
        "3"],
answer:"11"
},

{
    question: "यदि एक उदग्र खम्भे की छाया की लम्बाई खम्भे की लंबाई के √3 गुना है, तो सूर्य का उन्नयन कोण है :",
    option:["45°",
            "30°",
            "75°",
            "60°"],
    answer:"30°"
},

{
question: "यदि किसी वृत्त की त्रिज्या दुगनी कर दी जाए तो पुराने एवं नये वृत्तों के क्षेत्रफलों का अनुपात क्या होगा?",
option:["1 : 2",
        "1 : 4",
        "4 : 1",
        "2 : 1"],
answer:"1 : 4"
},

{
question: "बिंदुओं (4, -1) और (2, 3) के बीच की दूरी है:",
option:["3√3","√5","3√5","2√5"],
answer:"2√5"
},

{
question: "गोले का सम्पूर्ण पृष्ठीय क्षेत्रफल निम्न में से कौन होगा, अगर उसकी त्रिज्या r हो:",
option:["4/3 πr³",
        "4/3 πr²",
        "πr²",
        "4πr²"],
answer:"4πr²"
},

{
    question: "यदि α तथा β द्विघात बहुपद f(x) = x² + 2x + 3 के मूल हों, तो (1/α + 1/β) का मान होगा:",
    option:["3/2",
            "–2/3",
            "2/3",
            "–3/2"],
    answer:"–2/3"
},

{
    question: "k के किस मान के लिए 4x² – kx + 16 = 0 के मूल बराबर होंगे?",
    option:["16, 16",
            "16, -16",
            "-16, 0",
            "1, 16"],
    answer:"16, -16"
},

{
    question: "समांतर श्रेणी 2, 7, 12,……. का प्रथम 10 पदों का योगफल होगा:",

    option:["245",
            "240",
            "244",
            "254"],

    answer:"245"
},

{
    question: "रैखिक समीकरण युग्म x + 3y – 4 = 0 तथा 2x – 5y – 1 = 0 है:",
    option:["अविरोधी",
            "विरोधी",
            "आश्रित",
            "इनमें से कोई नहीं"],
    answer:"अविरोधी"
},

{
question: "किसी घटना E के लिए निम्न में कौन सही है ?",

option:["P(E) > 1",
        "P(E) < 0",
        "P(E) = 1",
        "P(E) = -1"],

answer:"P(E) = 1"
},

{
question: "cot 60° का मान होगा:",

option:["√3",
        "1/√3",
        "1",
        "0"],

answer:"1/√3"
},

{
    question: "यदि किसी ΔABC में BD = 5 सेमी, BC = 7.5 सेमी तथा ∠A का समविभाजक AD है तो AB/AC =",
    option:["1",
            "2",
            "0.8",
            "0.6"],
    answer:"2"
},

{
question: "दो वृत्तों के क्षेत्रफलों का अनुपात x² : y² है, तो उनकी त्रिज्याएँ निम्नांकित में कौन-से अनुपात में होंगी?",
option:["x² : y²",
        "√x : √y",
        "y : x",
        "x : y"],
answer:"x : y"
},

{
question: "24, 15, 22, 13, 9, 10 तथा 30 का परिसर होगा:",
option:["22",
        "24",
        "9",
        "21"],
answer:"21"
},

{
    question: "यदि α, β बहुपद x² – 4x + 3 के मूल हों, तो 3α + 3β का मान निम्न में से कौन-सा है?",
    option:["12",
            "-12",
            "24",
            "8"],
    answer:"12"
},

{
question: "प्रथम पाद में स्थित किसी बिंदु की x-अक्ष से दूरी क्या कहलाती है?",
option:["भुज","कोटि","(A) और (B) दोनों","इनमें से कोई नहीं"],
answer:"कोटि"
},

{
    question: "द्विघात समीकरण x² – 15x + 50 = 0 का विविक्तकर होगा:",
    option:["25",
            "425",
            "750",
            "-25"],
    answer:"25"
},

{
question: "एक पासा फेंकने पर एक अभाज्य संख्या पाने की प्रायिकता है।",

option:["1/2",
        "1/3",
        "5/6",
        "2/3"],

answer:"1/2"
},

{
question: "cot²θ बराबर है:",

option:["cosec²θ – 1",
        "cosec²θ + 1",
        "1 – cosec²θ",
        "इनमें से कोई नहीं"],

answer:"cosec²θ – 1"
},

{
question: "इनमें से कौन-सा बिंदु रेखा 3x – 2y = 5 पर नहीं है?",
option:["(2, 1/2)","(3, 2)","(5, 5)","(2, 3)"],
answer:"(2, 3)"
},

{
question: "यदि जीवा AB वृत्त के केन्द्र पर 60° का कोण अंतरित करती है, तो A और B बिन्दुओं पर खींची गई स्पर्शरेखाओं के बीच का कोण होगा:",
option:["30°",
        "60°",
        "90°",
        "120°"],
answer:"120°"
},

{
    question: "यदि समीकरण bx² + ax + c = 0 का मूल समान हो, तो c = ?",
    option:["-a²/4b",
            "a²/4b",
            "a/2b",
            "-a/2b"],
    answer:"a²/4b"
},

{
question: "5, 3, 7, 6, 4, 2, 1 की माध्यिका है :",
option:["2",
        "3",
        "4",
        "5"],
answer:"4"
},

{
    question: "दो चर x, y में रैखिक समीकरण ax + by + c = 0 के कितने अधिकतम हल संभव हैं?",
    option:["1",
            "2",
            "अनगिनत",
            "इनमें से कोई नहीं"],
    answer:"अनगिनत"
},

{
question: "निश्चित घटना की प्रायिकता होती है:",

option:["1",
        "2",
        "0",
        "कोई नहीं"],

answer:"1"
},

{
    question: "3√3x² + 10x + √3 = 0 का विवेचक होगा:",
    option:["16",
            "32",
            "64",
            "1281"],
    answer:"64"
},

{
question: "वर्ग-अंतराल a-b का वर्ग चिह्न होगा-",
option:["(a+b)/2",
        "(a-b)/2",
        "a/2",
        "a²-b²"],
answer:"(a+b)/2"
},

{
    question: "समांतर श्रेढ़ी 5, 8, 11, 14, _____ का 12वाँ पद है:",

    option:["35",
            "38",
            "41",
            "238"],

    answer:"38"
},

{
    question: "ΔABC में DE || BC एवं AD/DB = 3/5। यदि AE = 4.8 cm, तो EC का मान है:",
    option:["2 cm",
            "2.5 cm",
            "8 cm",
            "32 cm"],
    answer:"8 cm"
},

{
question: "5 cm त्रिज्या वाले एक वृत्त के बिन्दु P पर स्पर्श रेखा PO, केन्द्र O से जाने वाली एक रेखा से बिन्दु Q पर इस प्रकार मिलती है कि OQ = 12 cm, तो PQ की लम्बाई है:",
option:["12 cm",
        "13 cm",
        "8.5 cm",
        "√119 cm"],
answer:"√119 cm"
},

{
    question: "144 के अभाज्य गुणनखंड में 2 का घातांक क्या है?",
    option:["6",
            "4",
            "8",
            "5"],
    answer:"4"
},

{
    question: "यदि रैखिक समीकरण का युग्म असंगत है, तो उसे निरूपित करने वाली रेखाएँ होंगी:",
    option:["समान्तर",
            "सदैव संपाती",
            "सदैव प्रतिच्छेदी",
            "प्रतिच्छेदी अथवा संपाती"],
    answer:"समान्तर"
},

{
question: "यदि किसी त्रिभुज ABC में ∠A तथा ∠B पूरक हैं, तो cot C का मान है:",

option:["1/√3",
        "0",
        "1",
        "√3"],

answer:"परिभाषित नहीं"
},

{
    question: "यदि किसी समद्विबाहु त्रिभुज का आधार b हो और बराबर भुजा a हो, तो उसका क्षेत्रफल होगा:",
    option:["√3a²/4",
            "(a+b+c)/2",
            "1/2√(4a²-4b²)",
            "{b√(4a²-4b²)}/4"],
    answer:"{b√(4a²-4b²)}/4"
},

{
    question: "निम्नलिखित में से किस द्विघात बहुपद के शून्यकों का योग –4 तथा गुणनफल -5 है?",
    option:["x² + 4x + 5",
            "x² – 4x – 5",
            "x² – 4x + 5",
            "x² + 4x – 5"],
    answer:"x² + 4x – 5"
},

{
question: "किसी घटना E के घटित होने की प्रायिकता P(E) हो, तो निम्नांकित में कौन सही है ?",

option:["P(E) < 0",
        "P(E) > 1",
        "-1 ≤ P(E) ≤ 1",
        "0 ≤ P(E) ≤ 1"],

answer:"0 ≤ P(E) ≤ 1"
},

{
question: "y-अक्ष से 5 इकाई दाईं और x-अक्ष पर एक बिंदु P स्थित है। तो बिंदु P के निर्देशांक हैं:",
option:["(5, 0)","(0, 5)","(5, -5)","(-5, 5)"],
answer:"(5, 0)"
},

{
question: "x, x + 3, x + 6, x + 9 तथा x + 12 का समान्तर माध्य है:",
option:["x + 6",
        "x + 5",
        "x + 7",
        "x + 8"],
answer:"x + 6"
},

{
question: "tan π/2 का मान होगा:",

option:["0",
        "√3",
        "1/√3",
        "∞"],

answer:"∞"
},

{
    question: "1 से 100 तक सभी प्राकृतिक संख्याओं का योग है:",

    option:["4050",
            "5050",
            "6050",
            "7050"],

    answer:"5050"
},

{
question: "कार्तीय तल में स्थित किसी बिंदु (6, 4) के कोटि का मान क्या होगा?",
option:["6","4","5","2"],
answer:"4"
},

{
question: "यदि किसी गोले की त्रिज्या आधी कर दी जाती है, तो मूल गोले और नए गोले के आयतन का अनुपात क्या होगा?",
option:["1 : 8",
        "8 : 1",
        "1 : 4",
        "4 : 1"],
answer:"8 : 1"
},

{
    question: "त्रिभुज ABC में D, AB पर तथा E, AC पर स्थित हैं और DE || BC। यदि AD = x, DB = 16, AE = 34 तथा EC = 17 है, तो x का मान होगा:",
    option:["8",
            "32",
            "24",
            "16"],
    answer:"32"
},

{
    question: "समांतर श्रेणी 14, 9, 4, −1, –6,…… का 12वाँ पद है:",

    option:["41",
            "-41",
            "40",
            "36"],

    answer:"-41"
},

{
question: "x-अक्ष से बिंदु Q (3, 6) की दूरी है:",
option:["3 इकाई","6 इकाई","9 इकाई","3/5 इकाई"],
answer:"6 इकाई"
},

{
question: "3, 5, 4, 3, 2, 3, 1, 3 का बहुलक है",
option:["1",
        "5",
        "4",
        "3"],
answer:"3"
},

{
    question: "बहुपद 6x² – 11x + 3 के शून्यकों का योग क्या होगा?",
    option:["1/2",
            "6/11",
            "11/6",
            "-11/6"],
    answer:"11/6"
},

{
    question: "त्रिभुज ABC में D, AB पर तथा E, AC पर स्थित हैं और DE || BC। यदि AD/DB = 3/2 तथा AE = 4.8 cm है, तो EC होगा:",
    option:["2",
            "3",
            "3.2",
            "2.2"],
    answer:"3.2"
},

{
    question: "निम्नलिखित में क्या है? (√3/√12)",
    option:["परिमेय संख्या",
            "अपरिमेय संख्या",
            "पूर्णांक संख्या",
            "सभी"],
    answer:"परिमेय संख्या"
},

{
    question: "समीकरण 7x² – 12x + 18 = 0 के मूलों के योग एवं मूलों के गुणनफल का अनुपात होगा:",
    option:["7 : 12",
            "7 : 18",
            "3 : 2",
            "2 : 3"],
    answer:"2 : 3"
},

{
    question: "यदि किसी समांतर श्रेढ़ी का प्रथम पद 13 एवं सार्व-अंतर -4 हो तो इसके प्रथम 10 पदों का योगफल क्या होगा?",

    option:["50",
            "-50",
            "30",
            "-30"],

    answer:"-50"
},

{
question: "यदि वृत्त के व्यास के सिरों के निर्देशांक (2, 3) एवं (-6, 7) हैं, तो उसके केन्द्र के निर्देशांक होंगे:",
option:["(-2, 5)","(2, -5)","(2, 5)","(3, 5)"],
answer:"(-2, 5)"
},

{
    question: "बहुपद x² – x + 1 के शून्यक α, β हों, तो 1/α + 1/β का मान है:",
    option:["-1",
            "1",
            "0",
            "-2"],
    answer:"1"
},

{
    question: "3x² + 2x – 1 = 0 का विवेचक है:",
    option:["4",
            "16",
            "64",
            "32"],
    answer:"16"
},

{
question: "9sec²θ – 9tan²θ बराबर है:",

option:["1",
        "9",
        "8",
        "0"],

answer:"9"
},

{
    question: "किसी A.P. का दूसरा पद 4 और सातवाँ पद –11 है तो सार्वअन्तर होगा:",

    option:["2",
            "3",
            "-2",
            "-3"],

    answer:"-3"
},

{
question: "एक बेलन की ऊँचाई 14 cm है और इसका वक्र पृष्ठीय क्षेत्रफल 264 cm² है, तो बेलन का आयतन है:",
option:["308 cm³",
        "396 cm³",
        "1232 cm³",
        "1848 cm³"],
answer:"396 cm³"
},

{
question: "यदि कोण p°, त्रिज्या r वाले वृत्त के त्रिज्यखंड का कोण हो, तो त्रिज्यखंड का क्षेत्रफल होगा :",
option:["(2πrp)/360",
        "(πr²p)/360",
        "(πr²p)/180",
        "(2πr²p)/180"],
answer:"(πr²p)/360"
},

{
    question: "द्विघात बहुपद 5y² – 14y + 8 के शून्यकों का योग होगा।",
    option:["5/2",
            "-5/2",
            "14/5",
            "8/5"],
    answer:"14/5"
},

{
question: "किसी बारंबारता का बहुलक होता है:",
option:["कम से कम बारंबारता मान",
        "माध्यतम मान",
        "अधिकतम बारंबारता मान",
        "इनमें कोई नहीं"],
answer:"अधिकतम बारंबारता मान"
},

{
question: "बिंदु (-8, 6) किस चतुर्थांश में स्थित है:",
option:["प्रथम","द्वितीय","तृतीय","चतुर्थ"],
answer:"द्वितीय"
},

{
question: "यदि A = 35° तो sin A × cosec A का मान होगा:",

option:["0",
        "-1",
        "1",
        "2"],

answer:"1"
},

{
    question: "विविक्तकर (D) का सूत्र क्या होता है?",
    option:["√(b² ± 4ac)/2a",
            "√(b² – 4ac)",
            "b² – 4ac",
            "सभी"],
    answer:"b² – 4ac"
},

{
    question: "A.P. 2, 7, 12, …. का 10वाँ पद है:",

    option:["50",
            "40",
            "47",
            "53"],

    answer:"47"
},

{
question: "यदि ∠OPA = 35° है, तो ∠AOP का मान होगा:",
option:["45°",
        "55°",
        "60°",
        "65°"],
answer:"55°"
},

{
    question: "यदि a = 2³ × 5 × 3 और b = 2⁴ × 5 × 7 तब a और b का LCM क्या होगा?",
    option:["1700",
            "1680",
            "30",
            "इनमें से कोई नहीं"],
    answer:"1680"
},

{
    question: "निम्नांकित समुच्चयों में किसमें द्विघात समीकरण x² – 5 = 0 के मूल होंगे?",
    option:["पूर्णांक संख्याएँ",
            "परिमेय संख्याएँ",
            "अपरिमेय संख्याएँ",
            "प्राकृत संख्याएँ"],
    answer:"अपरिमेय संख्याएँ"
},

{
    question: "यदि समानान्तर चतुर्भुज की सभी भुजाएँ एक वृत्त को स्पर्श करें तो वह समानान्तर चतुर्भुज होगा:",
    option:["आयत",
            "वर्ग",
            "समचतुर्भुज",
            "समलम्ब चतुर्भुज"],
    answer:"समचतुर्भुज"
},

{
    question: "समान्तर श्रेणी 54, 51, 48, 45,……… का 10वाँ पद है:",

    option:["27",
            "30",
            "-27",
            "इनमें कोई नहीं"],

    answer:"27"
},

{
question: "त्रिज्या R वाले वृत्त के उस त्रिज्यखंड का क्षेत्रफल, जिसका कोण p° है, निम्नलिखित है :",
option:["p/180 × 2πR",
        "p/180 × 2πR²",
        "p/360 × 2πR",
        "p/720 × 2πR²"],
answer:"p/720 × 2πR²"
},

{
question: "बिंदु (-12, -18) का भुज है:",
option:["-12","-18","6","-30"],
answer:"-12"
},

{
    question: "एक द्विघाती बहुपद के शून्यकों का योग तथा गुणनफल क्रमशः 2 तथा -15 है, तो बहुपद है:",
    option:["x² – 2x + 15",
            "x² – 2x – 15",
            "3x² + 2x – 15",
            "2x² + 2x + 15"],
    answer:"x² – 2x – 15"
},

{
question: "यदि 3α = 90° तो sinα का मान होगा:",

option:["1/√3",
        "√3/4",
        "1/2",
        "√3/2"],

answer:"1/2"
},

{
    question: "2.13113111311113...... क्या है?",
    option:["परिमेय संख्या",
            "अपरिमेय संख्या",
            "सांत संख्या",
            "पूर्णांक संख्या"],
    answer:"अपरिमेय संख्या"
},

{
question: "एक थैले में 8 लाल, 2 काली एवं 5 सफेद गेंद हैं। एक गेंद यादृच्छया निकाली जाती है। इस गेंद के काला न होने की प्रायिकता क्या है ?",

option:["2/15",
        "13/15",
        "8/15",
        "1/3"],

answer:"13/15"
},

{
question: "बिंदु P (x, y) की मूल बिंदु से दूरी होगी:",
option:["√(x² - y²)","√(x² + y²)","x - y","x + y"],
answer:"√(x² + y²)"
},

{
question: "sin π/3 का मान है:",

option:["1/2",
        "√3/2",
        "1",
        "0"],

answer:"√3/2"
},

{
    question: "ΔABC में DE || BC और AD/DB = 5/3 हो, तब AE/AC =",
    option:["5/3",
            "3/5",
            "5/8",
            "8/5"],
    answer:"5/8"
},

{
question: "किसी वृत्त के केन्द्र से 13 सेमी दूर स्थित बिन्दु P से खींची गई स्पर्श रेखा की लम्बाई 12 सेमी है, तो वृत्त की त्रिज्या है:",
option:["6 cm",
        "12 cm",
        "9 cm",
        "5 cm"],
answer:"5 cm"
},

{
question: "8, 7, 12, 15, 10, 9, 11 की माध्यिका होगी :",
option:["10",
        "11",
        "9",
        "इनमें से कोई नहीं"],
answer:"10"
},

{
question: "sin63°/cos27° =",

option:["√3",
        "1",
        "2",
        "3"],

answer:"1"
},

{
    question: "समांतर श्रेणी 5, 8, 11, 14 ……. का दसवाँ पद है:",

    option:["32",
            "35",
            "38",
            "185"],

    answer:"32"
},

{
question: "एक वृत्ताकार पथ पर तीन धावक एक ही स्थान से दौड़ना शुरू करते हैं। एक चक्कर लगाने में क्रमशः 2 घंटे, 4 घंटे तथा 6 घंटे समय लगता है। तीनों को प्रस्थान बिंदु पर पुनः मिलने में लगा समय होगा :",
option:["8 घंटे",
        "6 घंटे",
        "12 घंटे",
        "2 घंटे"],
answer:"12 घंटे"
},

{
    question: "रैखिक बहुपद के शून्यक की संख्या होती है।",
    option:["2",
            "1",
            "3",
            "इनमें से कोई नहीं"],
    answer:"1"
},

{
question: "कार्तीय तल में स्थित किसी बिंदु (3, -4) के कोटि का मान है:",
option:["-4","3","-1","-7"],
answer:"-4"
},

{
question: "(tan²36°)/(cot²54°) का मान है:",

option:["1",
        "2",
        "3",
        "4"],

answer:"1"
},

{
    question: "1 + 2 + 3 + ….. + n बराबर है:",

    option:["(n + 1)/2",
            "{n(n + 1)(n + 2)}/2",
            "{n(n + 1)}/2",
            "{n(n – 1)}/2"],

    answer:"{n(n + 1)}/2"
},

{
    question: "यदि द्विघात बहुपद q(x) = x² – x + 4 के शून्यक α, β हो, तब (α + β) का मान होगा?",
    option:["-1",
            "4",
            "1",
            "0"],
    answer:"1"
},

{
question: "64π cm² क्षेत्रफल वाले वृत्त का व्यास है :",
option:["15 cm",
        "16 cm",
        "20 cm",
        "17 cm"],
answer:"16 cm"
},

{
question: "2sin38°/cos52° का मान है:",

option:["2",
        "1",
        "3",
        "4"],

answer:"2"
},

{
    question: "5√2 क्या है?",
    option:["पूर्ण संख्या",
            "प्राकृतिक संख्या",
            "परिमेय संख्या",
            "अपरिमेय संख्या"],
    answer:"अपरिमेय संख्या"
},

{
question: "y-अक्ष का समीकरण है:",
option:["y = 0","x = 0","xy = 0","x – y = 0"],
answer:"x = 0"
},

{
    question: "बहुपद x² – 3 के शून्यक होंगे:",
    option:["(3, 3)",
            "(−√3, +√3)",
            "(−√3, −√3)",
            "(−3, −3)"],
    answer:"−√3, +√3"
},

{
question: "sec70° · sin20° + cos20° · cosec70° का मान होगा:",

option:["0",
        "1",
        "-1",
        "2"],

answer:"2"
},

{
    question: "(4-√3) क्या है?",
    option:["विषम संख्या",
            "परिमेय संख्या",
            "अपरिमेय संख्या",
            "सभी"],
    answer:"अपरिमेय संख्या"
},

{
question: "निम्न में से कौन वृत्त के क्षेत्रफल का सूत्र है?",
option:["2πr",
        "4πr²",
        "πr²",
        "4πr"],
answer:"πr²"
},

{
    question: "एक घात वाला बहुपद कहलाता है:",
    option:["द्विघात बहुपद",
            "त्रिघात बहुपद",
            "रैखिक बहुपद",
            "बहुपद नहीं"],
    answer:"रैखिक बहुपद"
},

{
question: "यदि cosA + cos²A = 1 तो sin²A + sin⁴A =",

option:["-1",
        "0",
        "1",
        "इनमें से कोई नहीं"],

answer:"1"
},

{
question: "एक शंकु की ऊँचाई 24 cm और आधार की त्रिज्या 6 cm है। शंकु का आयतन क्या होगा:",
option:["288π cm³",
        "188π cm³",
        "100π cm³",
        "90π cm³"],
answer:"288π cm³"
},

{
    question: "यदि समांतर श्रेणी का nवाँ पद aₙ = 9 – 5n तो a₇ = ?", 

    option:["26",
            "-26",
            "45",
            "2"],

    answer:"-26"
},

{
    question: "यदि α और β बहुपद f(x) = x² + x + 1 के मूल हों, तो (1/α + 1/β) का मान होगा:",
    option:["1",
            "-1",
            "0",
            "इनमें से कोई नहीं"],
    answer:"-1"
},

{
question: "बिंदुओं (9, 3) एवं (15, 11) के बीच की दूरी है:",
option:["11","10","13","12"],
answer:"10"
},

{
    question: "निम्नलिखित में से किस भिन्न का दशमलव प्रसार सांत है?",
    option:["11/700",
            "91/2100",
            "343/(2³×5³×7³)",
            "इनमें से कोई नहीं"],
    answer:"343/(2³×5³×7³)"
},

{
    question: "यदि समांतर श्रेणी का सार्व अंतर -2 है, तथा nवाँ पद aₙ है तो a₁₇ – a₁₃ = ?", 

    option:["-2",
            "4",
            "8",
            "-8"],

    answer:"-8"
},

{
question: "sin(45° + θ) – cos(45° – θ) = ?",

option:["2sin θ",
        "2cos θ",
        "0",
        "1"],

answer:"0"
},

{
    question: "द्विघात बहुपद x² – 5x + 6 के शून्यक हैं:",
    option:["1, -1",
            "2, 1",
            "2, 3",
            "-2, -3"],
    answer:"2, 3"
},

{
    question: "द्विघात समीकरण (x² + 5x – 6 = 0) का घात होगा:",
    option:["1",
            "0",
            "2",
            "3"],
    answer:"2"
},

{
question: "बिंदु A (8, 10) तथा B (4, 6) को मिलाने वाली रेखा के मध्यबिंदु के निर्देशांक हैं:",
option:["(6, 8)","(8, 6)","(8, 4)","(4, 8)"],
answer:"(6, 8)"
},

{
question: "एक बेलन और एक शंकु के आधार समान हैं। यदि उनकी ऊँचाइयाँ भी समान हों, तो उनके आयतनों का अनुपात होगा:",
option:["1 : 2",
        "2 : 3",
        "3 : 2",
        "3 : 1"],
answer:"3 : 1"
},

{
question: "यदि वर्ग का विकर्ण 16√2 cm है, तो वर्ग की भुजा की लंबाई होगी :",
option:["4 cm",
        "16 cm",
        "256 cm",
        "4√2 cm"],
answer:"16 cm"
},

{
    question: "यदि समीकरण kx – 5y = 2 तथा 6x + 2 = 7 के कोई हल न हो, तो:",
    option:["k = –10",
            "k = –5",
            "k = –6",
            "k = –15"],
    answer:"k = –15"
},

{
    question: "p का मान जिसके लिए बहुपद x³ + 4x² – px + 8 पूर्णतया (x – 2) से विभाज्य है:",
    option:["0",
            "3",
            "5",
            "16"],
    answer:"16"
},

{
question: "यदि किसी गोले की त्रिज्या 3 गुनी हो जाती है, तो इसका आयतन हो जाएगा:",
option:["3 गुना",
        "6 गुना",
        "9 गुना",
        "27 गुना"],
answer:"27 गुना"
},

{
    question: "ΔABC में AD ⊥ BC, AD = BD = 8 cm, BC = 23 cm, तब AC =",
    option:["15 cm",
            "17 cm",
            "8 cm",
            "इनमें कोई नहीं"],
    answer:"17 cm"
},

{
    question: "रैखिक समीकरण युग्म x + 2y = 5 तथा 3x + 12y = 10 का:",
    option:["एकल हल होगा",
            "कोई हल नहीं होगा",
            "एक से अधिक हल होगा",
            "अनन्त बहुआयामी हल होंगे"],
    answer:"एकल हल होगा"
},

{
question: "आँकड़ों 8, 6, 12, 4, 13, 20, 7, 2, 3, 3, 10 में परिसर होगा:",
option:["20",
        "6",
        "18",
        "3"],
answer:"18"
},

{
question: "80 सेमी व्यास के आधार-वृत्त और 20 सेमी ऊँचाई वाले बेलन के कुल पृष्ठीय क्षेत्रफल तथा वक्र पृष्ठीय क्षेत्रफल का अनुपात है:",
option:["1 : 2",
        "2 : 1",
        "3 : 1",
        "5 : 1"],
answer:"3 : 1"
},

{
question: "यदि tan θ = 12/5 तो sin θ का मान होगा:",

option:["5/12",
        "12/13",
        "5/13",
        "12/5"],

answer:"12/13"
},

{
    question: "k के किस मान के लिए समीकरण निकाय 4x + ky = 6, 2x - 4y = 3 के अनगिनत हल होंगे?",
    option:["-2",
            "-8",
            "8",
            "2"],
    answer:"-8"
},

{
question: "माध्य (x), माध्यिका (y) और बहुलक (z) के बीच संबंध है:",
option:["x-y = 3(z-y)",
        "x-z = 3(x-y)",
        "xy = z-y",
        "3(x-z) = x-y"],
answer:"x-z = 3(x-y)"
},

{
    question: "यदि a और b अभाज्य संख्याएँ हैं तो a और b का LCM क्या होगा?",
    option:["a",
            "b",
            "ab",
            "सभी"],
    answer:"ab"
},

{
    question: "कौन रेखीय बहुपद व्यंजक है:",
    option:["2x – 5",
            "x² + 1/x + 3",
            "x² – 3x + 4",
            "2x³ – 3x² + 5x + 7"],
    answer:"2x – 5"
},

{
question: "किसी त्रिभुज ABC के दो शीर्ष A (2, 3) तथा B (1, -3) हैं एवं केन्द्रक (3, 0) है, तो तीसरे शीर्ष C के निर्देशांक हैं:",
option:["(5, 2)","(1, 3)","(6, 0)","(2, -3)"],
answer:"(6, 0)"
},

{
question: "एक वृत्त का क्षेत्रफल दूसरे वृत्त के क्षेत्रफल का 16 गुना है, तो उनकी त्रिज्याओं का अनुपात है :",
option:["1 : 16",
        "1 : 4",
        "1 : 2",
        "4 : 1"],
answer:"4 : 1"
},

{
question: "एक सिक्के को एक बार उछालने पर चित पाने की प्रायिकता क्या है ?",

option:["1/6",
        "2/3",
        "1/2",
        "कोई नहीं"],

answer:"1/2"
},

{
question: "निम्न में से कौन cos θ के बराबर है?",

option:["√(sin²θ – 1)",
        "√(1 – sin²θ)",
        "√(1 + sin²θ)",
        "√(1 – cos²θ)"],

answer:"√(1 – sin²θ)"
},

{
    question: "xⁿ + 1 का एक गुणक x + 1 है तो n निश्चित रूप से होगा:",
    option:["एक सम पूर्णांक संख्या है",
            "एक धनात्मक पूर्णांक संख्या है",
            "एक विषम पूर्णांक संख्या है",
            "एक ऋणात्मक पूर्णांक संख्या है"],
    answer:"एक विषम पूर्णांक संख्या है"
},

{
    question: "बहुपद x² + ax – b के शून्यक एक-दूसरे के व्युत्क्रम हों, तब b = है",
    option:["1",
            "-1",
            "a",
            "1/a"],
    answer:"-1"
},

{
    question: "समीकरण 3x – y = 5 तथा 6x – 2y = k के कोई हल न हो, तो:",
    option:["k = 0",
            "k ≠ 0",
            "k ≠ 10",
            "k = –10"],
    answer:"k ≠ 10"
},

{
question: "यदि किसी शंकु के वक्र पृष्ठ का क्षेत्रफल 880 cm² है और त्रिज्या 14 cm है, तो इसकी तिर्यक ऊँचाई होगी:",
option:["10 cm",
        "20 cm",
        "40 cm",
        "30 cm"],
answer:"20 cm"
},

{
question: "निर्देशांक (2, k - 3) तथा (4, -7) को जोड़ने वाली रेखा का झुकाव 3 है, तो k का मान होगा:",
option:["-10","-6","-2","10"],
answer:"-10"
},

{
question: "निम्न में कौन cotθ के बराबर है?",

option:["sinθ/cosθ",
        "cosθ/sinθ",
        "1/secθ",
        "1/sinθ"],

answer:"cosθ/sinθ"
},

{
    question: "समबाहु त्रिभुज ABC में यदि AD ⊥ BC तब AB²/AD² =",
    option:["3/4",
            "4/3",
            "1/2",
            "2/1"],
    answer:"4/3"
},

{
    question: "‘k’ के किस मान के लिए रैखीय समीकरण युग्म का एकमात्र हल x = 1, y = -1 है?",
    option:["3",
            "4",
            "6",
            "-6"],
    answer:"6"
},

{
question: "यदि PA तथा PB किसी बिन्दु P से O केन्द्र वाले वृत्त पर खींची गई स्पर्श रेखाएँ हैं, जिनके बीच का झुकाव 80° है, तो ∠POA =",
option:["50°",
        "60°",
        "70°",
        "80°"],
answer:"50°"
},

{
question: "यदि E कोई घटना हो, तब P(E) + P(E̅) का मान होगा :",

option:["2",
        "1",
        "-1",
        "कोई नहीं"],

answer:"1"
},

{
question: "cosec θ = b/a, तो sec θ का मान है:",

option:["b/√(b² – a²)",
        "√(b² – a²)/b",
        "a/√(b² – a²)",
        "b/a"],

answer:"b/√(b² – a²)"
},

{
    question: "-10, -6, -2, 2……., 34 में पदों की संख्या है:",

    option:["15",
            "12",
            "13",
            "14"],

    answer:"12"
},

{
question: "वृत्त C(O, r) के अन्तःभाग में एक बिन्दु P है, तो निम्न में कौन सत्य है?",
option:["r < OP",
        "r > OP",
        "r = OP",
        "इनमें कोई नहीं"],
answer:"r > OP"
},

{
question: "निम्नलिखित सारणी में चर मान 7 की संचयी बारंबारता इनमें से कौन-सी है? चर मान 3, 5, 7, 11 तथा बारंबारता 2, 3, 5, 9 है।",
option:["5",
        "9",
        "10",
        "19"],
answer:"10"
},

{
question: "दो वृत्तों के क्षेत्रफलों का अनुपात 4 : 1 है, तो उनकी त्रिज्याओं का अनुपात है :",
option:["4 : 1",
        "2 : 1",
        "1 : 2",
        "1 : 4"],
answer:"2 : 1"
},

{
question: "बेलन तथा शंकु के आधार-वृत्तों की त्रिज्याओं का अनुपात 3 : 4 है तथा उनकी ऊँचाइयों का अनुपात क्रमशः 2 : 3 है, तो उनके आयतन का अनुपात क्या होगा?",
option:["9 : 8",
        "9 : 4",
        "3 : 1",
        "27 : 64"],
answer:"9 : 8"
},

{
question: "बिंदुओं A (2, -3) तथा B (2, 2) के बीच की दूरी है:",
option:["2 इकाइयाँ","3 इकाइयाँ","4 इकाइयाँ","5 इकाइयाँ"],
answer:"5 इकाइयाँ"
},

{
    question: "जब A.P. के प्रथम पद 2 तथा सार्व अन्तर 3 हो, तब A.P. के तीन पद होंगे:",

    option:["2, 6, 9",
            "2, 5, 8",
            "2, 6, 10",
            "2, 5, 9"],

    answer:"2, 5, 8"
},

{
question: "cos1° cos2° cos3° … cos90° =",

option:["0",
        "1",
        "-1",
        "√2"],

answer:"0"
},

{
    question: "द्विघात समीकरण 3x² + 2x + 1/3 = 0 के विवेचक का मान होगा:",
    option:["0",
            "1/2",
            "1",
            "√3"],
    answer:"0"
},

{
    question: "64 के वर्गमूल को 64 के घनमूल से भाग देने का मान होगा:",
    option:["64",
            "2",
            "1/2",
            "64^(2/3)"],
    answer:"2"
},

{
question: "यदि त्रिभुज के शीर्षों के निर्देशांक (0, 8), (0, 0) तथा (6, 0) हैं, तो त्रिभुज का परिमाप होगा:",
option:["14 इकाई","28 इकाई","24 इकाई","100 इकाई"],
answer:"24 इकाई"
},

{
question: "PQRS एक समानान्तर चतुर्भुज है जो पूर्णतया एक वृत्त से घिरा है। तो यह एक …… नहीं है।",
option:["विषमकोण चतुर्भुज (समचतुर्भुज)",
        "वर्ग",
        "आयत",
        "समलम्ब चतुर्भुज"],
answer:"समलम्ब चतुर्भुज"
},

{
question: "निम्नलिखित में से कौन cosecθ के बराबर है?",

option:["cosθ/sinθ",
        "1/secθ",
        "1/sinθ",
        "sinθ/cosθ"],

answer:"1/sinθ"
},

{
question: "लट्टू का आकार किस ठोस आकृति के समान होता है?",
option:["वर्ग",
        "आयत",
        "बेलन",
        "शंकु"],
answer:"शंकु"
},

{
question: "दो बिंदुओं (2, 3) और (4, 1) के बीच की दूरी होगी:",
option:["2","2√2","4","8"],
answer:"2√2"
},

{
question: "O केन्द्र वाले वृत्त की PT एक स्पर्श रेखा है। यदि OT = 3 cm और OP = 5 cm, तब स्पर्श रेखा PT की लम्बाई है:",
option:["4 cm",
        "6 cm",
        "5 cm",
        "8 cm"],
answer:"4 cm"
},

{
question: "2cos²60° का मान है:",

option:["1/3",
        "1/4",
        "1",
        "1/2"],

answer:"1/2"
},

{
    question: "निम्न में कौन द्विघात समीकरण नहीं है?",
    option:["(x + 2)³ = x(x² – 1)",
            "(x + 1)² = 2(x – 3)",
            "(x – 2)(x + 2) = 5",
            "x² + 1/x² = 2"],
    answer:"x² + 1/x² = 2"
},

{
question: "बिंदु (4.5, 6.5) किस पाद में स्थित है?",
option:["प्रथम पाद","द्वितीय पाद","तृतीय पाद","चतुर्थ पाद"],
answer:"प्रथम पाद"
},

{
question: "अर्धगोले के सम्पूर्ण पृष्ठ का क्षेत्रफल होता है:",
option:["4πr²",
        "3πr²",
        "2πr²",
        "πr²"],
answer:"3πr²"
},

{
    question: "P(x) = x² – 2x + 5 के शून्यक a, b हो, तो ab का मान होगा:",
    option:["5",
            "-5",
            "2",
            "-2"],
    answer:"5"
},

{
    question: "यदि द्विघात समीकरण ax² + bx + c = 0 के मूल बराबर हों, तो c का मान होगा:",
    option:["-b/2a",
            "b/2a",
            "-b²/4a",
            "b²/4a"],
    answer:"b²/4a"
},

{
    question: "यदि रैखिक समीकरणों का युग्म संगत है तब उनके द्वारा निरूपित रेखाएँ कैसी होती हैं?",
    option:["समांतर",
            "हमेशा प्रतिच्छेदी",
            "प्रतिच्छेदी या संपाती",
            "हमेशा संपाती"],
    answer:"प्रतिच्छेदी या संपाती"
},

{
question: "यदि किसी घनाभ की लंबाई l, चौड़ाई b तथा ऊँचाई h हो, तो घनाभ का आयतन है:",
option:["lbh",
        "√(l² + b² + h²)",
        "2lbh",
        "2(lb + bh + lh)"],
answer:"lbh"
},

{
    question: "दो समानांतर रेखाएँ l और m को एक तिर्यक रेखा काटती है। यदि एक कोण 3d + 50° तथा उसके साथ का अंतः कोण 2d + 20° है, तो d का मान होगा:",
    option:["22°",
            "30°",
            "45°",
            "80°"],
    answer:"22°"
},

{
question: "3, 4, 7, 2, 7, 6, 7, 9 का बहुलक होगा:",
option:["2",
        "3",
        "7",
        "9"],
answer:"7"
},

{
    question: "निम्नलिखित में से कौन-सा कथन सही है?",
    option:["दो अपरिमेय संख्याओं का गुणनफल हमेशा अपरिमेय होता है।",
            "एक परिमेय व अपरिमेय संख्या का गुणनफल हमेशा अपरिमेय होता है।",
            "दो परिमेय संख्याओं का जोड़ कभी भी अपरिमेय नहीं हो सकता।",
            "एक पूर्णांक तथा एक अपरिमेय संख्या का जोड़ कभी पूर्णांक नहीं हो सकता।"],
    answer:"एक परिमेय व अपरिमेय संख्या का गुणनफल हमेशा अपरिमेय होता है।"
},

{
    question: "वह द्विघात समीकरण जिसके मूल 3, -3 हों, निम्नलिखित में कौन-सा होगा?",
    option:["x² – 3 = 0",
            "x² – 9 = 0",
            "x² + 3x – 9 = 0",
            "x² – 2x + 3 = 0"],
    answer:"x² – 9 = 0"
},

{
question: "sin50°/cos40° का मान होगा:",

option:["2",
        "1",
        "0",
        "4"],

answer:"1"
},

{
question: "52 पत्तों की अच्छी तरह फेंटी गई गड्डी से एक पत्ता निकाला जाता है, तो एक इक्का प्राप्त होने की क्या प्रायिकता है ?",

option:["1/4",
        "1/26",
        "1/13",
        "4/13"],

answer:"1/13"
},

{
    question: "y²(1/y + 3) =",
    option:["y",
            "y + 3y³",
            "y² + 3y",
            "y + 3y²"],
    answer:"y + 3y²"
},

{
question: "TP तथा TQ किसी बाह्य बिन्दु T से O केन्द्र वाले वृत्त पर खींची गई दो स्पर्श रेखाएँ हैं। यदि ∠POQ = 120°, तो ∠OTP का मान किसके बराबर है?",
option:["40°",
        "30°",
        "50°",
        "इनमें से कोई नहीं"],
answer:"30°"
},

{
question: "एक बेलन का व्यास 28 cm और उसकी ऊँचाई 20 cm है। बेलन का कुल पृष्ठीय क्षेत्रफल है:",
option:["2993 cm²",
        "2992 cm²",
        "2292 cm²",
        "2229 cm²"],
answer:"2992 cm²"
},

{
    question: "12 m ऊँचे खंभे की जमीन पर पड़ रही छाया की लंबाई 4√3 m है। सूर्य का उन्नयन कोण है :",
    option:["60°",
            "45°",
            "30°",
            "90°"],
    answer:"60°"
},

{
    question: "समांतर श्रेणी 0, 4, 8, 12 का सार्व अंतर है:",

    option:["0",
            "4",
            "-4",
            "2"],

    answer:"4"
},

{
question: "अर्द्धवृत्त का कोण होता है:",
option:["90°",
        "180°",
        "120°",
        "60°"],
answer:"180°"
},

{
    question: "निम्नलिखित में से कौन-सा द्विघात समीकरण है?",
    option:["2x² – 3x = (x + 1)²",
            "x² – 2√x + 3 = 0",
            "3x² + 2 = (3 – x)² + 4",
            "x² – 1/x² = 4"],
    answer:"3x² + 2 = (3 – x)² + 4"
},

{
question: "किसी घटना की प्रायिकता का अधिकतम मान होता है",

option:["0",
        "1",
        "-1",
        "2"],

answer:"1"
},

{
question: "एक अर्धगोले का आयतन 19404 cm³ है, तो अर्धगोले का कुल पृष्ठीय क्षेत्रफल है:",
option:["4158 cm²",
        "16632 cm²",
        "8316 cm²",
        "3696 cm²"],
answer:"4158 cm²"
},

{
    question: "ΔABC तथा ΔDEF में AD/DE = BC/DF, ये दोनों त्रिभुज समरूप होंगे, यदि:",
    option:["∠B = ∠E",
            "∠A = ∠D",
            "∠B = ∠D",
            "∠A = ∠F"],
    answer:"∠B = ∠D"
},

{
    question: "यदि 4, x₁, x₂, x₃, 28 समांतर श्रेणी (AP) में है, तो x₃ = ?", 

    option:["19",
            "23",
            "22",
            "ज्ञात नहीं किया जा सकता"],

    answer:"22"
},

{
question: "यदि 15cotA = 8 हो, तो sinA का मान होगा:",

option:["15/17",
        "17/15",
        "15/8",
        "8/17"],

answer:"15/17"
},

{
    question: "द्विघात समीकरण 2x² – 4x + 3 = 0 का विवेचक होगा:",
    option:["-4",
            "0",
            "-8",
            "कोई नहीं"],
    answer:"-8"
},

{
question: "P (-4, 2) और Q (8, 3) बिंदुओं को मिलाने वाले रेखाखंड को y-अक्ष किस अनुपात में बाँटता है?",
option:["3 : 1","1 : 3","2 : 1","1 : 2"],
answer:"1 : 2"
},

{
question: "तीन सही सिक्के उछाले जाते हैं। कम-से-कम 2 हेड आने की प्रायिकता है:",

option:["1/2",
        "1/3",
        "1/4",
        "1/8"],

answer:"1/2"
},

{
    question: "यदि (2k – 1, k) समीकरण 10x – 9y = 12 का हल हो, तो k = _______.",
    option:["1",
            "2",
            "3",
            "4"],
    answer:"2"
},

{
    question: "यदि x + 2, 3x और 4x + 1 समांतर श्रेढ़ी में हों तो x का मान होगा:",

    option:["1",
            "2",
            "3",
            "4"],

    answer:"3"
},

{
    question: "बहुपद y³ – 2y² – √3y + 1/2 का घात है:",
    option:["1/2",
            "2",
            "3",
            "3/2"],
    answer:"3"
},

{
question: "(sec θ + tan θ)(1 – sin θ) =",

option:["sin θ",
        "cosec θ",
        "cos θ",
        "sec θ"],

answer:"cos θ"
},

{
question: "2, 4, 6, 5, 4, 6, 3, 4 का बहुलक होगा",
option:["2",
        "6",
        "4",
        "5"],
answer:"4"
},

{
    question: "6/15 का दशमलव प्रसार है?",
    option:["सांत",
            "असांत",
            "सांत और असांत",
            "इनमें से कोई नहीं"],
    answer:"सांत"
},

{
    question: "यदि x² + 5x + 8 के शून्यक α तथा β हों तो (α + β) = ?",
    option:["5",
            "-5",
            "8",
            "-8"],
    answer:"-5"
},

{
question: "1/√3 बराबर है:",

option:["tan 60°",
        "cos 45°",
        "sin 30°",
        "tan 30°"],

answer:"tan 30°"
},

{
question: "यदि एक वृत्त का क्षेत्रफल 154 cm² है, तो इसकी परिधि है :",
option:["22 cm",
        "33 cm",
        "44 cm",
        "66 cm"],
answer:"44 cm"
},

{
question: "बिंदुओं A (4, 5) तथा B (6, 5) को मिलाने वाली रेखा का मध्यबिंदु है:",
option:["(5, 4)","(5, 5)","(4, 5)","(4, 3)"],
answer:"(5, 5)"
},

{
    question: "एक अशून्य परिमेय और अपरिमेय संख्या का गुणनफल क्या होगा?",
    option:["हमेशा परिमेय",
            "हमेशा अपरिमेय",
            "परिमेय और अपरिमेय दोनों",
            "कोई नहीं"],
    answer:"हमेशा अपरिमेय"
},

{
question: "(1 + tanθ + secθ)(1 + cotθ – cosecθ) बराबर है:",

option:["0",
        "1",
        "2",
        "-1"],

answer:"2"
},

{
question: "किसी वृत्त के बाह्य बिन्दु P से वृत्त पर दो स्पर्श रेखाएँ PA तथा PB खींची गई हैं। यदि PA = 6 cm हो, तो PB की लम्बाई होगी:",
option:["3 cm",
        "4 cm",
        "6 cm",
        "12 cm"],
answer:"6 cm"
},

{
question: "बिंदुओं A (3, 4) और B (-3, 8) को मिलाने वाले रेखाखंड के मध्यबिंदु के निर्देशांक हैं:",
option:["(0, 12)","(6, 0)","(6, -4)","(0, 6)"],
answer:"(0, 6)"
},

{
    question: "निम्नलिखित में कौन बहुपद नहीं है?",
    option:["-7",
            "y² + √2",
            "3√x + 2x + 7",
            "4x² – 3x + 7"],
    answer:"3√x + 2x + 7"
},

{
question: "2, 3, 4, 3, 5, 3, 1, 2, 3 का बहुलक निम्नलिखित में कौन है?",
option:["2",
        "3",
        "7",
        "4"],
answer:"3"
},

{
question: "tan15° · tan20° · tan70° · tan75° का मान होगा:",

option:["-1",
        "2",
        "0",
        "1"],

answer:"1"
},

{
question: "8 सेमी त्रिज्या वाले वृत्त पर दो समान्तर स्पर्श रेखाओं के बीच की दूरी क्या है?",
option:["12 सेमी",
        "14 सेमी",
        "16 सेमी",
        "18 सेमी"],
answer:"16 सेमी"
},

{
    question: "समान्तर श्रेणी 6, 13, 20, …..216 का मध्य पद है:",

    option:["118",
            "104",
            "111",
            "125"],

    answer:"111"
},

{
    question: "निम्नलिखित संख्याओं में परिमेय संख्या की पहचान करें:",
    option:["√10",
            "√5",
            "√3",
            "√25"],
    answer:"√25"
},

{
    question: "यदि बहुपद x² – kx + 8 के शून्यकों का योग 6 है, तो k का मान क्या होगा?",
    option:["8",
            "-8",
            "-6",
            "6"],
    answer:"6"
},

{
question: "यदि किसी घटना के घटने की प्रायिकता P है तो उसके नहीं होने की प्रायिकता होगी",

option:["p - 1",
        "1 - p",
        "p",
        "1 - 1/p"],

answer:"1 - p"
},

{
question: "यदि tan θ = 4/3 तब (sin θ + cos θ) = ?",

option:["7/3",
        "7/4",
        "7/5",
        "5/7"],

answer:"7/5"
},

{
question: "दो वृत्तों की परिधियों का अनुपात 3 : 4 है, तो उनके क्षेत्रफलों का अनुपात है :",
option:["4 : 3",
        "3 : 4",
        "16 : 9",
        "9 : 16"],
answer:"9 : 16"
},

{
question: "यदि समान्तर चतुर्भुज की सभी भुजाएँ एक वृत्त को स्पर्श करें, तो वह समान्तर चतुर्भुज कैसा है?",
option:["आयत",
        "वर्ग",
        "समलम्ब",
        "समचतुर्भुज"],
answer:"समचतुर्भुज"
},

{
    question: "यदि f(x) = 2x² + 6x – 6 का शून्यक α, β है, तो",
    option:["α + β = αβ",
            "α + β > αβ",
            "α + β < αβ",
            "α + β + αβ = 0"],
    answer:"α + β = αβ"
},

{
    question: "k के किस मान के लिए द्विघात समीकरण 9x² + 3kx + 4 = 0 के मूल समान हैं?",
    option:["±3",
            "±4",
            "±5",
            "9"],
    answer:"±4"
},

{
    question: "(7+3√2) क्या है?",
    option:["अपरिमेय संख्या",
            "परिमेय संख्या",
            "भिन्न संख्या",
            "पूर्णांक संख्या"],
    answer:"अपरिमेय संख्या"
},

{
question: "किसी त्रिभुज के तीनों लम्बों के मिलन बिन्दु को कहा जाता है:",
option:["अन्तःकेन्द्र",
        "बाह्य केन्द्र",
        "मध्य केन्द्र",
        "लम्ब केन्द्र"],
answer:"लम्ब केन्द्र"
},

{
    question: "समांतर श्रेणी 14, 9, 4, -1, -6, का nवाँ पद होगा:",

    option:["19 + 5n",
            "19 – 5n",
            "19 + n",
            "इनमें से कोई नहीं"],

    answer:"19 – 5n"
},

{
    question: "ΔABC में AB = 6√3 cm, AC = 12 cm और BC = 6 cm तो ∠B का मान है:",
    option:["60°",
            "90°",
            "70°",
            "50°"],
    answer:"90°"
},

{
    question: "बहुपद x² – 11 के शून्यक हैं",
    option:["11, -11",
            "-11, √11",
            "√11, √11",
            "√11, -√11"],
    answer:"√11, -√11"
},

{
question: "प्रथम 10 सम प्राकृतिक संख्याओं का माध्य है:",
option:["110",
        "100",
        "11",
        "10"],
answer:"11"
},

{
    question: "यदि h₁ तथा h₂ ऊँचाई के दो मीनारों के पादों को जोड़ने वाली रेखा के मध्य बिन्दु पर मीनारों द्वारा क्रमशः 60° तथा 30° का उन्नयन कोण बनाया जाता है, तो h₁ : h₂ है:",
    option:["3 : 1",
            "1 : 2",
            "√3 : 1",
            "1 : √3"],
    answer:"3 : 1"
},

{
question: "बिंदुओं A (0, 6), B (-5, 3) तथा C (3, 1) से बने त्रिभुज का प्रकार है:",
option:["समद्विबाहु","समबाहु","विषमबाहु","समकोण त्रिभुज नहीं"],
answer:"विषमबाहु"
},

{
    question: "यदि द्विघात समीकरण (b – c)x² + (c – a)x + (a – b) = 0 के मूल समान हों, तो a + c =",
    option:["b",
            "-b",
            "2b",
            "-2b"],
    answer:"2b"
},

{
    question: "त्रिभुज ABC में P, AB पर तथा Q, AC पर स्थित हैं और PQ || BC। यदि AP = 2 cm, PB = 6 cm तथा PQ = 3 cm है, तो BC (cm में) =",
    option:["8",
            "9",
            "10",
            "12"],
    answer:"9"
},

{
question: "सभी वृत्त हैं:",
option:["सर्वांगसम",
        "समरूप",
        "असमरूप",
        "इनमें से कोई नहीं"],
answer:"समरूप"
},

{
question: "निम्नलिखित में कौन-सा sec 60° के बराबर है?",

option:["cosec 30°",
        "cosec 60°",
        "cot 30°",
        "tan 60°"],

answer:"cosec 30°"
},

{
    question: "भाग एल्गोरिथ्म से p(x) = g(x) × q(x) + r(x), जहाँ g(x) ≠ 0 भाजक, तो निम्नलिखित में कौन सही है?",
    option:["r(x) का घात < q(x) का घात",
            "r(x) का घात < g(x) का घात",
            "q(x), p(x) का गुणनखंड अवश्य होगा",
            "p(x), g(x) का गुणनखंड होगा"],
    answer:"r(x) का घात < g(x) का घात"
},

{
question: "दो वृत्तों के क्षेत्रफल 4 : 9 के अनुपात में हैं, इनकी त्रिज्याओं का अनुपात होगा :",
option:["3 : 4",
        "2 : 3",
        "5 : 3",
        "इनमें कोई नहीं"],
answer:"2 : 3"
},

{
    question: "यदि दो समरूप त्रिभुजों के क्षेत्रफलों का अनुपात 25 : 64 है, तो उनके संगत भुजाओं का अनुपात होगा:",
    option:["25 : 64",
            "64 : 25",
            "5 : 8",
            "8 : 5"],
    answer:"5 : 8"
},

{
question: "निम्नलिखित वितरण में बहुलक वर्ग क्या है? वर्ग-अंतराल 0-10, 10-20, 20-30, 30-40, 40-50 की बारंबारताएँ क्रमशः 15, 20, 25, 15 और 45 हैं।",
option:["10-20",
        "20-30",
        "30-40",
        "40-50"],
answer:"40-50"
},

{
question: "बिंदु (4, -5) की दूरी मूल बिंदु से होगी:",
option:["√41","3","-3","√41"],
answer:"√41"
},

{
    question: "किसी मीनार की ऊँचाई 10 m है। जब सूर्य का उन्नयन कोण 45° हो, तो मीनार की छाया की लम्बाई क्या होगी?",
    option:["5 m",
            "8 m",
            "7 m",
            "10 m"],
    answer:"10 m"
},

{
question: "किसी वृत्त के बाह्य बिन्दु P से दो स्पर्श रेखाएँ PA एवं PB खींची गई हैं। यदि PA = 8 cm तो PB की लम्बाई क्या होगी?",
option:["4 cm",
        "16 cm",
        "12 cm",
        "8 cm"],
answer:"8 cm"
},

{
    question: "0 और 50 के बीच की विषम संख्याओं का योगफल होगा:",

    option:["50",
            "500",
            "625",
            "कोई नहीं"],

    answer:"625"
},

{
question: "एक शंकु का आयतन 1570 cm³ है। यदि इसके आधार का क्षेत्रफल 314 cm² है, तो उसकी ऊँचाई है:",
option:["10 cm",
        "15 cm",
        "18 cm",
        "20 cm"],
answer:"15 cm"
},

{
    question: "दो समरूप त्रिभुजों के क्षेत्रफलों का अनुपात 16 : 81 है। तो भुजाओं का अनुपात होगा:",
    option:["2 : 3",
            "3 : 6",
            "4 : 9",
            "7 : 9"],
    answer:"4 : 9"
},

{
question: "(sin18°)/(cos72°) का मान होगा:",

option:["1/2",
        "1",
        "√3/2",
        "0"],

answer:"1"
},

{
    question: "द्विघात समीकरण ax² + bx + c = 0 के मूल वास्तविक एवं समान हों तो मूल होगा:",
    option:["b/2a",
            "-c/a",
            "-b/2a",
            "-2b/a"],
    answer:"-b/2a"
},

{
question: "एक रेखा जो वृत्त को दो भिन्न बिन्दुओं पर प्रतिच्छेद करती है, कहलाती है:",
option:["जीवा",
        "स्पर्श रेखा",
        "(a) और (b) दोनों",
        "इनमें से कोई नहीं"],
answer:"इनमें से कोई नहीं"
},

{
    question: "निम्न में से कौन बहुपद नहीं है?",
    option:["√5x² – 3√2x + 4",
            "1/4x³ + 3x² + 1/√3x + 2",
            "x + 1/x",
            "3x² – 4x + √5"],
    answer:"x + 1/x"
},

{
question: "सरल रेखाएँ x = -1 तथा y = +4 से निरूपित की जाती हैं:",
option:["एक-दूसरे के लम्बवत हैं","एक-दूसरे के समानान्तर हैं","न तो एक-दूसरे के समानान्तर हैं न लम्बवत हैं","कोई निष्कर्ष नहीं कहा जा सकता"],
answer:"एक-दूसरे के लम्बवत हैं"
},

{
question: "p, q, r का गणितीय माध्य निम्नलिखित में से कौन-सा होगा?",
option:["p+q+r",
        "pqr/3",
        "q",
        "(p+q+r)/3"],
answer:"(p+q+r)/3"
},

{
    question: "π/3 क्या है?",
    option:["अपरिमेय संख्या",
            "परिमेय संख्या",
            "दोनों",
            "इनमें से कोई नहीं"],
    answer:"अपरिमेय संख्या"
},

{
question: "R त्रिज्या वाले वृत्त में θ° कोण वाले त्रिज्यखंड के संगत चाप की लंबाई होगी :",
option:["2πrθ/180",
        "2πRθ/360",
        "2πR²θ/180",
        "2πR²θ/360"],
answer:"2πRθ/360"
},

{
    question: "त्रिघात बहुपद का सबसे व्यापक रूप है।",
    option:["ax² + bx + c",
            "2ax⁴ + bx³ + c",
            "ax³ + bx² + cx + d",
            "ax² + bx² + c"],
    answer:"ax³ + bx² + cx + d"
},

{
question: "एक ठोस घन जिसकी एक किनारे की लंबाई 14 सेमी है, उसमें से अधिकतम आयतन का गोला काटा जाता है। गोले का आयतन लगभग है:",
option:["359 सेमी³",
        "1437 सेमी³",
        "2874 सेमी³",
        "इनमें से कोई नहीं"],
answer:"1437 सेमी³"
},

{
    question: "यदि रैखिक समीकरणों के आलेख एक बिन्दु पर काटें तो समीकरण निकाय निम्नांकित में से किस प्रकार का होगा?",
    option:["विरोधी",
            "आश्रित",
            "अविरोधी",
            "इनमें कोई नहीं"],
    answer:"अविरोधी"
},

{
question: "दो पासों को एक साथ फेंकने पर दोनों पर समान संख्या पाने की प्रायिकता क्या होगी ?",

option:["1/3",
        "1/6",
        "5/12",
        "2/3"],

answer:"1/6"
},

{
question: "8 cm त्रिज्या वाले वृत्त में अंतःस्थित वर्ग का क्षेत्रफल है :",
option:["64 cm²",
        "100 cm²",
        "125 cm²",
        "128 cm²"],
answer:"128 cm²"
},

{
    question: "ΔABC और ΔDEF समरूप हैं एवं क्षेत्रफल ΔABC = 36 सेमी² तथा क्षेत्रफल ΔDEF = 49 सेमी² है, तो दोनों त्रिभुजों की संगत भुजाओं का अनुपात होगा:",
    option:["36 : 49",
            "6 : 7",
            "7 : 6",
            "√6 : √7"],
    answer:"6 : 7"
},

{
question: "tan²θ – sec²θ का मान किसके बराबर है:",

option:["1",
        "0",
        "2",
        "-1"],

answer:"-1"
},

{
question: "सरल रेखा x = -2 तथा y = 3 का कटान बिंदु है:",
option:["(-2, 3)","(2, -3)","(3, -2)","(-3, 2)"],
answer:"(-2, 3)"
},

{
    question: "किसी पूर्णांक m के लिए सम संख्या का रूप है-",
    option:["2m",
            "m",
            "m/2",
            "2m/3"],
    answer:"2m"
},

{
    question: "बहुपद x² – 5x + 6 के शून्यकों का योग है:",
    option:["1",
            "2",
            "3",
            "5"],
    answer:"5"
},

{
question: "किसी वृत्त में केन्द्रीय कोण 90° वाला त्रिज्यखंड काट लिया जाए तो वृत्त और कटे हुए भाग के क्षेत्रफल का अनुपात क्या होगा?",
option:["1 : 4",
        "4 : 1",
        "2 : 3",
        "3 : 2"],
answer:"4 : 1"
},

{
question: "sec(90° – A) किसके बराबर है?",

option:["cosec A",
        "tan A",
        "cot A",
        "sin A"],

answer:"cosec A"
},

{
    question: "निम्नलिखित में से किसका दशमलव प्रसार असांत है?",
    option:["23/50",
            "13/625",
            "39/243",
            "25/1600"],
    answer:"39/243"
},

{
question: "एक वृत्त पर कितनी स्पर्श रेखाएँ खींची जा सकती हैं?",
option:["1",
        "2",
        "3",
        "अनन्त"],
answer:"अनन्त"
},

{
question: "12 सेमी व्यास के एक गोले द्वारा विस्थापित हवा का आयतन (सेमी³ में) क्या है:",
option:["144",
        "144π",
        "288",
        "288π"],
answer:"288π"
},

{
    question: "समद्विबाहु ΔABC में, यदि AC = BC और AB² = 2AC² तब ∠C = ?",
    option:["30°",
            "45°",
            "60°",
            "90°"],
    answer:"90°"
},

{
question: "दो सिक्के उछालने में दो पट पाने की प्रायिकता है:",

option:["1/3",
        "1/2",
        "1/8",
        "1/4"],

answer:"1/4"
},

{
    question: "समांतर श्रेणी 2, 7, 12, 17,….. के लिए a₃₀ – a₂₀ का मान है? (जहाँ aₙ समांतर श्रेणी का nवाँ पद है)",

    option:["100",
            "10",
            "50",
            "20"],

    answer:"50"
},

{
    question: "समीकरण निकाय 5x – 3y + 2 = 0 और 6x + y – 2 = 0 का किस प्रकार का हल सम्भव है?",
    option:["वास्तविक एवं अद्वितीय",
            "हल संभव नहीं",
            "अनेक हल",
            "इनमें कोई नहीं"],
    answer:"वास्तविक एवं अद्वितीय"
},

{
question: "यदि 1, 4, x, 5 तथा 12 का माध्य 7 है, तो x का मान है:",
option:["6",
        "8",
        "13",
        "9"],
answer:"13"
},

{
    question: "यदि द्विघात समीकरण 9x² + 6kx + 4 = 0 के मूल वास्तविक एवं समान हों तो k का मान होगा:",
    option:["2 या 0",
            "-2 या 0",
            "2 या -2",
            "केवल 0"],
    answer:"2 या -2"
},

{
    question: "एक 6 मीटर ऊँचे खम्भे की छाया पृथ्वी पर 2√3 मीटर लम्बी है, तो सूर्य का उन्नयन कोण है :",
    option:["60°",
            "45°",
            "30°",
            "15°"],
    answer:"60°"
},

{
    question: "निम्नलिखित में से कौन सी संख्या अपरिमेय संख्या है?",
    option:["√23",
            "√64",
            "√9",
            "√1+√25"],
    answer:"√23"
},

{
    question: "ΔABC तथा ΔDEF समरूप हैं। दोनों का क्षेत्रफल क्रमशः 9 तथा 16 वर्ग सेमी है। यदि EF = 4.2 सेमी तो BC (सेमी में) =",
    option:["4.2",
            "3.15",
            "4.7",
            "5.152"],
    answer:"3.15"
},

{
    question: "समांतर श्रेणी 25, 20, 15, …… का कौन-सा पद प्रथम ऋणात्मक पद है?",

    option:["6वाँ",
            "7वाँ",
            "8वाँ",
            "9वाँ"],

    answer:"7वाँ"
},

{
    question: "यदि सूरज के किरण का झुकाव 45° से 60° बढ़ता है, तो एक मीनार की छाया की लम्बाई 50 मीटर घट जाती है। मीनार की ऊँचाई (मीटर में) है :",
    option:["50(√3–1)",
            "75(3-√3)",
            "100(√3+1)",
            "25(3+√3)"],
    answer:"25(3+√3)"
},

{
    question: "दो रैखिक समीकरणों के आलेख समान्तर रेखाएँ हैं, तब रैखिक समीकरण युग्म का:",
    option:["कोई हल नहीं हैं",
            "एक हल है",
            "दो हल है",
            "अनगिनत हल है"],
    answer:"कोई हल नहीं हैं"
},

{
    question: "दो समानांतर रेखाएँ l और m को एक तिर्यक रेखा काटती है। यदि संगत कोण 3a + 60° और 4a + 40° हैं, तो a का मान होगा:",
    option:["32°",
            "72°",
            "20°",
            "16°"],
    answer:"20°"
},

{
question: "किसी वृत्त पर बाह्य बिन्दु से खींची गई स्पर्श रेखाओं की संख्या होगी:",
option:["1",
        "2",
        "3",
        "4"],
answer:"2"
},

{
question: "समान ऊँचाई वाले दो समबेलन के आयतनों का अनुपात 9 : 16 है, तो उनके वक्र पृष्ठों के क्षेत्रफलों का अनुपात है:",
option:["9 : 16",
        "16 : 9",
        "3 : 4",
        "4 : 3"],
answer:"3 : 4"
},

{
question: "चर मान 5, 3, 8, 2, 4 की माध्यिका कौन है?",
option:["4",
        "3",
        "6",
        "8"],
answer:"4"
},

{
    question: "तीन संख्याएँ A.P. में हैं तथा उनका योग 24 है। उनके वर्गों का योग 20 है, तो वे संख्याएँ हैं:",

    option:["4, 8, 12",
            "6, 8, 10",
            "5, 8, 11",
            "2, 8, 14"],

    answer:"6, 8, 10"
},

{
    question: "5005 के कितने अभाज्य गुणनखंड हैं?",
    option:["505",
            "101",
            "55",
            "4"],
    answer:"4"
},

{
question: "यदि एक वृत्त की परिमाप और क्षेत्रफल संख्यात्मक रूप से बराबर है, तो उस वृत्त की त्रिज्या है :",
option:["2 मात्रक",
        "π मात्रक",
        "4 मात्रक",
        "7 मात्रक"],
answer:"2 मात्रक"
},

{
question: "एक बेलन जिसकी आधार की त्रिज्या 40 cm एवं ऊँचाई 20 cm है, तो इसके सम्पूर्ण पृष्ठीय क्षेत्रफल एवं वक्र पृष्ठ के क्षेत्रफल का अनुपात होगा:",
option:["2 : 1",
        "3 : 1",
        "4 : 1",
        "5 : 1"],
answer:"3 : 1"
},

{
question: "यदि √3 cosecθ = 2 हो, तो θ का मान होगा:",

option:["60°",
        "45°",
        "30°",
        "0°"],

answer:"60°"
},

{
    question: "यदि x = √7 + 4√3 तो x + 1/x =",
    option:["4",
            "3",
            "2",
            "6"],
    answer:"कोई विकल्प सही नहीं है"
},

{
question: "ठीक 4:24 अपराह्न पर घंटे की सुई दोपहर के बाद कितने डिग्री घूम जा चुकी होगी?",
option:["135°",
        "134°",
        "133°",
        "132°"],
answer:"132°"
},

{
    question: "पाइथागोरस प्रमेय का सम्बन्ध है:",
    option:["समकोण त्रिभुज से",
            "समरूप त्रिभुज से",
            "समचतुर्भुज से",
            "इनमें कोई नहीं"],
    answer:"समकोण त्रिभुज से"
},

{
    question: "यदि बहुपद p(x) का एक गुणनखंड (x + 1) हो तो, बहुपद p(x) का एक शून्यक होगा।",
    option:["-1",
            "1",
            "0",
            "इनमें से कोई नहीं"],
    answer:"-1"
},

{
question: "tan 1° · tan 2° · tan 3° … tan 89° =",

option:["0",
        "1",
        "1/2",
        "2"],

answer:"1"
},

{
question: "यदि किसी घन के विकर्ण की लंबाई 6√3 cm है, तो इसके सम्पूर्ण पृष्ठ का क्षेत्रफल होगा:",
option:["144 cm²",
        "216 cm²",
        "180 cm²",
        "108 cm²"],
answer:"216 cm²"
},

{
question: "एक लॉटरी में 8 पुरस्कार हैं और 16 खाली हैं। एक पुरस्कार पाने की प्रायिकता क्या है ?",

option:["2/3",
        "1/3",
        "1/2",
        "1/4"],

answer:"1/3"
},

{
    question: "यदि ax² + bx + c = 0 के मूल समान हों तो निम्नलिखित में से कौन सत्य है?",
    option:["b² = ±4ac",
            "b² = 4ac",
            "b² = 4c",
            "b² = 4a"],
    answer:"b² = 4ac"
},

{
question: "यदि 4 tan θ = 4 तो θ का मान है:",

option:["0°",
        "30°",
        "45°",
        "60°"],

answer:"45°"
},

{
    question: "बहुपद p(x) का एक शून्यक 4 हो, तो p(x) निम्नलिखित में से किससे अवश्य विभाज्य होगा?",
    option:["x + 4",
            "4x²",
            "4x",
            "x – 4"],
    answer:"x – 4"
},

{
question: "त्रिभुज ABC के अन्तर्गत एक वृत्त है जो AB, BC तथा CA को क्रमशः P, Q और R पर स्पर्श करता है। यदि AP = 4 cm, BP = 6 cm तथा AC = 12 cm है और BC = x cm, तो x का मान है:",
option:["10 cm",
        "6 cm",
        "14 cm",
        "18 cm"],
answer:"14 cm"
},

{
    question: "k के किस मान के लिए समीकरण निकाय x + 2y = 3 तथा 5x + ky = 15 के अनन्त हल है:",
    option:["5",
            "10",
            "6",
            "2"],
    answer:"10"
},

{
    question: "समांतर श्रेणी 21, 42, 63, 84…….. का कौन-सा पद 210 है?",

    option:["9वाँ",
            "10वाँ",
            "11वाँ",
            "12वाँ"],

    answer:"10वाँ"
},

{
    question: "अगर ax³ + bx² + cx + d त्रिघाती बहुपद का एक शून्यक शून्य है, तो इसके दो अन्य शून्यकों का गुणनफल है।",
    option:["-c/a",
            "c/a",
            "0",
            "-b/a"],
    answer:"c/a"
},

{
question: "बिंदु (2√3, -√2) किस पाद में स्थित है?",
option:["प्रथम पाद","द्वितीय पाद","तृतीय पाद","चतुर्थ पाद"],
answer:"चतुर्थ पाद"
},

{
question: "एक वृत्ताकार पथ पर तीन धावक एक ही स्थान से दौड़ना शुरू करते हैं। एक चक्कर लगाने में क्रमशः 1 घंटा, 3 घंटे और 5 घंटे लगते हैं, तो तीनों को प्रस्थान बिंदु पर फिर मिलने में कितना समय लगेगा?",
option:["3 घंटे",
        "5 घंटे",
        "1 घंटा",
        "15 घंटे"],
answer:"15 घंटे"
},

{
    question: "k के किस मान के लिए समीकरण 3x – y = -16 तथा 6x - ky = -16 संपाती रेखाओं को प्रदर्शित करता है?",
    option:["2",
            "-2",
            "1/2",
            "-1/2"],
    answer:"2"
},

{
question: "घनाभ के किनारों की लंबाई क्रमशः 3 cm, 4 cm और 12 cm है, तो घनाभ के विकर्ण की लंबाई है:",
option:["12 cm",
        "13 cm",
        "14 cm",
        "15 cm"],
answer:"13 cm"
},

{
question: "cos π/3 का मान होगा:",

option:["1/2",
        "1/√3",
        "√3/2",
        "√3"],

answer:"1/2"
},

{
question: "निम्नलिखित में कौन केन्द्रीय प्रवृत्ति की माप नहीं है?",
option:["माध्य",
        "बहुलक",
        "माध्यक",
        "मानक विचलन"],
answer:"मानक विचलन"
},

{
question: "यदि एक वृत्त की परिधि 2π से बढ़ाकर 4π कर दी जाए, तो उसका क्षेत्रफल होगा :",
option:["आधा",
        "दुगुना",
        "तीन गुना",
        "चार गुना"],
answer:"चार गुना"
},

{
    question: "द्विघात बहुपद y² + 3y + 2 के शून्यकों का योग होगा:",
    option:["2",
            "-2",
            "3",
            "-3"],
    answer:"-3"
},

{
    question: "त्रिभुज PQR में यदि PQ² = PR² + RQ² तो त्रिभुज का कौन-सा कोण समकोण होगा?",
    option:["∠P",
            "∠Q",
            "∠R",
            "इनमें से कोई नहीं"],
    answer:"∠R"
},

{
question: "निम्नलिखित में से कौन-सी संख्या, एक घटना की प्रायिकता नहीं हो सकती है?",

option:["2/3",
        "-0.5",
        "0.7",
        "15%"],

answer:"-0.5"
},

{
question: "sec θ = ?",

option:["cos θ/sin θ",
        "1/cos θ",
        "1/sin θ",
        "sin θ/cos θ"],

answer:"1/cos θ"
},

{
question: "'r' त्रिज्या वाले गोला का आयतन होगा:",
option:["4/3 πr³ घन इकाई",
        "1/3 πr³ घन इकाई",
        "2/3 πr³ घन इकाई",
        "3/4 πr³ घन इकाई"],
answer:"4/3 πr³ घन इकाई"
},

{
    question: "दो संख्याओं a और b का LCM 39 है तथा a + b = 42 है, तो a और b का मान क्या होगा?",
    option:["15",
            "39",
            "33",
            "29"],
    answer:"29"
},

{
question: "'a' का मान, जिसके लिए बिंदु (a, 2a), (3, 1) और (-2, 6) संरेख हैं, क्या होगा?",
option:["4/3","3/4","-4/3","-3/4"],
answer:"4/3"
},

{
question: "O वृत्त का केन्द्र है तथा ∠BAC = 60° है, तो ∠OBC का मान होगा:",
option:["120°",
        "60°",
        "40°",
        "30°"],
answer:"120°"
},

{
question: "52 ताशों की एक गड्डी को अच्छी तरह फेंटकर, उसमें से यादृच्छया एक पत्ता निकाला जाता है। इसके काले रंग का बादशाह होने की प्रायिकता कितनी है ?",

option:["1/13",
        "1/26",
        "1/52",
        "3/39"],

answer:"1/26"
},

{
    question: "ΔABC में DE || BC एवं AD/DB = 3/5। यदि AE = 1.8 cm, तो AC बराबर है:",
    option:["2 cm",
            "2.5 cm",
            "4.8 cm",
            "3 cm"],
    answer:"4.8 cm"
},

{
question: "r त्रिज्या वाले बेलन के वक्र पृष्ठ का क्षेत्रफल होगा:",
option:["2rh",
        "3πrh",
        "2πrh",
        "πrh"],
answer:"2πrh"
},

{
question: "sin30° का मान है:",

option:["1",
        "1/2",
        "3",
        "√3/2"],

answer:"1/2"
},

{
    question: "1, 5, 9, 13, 17, 21, 25 ….. समान्तर श्रेणी में हैं, तो पदान्तर का मान होगा:",

    option:["1",
            "2",
            "3",
            "4"],

    answer:"4"
},

{
    question: "यदि द्विघात बहुपद x² – 2x + 5 = 0 के मूल α, β हों, तो α + β का मान क्या होगा?",
    option:["-2",
            "2",
            "5",
            "-5"],
    answer:"2"
},

{
question: "बिंदु (4, 3) किस पाद में है?",
option:["प्रथम पाद","द्वितीय पाद","तृतीय पाद","चतुर्थ पाद"],
answer:"प्रथम पाद"
},

{
question: "(1 – tan²45°)/(1 + tan²45°) =",

option:["tan90°",
        "1",
        "sin45°",
        "0"],

answer:"0"
},

{
    question: "K के किस मान के लिए समीकरण x + 2y = 7 तथा 2x + Ky = 14 संपाती होगा?",
    option:["2",
            "3",
            "4",
            "इनमें कोई नहीं"],
    answer:"4"
},

{
    question: "11/15 का दशमलव प्रसार क्या है?",
    option:["असांत",
            "सांत",
            "दोनों",
            "इनमें से कोई नहीं"],
    answer:"असांत"
},

{
question: "इस पासे (जिस पर A, B, C, D, E, F अंकित है) को एक बार फेंका जाता है, तो A प्राप्त होने की क्या प्रायिकता है ?",

option:["1/6",
        "3/5",
        "1/3",
        "कोई नहीं"],

answer:"1/6"
},

{
question: "sin(90° – θ) =",

option:["sin θ",
        "-sin θ",
        "cos θ",
        "-cos θ"],

answer:"cos θ"
},

{
    question: "यदि द्विघात समीकरण x² – px + 4 = 0 के मूल बराबर हों तो p = ?",
    option:["±3",
            "±4",
            "±5",
            "±2"],
    answer:"±4"
},

{
question: "बिंदुओं (5, 12) और (9, 9) के बीच की दूरी है:",
option:["4","5","6","8"],
answer:"5"
},

{
question: "संख्याओं 1, 2, 3, …, n का माध्य है:",
option:["n(n+1)/2",
        "n/2",
        "(n+1)/2",
        "कोई नहीं"],
answer:"(n+1)/2"
},

{
    question: "6x² – 7x – 3 के शून्यक होंगे:",
    option:["3/2, -1/3",
            "–3/2, 1/3",
            "3/2, 1/3",
            "–3/2, -1/3"],
    answer:"3/2, -1/3"
},

{
question: "1 + tan²θ का मान है?",

option:["sec²θ",
        "cos²θ",
        "tan²θ",
        "cot²θ"],

answer:"sec²θ"
},

{
    question: "समान्तर श्रेणी 2, 6, 10, 14, ……….. का कौन-सा पद 82 है?",

    option:["15वाँ",
            "20वाँ",
            "21वाँ",
            "22वाँ"],

    answer:"21वाँ"
},

{
    question: "द्विघात समीकरण x² + 5x + 4 = 0 का विविक्तकर निम्नलिखित में कौन है?",
    option:["4",
            "7",
            "9",
            "10"],
    answer:"9"
},

{
    question: "एक रैखिक समीकरण युग्म, जिसका कोई हल नहीं होता, क्या कहलाता है?",
    option:["विरोधी",
            "अविरोधी",
            "दोनों",
            "इनमें से कोई नहीं"],
    answer:"विरोधी"
},

{
question: "sec²60° – 1 का मान है:",

option:["2",
        "3",
        "4",
        "0"],

answer:"3"
},

{
question: "बिंदु P (-6, 8) की दूरी मूल बिंदु से है:",
option:["8 इकाई","2√7 इकाई","6 इकाई","10 इकाई"],
answer:"10 इकाई"
},

{
    question: "यदि α एवं β द्विघात बहुपद x² – 3x + 5 के शून्यक हों, तो (α + β) का मान क्या होगा?",
    option:["3",
            "5",
            "-3",
            "-5"],
    answer:"3"
},

{
question: "यदि O केन्द्र वाले वृत्त में TA तथा TB दो स्पर्श रेखाएँ इस तरह हैं कि ∠ATB = 70° तो ∠AOB का मान होगा:",
option:["90°",
        "110°",
        "70°",
        "140°"],
answer:"110°"
},

{
question: "कोण θ वाले त्रिज्यखंड का क्षेत्रफल होगा :",
option:["θ/270 × πr³",
        "π/360 × πr",
        "θ/270 × πr²",
        "θ/360 × πr²"],
answer:"θ/360 × πr²"
},

{
    question: "यदि एक उदग्र खंभे की ऊँचाई तथा उसकी भूमि पर छाया की लम्बाई समान हैं, तो सूर्य का उन्नयन कोण है :",
    option:["0°",
            "30°",
            "45°",
            "60°"],
    answer:"45°"
},

{
question: "x-अक्ष का समीकरण है:",
option:["x = 0","y = 0","x = y","इनमें से कोई नहीं"],
answer:"y = 0"
},

{
    question: "संख्या रेखा पर प्रत्येक बिंदु क्या प्रदर्शित करता है?",
    option:["एक परिमेय संख्या",
            "एक अपरिमेय संख्या",
            "एक प्राकृत संख्या",
            "एक वास्तविक संख्या"],
    answer:"एक वास्तविक संख्या"
},

{
    question: "समांतर श्रेणी -10, -6, –2, 2,…. का सार्व अंतर है:",

    option:["-4",
            "4",
            "2",
            "इनमें से कोई नहीं"],

    answer:"4"
},

{
    question: "यदि समीकरण 3x² – 10x + 3 = 0 का एक मूल 1/3 है तो दूसरा मूल होगा:",
    option:["-1/3",
            "1/3",
            "-3",
            "3"],
    answer:"3"
},

{
question: "P (-4, 2) और Q (8, 6) को मिलाने वाले रेखाखंड के मध्य बिंदु के निर्देशांक हैं:",
option:["(3, 1)","(1, 3)","(2, 4)","(4, 2)"],
answer:"(2, 4)"
},

{
question: "यदि 3, 4, 5, 17 तथा x का माध्य 6 हो, तो x का मान है :",
option:["1",
        "2",
        "3",
        "4"],
answer:"1"
},

{
    question: "x² + 2x + 1 के शून्यक हैं:",
    option:["1, 1",
            "-1, -1",
            "2, 2",
            "-2, -2"],
    answer:"-1, -1"
},

{
    question: "A.P. 10, 7, 4, … का 30वाँ पद है:",

    option:["75",
            "-77",
            "55",
            "67"],

    answer:"-77"
},

{
question: "मूल बिंदु से बिंदु P (-a, -b) की दूरी है:",
option:["√(a² + b²) इकाई","√(a² - b²) इकाई","(a² + b²) इकाई","(a + b) इकाई"],
answer:"√(a² + b²) इकाई"
},

{
question: "sin(π/4) – cos(π/4) का मान होगा:",

option:["2",
        "0",
        "-1",
        "1"],

answer:"0"
},

{
question: "यदि किसी वृत्त की दो समान्तर स्पर्श रेखाओं के बीच की दूरी 12 सेमी है, तो वृत्त की त्रिज्या क्या है?",
option:["2 सेमी",
        "4 सेमी",
        "6 सेमी",
        "8 सेमी"],
answer:"6 सेमी"
},

{
    question: "यदि द्विघात समीकरण ax² + bx = c, (a ≠ 0) के मूल α और β हों, तो α + β का मान होगा:",
    option:["-b/a",
            "b/a",
            "-a/b",
            "-c/a"],
    answer:"-b/a"
},

{
question: "निम्न में से किसी घटना की प्रायिकता नहीं होती है।",

option:["-5",
        "0",
        "1",
        "1/4"],

answer:"-5"
},

{
question: "(cos60° + 1)/(cos60° – 1) का मान निम्नलिखित में कौन होगा?",

option:["-2",
        "-3",
        "3",
        "2"],

answer:"-3"
},

{
    question: "यदि समीकरण x + 2y = 3 तथा 3x + ky = 1 का एक अद्वितीय हल हो, तो:",
    option:["k = –6",
            "k ≠ -6",
            "k = 0",
            "k ≠ 0"],
    answer:"k ≠ -6"
},

{
question: "70, 80, 50, 600, 70, 40, 50, 90, 50, 30 का बहुलक होगा :",
option:["70",
        "50",
        "40",
        "इनमें से कोई नहीं"],
answer:"50"
},

{
question: "यदि एक वृत्त की परिधि 132 cm है, तो इसकी त्रिज्या है :",
option:["66 cm",
        "7 cm",
        "42 cm",
        "21 cm"],
answer:"21 cm"
},

{
    question: "2 – x² + x³ में x² का गुणांक है:",
    option:["0",
            "-1",
            "2",
            "3"],
    answer:"-1"
},

{
    question: "यदि ΔABC ∼ ΔPQR, ∠A = 47°, ∠Q = 73° तब ∠C =",
    option:["50°",
            "73°",
            "60°",
            "इनमें कोई नहीं"],
    answer:"60°"
},

{
question: "ΔABC एक समकोण त्रिभुज है जिसमें ∠C = 90° है तो cos(A + B) का मान है:",

option:["0",
        "1",
        "1/2",
        "√3/2"],

answer:"0"
},

{
question: "बिंदु (2, 3) एवं (4, 1) के बीच की दूरी होगी:",
option:["2√2 इकाई","2√13 इकाई","2√10 इकाई","4√2 इकाई"],
answer:"2√2 इकाई"
},

{
    question: "निम्नलिखित में से कौन परिमेय संख्या है?",
    option:["√5",
            "√7",
            "√9",
            "√11"],
    answer:"√9"
},

{
    question: "यदि 4/5, a, 2 किसी A.P. के तीन क्रमागत पद हैं तो a का मान होगा:",

    option:["1/2",
            "4/5",
            "7/5",
            "9/4"],

    answer:"7/5"
},

{
question: "(sin61°)/(sin29°) का मान होगा:",

option:["cot61°",
        "tan61°",
        "0",
        "tan29°"],

answer:"tan61°"
},

{
question: "यदि TP और TQ, केन्द्र O वाले किसी वृत्त की स्पर्श रेखाएँ हैं तथा ∠POQ = 110°, तो ∠PTQ बराबर है:",
option:["60°",
        "70°",
        "80°",
        "90°"],
answer:"70°"
},

{
question: "दो बेलनों की त्रिज्याओं का अनुपात 1 : 2 है तथा उनकी ऊँचाइयों का अनुपात 5 : 3 है, तो उनके आयतनों का अनुपात है:",
option:["4 : 9",
        "11 : 12",
        "5 : 12",
        "20 : 9"],
answer:"5 : 12"
},

{
    question: "k के किस मान के लिए समीकरण kx² + 4x + 1 = 0 के मूल वास्तविक तथा असमान हैं?",
    option:["k < 4",
            "k > 4",
            "k = 4",
            "k ≥ 4"],
    answer:"k < 4"
},

{
    question: "समान्तर श्रेणी 1, 4, 7, 10,….. का कौन-सा पद 88 है?",

    option:["26",
            "27",
            "30",
            "35"],

    answer:"30"
},

{
question: "बिंदु (-4, 3) की स्थिति किस पाद में है?",
option:["प्रथम पाद","द्वितीय पाद","तृतीय पाद","चतुर्थ पाद"],
answer:"द्वितीय पाद"
},

{
    question: "32 का अभाज्य गुणनखंड ज्ञात करें:",
    option:["2⁶",
            "2⁵",
            "2⁴",
            "2¹⁶"],
    answer:"2⁵"
},

{
question: "20 टिकटों, जिन पर क्रमशः संख्याएँ 1, 2, 3, …, 20 लिखी हैं, में से यादृच्छया एक टिकट निकाला जाता है। टिकट पर 5 के गुणज की संख्या होने की प्रायिकता क्या है ?",

option:["1/4",
        "1/5",
        "2/5",
        "3/5"],

answer:"1/5"
},

{
question: "cos⁴A – sin⁴A =",

option:["2cos²A + 1",
        "2cos²A – 1",
        "2sin²A – 1",
        "2sin²A + 1"],

answer:"2cos²A – 1"
},

{
    question: "एक द्विघात बहुपद लिखें जिसके शून्यक 2 और -6 हैं:",
    option:["x² + 4x + 12",
            "3x² + 4x – 12",
            "x² – 4x + 12",
            "x² – 4x – 12"],
    answer:"x² + 4x – 12"
},

{
    question: "5, 15 और 20 के LCM और HCF का अनुपात क्या होगा?",
    option:["12:1",
            "12:2",
            "2:12",
            "1:12"],
    answer:"12:1"
},

{
question: "प्रथम पाँच पूर्ण संख्याओं का माध्य कौन होगा?",
option:["3",
        "2",
        "25",
        "4"],
answer:"2"
},

{
    question: "A.P. 21, 18, 15, … का कौन-सा पद शून्य है?",

    option:["7वाँ",
            "8वाँ",
            "9वाँ",
            "10वाँ"],

    answer:"8वाँ"
},

{
question: "cosec(90° – θ) sin(90° – θ) किसके बराबर है?",

option:["1",
        "-1",
        "0",
        "1/2"],

answer:"1"
},

{
    question: "त्रिभुज ABC में AB² = BC² + CA² तो ∠C = ?",
    option:["30°",
            "90°",
            "45°",
            "60°"],
    answer:"90°"
},

{
    question: "दो लगातार संख्याओं का HCF क्या होता है?",
    option:["1",
            "2",
            "4",
            "8"],
    answer:"1"
},

{
question: "सूत्र [(m₁x₂ + m₂x₁)/(m₁ + m₂), (m₁y₂ + m₂y₁)/(m₁ + m₂)] को क्या कहा जाता है?",
option:["अन्तः विभाजन सूत्र","बाह्य विभाजन सूत्र","(A) एवं (B) दोनों","इनमें से कोई नहीं"],
answer:"अन्तः विभाजन सूत्र"
},

{
    question: "निम्नलिखित में से किस समीकरण का एक मूल 2 है?",
    option:["x² – 4x – 21 = 0",
            "x² – 4x + 5 = 0",
            "x² – 2x + 1 = 0",
            "2x² – 7x + 6 = 0"],
    answer:"2x² – 7x + 6 = 0"
},

{
question: "6 सेमी भुजा वाले घन में 2 सेमी भुजा वाले कितने घन बनाए जा सकते हैं?",
option:["56",
        "54",
        "28",
        "27"],
answer:"27"
},

{
    question: "बहुपद 2x² + 5x – 12 के शून्यक हैं",
    option:["4, 3/2",
            "-4, 3/2",
            "-3/2, 4/3",
            "-3, 4"],
    answer:"-4, 3/2"
},

{
question: "यदि cosec θ = 17/8 तो tan θ =",

option:["8/17",
        "8/15",
        "15/8",
        "15/17"],

answer:"8/15"
},

{
question: "प्रथम पाँच प्राकृतिक संख्याओं का माध्य निम्नलिखित में कौन है?",
option:["5",
        "3",
        "15",
        "5√3"],
answer:"3"
},

{
question: "बिंदु A (0, -2), B (3, 1), C (0, 4) तथा D (-3, 1) शीर्ष हैं, एक:",
option:["समान्तर चतुर्भुज के","आयत के","वर्ग के","समचतुर्भुज के"],
answer:"वर्ग के"
},

{
    question: "x² – 2x – 3 बहुपद के शून्यक कौन-से हैं?",
    option:["3, 1",
            "3, -1",
            "1, -3",
            "-3, -1"],
    answer:"3, -1"
},

{
question: "एक वृत्त के बाहर बिन्दु P से दो छेदक रेखाएँ P-A-B तथा P-D-C खींची गई हैं। यदि PA = 8 सेमी, PD = 4 सेमी तथा DC = 3 सेमी है, तो AB की लम्बाई है:",
option:["3 सेमी",
        "3.5 सेमी",
        "4 सेमी",
        "4.5 सेमी"],
answer:"4.5 सेमी"
},

{
question: "यदि एक घनाभ की लंबाई, चौड़ाई एवं ऊँचाई क्रमशः 10 cm, 8 cm और 6 cm हैं, तो इसका विकर्ण होगा:",
option:["10√2 cm",
        "15√2 cm",
        "15√2 cm",
        "8√2 cm"],
answer:"10√2 cm"
},

{
question: "मूल बिंदु से बिंदु A (4, -3) की दूरी क्या है?",
option:["1 इकाई","7 इकाई","5 इकाई","3 इकाई"],
answer:"5 इकाई"
},

{
    question: "बहुपद x² – 9x + a के मूलों का गुणनफल 8 है, तो a का मान है:",
    option:["9",
            "-9",
            "8",
            "-8"],
    answer:"8"
},

{
    question: "त्रिभुज EFG में L, EF पर तथा M, EG पर स्थित हैं और LM || FG। यदि FL = 7.2 सेमी, EM = 1.8 सेमी तथा MG = 5.4 सेमी है, तो LE =",
    option:["1.8 सेमी",
            "2.4 सेमी",
            "3.4 सेमी",
            "4 सेमी"],
    answer:"2.4 सेमी"
},

{
question: "यदि 2 cos 3θ = 1, तो θ बराबर है:",

option:["10°",
        "30°",
        "15°",
        "20°"],

answer:"20°"
},

{
question: "ऑकड़े 5, 4, 13, 9, 8, 9, 9, 11, 14 का बहुलक है :",
option:["4",
        "9",
        "8",
        "14"],
answer:"9"
},

{
question: "सरल रेखाएँ x = 2 तथा y = 2 हैं:",
option:["एक-दूसरे के लम्बवत","एक-दूसरे के समानान्तर","एक-दूसरे के न तो समानान्तर हैं न लम्बवत","निष्कर्ष से कुछ नहीं कहा जा सकता"],
answer:"एक-दूसरे के लम्बवत"
},

{
    question: "निम्नलिखित में x² – √2x – 12 के शून्यक कौन से हैं?",
    option:["-3√2, √2",
            "4√2, 1/√2",
            "-3/√2, 1/(2√2)",
            "इनमें से कोई नहीं"],
    answer:"इनमें से कोई नहीं"
},

{
question: "(cosec θ - cot θ)² = ?",

option:["(1 + cos θ)/(1 - cos θ)",
        "(1 - cos θ)/(1 + cos θ)",
        "(1 + sin θ)/(1 - sin θ)",
        "sin θ · cos θ"],

answer:"(1 - cos θ)/(1 + cos θ)"
},

{
    question: "यदि p + 1, 2p + 1, 4p – 1 AP में हैं, तो p का मान है:",

    option:["1",
            "2",
            "3",
            "4"],

    answer:"2"
},

{
question: "एक साथ दो सिक्कों को उछालने पर, कम-से-कम एक हेड आने की प्रायिकता है:",

option:["1/2",
        "1/3",
        "2/3",
        "3/4"],

answer:"3/4"
},

{
    question: "एक द्विघात बहुपद के मूलों के योगफल तथा गुणनफल क्रमशः 2 तथा -15 है। द्विघात बहुपद है:",
    option:["x² + 2x + 15",
            "3x² + 2x – 15",
            "x² – 2x + 15",
            "x² – 2x – 15"],
    answer:"x² – 2x – 15"
},

{
question: "प्रथम पाँच विषम संख्याओं का माध्य है",
option:["6",
        "4",
        "5",
        "8"],
answer:"5"
},

{
    question: "त्रिभुज ABC में P और Q बिन्दु भुजा AB और AC पर क्रमशः इस प्रकार हैं कि PQ || BC। यदि AP = 3 सेमी, PB = 2 सेमी, AQ = 6 सेमी और QC = x सेमी तो x का मान होगा:",
    option:["2 सेमी",
            "4 सेमी",
            "8 सेमी",
            "10 सेमी"],
    answer:"4 सेमी"
},

{
question: "cos1° · cos2° · cos3° … cos180° बराबर है:",

option:["-1",
        "1",
        "0",
        "1/2"],

answer:"0"
},

{
question: "एक थैले में 6 काले तथा 8 उजले गेंद हैं। कोई गेंद आकस्मिक रूप से निकाली गई। इस गेंद के उजला होने की प्रायिकता क्या है ?",

option:["3/4",
        "4/7",
        "1/8",
        "3/7"],

answer:"4/7"
},

{
question: "यदि h ऊँचाई तथा r त्रिज्या वाले एक ठोस बेलन के वक्र पृष्ठ का क्षेत्रफल इसके कुल पृष्ठीय क्षेत्रफल का एक-तिहाई है, तो:",
option:["h = 1/3 r",
        "h = 1/2 r",
        "h = r",
        "h = 2r"],
answer:"h = 1/2 r"
},

{
    question: "निम्नलिखित में किसका दशमलव प्रसार सांत है?",
    option:["11/13",
            "12/14",
            "6/13",
            "3/8"],
    answer:"3/8"
},

{
    question: "युग्म समीकरण a₁x + b₁y = c₁ और a₂x + b₂y = c₂ के अनंत हल होंगे यदि:",
    option:["a₁/a₂ = b₁/b₂ ≠ c₁/c₂",
            "a₁/a₂ ≠ b₁/b₂",
            "a₁/a₂ ≠ b₁/b₂ ≠ c₁/c₂",
            "a₁/a₂ = b₁/b₂ = c₁/c₂"],
    answer:"a₁/a₂ = b₁/b₂ = c₁/c₂"
},

{
    question: "समांतर श्रेणी 3/4, 5/4, 7/4, 9/4 का सार्व अंतर है?",

    option:["3/4",
            "1/4",
            "1/2",
            "5/4"],

    answer:"1/2"
},

{
question: "यदि बिंदु (x₁, y₁), (x₂, y₂) और (x₃, y₃) संरेख हैं, तो निम्नलिखित में कौन-सा सत्य है?",
option:["x₁(y₂ – y₃) + x₂(y₃ – y₁) + x₃(y₁ – y₂) = 0","x₁(y₂ – y₃) + x₂(y₃ + y₁) + x₃(y₁ + y₂) = 0","y₁(x₂ + x₃) + y₂(x₃ + x₁) + y₃(x₁ + x₂) = 0","x₁(y₂ – y₃) – x₂(y₃ – y₁) – x₃(y₁ – y₂) = 0"],
answer:"x₁(y₂ – y₃) + x₂(y₃ – y₁) + x₃(y₁ – y₂) = 0"
},

{
question: "एक साथ दो पासों को उछालने पर प्राप्त संख्याओं का जोड़ 7 होने की प्रायिकता है:",

option:["1/4",
        "1/6",
        "2/3",
        "3/4"],

answer:"1/6"
},

{
question: "यदि tan θ = 8/15 हो तो cosec θ का मान है:",

option:["17/8",
        "8/17",
        "15/17",
        "17/15"],

answer:"17/8"
},

{
    question: "निम्न में से कौन अभाज्य संख्या है?",
    option:["91",
            "213",
            "41",
            "501"],
    answer:"41"
},

{
question: "3, 5, 2, 5, 7, 5, 8, 5 का बहुलक होगा :",
option:["2",
        "3",
        "5",
        "8"],
answer:"5"
},

{
    question: "विरोधी समीकरण युग्म के कितने हल होते हैं?",
    option:["एक",
            "दो",
            "अनगिनत",
            "एक भी नहीं"],
    answer:"एक भी नहीं"
},

{
question: "यदि किसी वृत्त की त्रिज्या दुगुनी कर दी जाए तो नये एवं पुराने वृत्तों की परिधियों का अनुपात होगा :",
option:["1 : 1",
        "2 : 1",
        "4 : 1",
        "1 : 4"],
answer:"2 : 1"
},

{
    question: "1/√7 क्या है?",
    option:["पूर्णांक संख्या",
            "परिमेय संख्या",
            "अपरिमेय संख्या",
            "इनमें से कोई नहीं"],
    answer:"अपरिमेय संख्या"
},

{
question: "1/√3 किसका मान है?",

option:["sin π/3",
        "cot π/3",
        "tan π/6",
        "cos π/6"],

answer:"tan π/6"
},

{
    question: "यदि α, β बहुपद x² – 3x + 5 के शून्यक हैं, तब α/β + β/α = है",
    option:["5",
            "-5",
            "-1/5",
            "इनमें से कोई नहीं"],
    answer:"-1/5"
},

{
question: "6, 4, 3, 6, 4, 3, 4, 6, 5 तथा x का बहुलक हो सकता है।",
option:["सिर्फ 5",
        "4 तथा 6 दोनों",
        "3 तथा 6 दोनों",
        "3, 4 तथा 6"],
answer:"4 तथा 6 दोनों"
},

{
question: "निम्नलिखित में से कौन किसी घटना की प्रायिकता नहीं हो सकती है ?",

option:["1/3",
        "0.3",
        "33%",
        "6/7"],

answer:"कोई नहीं"
},

{
    question: "भूमि के एक बिन्दु से, जो मीनार के पाद-बिन्दु से 30 m की दूरी पर है, मीनार के शिखर का उन्नयन कोण 30° है। मीनार की ऊँचाई होगी",
    option:["30√3 m",
            "10√3 m",
            "20√3 m",
            "40√3 m"],
    answer:"10√3 m"
},

{
    question: "दो या दो से अधिक अभाज्य संख्याओं का HCF क्या होता है?",
    option:["अंततः",
            "1",
            "2",
            "3"],
    answer:"1"
},

{
question: "यदि एक वृत्त का क्षेत्रफल 154 cm² है, तो इसके व्यास का मान होगा :",
option:["14 cm",
        "28 cm",
        "7 cm",
        "21 cm"],
answer:"14 cm"
},

{
    question: "ΔABC में DE || BC एवं AD/DB = 3/5। यदि AC = 5.6 cm, तो AE =",
    option:["4.2 cm",
            "3.1 cm",
            "2.8 cm",
            "2.1 cm"],
    answer:"2.1 cm"
},

{
question: "दिए गए आँकड़ों 1, 0, 5 का माध्य है:",
option:["1",
        "2",
        "3",
        "5"],
answer:"2"
},

{
    question: "3-√3 कौन सी संख्या है?",
    option:["परिमेय संख्या",
            "अपरिमेय संख्या",
            "पूर्णांक संख्या",
            "इनमें से कोई नहीं"],
    answer:"अपरिमेय संख्या"
},

{
question: "यदि 7sin²θ + 3cos²θ = 4 तब secθ + cosecθ बराबर है:",

option:["(2/√3) – 2",
        "2/√3 + 2",
        "2/√3",
        "√3/2"],

answer:"2/√3 + 2"
},

{
    question: "त्रिभुज PQR में A और B क्रमशः PQ और PR पर स्थित हैं तथा AB || QR। यदि समरूप त्रिभुज PAB और PQR के क्षेत्रफलों का अनुपात 1 : 2 है, तो PQ/AQ =",
    option:["√2 : 1",
            "1 : (√2 - 1)",
            "1 : (√2 + 1)",
            "इनमें से कोई नहीं"],
    answer:"इनमें से कोई नहीं"
},

{
    question: "यदि किसी A.P. का छठा और बारहवाँ पद क्रमशः 13 और 25 हैं, तो इसका 20वाँ पद है:",

    option:["41",
            "39",
            "43",
            "47"],

    answer:"41"
},

{
question: "2, 6, 4, 5, 0, 2, 1, 3, 2 का बहुलक है :",
option:["2",
        "3",
        "6",
        "1"],
answer:"2"
},

{
    question: "सूर्य का उन्नयन कोण, जब किसी सीधे खड़े खम्भे की छाया और उसकी ऊँचाई बराबर हो, होगा :",
    option:["30°",
            "45°",
            "60°",
            "90°"],
    answer:"45°"
},

{
    question: "समीकरण युग्म 2x + 3y = 5 तथा 4x + 6y = 15 का है:",
    option:["अद्वितीय हल",
            "अनन्त हल",
            "कोई हल नहीं",
            "इनमें से कोई नहीं"],
    answer:"कोई हल नहीं"
},

{
question: "एक असंभव घटना की प्रायिकता होती है",

option:["0",
        "1",
        "0.5",
        "1.5"],

answer:"0"
},

{
    question: "दो क्रमिक सम संख्याओं का HCF क्या होता है?",
    option:["8",
            "4",
            "0",
            "2"],
    answer:"2"
},

{
question: "एक घन का आयतन 2744 सेमी³ है। इसका पृष्ठीय क्षेत्रफल (सेमी² में) होगा:",
option:["196",
        "588",
        "784",
        "1176"],
answer:"1176"
},

{
question: "दो वृत्तों की परिधियाँ 2 : 3 के अनुपात में हैं, तो उनकी त्रिज्याओं का अनुपात निम्नलिखित में कौन होगा?",
option:["4 : 9",
        "2 : 3",
        "8 : 27",
        "3 : 2"],
answer:"2 : 3"
},

{
question: "cos(90° – A) =",

option:["cotA",
        "sinA",
        "tanA",
        "secA"],

answer:"sinA"
},

{
    question: "यदि संख्याएँ (2x – 1), (3x + 2) तथा (6x – 1) समांतर श्रेणी में हों, तो x का मान है:",

    option:["3",
            "1",
            "2",
            "0"],

    answer:"3"
},

{
    question: "यदि 10^(2y) = 25 तो 10^(-y) बराबर है:",
    option:["1/5",
            "50",
            "1/625",
            "-1/5"],
    answer:"1/5"
},

{
question: "एक थैले में 3 उजली, 4 लाल एवं 5 काली गेंदें हैं। यादृच्छया एक गेंद निकाली जाती है, तो निकाली गई गेंद के काली और न उजली होने की प्रायिकता क्या है ?",

option:["3/4",
        "1/2",
        "1/3",
        "1/4"],

answer:"5/12"
},

{
question: "बिंदुओं (6, -5) एवं (-2, 11) को जोड़ने वाले रेखाखंड के मध्य बिंदु के निर्देशांक यदि (2, p) हैं, तो p का मान होगा:",
option:["2","3","-3","इनमें से कोई नहीं"],
answer:"3"
},

{
    question: "द्विघात समीकरण x² + 2x – 3 = 0 के मूलों के योग का मान होगा:",
    option:["-2",
            "2",
            "1/2",
            "-1/2"],
    answer:"-2"
},

{
question: "निम्नलिखित में कौन आलेख द्वारा निर्धारित नहीं किया जा सकता है?",
option:["माध्यक",
        "बहुलक",
        "माध्य",
        "कोई नहीं"],
answer:"माध्य"
},

{
question: "किसी बाह्य बिन्दु से किसी वृत्त पर खींची गई दोनों स्पर्श रेखाओं की लम्बाइयों में कौन-सा सम्बन्ध होता है?",
option:["समान",
        "असमान",
        "दुगुना",
        "कोई नहीं"],
answer:"समान"
},

{
    question: "निम्न में से किस द्विघात बहुपद के शून्यकों का योग -3 तथा गुणनफल 2 है?",
    option:["x² + 3x + 2",
            "x² + 2x – 3",
            "2x² – 3x – 2",
            "3x² – 3x + 2"],
    answer:"x² + 3x + 2"
},

{
question: "दो वृत्तों की त्रिज्याओं का अनुपात 3 : 4 है, तो उनके क्षेत्रफलों का अनुपात होगा :",
option:["3 : 4",
        "4 : 7",
        "9 : 16",
        "इनमें कोई नहीं"],
answer:"9 : 16"
},

{
question: "एक लम्बवृत्तीय बेलन जिसकी त्रिज्या r तथा ऊँचाई h है, तो उसका आयतन है:",
option:["2π²h",
        "1/3 πr²h",
        "4πr²h",
        "πr²h"],
answer:"πr²h"
},

{
question: "यदि √3 tanθ = 3sinθ, तब sin²θ – cos²θ का मान बराबर है:",

option:["√3",
        "2/3",
        "1/3",
        "1/√3"],

answer:"1/3"
},

{
    question: "बहुपद y² – 6y + 8 का घात है:",
    option:["2",
            "0",
            "1",
            "3"],
    answer:"2"
},

{
question: "2, 5, 7, 3, 3, 6 का बहुलक होगा:",
option:["2",
        "3",
        "5",
        "0"],
answer:"3"
},

{
    question: "निम्नलिखित में से कौन सी अभाज्य संख्या है?",
    option:["69",
            "61",
            "81",
            "51"],
    answer:"61"
},

{
question: "यदि sec θ = 25/7, तो tan θ का मान है:",

option:["7/24",
        "7/25",
        "25/7",
        "24/7"],

answer:"24/7"
},

{
question: "यदि किसी वृत्त की त्रिज्या आधी कर दी जाए, तो पुराने तथा नये वृत्तों की परिधियों का अनुपात होगा :",
option:["1 : 2",
        "2 : 1",
        "4 : 1",
        "1 : 4"],
answer:"2 : 1"
},

{
    question: "यदि द्विघात समीकरण ax² + bx + e = 0 के लिए b² < 4ae हो, तो मूल होंगे:",
    option:["वास्तविक और असमान",
            "वास्तविक और समान",
            "वास्तविक नहीं",
            "इनमें कोई नहीं"],
    answer:"वास्तविक नहीं"
},

{
    question: "x² – 4x + 1 के मूलों का योग होगा:",
    option:["1",
            "4",
            "3",
            "5"],
    answer:"4"
},

{
question: "यदि 2 sin²A – 1 = 0 तो A का मान है:",

option:["45°",
        "30°",
        "60°",
        "90°"],

answer:"45°"
},

{
question: "वृत्त की सबसे बड़ी जीवा होती है:",
option:["चाप",
        "चापकर्ण",
        "व्यास",
        "इनमें से कोई नहीं"],
answer:"व्यास"
},

{
    question: "2 और 2.5 के बीच की अपरिमेय संख्या है?",
    option:["√12.5",
            "√22.5",
            "√5",
            "√11"],
    answer:"√5"
},

{
    question: "समीकरण x + 2y = 9 में यदि x = 5 हो, तो y का मान क्या होगा?",
    option:["1",
            "2",
            "4",
            "-2"],
    answer:"2"
},

{
    question: "एक मीनार से 100 मीटर दूर स्थित बिन्दु पर मीनार का उन्नयन कोण 60° है, तो मीनार की ऊँचाई है :",
    option:["100√3 m",
            "100/√3 m",
            "50√3 m",
            "200/√3 m"],
    answer:"100√3 m"
},

{
question: "बिंदु (-6, 7) का कोटि है:",
option:["-6","7","-7","6"],
answer:"7"
},

{
    question: "दो समरूप त्रिभुजों की दो संगत भुजाएँ 3 : 5 के अनुपात में हैं, तो इन त्रिभुजों के क्षेत्रफलों का अनुपात है:",
    option:["9 : 25",
            "3 : 5",
            "27 : 125",
            "9 : 8"],
    answer:"9 : 25"
},

{
    question: "दो संख्याओं का गुणनफल 8670 और इसका HCF 17 है तो LCM क्या होगा?",
    option:["510",
            "2335",
            "231",
            "526"],
    answer:"510"
},

{
    question: "दो चर x, y में रैखिक समीकरण ax + by + c = 0 के वास्तविक संख्याओं के समुच्चय में कितने हल होंगे?",
    option:["1",
            "2",
            "3",
            "इनमें से कोई नहीं"],
    answer:"अनगिनत"
},

{
question: "दो घनों के आयतनों का अनुपात 1 : 27 है तो उनके पृष्ठीय क्षेत्रों का अनुपात होगा:",
option:["1 : 3",
        "1 : 8",
        "1 : 9",
        "1 : 18"],
answer:"1 : 9"
},

{
    question: "यदि बहुपद x² + ax – b के मूल बराबर परन्तु विपरीत चिह्न के हों, तो a का मान है:",
    option:["1",
            "-1",
            "2",
            "0"],
    answer:"0"
},

{
    question: "दो परिमेय संख्याओं के बीच कितनी परिमेय संख्याएँ हो सकती हैं?",
    option:["मात्र एक",
            "दो",
            "अनंत",
            "एक भी नहीं"],
    answer:"अनंत"
},

{
question: "यदि sin65° = a तथा cos65° = b तो a² + b² का मान क्या होगा:",

option:["0",
        "1",
        "2",
        "3"],

answer:"1"
},

{
question: "1 सेमी त्रिज्या वाले एक ठोस गोले से 0.1 सेमी त्रिज्या वाले कितने ठोस गोले बनाए जा सकते हैं?",
option:["10",
        "100",
        "1000",
        "10,000"],
answer:"1000"
},

{
    question: "किसी द्विघात समीकरण के विवेचक का मान शून्य से बड़ा होने पर दोनों मूल होंगे:",
    option:["वास्तविक और भिन्न",
            "वास्तविक और समान",
            "अवास्तविक और भिन्न",
            "अवास्तविक और समान"],
    answer:"वास्तविक और भिन्न"
},

{
    question: "यदि बहुपद p(x) = x² – 2x – 6 के शून्यक α, β हों, तो αβ का मान है:",
    option:["6",
            "-6",
            "2",
            "-2"],
    answer:"-6"
},

{
question: "यदि A, B, C किसी त्रिभुज के कोण हों, तो sin{(B + C)/2} बराबर है:",

option:["tan(A/2)",
        "sin(A/2)",
        "cos(A/2)",
        "sec(A/2)"],

answer:"cos(A/2)"
},

{
question: "बाह्यतः स्पर्श करने वाले दो वृत्तों की उभयनिष्ठ स्पर्श रेखाओं की संख्या कितनी होती है?",
option:["1",
        "2",
        "3",
        "4"],
answer:"3"
},

{
    question: "निम्नलिखित में कौन-सा समांतर श्रेढ़ी में नहीं है?",

    option:["a, a + d, a + 2d, a + 3d, …….",
            "√2, √8, √18, √32",
            "0.3, 0.33, 0.333, 0.3333",
            "1/2, 1/3, 1/6, 0, ……"],

    answer:"0.3, 0.33, 0.333, 0.3333"
},

{
    question: "बहुपद p(x) = x² + 7x + 10 के शून्यक α, β हों तो αβ का मान क्या होगा?",
    option:["10",
            "-10",
            "1/10",
            "7/10"],
    answer:"10"
},

{
question: "√(1 + tan²A) = ? (0 ≤ A < 90°)",

option:["cot A",
        "sec A",
        "cos A",
        "sin A"],

answer:"sec A"
},

{
    question: "द्विघात समीकरण 4y² + 4y + 1 = 0 के मूलों का गुणनफल होगा:",
    option:["1/4",
            "-1/4",
            "1",
            "इनमें से कोई नहीं"],
    answer:"1/4"
},

{
question: "बिंदु (6, -5) का नियामक (भुज) है:",
option:["6","-5","-6","5"],
answer:"6"
},

{
question: "एक शंकु की त्रिज्या तथा ऊँचाई क्रमशः r और h है, तो उसका आयतन है:",
option:["1/2 πr²h",
        "4/3 πr²h",
        "1/3 πr²h",
        "πr²h"],
answer:"1/3 πr²h"
},

{
question: "यदि किसी घटना की संभावना p है, तो इसके पूरक घटना की संभावना होगी",

option:["p",
        "p - 1",
        "1 - 1/p",
        "1 - p"],

answer:"1 - p"
},

{
question: "किसी वृत्त की परिधि 462 सेमी है, तो इसकी त्रिज्या होगी :",
option:["73.5 cm",
        "72.5 cm",
        "65.5 cm",
        "74.5 cm"],
answer:"73.5 cm"
},

{
question: "एक बिन्दु Q से एक वृत्त पर स्पर्श रेखा की लम्बाई 24 cm तथा Q की केन्द्र से दूरी 25 cm है। वृत्त की त्रिज्या है:",
option:["7 cm",
        "12 cm",
        "15 cm",
        "24.5 cm"],
answer:"7 cm"
},

{
question: "tan 50° + cot 40° =",

option:["1",
        "cot 40°",
        "tan 50°",
        "2tan 50°"],

answer:"2tan 50°"
},

{
    question: "जब दो चर वाले समीकरणों का आलेख सम्पाती होता है तब उनके हल होंगे:",
    option:["एक",
            "दो",
            "तीन",
            "अनगिनत"],
    answer:"अनगिनत"
},

{
question: "बिंदु (-3, -3) किस पाद में होगा?",
option:["प्रथम","द्वितीय","तृतीय","चतुर्थ"],
answer:"तृतीय"
},

{
question: "आँकड़े 12, 17, 81, 26, 38, 42, 57, 62 का परिसर है:",
option:["12",
        "62",
        "81",
        "69"],
answer:"69"
},

{
    question: "a के जिस मान के लिए समीकरण x² + 4x + a = 0 के मूल वास्तविक और भिन्न होंगे, वह है:",
    option:["b/2a",
            "-b/a",
            "b/a",
            "-b/2a"],
    answer:"-b/a"
},

{
    question: "समीकरण निकाय a₁x + b₁y + c₁ = 0 और a₂x + b₂y + c₂ = 0 का अद्वितीय हल होगा, जब",
    option:["a₁/a₂ = b₁/b₂",
            "a₁/a₂ = c₁/c₂",
            "a₁/a₂ ≠ b₁/b₂",
            "a₁/a₂ ≠ c₁/c₂"],
    answer:"a₁/a₂ ≠ b₁/b₂"
},

{
    question: "एक आदमी 24 मीटर पश्चिम जाता है, पुनः वह 10 मीटर उत्तर जाता है। अब वह अपने प्रारंभिक बिन्दु से कितनी दूरी पर है?",
    option:["34 m",
            "17 m",
            "26 m",
            "28 m"],
    answer:"26 m"
},

{
question: "बिंदु (3, 2) और (-3, 2) दोनों अवस्थित हैं:",
option:["x-अक्ष पर","y-अक्ष पर","x-अक्ष के एक ओर","x-अक्ष के दोनों ओर"],
answer:"x-अक्ष के दोनों ओर"
},

{
    question: "A.P. √2, √8, √18, √32 में पाँचवाँ पद है:",

    option:["√20",
            "√50",
            "√60",
            "√80"],

    answer:"√50"
},

{
    question: "45, 60 का HCF क्या होगा?",
    option:["90",
            "15",
            "5",
            "1"],
    answer:"15"
},

{
question: "cos 48° – sin 42° = ?",

option:["1",
        "0",
        "2",
        "-1"],

answer:"0"
},

{
    question: "समीकरण x + y = 6 में कितने हल होंगे?",
    option:["एक",
            "दो",
            "अनंत",
            "एक भी नहीं"],
    answer:"अनंत"
},

{
    question: "निम्नलिखित में कौन द्विघात समीकरण नहीं है?",
    option:["(x + 1)(x – 2) = 0",
            "2x² – 7x = 0",
            "x + 3/x = x²",
            "x² – 9 = 0"],
    answer:"x + 3/x = x²"
},

{
question: "दो पासों को एक साथ फेंका जाता है। दोनों पासों पर अंक 5 आने की प्रायिकता होगी",

option:["1/2",
        "1/36",
        "1/6",
        "इनमें से कोई नहीं"],

answer:"1/36"
},

{
question: "यदि वृत्त की त्रिज्या 7 cm है, तो उस अर्द्धवृत्त की परिमिति होगी :",
option:["36 cm",
        "63 cm",
        "37 cm",
        "इनमें से कोई नहीं"],
answer:"36 cm"
},

{
question: "दो वृत्त एक-दूसरे को बिन्दु S पर स्पर्श करते हैं। एक उभयनिष्ठ स्पर्श रेखा पर P, Q और R बिन्दु क्रमशः इस प्रकार हैं कि PR = 4.5 सेमी। यदि P से दोनों वृत्तों पर स्पर्श रेखाएँ खींची गई हैं, तो PQ का मान है:",
option:["7 cm",
        "9 cm",
        "13.5 cm",
        "15 cm"],
answer:"9 cm"
},

{
question: "एक घन का आयतन 125 m³ है, तो उसका कुल पृष्ठीय क्षेत्रफल होगा:",
option:["30 m²",
        "10 m²",
        "150 m²",
        "125 m²"],
answer:"150 m²"
},

{
question: "किसका मान सबसे छोटा है?",

option:["cos30°",
        "cos45°",
        "cos60°",
        "cos90°"],

answer:"cos90°"
},

{
    question: "एक A.P. के 15 पदों का योग क्या है, जिसके प्रथम और अन्तिम पद क्रमशः 5 और 75 हैं?",

    option:["550",
            "500",
            "600",
            "700"],

    answer:"600"
},

{
    question: "यदि बहुपद x² – 9x + a में शून्यकों का गुणनफल 8 है, तब इसके शून्यक हैं:",
    option:["-1, -8",
            "1, -8",
            "8, -1",
            "1, 8"],
    answer:"1, 8"
},

{
question: "बिंदु (4, -3) किस चतुर्थांश में है?",
option:["प्रथम","द्वितीय","तृतीय","चतुर्थ"],
answer:"चतुर्थ"
},

{
    question: "समीकरण निकाय x – 2y + 9 = 0 और 3x + y + 12 = 0 का आलेख दो सरल रेखाएँ हैं जो:",
    option:["संपाती हैं",
            "समान्तर हैं",
            "केवल एक बिन्दु पर प्रतिच्छेद करती हैं",
            "इनमें से कोई नहीं"],
    answer:"केवल एक बिन्दु पर प्रतिच्छेद करती हैं"
},

{
question: "संचयी बारंबारता वक्र कहलाती है :",
option:["तोरण",
        "आयत चित्र",
        "दण्डालेख",
        "बारंबारता बहुभुज"],
answer:"तोरण"
},

{
question: "यदि 3 cos θ = 2 हो, तो (2sec²θ + 2tan²θ – 7) का मान होगा:",

option:["0",
        "1",
        "3",
        "4"],

answer:"0"
},

{
    question: "एक समकोण समद्विबाहु ΔABC में ∠C = 90° है, तो AB की लम्बाई होगी:",
    option:["2AC",
            "√AC",
            "√2 AC",
            "AC/√2"],
    answer:"√2 AC"
},

{
    question: "यदि A.P. का प्रथम पद a और पदान्तर d हो, तो इसके प्रथम n पदों का योगफल निम्नांकित में कौन-सा होगा?",

    option:["a + (n – 1)d",
            "a + nd",
            "n/2[2a + (n − 1)d]",
            "n/2[2n + nd]"],

    answer:"n/2[2a + (n − 1)d]"
},

{
    question: "युगपत समीकरण 2x + 3y = 5, 4x + 6y = 9 है। निकाय है:",
    option:["असंगत",
            "अद्वितीय हल",
            "अपरिचित रूप से अनेक हल",
            "कोई नहीं"],
    answer:"असंगत"
},

{
    question: "द्विघात समीकरण 3/4x² – 8x – 3 = 0 के विविक्तकर (D) का मान निम्नलिखित में कौन होगा?",
    option:["55",
            "73",
            "81",
            "47"],
    answer:"73"
},

{
    question: "यदि बहुपद x² + ax – b के शून्यक बराबर, किन्तु विपरीत हों, तब a =",
    option:["1",
            "-1",
            "b",
            "0"],
    answer:"0"
},

{
question: "एक 8 सेमी व्यास के सीसे के ठोस गोले से 1 सेमी व्यास के कितने ठोस गोले बनाए जा सकते हैं?",
option:["256",
        "512",
        "1024",
        "576"],
answer:"512"
},

{
    question: "किसी समचतुर्भुज के विकर्णों की लम्बाई 30 सेमी तथा 40 सेमी है, तो इसकी एक भुजा की लम्बाई है:",
    option:["15 cm",
            "26 cm",
            "25 cm",
            "20 cm"],
    answer:"25 cm"
},

{
question: "sin A = 8/17 हो, तो cot A का मान होगा:",

option:["8/15",
        "17/15",
        "15/8",
        "8/17"],

answer:"15/8"
},

{
    question: "निम्नलिखित में कौन समान्तर श्रेणी में है?",

    option:["12, 52, 72, 73, ….",
            "√2, √8, √18, √32 ….",
            "-10, -16, -2, 2, ….",
            "0.2, 0.22, 0.222, 0.2222"],

    answer:"√2, √8, √18, √32 …."
},

{
question: "किसी वितरण के माध्य, बहुलक और माध्यक के बीच मूल सम्बन्ध है:",
option:["बहुलक = 3 माध्यक - 2 माध्य",
        "बहुलक = 2 माध्यक - 3 माध्य",
        "बहुलक = 2 माध्यक + 3 माध्य",
        "इनमें कोई नहीं"],
answer:"बहुलक = 3 माध्यक - 2 माध्य"
},

{
question: "जिस त्रिभुज के तीनों शीर्ष के निर्देशांक (0, 4), (0, 0) तथा (3, 0) हैं, उसकी परिमिति है:",
option:["8 इकाई","10 इकाई","12 इकाई","15 इकाई"],
answer:"12 इकाई"
},

{
question: "दो समानान्तर रेखाओं के बीच की दूरी 14 सेमी है। एक वृत्त दोनों रेखाओं को स्पर्श करता है, तो वृत्त की त्रिज्या निम्न में से कौन-सी है?",
option:["6 cm",
        "7 cm",
        "14 cm",
        "इनमें से कोई नहीं"],
answer:"7 cm"
},

{
    question: "त्रिभुज ABC में D, AB पर तथा E, AC पर स्थित हैं और DE || BC। यदि AD : AB = AE : x है, तो x बराबर है:",
    option:["BD",
            "BC",
            "AC",
            "EC"],
    answer:"AC"
},

{
question: "9, 3, 4, 7, 2, 9, 6, 7, 9, 9 का बहुलक क्या है?",
option:["2",
        "3",
        "7",
        "9"],
answer:"9"
},

{
    question: "द्विघात बहुपद x(2x – 5) – 3 के शून्यकों का योग है:",
    option:["2/5",
            "-5/2",
            "-3/2",
            "5/2"],
    answer:"5/2"
},

{
question: "यदि दो वृत्त एक-दूसरे को बाहर से छूते हैं, तो दोनों वृत्तों से एक साथ गुजरने वाली स्पर्श रेखा की संख्या है:",
option:["1",
        "2",
        "3",
        "4"],
answer:"1"
},

{
question: "एक सिक्का को उछालने पर पट आने की प्रायिकता होगी",

option:["1/2",
        "2/3",
        "4/3",
        "5/4"],

answer:"1/2"
},

{
question: "यदि किसी परिधि की माप 220 m हो, तो उसकी त्रिज्या का मान निम्नलिखित में कौन-सा होगा?",
option:["30 m",
        "35 m",
        "54 m",
        "55 m"],
answer:"35 m"
},

{
question: "यदि P (5, 6) बिंदु A (6, 5) और B (4, y) को मिलाने वाले रेखाखंड AB का मध्यबिंदु है, तो y का मान क्या है?",
option:["5","7","12","16"],
answer:"7"
},

{
    question: "शून्यक 4, 7 वाले द्विघात बहुपदों की संख्या होगी:",
    option:["2",
            "3",
            "4",
            "अनगिनत"],
    answer:"अनगिनत"
},

{
    question: "यदि द्विघात समीकरण px² + 4x + 3 = 0 के मूल बराबर हों, तो p का मान होगा:",
    option:["2/3",
            "4/3",
            "4/5",
            "3/5"],
    answer:"4/3"
},

{
question: "यदि 3θ = 90° तो cos θ बराबर होगा:",

option:["1/2",
        "√3/2",
        "1/√2",
        "2/√3"],

answer:"√3/2"
},

{
question: "यदि d एक वृत्त का व्यास हो, तो उसका क्षेत्रफल होगा :",
option:["πd² वर्ग इकाई",
        "(πd²)/2 वर्ग इकाई",
        "(πd²)/3 वर्ग इकाई",
        "(πd²)/4 वर्ग इकाई"],
answer:"(πd²)/4 वर्ग इकाई"
},

{
    question: "27, 35, 13 और 56 में से कौन सी संख्या अभाज्य संख्या है?",
    option:["27",
            "35",
            "13",
            "56"],
    answer:"13"
},

{
    question: "यदि p(x) = x² – 3x – 4, तो p(x) का एक शून्यक है-",
    option:["2",
            "4",
            "0",
            "3"],
    answer:"4"
},

{
question: "व्यंजक (1 – cos⁴θ) का मान है:",

option:["cos²θ(1 – cos²θ)",
        "sin²θ(1 + cos²θ)",
        "sin²θ(1 – cos²θ)",
        "sin²θ(1 + sin²θ)"],

answer:"sin²θ(1 + cos²θ)"
},

{
question: "सरल रेखा 5x – 3y + 10 = 0 तथा अक्षों के बीच बने त्रिभुज का क्षेत्रफल है:",
option:["15/2 सेमी²","5 सेमी²","8 सेमी²","15 सेमी²"],
answer:"10/3 सेमी²"
},

{
question: "एक पासा फेंकने पर 3 पाने की प्रायिकता है",

option:["1/3",
        "1/6",
        "2/3",
        "5/6"],

answer:"1/6"
},

{
question: "किसी वृत्त के बाह्य बिन्दु P से दो स्पर्श रेखाएँ PA तथा PB खींची गई हैं। यदि PA = 4 सेमी, तो PB की लम्बाई है:",
option:["16 सेमी",
        "12 सेमी",
        "8 सेमी",
        "4 सेमी"],
answer:"4 सेमी"
},

{
question: "(1 + tan²A)/(1 + cot²A) =",

option:["sec²A",
        "-1",
        "cot²A",
        "tan²A"],

answer:"tan²A"
},

{
question: "यदि एक शंकु की त्रिज्या 14 cm और इसकी तिर्यक ऊँचाई 15 cm हो, तो शंकु का सम्पूर्ण पृष्ठीय क्षेत्रफल होगा:",
option:["1276 cm²",
        "660 cm²",
        "1376 cm²",
        "1320 cm²"],
answer:"1276 cm²"
},

{
    question: "6, 8 और 22 का LCM और HCF का अनुपात क्या होगा?",
    option:["48:5",
            "23:3",
            "22:1",
            "132:1"],
    answer:"132:1"
},

{
    question: "अगर p(x) = 4x³ – 5x² + 3x + 7 के शून्यक α, β और γ हों, तो αβγ का मान क्या होगा?",
    option:["-7/4",
            "5/4",
            "7/4",
            "-3/4"],
    answer:"-7/4"
},

{
question: "यदि 6, 8, 9, x तथा 13 का माध्य 10 हो, तो x का मान होगा:",
option:["12",
        "15",
        "13",
        "14"],
answer:"14"
},

{
question: "cosec² 57° - tan² 33° = ?",

option:["0",
        "1",
        "-1",
        "2"],

answer:"1"
},

{
question: "7 cm त्रिज्या वाले एक अर्धगोले का कुल पृष्ठीय क्षेत्रफल है:",
option:["588π cm²",
        "392π cm²",
        "147π cm²",
        "98π cm²"],
answer:"147π cm²"
},

{
    question: "√10×√15 किसके बराबर है?",
    option:["10√5",
            "6√5",
            "5√6",
            "√30"],
    answer:"5√6"
},

{
question: "यदि 3 cm त्रिज्या वाले एक वृत्त पर खींची गई दो स्पर्श रेखाएँ परस्पर 60° के कोण पर झुकी हों, तो प्रत्येक स्पर्शरेखा की लंबाई है:",
option:["2√3 cm",
        "3√3/2 cm",
        "3√3 cm",
        "6 cm"],
answer:"3√3 cm"
},

{
question: "sin2A = 2sinA तब सत्य होता है, जबकि A बराबर है:",

option:["0°",
        "30°",
        "45°",
        "60°"],

answer:"0°"
},

{
question: "निम्न में से कौन-सी घटना की प्रायिकता नहीं हो सकती है ?",

option:["1.1",
        "0.5",
        "0.9",
        "0.1"],

answer:"1.1"
},

{
    question: "2, 10 और 20 के LCM और HCF का अनुपात क्या होगा?",
    option:["1:10",
            "20:1",
            "10:1",
            "सभी"],
    answer:"10:1"
},

{
    question: "द्विघात समीकरण x² + x – 1 = 0 के मूलों की प्रकृति होगी:",
    option:["वास्तविक तथा असमान",
            "वास्तविक तथा समान",
            "समान",
            "वास्तविक नहीं"],
    answer:"वास्तविक तथा असमान"
},

{
    question: "यदि A.P. का प्रथम पद a और पदान्तर d हो, तो nवाँ पद निम्नांकित कौन-सा होगा?",

    option:["a + (n – 2)d",
            "a + (n – 1)d",
            "a + nd",
            "a - (a – 1)d"],

    answer:"a + (n – 1)d"
},

{
    question: "द्विघात बहुपदों के शून्यकों की संख्या होती है:",
    option:["2",
            "3",
            "1",
            "4"],
    answer:"2"
},

{
    question: "किसी त्रिभुज ABC में ∠A = 90°, BC = 13 सेमी, AB = 12 सेमी, तो AC का मान है:",
    option:["3 cm",
            "4 cm",
            "5 cm",
            "6 cm"],
    answer:"5 cm"
},

{
question: "बिंदु (-5, 4) किस पाद में स्थित है?",
option:["प्रथम पाद","द्वितीय पाद","तृतीय पाद","चतुर्थ पाद"],
answer:"द्वितीय पाद"
},

{
question: "दो घनों के आयतनों में 1 : 8 का अनुपात है, तो उनकी कोरों का अनुपात होगा:",
option:["1 : 4",
        "1 : 2",
        "2 : 3",
        "इनमें से कोई नहीं"],
answer:"1 : 2"
},

{
    question: "दो खंभे 6 मी० और 11 मी० ऊँचे हैं और समतल जमीन पर ऊर्ध्वाधर खड़े हैं। यदि उनके पादों के बीच की दूरी 12 मी० है, तो उनके सिरों के बीच की दूरी है :",
    option:["12 मी०",
            "10 मी०",
            "13 मी०",
            "14 मी०"],
    answer:"13 मी०"
},

{
    question: "त्रिभुज ABC में D, BC पर स्थित है और E, AC पर स्थित है। यदि BD = CD, CE = AE, ∠BAD = ∠CAD तथा ∠EBC = ∠EBA, तो निम्नलिखित में कौन सत्य है?",
    option:["AB = BC = AC",
            "AB ≠ BC",
            "AB ≠ AC",
            "BC ≠ AC"],
    answer:"AB = BC = AC"
},

{
question: "x = -5 का आलेख कैसी सरल रेखा होगी?",
option:["x-अक्ष के समान्तर","y-अक्ष के समान्तर","मूल बिंदु से जाती हुई","इनमें से कोई नहीं"],
answer:"y-अक्ष के समान्तर"
},

{
question: "7, 3, 5, 8, 6, 10, 9, 12 की माध्यिका है :",
option:["7",
        "7.5",
        "8",
        "इनमें से कोई नहीं"],
answer:"7.5"
},

{
question: "यदि 5cosθ = 3, तो 3tanθ का मान होगा:",

option:["3",
        "5",
        "4",
        "7"],

answer:"4"
},

{
    question: "सभी समबाहु त्रिभुज होते हैं:",
    option:["समरूप",
            "सर्वांगसम",
            "समानुपाती",
            "इनमें कोई नहीं"],
    answer:"समरूप"
},

{
    question: "A.P. 5, 7, 9, 11, ……. के सातवाँ पद का मान होगा:",

    option:["20",
            "25",
            "17",
            "35"],

    answer:"17"
},

{
    question: "5.2372 है?",
    option:["सम संख्या",
            "विषम संख्या",
            "परिमेय संख्या",
            "भाज्य संख्या"],
    answer:"परिमेय संख्या"
},

{
    question: "2x² – 3x – 5 का एक शून्यक है।",
    option:["1",
            "-1",
            "0",
            "इनमें से कोई नहीं"],
    answer:"-1"
},

{
    question: "समीकरण निकाय 2x + ay = 1 और 3x – 5y = 7 में अचर a के किस मान के लिए एक अद्वितीय हल होंगे?",
    option:["a = 10/3",
            "a ≠ -10/3",
            "a = 10",
            "a ≠ 10"],
    answer:"a ≠ -10/3"
},

{
    question: "किसी A.P. की चार संख्याओं का योग 40 और उनकी पहली और चौथी संख्याओं का गुणनफल 91 है, वे संख्याएँ हैं:",

    option:["7, 9, 11, 13",
            "6, 8, 12, 14",
            "4, 7, 10, 19",
            "3, 8, 9, 20"],

    answer:"7, 9, 11, 13"
},

{
    question: "दो संख्याएँ a और 18 का LCM 36 तथा HCF 2 है तो a का मान क्या होगा?",
    option:["2",
            "3",
            "4",
            "5"],
    answer:"4"
},

{
question: "बिंदु (1, 5) किस चतुर्थांश में स्थित है?",
option:["I","II","III","IV"],
answer:"I"
},

{
question: "tan10° tan15° tan75° tan80° = ?",

option:["√3",
        "1/√3",
        "-1",
        "1"],

answer:"1"
},

{
    question: "अगर α, β द्विघात बहुपद f(x) = x² – 5x + 7 के मूल हों, तो (1/α + 1/β) का मान होगा:",
    option:["–5/7",
            "5/7",
            "7/5",
            "–7/5"],
    answer:"5/7"
},

{
question: "एक घड़ी के मिनट वाली सूई द्वारा 60 मिनट में बनाया गया कोण होता है :",
option:["60°",
        "120°",
        "180°",
        "360°"],
answer:"360°"
},

{
question: "y-अक्ष पर वह बिंदु जिसकी बिंदु (4, 2) से दूरी 5 है, निम्नलिखित में कौन है?",
option:["(-1, 0)","(0, -1)","(2, -5)","(3, 5)"],
answer:"(0, -1)"
},

{
question: "तोरण खींचने के लिए वर्ग-अंतरालों को होना चाहिए:",
option:["समावेशिक",
        "अपवर्जी",
        "दोनों (a) तथा (b)",
        "इनमें से कोई नहीं"],
answer:"अपवर्जी"
},

{
question: "दो भिन्न त्रिज्याओं वाले वृत्त हमेशा होते हैं:",
option:["सर्वांगसम",
        "समरूप",
        "सर्वांगसम और समरूप",
        "इनमें से कोई नहीं"],
answer:"समरूप"
},

{
question: "किसी गोले का सम्पूर्ण पृष्ठीय क्षेत्रफल 144π cm² है, तो उसकी त्रिज्या है:",
option:["6 cm",
        "8 cm",
        "12 cm",
        "10 cm"],
answer:"6 cm"
},

{
question: "बिंदुओं R (x₁, y₁) और S (x₂, y₂) को मिलाने वाले रेखाखंड के मध्यबिंदु के निर्देशांक हैं:",
option:["{(x₁ + y₁)/2, (x₂ + y₂)/2}","{(x₁ + x₂)/2, (y₁ + y₂)/2}","{(x₁ - x₂)/2, (y₁ - y₂)/2}","{x₁ + x₂, y₁ + y₂}"],
answer:"{(x₁ + x₂)/2, (y₁ + y₂)/2}"
},

{
    question: "निम्नलिखित में से कौन बहुपद है?",
    option:["x² – 5x + 4√x + 3",
            "x^(3/2) – x + x^(1/2) + 1",
            "√x + 1/√x",
            "√2x² – 3√3x + √6"],
    answer:"√2x² – 3√3x + √6"
},

{
    question: "यदि किसी समान्तर श्रेणी का छठा और बारहवाँ पद 13 और 25 है, तो इसका पहला पद है:",

    option:["4",
            "3",
            "2",
            "5"],

    answer:"3"
},

{
question: "tan 30° · sin 30° · cot 60° · cosec 30° =",

option:["1/2",
        "1/3",
        "1/4",
        "1"],

answer:"1/3"
},

{
    question: "निम्नलिखित में कौन सी संख्या अलग है?",
    option:["3/5",
            "√16/√4",
            "√2/5",
            "25/4"],
    answer:"√2/5"
},

{
    question: "अगर α, β बहुपद x² + 2x + 1 के शून्यक हैं, तब (1/α + 1/β) का मान होगा:",
    option:["2",
            "-2",
            "0",
            "1"],
    answer:"-2"
},

{
question: "बिंदु (2, 3) एवं (-2, 3) के बीच की दूरी होगी:",
option:["3","4","√3","5"],
answer:"4"
},

{
question: "यदि sin θ = 3/5 हो, तो cos θ का मान होगा:",

option:["4/5",
        "4/3",
        "5/6",
        "3/5"],

answer:"4/5"
},

{
    question: "यदि द्विघाती समीकरण ax² – 4ax + 2a + 1 = 0 के समान मूल हैं, तो a = ?",
    option:["0",
            "1/2",
            "2",
            "4"],
    answer:"1/2"
},

{
    question: "यदि किसी A.P. का सामान्य पद 3n + 5 है तो इसका सार्व अन्तर होगा:",

    option:["1",
            "2",
            "3",
            "5"],

    answer:"3"
},

{
    question: "यदि दो समरूप त्रिभुजों की संगत भुजाओं में 3 : 4 का अनुपात है, तो उनके परिमापों का अनुपात है:",
    option:["3 : 4",
            "4 : 3",
            "9 : 16",
            "16 : 9"],
    answer:"3 : 4"
},

{
question: "यदि tanθ = 3/4 हो, तो sinθ का मान है:",

option:["4/5",
        "2/3",
        "4/3",
        "3/5"],

answer:"3/5"
},

{
question: "दो न्यायसंगत सिक्के उछाले जाते हैं, तो 2 शीर्ष (चित) आने की प्रायिकता है:",

option:["1/3",
        "1/2",
        "1/8",
        "1/4"],

answer:"1/4"
},

{
question: "वृत्त के केन्द्र पर बना कोण होगा:",
option:["90°",
        "180°",
        "360°",
        "270°"],
answer:"360°"
},

{
question: "एक धातु का घन, जिसकी भुजा 1 cm है, को खींचकर 4 mm व्यास का एक तार बनाया गया है। तार की लंबाई क्या है?",
option:["100/π cm",
        "25/π cm",
        "100π cm",
        "10000 cm"],
answer:"25/π cm"
},

{
question: "बिंदुएँ (4, 6) और (-4, -6) दोनों अवस्थित हैं:",
option:["y-अक्ष पर","x-अक्ष पर","x-अक्ष के एक ओर","y-अक्ष के दोनों ओर"],
answer:"y-अक्ष के दोनों ओर"
},

{
    question: "समांतर चतुर्भुज ABCD में ∠ABC = 55° है तथा विकर्ण AC और भुजा CD के बीच का कोण ∠ACD = 70° है। तो ∠ACB की माप है:",
    option:["70°",
            "55°",
            "25°",
            "125°"],
    answer:"55°"
},

{
question: "sec²45° – 2 =",

option:["1",
        "0",
        "4",
        "1/2"],

answer:"0"
},

{
question: "10 cm त्रिज्या वाले वृत्त की एक जीवा वृत्त के केन्द्र पर 90° का कोण बनाती है, तो उस जीवा की लंबाई होगी:",
option:["5/√2 cm",
        "5√2 cm",
        "10√2 cm",
        "10√3 cm"],
answer:"10√2 cm"
},

{
question: "एक खोखले गोले के आंतरिक तथा बाह्य व्यास क्रमशः 4 सेमी तथा 8 सेमी हैं। इसे गलाकर 8 सेमी व्यास वाले आधार-वृत्त का शंकु बनाया जाता है। शंकु की ऊँचाई (सेमी में) है:",
option:["12",
        "13",
        "14",
        "15"],
answer:"14"
},

{
question: "निम्नलिखित में से कौन-सी किसी घटना की प्रायिकता नहीं हो सकती ?",

option:["0.8",
        "2.5",
        "80%",
        "5/6"],

answer:"2.5"
},

{
question: "प्रथम तीन लगातार प्राकृतिक संख्याओं का माध्य होगा :",
option:["1",
        "2",
        "3",
        "4"],
answer:"2"
},

{
question: "त्रिभुज ABC जिसके शीर्ष A (-1, 0), B (5, -2) और C (8, 2) हैं, तो केन्द्रक के निर्देशांक हैं:",
option:["(12, 0)","(6, 0)","(0, 6)","(4, 0)"],
answer:"(4, 0)"
},

{
question: "यदि A + B = 90° हो तो cos A बराबर होगा:",

option:["cos B",
        "sin A",
        "sin B",
        "cos A"],

answer:"sin B"
},

{
    question: "द्विघात बहुपद x² – 2 के शून्यक हैं:",
    option:["2, 2",
            "-√2, √2",
            "-√2, -√2",
            "-2, -2"],
    answer:"-√2, √2"
},

{
    question: "निम्नलिखित में कौन द्विघात समीकरण है?",
    option:["4x + 6 = 0",
            "x² – bx + c = 0",
            "x(x + 3) = x²",
            "x² + 1/x² = 2"],
    answer:"x² – bx + c = 0"
},

{
    question: "प्रथम 200 प्राकृतिक संख्याओं का योग है:",

    option:["30600",
            "20100",
            "40200",
            "कोई नहीं"],

    answer:"20100"
},

{
    question: "निम्नलिखित संख्याओं में कौन परिमेय संख्या नहीं है?",
    option:["5√49",
            "19√1",
            "2√16",
            "2√3"],
    answer:"2√3"
},

{
question: "यदि tan θ = √3, तब sec θ होगा:",

option:["2√3",
        "√3/2",
        "1/2",
        "2"],

answer:"2"
},

{
    question: "निम्न में से किस द्विघात बहुपद के शून्यकों का योगफल 3 तथा गुणनफल –10 है?",
    option:["x² – 3x + 10",
            "2x² + 3x – 10",
            "x² – 3x – 10",
            "इनमें से कोई नहीं"],
    answer:"x² – 3x – 10"
},

{
    question: "A.P. -3, -1/2, 2 … का 11वाँ पद है:",

    option:["22",
            "30",
            "25",
            "32"],

    answer:"22"
},

{
question: "किसी 5 सेमी भुजा वाले घन को बाँटकर 1 सेमी भुजा वाले कितने घन बनाए जा सकते हैं?",
option:["5",
        "50",
        "125",
        "250"],
answer:"125"
},

{
    question: "25 m ऊँची पहाड़ी चोटी से एक मीनार के शिखर का उन्नयन कोण उसके पाद के अवनमन कोण के बराबर है। मीनार की ऊँचाई है:",
    option:["25 m",
            "50 m",
            "75 m",
            "100 m"],
    answer:"50 m"
},

{
question: "एक वृत्त का व्यास 14 cm है। इसकी परिधि निम्नांकित में कौन-सी होगी?",
option:["22 cm",
        "88 cm",
        "55 cm",
        "44 cm"],
answer:"44 cm"
},

{
    question: "यदि द्विघात समीकरण P(x) = 2x² + 3x – 4 = 0 के शून्यक α तथा β हों, तो α + β का मान होगा:",
    option:["-2/3",
            "-2",
            "2",
            "-3/2"],
    answer:"-3/2"
},

{
    question: "यदि P तथा Q दो अभाज्य संख्याएँ हैं तो उनका HCF कितना होगा?",
    option:["0",
            "1",
            "2",
            "10"],
    answer:"1"
},

{
    question: "दो चर में दो एकघातीय समीकरणों के ग्राफ यदि प्रतिच्छेदी रेखाएँ हों, तो हलों की संख्या है:",
    option:["सिर्फ एक",
            "कोई हल नहीं",
            "अनन्त हल",
            "इनमें से कोई नहीं"],
    answer:"सिर्फ एक"
},

{
question: "यदि cotθ = 3/4 तो tan²θ =",

option:["5/9",
        "16/9",
        "3/7",
        "9/16"],

answer:"16/9"
},

{
question: "यदि एक अर्द्धवृत्त का परिमाप 72 सेमी है, तो इसकी त्रिज्या है : (π = 22/7)",
option:["14 cm",
        "21 cm",
        "35 cm",
        "42 cm"],
answer:"14 cm"
},

{
    question: "द्विघात बहुपद x² + (1/6)x – 2 के शून्यक हैं",
    option:["-3, 4",
            "-3/2, 4/3",
            "-4/3, 3/2",
            "इनमें से कोई नहीं"],
    answer:"-3/2, 4/3"
},

{
question: "किसी वृत्त के केन्द्र से 5 cm दूर स्थित बिन्दु A से वृत्त पर खींची गई स्पर्श रेखा की लम्बाई 4 cm है, तो वृत्त की त्रिज्या है:",
option:["7 cm",
        "6 cm",
        "3 cm",
        "4 cm"],
answer:"3 cm"
},

{
question: "(secA + tanA)(1 – sinA) बराबर है:",

option:["secA",
        "sinA",
        "cosecA",
        "cosA"],

answer:"cosA"
},

{
question: "बिंदु (-3, 4) की दूरी मूल बिंदु से है:",
option:["3","-3","4","5"],
answer:"5"
},

{
question: "एक पहिए का व्यास 40 cm है। 176 m की दूरी तय करने में इसे कितने चक्कर लगाने पड़ेंगे?",
option:["140",
        "150",
        "160",
        "166"],
answer:"140"
},

{
    question: "ΔABC में BC को D बिन्दु तक बढ़ाया गया है जिससे ∠ACD = 110° तथा ∠BAC = 57°, तो ∠ABC का मान होगा:",
    option:["53°",
            "57°",
            "33°",
            "123°"],
    answer:"53°"
},

{
question: "9tan²α – 9sec²α =",

option:["9",
        "-9",
        "0",
        "1"],

answer:"-9"
},

{
question: "दो बिंदु P (2, 3) और Q (4, 2) के बीच की दूरी ज्ञात करें:",
option:["√2","√5","√√3","√7"],
answer:"√5"
},

{
    question: "2x + 3y = 11 और 2x – 4y = –24 के हल हैं:",
    option:["x = 2, y = 4",
            "x = -2, y = -5",
            "x = -3, y = 1",
            "x = -2, y = 5"],
    answer:"x = -2, y = 5"
},

{
    question: "यदि द्विघात समीकरण bx² + ax + c = 0 के मूल समान हैं, तो:",
    option:["b² – 4ac = 0",
            "a² – 4ac = 0",
            "c² – 4ab = 0",
            "a² – 4bc = 0"],
    answer:"a² – 4bc = 0"
},

{
question: "यदि किसी घन का प्रत्येक किनारा l इकाई हो, तो उसका सम्पूर्ण पृष्ठ का क्षेत्रफल होगा:",
option:["l² वर्ग इकाई",
        "6l² वर्ग इकाई",
        "4l² वर्ग इकाई",
        "9l² वर्ग इकाई"],
answer:"6l² वर्ग इकाई"
},

{
question: "y = 10 का आलेख कैसी सरल रेखा होगी?",
option:["x-अक्ष के समांतर","y-अक्ष के समांतर","मूल बिंदु से जाती हुई","इनमें से कोई नहीं"],
answer:"x-अक्ष के समांतर"
},

{
    question: "ΔABC में AB एवं AC के मध्य बिंदु D एवं E इस प्रकार हैं कि DE || BC तथा BC = 8 cm तब DE का मान होगा:",
    option:["5 cm",
            "3 cm",
            "4 cm",
            "2 cm"],
    answer:"4 cm"
},

{
    question: "6/7 का दशमलव प्रसार है?",
    option:["असांत",
            "सांत",
            "असांत एवं सांत दोनों",
            "इनमें से कोई नहीं"],
    answer:"असांत"
},

{
question: "यदि cosA = 4/5 तो tanA का मान होगा:",

option:["1/2",
        "3/4",
        "4/3",
        "2"],

answer:"3/4"
},

{
question: "r त्रिज्या वाले गोले का आयतन होता है:",
option:["4/3 πr³",
        "2/3 πr³",
        "3/2 πr³",
        "1/3 πr³"],
answer:"4/3 πr³"
},

{
    question: "किसी त्रिभुज के दो कोणों का योग तीसरे कोण के बराबर है। यदि दो कोणों का अन्तर 50° है, तब त्रिभुज के कोण हैं:",
    option:["45°, 45°, 90°",
            "20°, 70°, 90°",
            "40°, 70°, 70°",
            "20°, 60°, 100°"],
    answer:"20°, 70°, 90°"
},

{
question: "38.5 सेमी² क्षेत्रफल वाले वृत्त की त्रिज्या है :",
option:["7 सेमी",
        "3.5 सेमी",
        "10.5 सेमी",
        "इनमें से कोई नहीं"],
answer:"3.5 सेमी"
},

{
    question: "समांतर श्रेणी -40, -15, 10, 35 का 10वाँ पद है:",

    option:["184",
            "186",
            "182",
            "185"],

    answer:"185"
},

{
question: "sec² 10° – cot² 80° का मान है:",

option:["1",
        "0",
        "3/2",
        "1/2"],

answer:"1"
},

{
    question: "यदि α तथा β द्विघात समीकरण x² + x – 2 = 0 के मूल हों, तो 1/α + 1/β का मान होगा:",
    option:["1/2",
            "-1/√2",
            "1",
            "2"],
    answer:"1/2"
},

{
question: "एक घड़ी की मिनट की सूई 21 cm लंबी है। इसके द्वारा एक मिनट में रचित क्षेत्रफल है :",
option:["126 cm²",
        "210 cm²",
        "231 cm²",
        "252 cm²"],
answer:"231 cm²"
},

{
question: "यदि चार लगातार विषम संख्याओं का माध्य 6 है, तो सबसे बड़ी संख्या है:",
option:["5",
        "9",
        "15",
        "21"],
answer:"9"
},

{
question: "बिंदु A (2, -4) और B (4, -2) को मिलाने वाली रेखाखंड का मध्य बिंदु है:",
option:["(6, -6)","(-1, -2)","(3, -3)","(-3, 3)"],
answer:"(3, -3)"
},

{
    question: "यदि दो चर में दो रैखिक समीकरणों के हल अनन्त हों, तो उनके आलेख होंगे:",
    option:["दो समान्तर रेखाएँ",
            "दो प्रतिच्छेदी रेखाएँ",
            "दो संपाती रेखाएँ",
            "इनमें से कोई नहीं"],
    answer:"दो संपाती रेखाएँ"
},

{
    question: "दो समरूप त्रिभुजों के क्षेत्रफलों का अनुपात 9 : 4 है तो उनकी संगत ऊँचाइयों का अनुपात होगा:",
    option:["2 : 3",
            "3 : 2",
            "4 : 9",
            "9 : 4"],
    answer:"3 : 2"
},

{
question: "19 और 25 का समांतर माध्य है।",
option:["21",
        "22",
        "23",
        "24"],
answer:"22"
},

{
    question: "5 m ऊँची उदग्र मीनार के पाद से 5 m दूर स्थित बिन्दु पर मीनार की चोटी का उन्नयन कोण क्या है?",
    option:["30°",
            "45°",
            "60°",
            "90°"],
    answer:"45°"
},

{
question: "किसी वृत्त के व्यास के दोनों किनारों से खींची गई स्पर्श रेखा हमेशा होती है:",
option:["समानान्तर",
        "लम्बवत",
        "एक-दूसरे को काटने वाली",
        "इनमें से कोई नहीं"],
answer:"समानान्तर"
},

{
    question: "किसी द्विघात बहुपद के शून्यक यदि 5 एवं –3 हैं, तो द्विघात बहुपद होगा:",
    option:["x² + 2x – 15",
            "2x² – 2x + 15",
            "x² – 2x – 15",
            "इनमें से कोई नहीं"],
    answer:"x² – 2x – 15"
},

{
    question: "यदि दो त्रिभुजों ABC तथा PQR में ∠A = ∠P, ∠B = ∠Q, ∠C = ∠R, तो:",
    option:["ΔPQR - ΔCAB",
            "ΔPQR - ΔBCA",
            "ΔCBA - ΔPQR",
            "ΔABC - ΔPQR"],
    answer:"ΔABC - ΔPQR"
},

{
question: "यदि sinA = 3/4 तो cosA का मान होगा:",

option:["4/3",
        "√3/4",
        "√4/3",
        "√7/4"],

answer:"√7/4"
},

{
question: "A (0, 1), B (0, 5) तथा C (3, 4) से बने त्रिभुज का क्षेत्रफल वर्ग इकाई में है:",
option:["16","8","6","4"],
answer:"6"
},

{
    question: "11/15 का दशमलव प्रसार क्या होता है?",
    option:["असांत",
            "सांत",
            "दोनों",
            "कोई नहीं"],
    answer:"असांत"
},

{
    question: "107 और 253 के बीच की 5 से विभाज्य संख्याओं का योग है:",

    option:["5220",
            "5210",
            "5200",
            "50000"],

    answer:"5220"
},

{
question: "यदि एक अर्धवृत्त की परिमाप 36 सेमी है, तो इसकी त्रिज्या है:",
option:["14 सेमी",
        "7 सेमी",
        "21 सेमी",
        "इनमें से कोई नहीं"],
answer:"7 सेमी"
},

{
    question: "यदि किसी ऊर्ध्वाधर स्तंभ की ऊँचाई जमीन पर उस स्तंभ की छाया की लंबाई की √3 गुनी है तो सूर्य का उन्नयन कोण होगा :",
    option:["30°",
            "45°",
            "60°",
            "75°"],
    answer:"60°"
},

{
    question: "एक समबाहु त्रिभुज ABC की एक भुजा 2a है, तो इसकी ऊँचाई होगी:",
    option:["3a",
            "√3a",
            "√3a²",
            "(√3/2)a"],
    answer:"√3a"
},

{
    question: "समीकरण युग्म x + 2y + 5 = 0 तथा -3x – 6y + 1 = 0 के हल है:",
    option:["अद्वितीय हल",
            "अनंत हल",
            "कोई हल नहीं",
            "इनमें से कोई नहीं"],
    answer:"कोई हल नहीं"
},

{
    question: "6x⁴y तथा 12xy का HCF क्या होगा?",
    option:["6x²y",
            "6xy",
            "6y",
            "6x"],
    answer:"6xy"
},

{
question: "यदि sin x° = sinα तब α है:",

option:["180/π",
        "π/270",
        "270/π",
        "π/180"],

answer:"π/180"
},

{
question: "किसी वृत्त को दो अलग बिन्दुओं पर प्रतिच्छेदित करने वाली रेखा को कहते हैं:",
option:["जीवा",
        "छेदक रेखा",
        "स्पर्श रेखा",
        "इनमें से कोई नहीं"],
answer:"छेदक रेखा"
},

{
    question: "बहुपद p(x) का एक गुणनखंड x + 2 हो, तो बहुपद p(x) का एक शून्यक होगा।",
    option:["-2",
            "2",
            "0",
            "p(0)"],
    answer:"-2"
},

{
    question: "यदि 2x + 3y = 12 और 3x – 2y = 5, तब:",
    option:["x = 2, y = 3",
            "x = 2, y = -3",
            "x = 3, y = 2",
            "x = 3, y = -2"],
    answer:"x = 3, y = 2"
},

{
question: "यदि sin θ = cos θ, तो θ का मान होगा:",

option:["0°",
        "30°",
        "60°",
        "45°"],

answer:"45°"
},

{
question: "बिंदुओं (-2, 3) और (4, 1) को मिलाने वाले रेखाखंड के मध्य बिंदु के निर्देशांक हैं:",
option:["(1, 2)","(-1, 2)","(1, -2)","(2, 2)"],
answer:"(1, 2)"
},

{
question: "यदि किसी बारंबारता सारणी का माध्य 8.9 एवं माध्यिका 9 हो, तो बहुलक होगा:",
option:["7.2",
        "8.2",
        "9.2",
        "10.2"],
answer:"9.2"
},

{
    question: "दो समरूप त्रिभुजों की संगत भुजाओं का अनुपात 4 : 9 है, तब उनके क्षेत्रफलों का अनुपात होगा:",
    option:["16 : 27",
            "16 : 81",
            "9 : 25",
            "4 : 9"],
    answer:"16 : 81"
},

{
    question: "भूमि से 100 m की ऊँचाई तथा 60° के उन्नयन कोण पर उड़ती हुई एक पतंग की डोरी की लंबाई है:",
    option:["100 m",
            "100√2 m",
            "200/√3 m",
            "200 m"],
    answer:"200/√3 m"
},

{
    question: "एक रैखिक समीकरण का घात होगा:",
    option:["0",
            "2",
            "1",
            "इनमें कोई नहीं"],
    answer:"1"
},

{
question: "किसी वृत्त की स्पर्शरेखा उसे कितने बिन्दु पर स्पर्श करती है?",
option:["∞",
        "2",
        "1",
        "3"],
answer:"1"
},

{
    question: "यूक्लिड विभाजन एल्गोरिथ्म दो धनात्मक पूर्णांकों के निम्न में किसे परिकलित करने की तकनीक है:",
    option:["LCM",
            "HCF",
            "भागफल",
            "शेषफल"],
    answer:"HCF"
},

{
question: "tanA बराबर होगा:",

option:["cot(90° – A)",
        "sec(90° – A)",
        "cosec(90° – A)",
        "cos(90° – A)"],

answer:"cot(90° – A)"
},

{
question: "बिंदुओं (-5, 7) और (-1, 3) के बीच की दूरी है:",
option:["2√2","3/2","4√2","5/2"],
answer:"4√2"
},

{
    question: "यदि इकाई का अंक x तथा दहाई का अंक y हो तो, दो अंकों वाली संख्या होगी:",
    option:["10x + y",
            "10y + x",
            "x + y",
            "x – y"],
    answer:"10y + x"
},

{
    question: "सबसे छोटी अभाज्य संख्या और सबसे छोटी भाज्य संख्या का गुणनफल क्या होगा?",
    option:["0",
            "2",
            "4",
            "8"],
    answer:"8"
},

{
question: "cosec²A – 1 का मान है:",

option:["sin²A",
        "tan²A",
        "cot²A",
        "cos²A"],

answer:"cot²A"
},

{
    question: "यदि बहुपद p(x) = 4x³ – 5x² + 3x + 7 के शून्यक α, β और γ हों, तो αβγ का मान क्या होगा?",
    option:["-7/4",
            "5/4",
            "7/4",
            "-3/4"],
    answer:"-7/4"
},

{
    question: "त्रिभुज DEF तथा PQR में दिया है कि ∠D = ∠Q तथा ∠R = ∠E तो निम्नलिखित में से कौन-सा सही है?",
    option:["∠F = ∠P",
            "∠F = ∠Q",
            "∠E = ∠P",
            "∠D = ∠P"],
    answer:"∠F = ∠P"
},

{
question: "बिंदु (2, 3) की दूरी मूल बिंदु से होगी:",
option:["2","2√3","√13","कोई नहीं"],
answer:"√13"
},

{
question: "यदि sec A = cosec B = 13/12 तब (A + B) का मान है:",

option:["0°",
        "> 90°",
        "90°",
        "< 90°"],

answer:"90°"
},

{
question: "किसी पासे को फेंकने पर सम संख्या आने की प्रायिकता है",

option:["2/3",
        "1/6",
        "1/4",
        "2/3"],

answer:"1/2"
},

{
    question: "यदि x = 1 दोनों समीकरणों x² + x + a = 0 और bx² + bx + 3 = 0 का मूल हो तो ab =",
    option:["-3",
            "4",
            "3",
            "इनमें से कोई नहीं"],
    answer:"3"
},

{
    question: "द्विघात समीकरण ax² + bx + c = 0 के मूल बराबर हों तो:",
    option:["b² > 4ac",
            "b² < 4ac",
            "c² = 4ac",
            "b² = 4ac"],
    answer:"b² = 4ac"
},

{
    question: "A.P. 13, 19, ….., 205 के पदों की संख्या है:",

    option:["30",
            "31",
            "32",
            "33"],

    answer:"33"
},

{
question: "यदि tan θ = √3 हो तो θ का मान है:",

option:["90°",
        "45°",
        "30°",
        "60°"],

answer:"60°"
},

{
    question: "यदि किसी द्विघात बहुपद p(x) = 2x² + 3x – 4 के शून्यक α, β हों, तो αβ का मान होगा:",
    option:["-4",
            "-3/2",
            "-2",
            "-4/3"],
    answer:"-2"
},

{
    question: "द्विघात समीकरण -3x² + 4x + 5 = 0 के मूलों का योगफल कितना होगा?",
    option:["1/3",
            "5/3",
            "4/3",
            "कोई नहीं"],
    answer:"4/3"
},

{
question: "किसी बारंबारता बंटन का बहुलक आलेख द्वारा निम्नलिखित में से किससे निर्धारित किया जा सकता है?",
option:["बारंबारता वक्र",
        "तोरण",
        "बारंबारता बहुभुज",
        "आयत चित्र"],
answer:"आयत चित्र"
},

{
question: "यदि 4sin²θ = 3 तो θ का मान है:",

option:["30°",
        "60°",
        "90°",
        "45°"],

answer:"60°"
},

{
    question: "दो रैखिक समीकरणों के आलेख प्रतिच्छेदी रेखाएँ हैं, तब रैखिक समीकरण युग्म का:",
    option:["कोई हल नहीं है",
            "एक हल है",
            "दो हल है",
            "अंततः अनेक हल है"],
    answer:"एक हल है"
},

{
question: "निर्देशांक ज्यामिति में त्रिभुज के क्षेत्रफल का सूत्र क्या होता है?",
option:["1/2[x₁(y₂ – y₃) + x₂(y₃ – y₁) + x₃(y₁ – y₂)]","1/2[x₁(y₂ – y₃) + x₂(y₃ + y₁) + x₃(y₁ + y₂)]","1/2[y₁(x₂ + x₃) + y₂(x₃ + x₁) + y₃(x₁ + x₂)]","1/2[x₁(y₂ – y₃) – x₂(y₃ – y₁) – x₃(y₁ – y₂)]"],
answer:"1/2[x₁(y₂ – y₃) + x₂(y₃ – y₁) + x₃(y₁ – y₂)]"
},

{
    question: "यदि p(x) = q(x) × g(x) और p(x) का घात = 6 और g(x) का घात = 2 हो, तो p(x)/g(x) का घात होगा।",
    option:["4",
            "6",
            "3",
            "इनमें से कोई नहीं"],
    answer:"4"
},

{
question: "cosec45° का मान है:",

option:["2",
        "1/√2",
        "√2",
        "1/2"],

answer:"√2"
},

{
question: "यदि 4, 5, 9, 11 और x का माध्य 7 है, तो x का मान है:",
option:["6",
        "4",
        "8",
        "7"],
answer:"6"
},

{
question: "यदि कोई रेखा वृत्त को सिर्फ एक बिन्दु पर स्पर्श करती है, तो वह रेखा कहलाती है:",
option:["जीवा",
        "स्पर्श रेखा",
        "छेदक रेखा",
        "इनमें से कोई नहीं"],
answer:"स्पर्श रेखा"
},

{
    question: "ΔABC में D और E क्रमशः भुजाओं AB और AC पर स्थित हैं तथा DE || BC। यदि AD/DB = 1/2 और AC = 27 सेमी तो EC = ?",
    option:["9 सेमी",
            "18 सेमी",
            "27 सेमी",
            "36 सेमी"],
    answer:"18 सेमी"
},

{
question: "यदि sinθ = cosθ, तो θ किसके बराबर है?",

option:["45°",
        "30°",
        "90°",
        "60°"],

answer:"45°"
},

{
question: "किससे माध्यिका आलेखीय ढंग से ज्ञात की जा सकती है?",
option:["आयत चित्र",
        "बारंबारता वक्र",
        "तोरण",
        "इनमें कोई नहीं"],
answer:"तोरण"
},

{
    question: "p(x) = x² – 3x – 4, तो p(x) का एक शून्यक होगा:",
    option:["2",
            "4",
            "0",
            "3"],
    answer:"4"
},

{
    question: "दो खंभे 13 m और 7 m ऊँचे हैं और समतल जमीन पर ऊर्ध्वाधर खड़े हैं। यदि उनके पादों के बीच की दूरी 8 m है, तो उनके सिरों के बीच की दूरी है-",
    option:["9 m",
            "10 m",
            "11 m",
            "12 m"],
    answer:"10 m"
},

{
question: "(2tan30°)/(1 + tan²30°) =",

option:["sin60°",
        "cos60°",
        "tan60°",
        "sin30°"],

answer:"sin60°"
},

{
question: "(1 + tan²A)/cosec²A बराबर होता है:",

option:["sec²A",
        "cosec²A",
        "cot²A",
        "tan²A"],

answer:"tan²A"
},

{
question: "यदि √2 cosθ = 1 हो, तो θ का मान होगा:",

option:["60°",
        "45°",
        "30°",
        "0°"],

answer:"45°"
},

{
question: "यदि θ = 60°, तो sin θ + cos θ का मान होगा:",

option:["(√3 + 1)/2",
        "2",
        "1",
        "इनमें से कोई नहीं"],

answer:"(√3 + 1)/2"
},

{
question: "यदि 2sin 2θ = √3, तो θ बराबर है:",

option:["30°",
        "45°",
        "0°",
        "90°"],

answer:"30°"
},

{
question: "(1 – cos²θ)(1 + cot²θ) बराबर है:",

option:["0",
        "-1",
        "1/2",
        "1"],

answer:"1"
},

{
question: "यदि θ = 90° हो तो sin θ – cos θ =",

option:["0",
        "1",
        "-1",
        "1/2"],

answer:"1"
},

{
question: "cos A × tan A =",

option:["1",
        "sin A",
        "0",
        "cos A"],

answer:"sin A"
},

{
question: "यदि θ = 30°, तो 2 cos 2θ का मान होगा:",

option:["1",
        "2",
        "√3",
        "√2"],

answer:"1"
},

{
question: "sec²θ – 1 का मान है:",

option:["cosec²θ",
        "sin²θ",
        "tan²θ",
        "cot²θ"],

answer:"tan²θ"
},

{
question: "1 + cot²θ का मान होगा:",

option:["sec²θ",
        "cosec²θ",
        "tan²θ",
        "cot²θ"],

answer:"cosec²θ"
},

{
    question: "सूर्य का उन्नयन कोण, जब किसी सीधे खड़े खम्भे की छाया और उसकी लम्बाई (ऊँचाई) बराबर हो, है:",
    option:["π/2",
            "π/3",
            "π/4",
            "π/6"],
    answer:"π/4"
},

{
question: "निम्नलिखित में से कौन tan A के बराबर है?",

option:["√(1 + sec²A)",
        "√(sec²A – 1)",
        "√(1 – sec²A)",
        "√(cosec²A – 1)"],

answer:"√(sec²A – 1)"
},

{
question: "यदि 0° < θ < 90° तथा sin θ = y तो cos θ का मान है:",

option:["1 – y²",
        "1 + y²",
        "√(1 – y²)",
        "√(1 + y²)"],

answer:"√(1 – y²)"
},

{
question: "यदि 2sinA = √3 तो A का मान होगा:",

option:["30°",
        "60°",
        "50°",
        "90°"],

answer:"60°"
},

{
question: "यदि cosec θ = √10 हो, तो sec θ = ?",

option:["3/√10",
        "√10/3",
        "1/√10",
        "2/√10"],

answer:"√10/3"
},

{
question: "यदि sec θ = 13/12 हो, तो cot θ बराबर है:",

option:["5/12",
        "5/13",
        "12/5",
        "13/5"],

answer:"12/5"
},

{
question: "(1 + cot²A)/(1 + tan²A) बराबर है:",

option:["sec²A",
        "cosec²A",
        "cot²A",
        "tan²A"],

answer:"cot²A"
},

{
question: "यदि sin θ = 1/2 हो, तो θ का मान होगा:",

option:["60°",
        "45°",
        "90°",
        "30°"],

answer:"30°"
},

{
question: "[2(1 – sin²A)]/(cos²A) का मान है:",

option:["1",
        "-2",
        "2",
        "0"],

answer:"2"
},

{
question: "cos 60° cos 30° – sin 60° sin 30° का मान है:",

option:["1",
        "2",
        "0",
        "-1"],

answer:"1"
},

{
question: "यदि tan(α + β) = √3 और tanα = 1/√3 तब tanβ =", 

option:["1/6",
        "1/7",
        "1/√3",
        "7/6"],

answer:"1/√3"
},

{
question: "2cos37°/sin53° =",

option:["0",
        "-1",
        "1",
        "2"],

answer:"2"
},

{
question: "निम्न में किसका मान θ के बराबर है?",

option:["sin90°",
        "cos90°",
        "cos0°",
        "tan90°"],

answer:"cos90°"
},

{
question: "यदि 5cotθ = 3 तब (5sinθ – 3cosθ)/(4sinθ + 3cosθ) बराबर है:",

option:["11/18",
        "16/29",
        "14/27",
        "11/29"],

answer:"16/29"
},

{
question: "यदि cosA = 1/2 हो, तो 1 – 2cos²A का मान है:",

option:["1/2",
        "2/3",
        "1/4",
        "1/3"],

answer:"1/2"
},

{
question: "sec 11°/cosec 79° का मान होगा:",

option:["1",
        "0",
        "2",
        "-1"],

answer:"1"
},

{
question: "tan49°/cot41° =",

option:["3",
        "2",
        "1",
        "6"],

answer:"1"
},

{
question: "tan65°/cot25° का मान है:",

option:["1",
        "-1",
        "0",
        "1/2"],

answer:"1"
},

{
question: "यदि A और B दो ऐसे न्यूनकोण हों कि sin A = cos B, तब (A + B) = ?",

option:["45°",
        "60°",
        "90°",
        "30°"],

answer:"90°"
},

{
    question: "उन्नयन कोण एवं अवनमन कोण में क्या संबंध होता है :",
    option:["समान",
            "असमान",
            "दोनों",
            "इनमें से कोई नहीं"],
    answer:"समान"
},

{
question: "sin 59°/cos 31° का मान है:",

option:["0",
        "-1",
        "1",
        "इनमें से कोई नहीं"],

answer:"1"
},

{
question: "यदि sin θ = √2 cos θ, तो sec θ का मान है:",

option:["1/√3",
        "√3",
        "√3/2",
        "2/√3"],

answer:"√3"
},

{
question: "sin θ बराबर है –",

option:["1 + tan²θ",
        "1/cosec θ",
        "1/cos θ",
        "sec²θ – 1"],

answer:"1/cosec θ"
},

  
];

// --- Helper: Get random questions ---
const getRandomQuestions = (count) => {
  const shuffled = [...mathQuestions].sort(() => Math.random() - 0.5);
  return shuffled.slice(0, count);
};

// --- Build the complete question paper (100 questions) ---
const buildQuestionPaper = () => {
  return getRandomQuestions(100);
};

// --- Component ---
export default function BSEBClass10MathMockTest() {
  const [started, setStarted] = useState(false);
  const [submitted, setSubmitted] = useState(false);
  const [timer, setTimer] = useState(3600); // 1 hour = 3600 seconds
  const [questions] = useState(buildQuestionPaper);
  const [current, setCurrent] = useState(0);
  const [answers, setAnswers] = useState({});
  const [score, setScore] = useState(0);
  const [resultDetails, setResultDetails] = useState([]);
  const [showTimerWarning, setShowTimerWarning] = useState(false);

  useEffect(() => {
    if (started && !submitted && timer > 0) {
      const t = setInterval(() => {
        setTimer((p) => {
          if (p <= 60) setShowTimerWarning(true);
          return p - 1;
        });
      }, 1000);
      return () => clearInterval(t);
    }
    if (timer === 0 && started && !submitted) {
      submitExam();
    }
  }, [started, submitted, timer]);

  const startExam = () => {
    setStarted(true);
  };

  const submitExam = () => {
    let s = 0;
    const details = questions.map((q, i) => {
      const isCorrect = answers[i] === q.answer;
      if (isCorrect) s++;
      return {
        question: q.question,
        option: q.option,
        correctAnswer: q.answer,
        userAnswer: answers[i] || "Not Attempted",
        isCorrect: isCorrect,
      };
    });
    setScore(s);
    setResultDetails(details);
    setSubmitted(true);
  };

  // Home Page - Mobile Optimized
  if (!started) {
    return (
      <div style={{
        minHeight: "100vh",
        display: "flex",
        justifyContent: "center",
        alignItems: "center",
        background: "linear-gradient(135deg, #0d47a1 0%, #1565c0 50%, #1976d2 100%)",
        fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif",
        padding: "20px"
      }}>
        <div style={{
          backgroundColor: "white",
          padding: "25px 20px",
          borderRadius: "16px",
          boxShadow: "0 20px 60px rgba(0,0,0,0.6)",
          textAlign: "center",
          maxWidth: "500px",
          width: "100%"
        }}>
          <div style={{ fontSize: "48px", marginBottom: "5px" }}>📐</div>
          <h1 style={{ 
            color: "#0d47a1", 
            marginBottom: "3px", 
            fontSize: "22px",
            fontWeight: "700"
          }}>
            BSEB Class 10 Math Mock Test
          </h1>
          <p style={{ color: "#666", fontSize: "12px", marginBottom: "15px" }}>
            Bihar School Examination Board - 2026
          </p>
          <div style={{
            height: "3px",
            background: "linear-gradient(90deg, #0d47a1, #1976d2)",
            margin: "10px auto",
            width: "60px"
          }}></div>
          
          <div style={{
            display: "grid",
            gridTemplateColumns: "1fr 1fr",
            gap: "10px",
            marginTop: "15px"
          }}>
            <div style={{ 
              backgroundColor: "#e3f2fd", 
              padding: "12px", 
              borderRadius: "10px"
            }}>
              <div style={{ fontSize: "11px", color: "#666" }}>📝 Total Questions</div>
              <div style={{ fontSize: "22px", fontWeight: "bold", color: "#0d47a1" }}>100</div>
            </div>
            <div style={{ 
              backgroundColor: "#e3f2fd", 
              padding: "12px", 
              borderRadius: "10px"
            }}>
              <div style={{ fontSize: "11px", color: "#666" }}>⏱️ Time Limit</div>
              <div style={{ fontSize: "22px", fontWeight: "bold", color: "#0d47a1" }}>60 Minutes</div>
            </div>
          </div>

          <div style={{
            backgroundColor: "#fff3e0",
            padding: "12px",
            borderRadius: "10px",
            marginTop: "15px",
            fontSize: "12px",
            color: "#e65100",
            textAlign: "left"
          }}>
            <strong>📋 Instructions:</strong>
            <ul style={{ margin: "5px 0 0 0", paddingLeft: "18px" }}>
              <li>All questions are compulsory</li>
              <li>Each question carries <strong>1 mark</strong></li>
              <li><strong>No negative marking</strong></li>
              <li>Submit before time runs out</li>
            </ul>
          </div>

          <button
            onClick={startExam}
            style={{
              padding: "14px 40px",
              fontSize: "18px",
              fontWeight: "bold",
              background: "linear-gradient(135deg, #0d47a1 0%, #1976d2 100%)",
              color: "white",
              border: "none",
              borderRadius: "50px",
              cursor: "pointer",
              marginTop: "20px",
              width: "100%",
              transition: "transform 0.3s, box-shadow 0.3s",
              boxShadow: "0 4px 15px rgba(25, 118, 210, 0.4)"
            }}
          >
            🚀 Start
          </button>
        </div>
      </div>
    );
  }

  // Result Page - Mobile Optimized
  if (submitted) {
    const percentage = ((score / questions.length) * 100).toFixed(2);
    const isPassed = percentage >= 33;

    return (
      <div style={{
        minHeight: "100vh",
        background: "#f5f7fa",
        padding: "15px",
        fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif"
      }}>
        <div style={{
          maxWidth: "900px",
          margin: "0 auto"
        }}>
          {/* Result Card */}
          <div style={{
            backgroundColor: "white",
            borderRadius: "16px",
            padding: "25px 20px",
            boxShadow: "0 10px 40px rgba(0,0,0,0.1)",
            textAlign: "center",
            marginBottom: "20px"
          }}>
            <h1 style={{ 
              fontSize: "24px", 
              marginBottom: "5px",
              color: "#2d3748"
            }}>
              {isPassed ? "🎉 Congratulations!" : "📖 Keep Practicing!"}
            </h1>
            <p style={{ color: "#888", fontSize: "12px" }}>BSEB Class 10 Math Mock Test</p>
            <div style={{
              width: "80px",
              height: "80px",
              borderRadius: "50%",
              background: isPassed ? "#d4edda" : "#f8d7da",
              display: "flex",
              alignItems: "center",
              justifyContent: "center",
              margin: "15px auto",
              fontSize: "32px"
            }}>
              {isPassed ? "✅" : "📝"}
            </div>
            <div style={{ fontSize: "40px", fontWeight: "bold", color: "#0d47a1" }}>
              {score} <span style={{ fontSize: "20px", color: "#888" }}>/ {questions.length}</span>
            </div>
            <div style={{ 
              fontSize: "18px", 
              color: isPassed ? "#28a745" : "#dc3545", 
              marginTop: "5px",
              fontWeight: "600"
            }}>
              {percentage}% {isPassed ? "✔️ Passed" : "❌ Needs Improvement"}
            </div>
            {isPassed && (
              <div style={{
                marginTop: "10px",
                padding: "8px",
                backgroundColor: "#d4edda",
                borderRadius: "8px",
                color: "#155724",
                fontSize: "13px"
              }}>
                🎯 You have qualified the mock test!
              </div>
            )}
          </div>

          {/* Answer Review */}
          <div style={{
            backgroundColor: "white",
            borderRadius: "16px",
            padding: "20px 15px",
            boxShadow: "0 10px 40px rgba(0,0,0,0.1)"
          }}>
            <h2 style={{ 
              borderBottom: "2px solid #eee", 
              paddingBottom: "12px", 
              marginBottom: "15px",
              fontSize: "18px",
              color: "#2d3748"
            }}>
              📋 Answer Review
            </h2>
            {resultDetails.map((item, index) => (
              <div
                key={index}
                style={{
                  backgroundColor: item.isCorrect ? "#f0fff4" : "#fff5f5",
                  borderLeft: `4px solid ${item.isCorrect ? "#48bb78" : "#fc8181"}`,
                  padding: "12px 15px",
                  marginBottom: "12px",
                  borderRadius: "8px"
                }}
              >
                <div style={{ display: "flex", justifyContent: "space-between", alignItems: "flex-start" }}>
                  <h4 style={{ 
                    margin: "0", 
                    fontSize: "14px", 
                    color: "#2d3748",
                    flex: 1,
                    marginRight: "10px"
                  }}>
                    Q{index + 1}. {item.question}
                  </h4>
                  <span style={{ fontSize: "18px", flexShrink: 0 }}>
                    {item.isCorrect ? "✅" : "❌"}
                  </span>
                </div>
                <div style={{ marginTop: "8px", marginLeft: "5px", fontSize: "13px" }}>
                  <p style={{ margin: "3px 0" }}>
                    <strong>Your Answer:</strong>{" "}
                    <span style={{ color: item.isCorrect ? "#48bb78" : "#fc8181" }}>
                      {item.userAnswer}
                    </span>
                  </p>
                  {!item.isCorrect && (
                    <p style={{ margin: "3px 0" }}>
                      <strong>Correct Answer:</strong>{" "}
                      <span style={{ color: "#48bb78" }}>{item.correctAnswer}</span>
                    </p>
                  )}
                </div>
              </div>
            ))}
          </div>

          <div style={{ textAlign: "center", marginTop: "20px" }}>
            <button
              onClick={() => {
                setStarted(false);
                setSubmitted(false);
                setAnswers({});
                setResultDetails([]);
                setTimer(3600);
                setShowTimerWarning(false);
                window.location.reload();
              }}
              style={{
                padding: "14px 35px",
                fontSize: "16px",
                fontWeight: "bold",
                background: "linear-gradient(135deg, #0d47a1 0%, #1976d2 100%)",
                color: "white",
                border: "none",
                borderRadius: "50px",
                cursor: "pointer",
                width: "100%",
                maxWidth: "300px",
                boxShadow: "0 4px 15px rgba(25, 118, 210, 0.4)"
              }}
            >
              🔄 Take New Mock Test
            </button>
          </div>
        </div>
      </div>
    );
  }

  // Exam Page - Mobile Optimized
  const q = questions[current];
  const answeredCount = Object.keys(answers).length;

  return (
    <div style={{
      minHeight: "100vh",
      background: "#f5f7fa",
      padding: "10px",
      fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif"
    }}>
      <div style={{
        maxWidth: "800px",
        margin: "0 auto"
      }}>
        {/* Header - Mobile Optimized */}
        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "10px 14px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginBottom: "10px",
          display: "flex",
          justifyContent: "space-between",
          alignItems: "center"
        }}>
          <div style={{ flex: 1 }}>
            <p style={{ 
              margin: "0", 
              fontSize: "11px", 
              color: "#718096"
            }}>
              Q{current + 1}/{questions.length}
            </p>
            <p style={{ 
              margin: "2px 0 0", 
              fontSize: "10px", 
              color: "#a0aec0"
            }}>
              Answered: {answeredCount}/{questions.length}
            </p>
          </div>
          <div style={{
            fontSize: "20px",
            fontWeight: "bold",
            color: timer < 60 ? "#fc8181" : "#0d47a1",
            display: "flex",
            alignItems: "center",
            gap: "6px"
          }}>
            <span style={{ fontSize: "16px" }}>⏱️</span>
            <span>{Math.floor(timer / 60)}:{String(timer % 60).padStart(2, "0")}</span>
          </div>
        </div>

        {/* Question Card */}
        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "16px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginBottom: "10px"
        }}>
          <div style={{
            display: "inline-block",
            backgroundColor: "#e3f2fd",
            padding: "2px 10px",
            borderRadius: "12px",
            fontSize: "11px",
            color: "#0d47a1",
            marginBottom: "12px"
          }}>
            📌 Q{current + 1}
          </div>
          <h3 style={{
            fontSize: "16px",
            color: "#0d47a1",
            marginBottom: "16px",
            fontWeight: "600",
            lineHeight: "1.5"
          }}>
            {q.question}
          </h3>

          <div style={{ marginTop: "5px" }}>
            {q.option.map((op, idx) => (
              <div
                key={idx}
                style={{
                  padding: "10px 12px",
                  margin: "5px 0",
                  backgroundColor: answers[current] === op ? "#e3f2fd" : "#f7fafc",
                  border: answers[current] === op ? "2px solid #0d47a1" : "2px solid transparent",
                  borderRadius: "8px",
                  cursor: "pointer",
                  transition: "all 0.2s",
                  display: "flex",
                  alignItems: "center"
                }}
                onClick={() => setAnswers({ ...answers, [current]: op })}
              >
                <input
                  type="radio"
                  id={`q${current}-opt${idx}`}
                  name={`question-${current}`}
                  checked={answers[current] === op}
                  onChange={() => {}}
                  style={{ marginRight: "10px", width: "16px", height: "16px", flexShrink: 0 }}
                />
                <label
                  htmlFor={`q${current}-opt${idx}`}
                  style={{
                    fontSize: "14px",
                    cursor: "pointer",
                    flex: 1,
                    margin: "0",
                    color: "#2d3748"
                  }}
                >
                  {op}
                </label>
              </div>
            ))}
          </div>
        </div>

        {/* Navigation */}
        <div style={{
          display: "flex",
          gap: "8px",
          flexWrap: "wrap",
          justifyContent: "space-between"
        }}>
          <div style={{ display: "flex", gap: "8px" }}>
            <button
              onClick={() => setCurrent(Math.max(0, current - 1))}
              disabled={current === 0}
              style={{
                padding: "8px 14px",
                fontSize: "13px",
                backgroundColor: current === 0 ? "#e2e8f0" : "#0d47a1",
                color: current === 0 ? "#a0aec0" : "white",
                border: "none",
                borderRadius: "8px",
                cursor: current === 0 ? "not-allowed" : "pointer",
                fontWeight: "600",
                transition: "all 0.2s"
              }}
            >
              ⬅ Prev
            </button>
            <button
              onClick={() => setCurrent(Math.min(questions.length - 1, current + 1))}
              disabled={current === questions.length - 1}
              style={{
                padding: "8px 14px",
                fontSize: "13px",
                backgroundColor: current === questions.length - 1 ? "#e2e8f0" : "#0d47a1",
                color: current === questions.length - 1 ? "#a0aec0" : "white",
                border: "none",
                borderRadius: "8px",
                cursor: current === questions.length - 1 ? "not-allowed" : "pointer",
                fontWeight: "600",
                transition: "all 0.2s"
              }}
            >
              Next ➡
            </button>
          </div>

          <button
            onClick={submitExam}
            style={{
              padding: "8px 18px",
              fontSize: "13px",
              backgroundColor: "#f57c00",
              color: "white",
              border: "none",
              borderRadius: "8px",
              cursor: "pointer",
              fontWeight: "600",
              transition: "all 0.2s",
              boxShadow: "0 2px 8px rgba(245, 124, 0, 0.3)"
            }}
          >
            📤 Submit
          </button>
        </div>

        {/* Question Navigator */}
        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "12px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginTop: "10px"
        }}>
          <p style={{ 
            margin: "0 0 8px 0", 
            color: "#718096", 
            fontSize: "11px", 
            fontWeight: "600" 
          }}>
            Question Navigator - {answeredCount}/{questions.length}
          </p>
          <div style={{
            display: "flex",
            flexWrap: "wrap",
            gap: "5px"
          }}>
            {questions.map((_, idx) => (
              <button
                key={idx}
                onClick={() => setCurrent(idx)}
                style={{
                  width: "32px",
                  height: "32px",
                  fontSize: "11px",
                  backgroundColor: answers[idx] ? "#48bb78" : 
                                   current === idx ? "#0d47a1" : "#e2e8f0",
                  color: answers[idx] ? "white" :
                         current === idx ? "white" : "#4a5568",
                  border: current === idx ? "2px solid #0d47a1" : "none",
                  borderRadius: "6px",
                  cursor: "pointer",
                  fontWeight: "bold",
                  transition: "all 0.2s"
                }}
              >
                {idx + 1}
              </button>
            ))}
          </div>
          <div style={{
            display: "flex",
            gap: "12px",
            marginTop: "8px",
            fontSize: "10px",
            color: "#4a5568",
            flexWrap: "wrap"
          }}>
            <span>🟢 Attempted</span>
            <span>🔵 Current</span>
            <span>⚪ Not Attempted</span>
          </div>
        </div>

        {/* Timer Warning */}
        {showTimerWarning && (
          <div style={{
            position: "fixed",
            bottom: "15px",
            right: "15px",
            left: "15px",
            backgroundColor: "#fc8181",
            color: "white",
            padding: "12px 18px",
            borderRadius: "10px",
            boxShadow: "0 4px 15px rgba(252, 129, 129, 0.4)",
            textAlign: "center",
            fontSize: "14px",
            fontWeight: "600",
            animation: "pulse 1.5s ease-in-out infinite",
            maxWidth: "400px",
            margin: "0 auto"
          }}>
            ⚠️ Less than 1 minute remaining!
          </div>
        )}
      </div>
      <style>
        {`
          @keyframes pulse {
            0% { opacity: 1; }
            50% { opacity: 0.6; }
            100% { opacity: 1; }
          }
        `}
      </style>
    </div>
  );
}