// BusinessStudies12thQuiz.jsx
import React, { useState, useEffect, useRef } from "react";

// --- 12th Business Studies Question Bank (100 questions) - Hindi & English ---

// Hindi Questions
const businessStudiesHindi = [
  {
    question: "प्रबंध कला है:",
    option: [
        "स्वयं काम करने की",
        "दुसरों से काम लेने की",
        "स्वयं काम करने एवं दूसरों से काम लेने दोनों की",
        "इनमें से कोई नहीं।"
    ],
    answer: "स्वयं काम करने एवं दूसरों से काम लेने दोनों की"
},

{
    question: "विपणन अवधारणा है-",
    option: [
        "उत्पादनोन्मुखी",
        "विक्रयोन्मुखी",
        "ग्राहकोन्मुखी",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "प्रशिक्षण के अंतर्गत कर्मचारियों को ............... क्षेत्र/क्षेत्रों में निपुण बनाया जाता है।",
    option: [
        "एक विशेष",
        "दो",
        "तीन",
        "सभी"
    ],
    answer: "एक विशेष"
},

{
    question: "निम्न में से कौन-सा समता पर व्यापार का प्रकार है ?",
    option: [
        "अल्प-समता पर व्यापार",
        "उच्च समता पर व्यापार",
        "A तथा B दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "A तथा B दोनों"
},

{
    question: "संयुक्त राष्ट्र संघ के कितने अंग हैं?",
    option: [
        "2",
        "4",
        "6",
        "8"
    ],
    answer: "6"
},

{
    question: "मास्टर बजट ...............के लिए बनाया जाता है।",
    option: [
        "एक विभाग",
        "दो विभागों",
        "रोकेड विभाग",
        "सभी विभागों"
    ],
    answer: "सभी विभागों"
},

{
    question: "वैज्ञानिक प्रबंध के जन्मदाता कौन थे:",
    option: [
        "एच.एस. पर्सन",
        "डाइमर",
        "एफ. डब्ल्यू. टेलर",
        "चार्ल्स बैबेज"
    ],
    answer: "एफ. डब्ल्यू. टेलर"
},

{
    question: "नियुक्तिकरण है :",
    option: [
        "नियोजन करना",
        "नियंत्रण करना",
        "निर्देशित करना",
        "व्यक्तियों को कार्य पर लगाना"
    ],
    answer: "व्यक्तियों को कार्य पर लगाना"
},

{
    question: "सुरक्षा परिषद् में कुल अस्थायी सदस्यों की संख्या कितनी है?",
    option: [
        "10",
        "6",
        "7",
        "14"
    ],
    answer: "10"
},

{
    question: "जिला मंच विवादों का निपटारा कर सकता है",
    option: [
        "₹ 5 लाख तक",
        "₹ 10 लाख तक",
        "₹ 15 लाख तक",
        "₹ 20 लाख तक"
    ],
    answer: "₹ 20 लाख तक"
},

{
    question: "प्रबंध की प्रकृति है:",
    option: [
        "जन्मजात प्रतिभा के रूप में",
        "अर्जित प्रतिभा के रूप में",
        "जन्मजात प्रतिभा तथा अर्जित प्रतिभा दोनों के रूप में",
        "कोई नहीं"
    ],
    answer: "जन्मजात प्रतिभा तथा अर्जित प्रतिभा दोनों के रूप में"
},

{
    question: "प्रबंधक + नेतृत्व योग्यता = ............।",
    option: [
        "हानि",
        "सफलता",
        "असफलता",
        "शून्य"
    ],
    answer: "सफलता"
},

{
    question: "प्रबन्ध अंकेक्षण किसके निष्पादन पर निगरानी रखने की एक तकनीक है :",
    option: [
        "कंपनी",
        "कंपनी का प्रबन्ध",
        "अंशधारी",
        "ग्राहक"
    ],
    answer: "कंपनी का प्रबन्ध"
},

{
    question: "निम्न में से विपणन मिश्रण का तत्व कौन-सा है ?",
    option: [
        "उत्पाद",
        "मूल्य",
        "संवर्धन",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "पूँजी बाजार व्यवहार करता है",
    option: [
        "दीर्घकालीन कोष",
        "मध्यकालीन कोष",
        "अल्पकालीन कोष",
        "इनमें कोई नहीं"
    ],
    answer: "दीर्घकालीन कोष"
},

{
    question: "उच्चस्तरीय प्रबंध नियोजन पर अपने समय का भाग व्यय करता है:",
    option: [
        "35%",
        "50%",
        "75%",
        "100%"
    ],
    answer: "35%"
},

{
    question: "राष्ट्रसंघ की स्थापना कब हुई?",
    option: [
        "10 जनवरी, 1920",
        "10 जनवरी, 1919",
        "24 अक्टूबर, 1945",
        "15 अगस्त, 1948"
    ],
    answer: "10 जनवरी, 1920"
},

{
    question: "वर्ष 2004 में भारत में स्कन्ध विपणियों की संख्या थी :",
    option: [
        "20",
        "21",
        "23",
        "24"
    ],
    answer: "24"
},

{
    question: "सामाजिक उपगम्यता के अनुसार उद्यमिता है—",
    option: [
        "भावुकता की प्रक्रिया",
        "भूमिका निष्पादन प्रक्रिया",
        "आर्थिक परिवर्तन की प्रक्रिया",
        "इनमें से सभी"
    ],
    answer: "भूमिका निष्पादन प्रक्रिया"
},

{
    question: "एक व्यक्ति को निम्न में से कौन-सी आवश्यकता अभिप्रेरित करती हैं।",
    option: [
        "कार्यसिद्धि",
        "शक्ति",
        "सम्बन्धन व स्वतंत्रता",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "नियुक्तिकरण उत्तरदायित्व है :",
    option: [
        "निम्न प्रबन्ध",
        "मध्यम प्रबन्ध",
        "उच्च प्रबन्ध",
        "इन सभी का"
    ],
    answer: "इन सभी का"
},

{
    question: "सेबी का मुख्य कार्यालय है :",
    option: [
        "दिल्ली",
        "मुंबई",
        "कोलकाता",
        "चेन्नई"
    ],
    answer: "मुंबई"
},

{
    question: "अब्राहम मास्लो की आवश्यकता सीढ़ी में सबसे उच्च आवश्यकता स्तर है :",
    option: [
        "सुरक्षा आवश्यकता",
        "संबंध आवश्यकता",
        "आत्म संतुष्टि की आवश्यकता",
        "प्रतिष्ठा आवश्यकता"
    ],
    answer: "आत्म संतुष्टि की आवश्यकता"
},

{
    question: "स्टाफिंग का कार्य है",
    option: [
        "भर्ती करना",
        "प्रशिक्षण प्रदान करना",
        "कार्य पर नियुक्ति करना",
        "ये सभी कार्य सम्पन्न करना"
    ],
    answer: "ये सभी कार्य सम्पन्न करना"
},

{
    question: "व्यावसायिक वातावरण……….को मदद नहीं करता है।",
    option: [
        "बाधा",
        "अवसर",
        "संसाधन",
        "निश्चितता"
    ],
    answer: "निश्चितता"
},

{
    question: "स्थायी पूँजी की आवश्यकता होती है",
    option: [
        "दैनिक व्ययों का भुगतान करने के लिए",
        "भूमि खरीदने के लिए",
        "स्टॉक खरीदने के लिए",
        "लेनदारों का भुगतान करने के लिए"
    ],
    answer: "भूमि खरीदने के लिए"
},

{
    question: "एक उद्यमी को की स्थिति में क्षमतावान उद्यमी कहा जाता है",
    option: [
        "न्यूनतम सामर्थ्य व न्यूनतम इच्छा",
        "न्यूनतम सामर्थ्य व अधिकतम इच्छा",
        "अधिकतम सामर्थ्य व न्यूनतम इच्छा",
        "अधिकतम सामर्थ्य व अधिकतम इच्छा"
    ],
    answer: "अधिकतम सामर्थ्य व न्यूनतम इच्छा"
},

{
    question: "भारत में स्कन्ध विपणियों का भविष्य है :",
    option: [
        "उज्जवल",
        "अंधेरे में",
        "सामान्य",
        "कोई भविष्य नहीं"
    ],
    answer: "उज्जवल"
},

{
    question: "निर्देशन प्रबन्ध का ............ पहलू नहीं है।",
    option: [
        "व्यावहारिक",
        "सैद्धान्तिक",
        "अन्तर-व्यक्तिगत",
        "सकारात्मक"
    ],
    answer: "सैद्धान्तिक"
},

{
    question: "संयुक्त राष्ट्र संघ के प्रथम एशियाई महासचिव कौन थे?",
    option: [
        "बान की मून",
        "यू थांट",
        "कोफी अन्नान",
        "बुतरस घाली"
    ],
    answer: "यू थांट"
},

{
    question: "नई आर्थिक नीति के प्रमुख अंग हैं :",
    option: [
        "उदारीकरण",
        "वैश्वीकरण",
        "निजीकरण",
        "ये सभी"
    ],
    answer: "ये सभी"
},

{
    question: "मानव संसाधन प्रबन्ध में निम्नलिखित में से क्या सम्मिलित किया जाता है ?",
    option: [
        "भर्ती",
        "विशेषज्ञ सेवाएँ",
        "शिकायत निवारण",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "उद्यमिता के उपलब्ध/अवरोध पोषित करते हैं",
    option: [
        "नव सृजन",
        "लाभदायकता",
        "अनिश्चितता",
        "इनमें कोई नहीं"
    ],
    answer: "नव सृजन"
},

{
    question: "संयुक्त राष्ट्र संघ का सबसे बड़ा अंग कौन है?",
    option: [
        "सुरक्षा परिषद",
        "महासभा",
        "सचिवालय",
        "अन्तर्राष्ट्रीय न्यायालय"
    ],
    answer: "महासभा"
},

{
    question: "नारायण मूर्ति द्वारा प्रोत्साहित/प्रवर्तक सॉफ्टवेयर कंपनी है :",
    option: [
        "विप्रो",
        "इन्फोसिस",
        "सत्यम",
        "एक सी० एल०"
    ],
    answer: "इन्फोसिस"
},

{
    question: "निम्न में से किसे उपभोक्ता नहीं माना जा सकता ?",
    option: [
        "वह व्यक्ति जो पुनः बेचने के लिए वस्तुएँ खरीदता है",
        "वह व्यक्ति जो बिना प्रतिफल के वस्तुएँ प्राप्त करता है",
        "वह व्यक्ति जो क्रेता की स्वीकृति के बिना वस्तुएँ प्रयोग करता",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "बजटीय नियंत्रण के लिए तैयारी आवश्यक हैं",
    option: [
        "प्रशिक्षण समय-सारणी",
        "बजट",
        "नेटवर्क आरेख",
        "उत्तरदायित्व"
    ],
    answer: "बजट"
},

{
    question: "NSE के सूचकांक को .................. कहते हैं",
    option: [
        "INDEX",
        "NIFTY",
        "SENSEX",
        "LISTING"
    ],
    answer: "NIFTY"
},

{
    question: "वैज्ञानिक प्रबंध में उत्पादन होता है :",
    option: [
        "अधिकतम",
        "न्यूनतम",
        "सामान्य",
        "औसत"
    ],
    answer: "अधिकतम"
},

{
    question: "उद्यमिता के परिणाम को निम्न में से क्या कहा जाता है?",
    option: [
        "उद्यमी",
        "उद्यमिता",
        "उपक्रम",
        "उद्यमी व उद्यमित"
    ],
    answer: "उपक्रम"
},

{
    question: "विश्व शांति बनाए रखने का दायित्व किस पर है?",
    option: [
        "महासभा",
        "सुरक्षा परिषद",
        "आर्थिक व सामाजिक परिषद",
        "महासचिव"
    ],
    answer: "सुरक्षा परिषद"
},

{
    question: ".................संदेशवाहन के माध्यम का उदाहरण है।",
    option: [
        "पत्र",
        "टेलीफोन",
        "ई-मेल",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "राज्य आयोग विवादों का निपटारा कर सकता है",
    option: [
        "₹ 5 लाख तक",
        "₹ 10 लाख तक",
        "₹ 20 लाख तक",
        "₹ 20 लाख से अधिक"
    ],
    answer: "₹ 20 लाख से अधिक"
},

{
    question: "सेंसेक्स .................. कम्पनियों पर आधारित है।",
    option: [
        "30",
        "50",
        "100",
        "500"
    ],
    answer: "30"
},

{
    question: "पर्यवेक्षक कर्मचारियों का है",
    option: [
        "मित्र",
        "मार्गदर्शक",
        "दार्शनिक",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "स्थायी पूँजी में विनियोग सम्बन्धी निर्णय कहलाता है :",
    option: [
        "स्थायी पूँजी निर्णय",
        "कार्यशील पूँजी निर्णय",
        "उपरोक्त दोनों",
        "कोई नहीं"
    ],
    answer: "स्थायी पूँजी निर्णय"
},

{
    question: "प्राथमिक एवं द्वितीयक बाजार :",
    option: [
        "एक-दूसरे से प्रतिस्पर्धा करते हैं",
        "एक-दूसरे को सहयोग देते (संपूरक) हैं",
        "स्वतंत्र रूप से कार्य करते हैं",
        "एक-दूसरे को नियंत्रित करते हैं"
    ],
    answer: "एक-दूसरे को सहयोग देते (संपूरक) हैं"
},

{
    question: "एन. एस. ई. के भावी व्यापार की शुरूआत किस वर्ष में हुई ?",
    option: [
        "1999",
        "2000",
        "2001",
        "2002"
    ],
    answer: "2000"
},

{
    question: "प्रभावी नियंत्रण है",
    option: [
        "स्थिर",
        "निर्धारित",
        "गतिशील",
        "इनमें से सभी"
    ],
    answer: "गतिशील"
},

{
    question: "नियुक्तिकरण है :",
    option: [
        "संगठन का भाग",
        "कर्मचारी प्रबन्ध कार्य",
        "प्रबन्ध का कार्य",
        "ये सभी"
    ],
    answer: "ये सभी"
},

{
    question: "उद्यमी के कार्य हैं",
    option: [
        "व्यावसायिक विचार की कल्पनाप",
        "परियोजना सम्भाव्यता अध्ययन",
        "उपक्रम की स्थापना करना",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "NSE पर सूचीबद्ध होने के लिए न्यूनतम पूंजी की सीमा है।",
    option: [
        "₹3 करोड़ व अधिक",
        "₹30 लाख व अधिक",
        "₹10 करोड़ व अधिक",
        "₹10 लाख व अधिक"
    ],
    answer: "₹3 करोड़ व अधिक"
},

{
    question: "विश्व श्रम संगठन का मुख्यालय अवस्थित है-",
    option: [
        "जिनेवा में",
        "पेरिस में",
        "दिल्ली में",
        "लंदन में"
    ],
    answer: "जिनेवा में"
},

{
    question: "निम्न में से विपणन का कार्य कौन-सा है ?",
    option: [
        "संवर्धन",
        "भौतिक वितरण",
        "परिवहन",
        "इनमें से सभी"
    ],
    answer: "संवर्धन"
},

{
    question: "मास्लो का आवश्यकताओं का पदानुक्रम सिद्धांत तथा द्वारा शासित होता है कि :",
    option: [
        "लोग सार्वभौमिक रूप में आवश्यकताओं द्वारा प्रेरित होते हैं",
        "लोग आवश्यकताओं द्वारा सामाजिक रूप में प्रेरित होते हैं",
        "लोग राजनैतिक तौर पर आवश्यकताओं से प्रेरित होते हैं",
        "उपरोक्त में से कोई नहीं"
    ],
    answer: "लोग सार्वभौमिक रूप में आवश्यकताओं द्वारा प्रेरित होते हैं"
},

{
    question: "राष्ट्रीय आयोग उपभोक्ता विवादों का निपटारा कर सकता है",
    option: [
        "₹5 लाख तक",
        "₹ 10 लाख तक",
        "₹ 1 करोड़ तक",
        "₹ 10 करोड़ से अधिक"
    ],
    answer: "₹ 10 करोड़ से अधिक"
},

{
    question: "संयुक्त राष्ट्र संघ के पूर्व महासचिव बान की-मून किस देश के हैं?",
    option: [
        "अमेरिका",
        "ब्रिटेन",
        "चीन",
        "दक्षिण कोरिया"
    ],
    answer: "दक्षिण कोरिया"
},

{
    question: "हड़ताल, विचलन का .................. से संबंधित कारण है।",
    option: [
        "मानव",
        "अनिश्चित घटनाओं",
        "विभिन्न रुकावटों",
        "गलत प्रमापों"
    ],
    answer: "अनिश्चित घटनाओं"
},

{
    question: "बैज्ञानिक प्रबंध कब प्रारम्भ हुआ?",
    option: [
        "1913",
        "1832",
        "1903",
        "1920"
    ],
    answer: "1913"
},

{
    question: "कंपनी के मूल्य (Value of Company) पर किसका प्रभाव पड़ता है ?",
    option: [
        "पूँजी लागत",
        "अंशों का बाजार मूल्य",
        "उपरोक्त दोनों",
        "कोई नहीं"
    ],
    answer: "उपरोक्त दोनों"
},

{
    question: "मानसिक क्रांति मूलाधार है।",
    option: [
        "वैज्ञानिक प्रबंध",
        "संयोजन",
        "विवेकीकरण",
        "पेशा"
    ],
    answer: "वैज्ञानिक प्रबंध"
},

{
    question: "पेपर है",
    option: [
        "पुनर्खरीद समझौता (विलेख)",
        "रिलायन्स पेट्रोलियम",
        "रीड एण्ड प्रोसेस (पढ़ो और प्रक्रम करो)",
        "उपर्युक्त कुछ भी नहीं"
    ],
    answer: "पुनर्खरीद समझौता (विलेख)"
},

{
    question: "उद्यमी उठाता है :",
    option: [
        "सोची-समझी जोखिम",
        "उच्च जोखिम",
        "निम्न जोखिम",
        "सामान्य एवं त्याग की गई जोखिम"
    ],
    answer: "सामान्य एवं त्याग की गई जोखिम"
},

{
    question: "काम करने की योग्यता निम्न में से किससे पैदा होती है?",
    option: [
        "शिक्षण",
        "प्रशिक्षण",
        "शिक्षण एवं प्रशिक्षण",
        "अभिप्रेरणा"
    ],
    answer: "शिक्षण एवं प्रशिक्षण"
},

{
    question: "विश्व के देशों के बीच व्यापार संगठनों के लिए कौन-सा अन्तर्राष्ट्रीय संगठन है?",
    option: [
        "विश्व व्यापार संगठन",
        "अन्तर्राष्ट्रीय मुद्रा कोष",
        "विश्व बैंक",
        "इनमें से सभी"
    ],
    answer: "विश्व व्यापार संगठन"
},

{
    question: "उद्यमिता विकास कार्यक्रम के आलोचनात्मक मूल्यांकन बिन्दु हैं :",
    option: [
        "संगठनात्मक नीतियाँ",
        "उपयुक्त चयन प्रक्रिया का अभाव",
        "निम्न श्रेणी की तकनीकी एवं व्यावसायिक शिक्षा एवं प्रशिक्षण",
        "उपयुक्त सभी"
    ],
    answer: "उपयुक्त सभी"
},

{
    question: "संयुक्त राष्ट्र संघ के कितने अंग हैं?",
    option: [
        "दो",
        "चार",
        "छः",
        "आठ"
    ],
    answer: "छः"
},

{
    question: "परम्परागत प्रबंध में श्रमिकों को मजदूरी दी जाती थी।",
    option: [
        "कम",
        "अधिक",
        "अधिकतम",
        "सामान्य"
    ],
    answer: "कम"
},

{
    question: "किस देश ने सुरक्षा परिषद् में निषेधाधिकार का सर्वाधिक बार प्रयोग किया?",
    option: [
        "यू.एस.ए.",
        "फ्रांस",
        "रूस",
        "चीन"
    ],
    answer: "रूस"
},

{
    question: "कार्यशील पूँजी क्यों आवश्यक होती है ?",
    option: [
        "भूमि क्रय करने के लिए",
        "भवन क्रय करने के लिए",
        "दैनिक व्ययों के भुगतान के लिए",
        "मशीन क्रय करने के लिए"
    ],
    answer: "दैनिक व्ययों के भुगतान के लिए"
},

{
    question: "मानवाधिकारों की सार्वभौमिक घोषणा कब की गई?",
    option: [
        "1945 ई. में",
        "1946 ई. में",
        "1947 ई. में",
        "1948 ई. में"
    ],
    answer: "1948 ई. में"
},

{
    question: "प्रभावी संदेशवाहन में बाधा है :",
    option: [
        "भाषा",
        "दूरी",
        "व्यक्तिगत भिन्नताएँ",
        "उपर्युक्त सभी"
    ],
    answer: "उपर्युक्त सभी"
},

{
    question: "किसी गैर-सरकारी संगठन को तदर्थ मान्यता कौन दे सकता है?",
    option: [
        "महासचिव",
        "महासभा का अध्यक्ष",
        "सुरक्षा परिषद् का अध्यक्ष",
        "अन्तर्राष्ट्रीय न्यायालय का अध्यक्ष"
    ],
    answer: "महासचिव"
},

{
    question: "नये उत्पाद से उपभोक्ताओं को परिचित कराने में निम्न में से किसकी प्रमुख भूमिका रहती है ?",
    option: [
        "प्रचार",
        "व्यक्तिगत विक्रय",
        "विक्रय संवर्धन",
        "विज्ञापन"
    ],
    answer: "व्यक्तिगत विक्रय"
},

{
    question: "......................... विचारधारा उपभोक्ता कल्याण पर जोर देती है।",
    option: [
        "उत्पादन",
        "उत्पाद",
        "विपणन",
        "सामाजिक"
    ],
    answer: "सामाजिक"
},

{
    question: "उद्यमिता विकास कार्यक्रम प्रदान करता है :",
    option: [
        "बेरोजगारी",
        "रोजगार",
        "बेईमानी",
        "भ्रष्टाचार"
    ],
    answer: "रोजगार"
},

{
    question: "विज्ञापन के लिए .................. का होना आवश्यक है",
    option: [
        "व्यय",
        "प्रयास",
        "(A) और (B) दोनों",
        "टेलीविजन"
    ],
    answer: "(A) और (B) दोनों"
},

{
    question: "विश्व बैंक की स्थापना कब हुई?",
    option: [
        "1945 ई. में",
        "1947 ई. में",
        "1948 ई. में",
        "1944 ई. में"
    ],
    answer: "1944 ई. में"
},

{
    question: "संदेशवाहन प्रक्रिया में पत्र का भेजा जाना ............ का उदाहरण है।",
    option: [
        "संदेशवाहन",
        "संदेश",
        "संदेशबद्धता",
        "शोर"
    ],
    answer: "शोर"
},

{
    question: "निम्न में से किस नेतृत्व शैली में उच्च स्तरीय अभिप्रेरणा का लाभ मिलता है?",
    option: [
        "निरंकुश नेतृत्व शैली",
        "जनतांत्रीय नेतृत्व शैली",
        "स्वतंत्र नेतृत्व शैली",
        "इनमें से किसी में नहीं"
    ],
    answer: "स्वतंत्र नेतृत्व शैली"
},

{
    question: "यू.एन. वीमेन की स्थापना हुई है-",
    option: [
        "2009 ई. में",
        "2010 ई. में",
        "2011 ई. में",
        "2012 ई. में"
    ],
    answer: "2010 ई. में"
},

{
    question: "संदेशवाहन प्रक्रिया में .......... का विनिमय होता है।",
    option: [
        "विचारों",
        "आदेशों",
        "भावनाओं",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "कार्यशील पूँजी का निर्धारक है:",
    option: [
        "संस्था का आकार",
        "निर्माण प्रक्रिया की अवधि",
        "कच्चे माल की उपलब्धता",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "भारत की प्रगति की धीमी गति का प्रमुख कारण……….का अभाव है।",
    option: [
        "कुशल प्रबंध",
        "मानव शक्ति",
        "संसाधन",
        "ये सभी"
    ],
    answer: "कुशल प्रबंध"
},

{
    question: "'जल्दबाजी में क्रय न करें' यह उपभोक्ताओं के एक महत्वपूर्ण ................. है।",
    option: [
        "उत्तरदायित्व",
        "अधिकार",
        "अधिनियम",
        "उपरोक्त सभी"
    ],
    answer: "उत्तरदायित्व"
},

{
    question: "जिला फोरम में ₹ तक के मूल्य के विवादों से संबंधित शिकायतों का समाधान किया जाता है।",
    option: [
        "₹ 10 लाख",
        "₹ 30 लाख",
        "₹ 50 लाख",
        "₹ 20 लाख"
    ],
    answer: "₹ 20 लाख"
},

{
    question: ".................. पूँजी बाजार का अंग है।",
    option: [
        "मांग मुद्रा",
        "प्राथमिक बाजार",
        "गौण बाजार",
        "प्राथमिक व गौण बाजार"
    ],
    answer: "प्राथमिक व गौण बाजार"
},

{
    question: "सम्भावित उपभोक्ता तक व्यक्तिगत पहुँच स्थापित की जाती है ?",
    option: [
        "विज्ञापन द्वारा",
        "विक्रय संवर्धन उपायों द्वारा",
        "व्यक्तिगत विक्रय द्वारा",
        "इनमें कोई नहीं"
    ],
    answer: "व्यक्तिगत विक्रय द्वारा"
},

{
    question: "विज्ञापन के लिए ................. का होना आवश्यक है।",
    option: [
        "व्यय",
        "प्रयास",
        "उपरोक्त दोनों",
        "टेलीविजन"
    ],
    answer: "उपरोक्त दोनों"
},

{
    question: "वह सम्प्रेषण तंत्र जिसमें सभी अधीनस्थ जो पर्यवेक्षक के द्वारा संवाद करते हैं:",
    option: [
        "एकल प्रणाली / श्रृंखला",
        "इंवर्टेड",
        "पहिया",
        "किसी भी दिशा में"
    ],
    answer: "पहिया"
},

{
    question: "निर्देशन प्रबन्ध प्रक्रिया का ............ चरण है।",
    option: [
        "प्रथम",
        "द्वितीय",
        "तृतीय",
        "चतुर्थ"
    ],
    answer: "चतुर्थ"
},

{
    question: "किसकी सिफारिश पर महासभा महासचिव की नियुक्ति करती है?",
    option: [
        "सुरक्षा परिषद्",
        "आर्थिक व सामाजिक परिषद्",
        "अन्तर्राष्ट्रीय न्यायालय",
        "न्यासी परिषद्"
    ],
    answer: "सुरक्षा परिषद्"
},

{
    question: "प्रबंध का कर्मचारियों को सर्वाधिक प्रेरणा देने वाला कार्य है:",
    option: [
        "स्टाफिंग",
        "अभिप्रेरण",
        "संगठन",
        "नियंत्रण"
    ],
    answer: "अभिप्रेरण"
},

{
    question: "एक उद्यमी ................... अभिप्रेरित होता है।",
    option: [
        "शक्ति प्राप्त होने से",
        "उद्देश्य को पूरा होते देख",
        "अधिक वेतन प्राप्त करके",
        "अधिक लाभ प्राप्त करके"
    ],
    answer: "उद्देश्य को पूरा होते देख"
},

{
    question: "अर्थशास्त्र में निम्न में से कौन-सा उद्यमी का कार्य नहीं है?",
    option: [
        "जोखिम उठाना",
        "पूँजी का प्रावधान एवं उत्पादन का संगठन",
        "अभिनवता",
        "दिन-प्रतिदिन के व्यवसाय का संचालन"
    ],
    answer: "दिन-प्रतिदिन के व्यवसाय का संचालन"
},

{
    question: "विपणन का लाभ है-",
    option: [
        "उपभोक्ताओं को",
        "व्यवसायियों को",
        "निर्माताओं को",
        "इनमें से सभी को"
    ],
    answer: "इनमें से सभी को"
},

{
    question: "निम्नलिखित में से कौन-सा देश सार्क का सदस्य नहीं है?",
    option: [
        "भारत",
        "पाकिस्तान",
        "नेपाल",
        "जापान"
    ],
    answer: "जापान"
},

{
    question: "निम्न में से किसे चालू सम्पत्तियों में शामिल नहीं किया जाता है?",
    option: [
        "नकद राशि",
        "स्टॉक-ध",
        "देनदार",
        "फर्नीचर"
    ],
    answer: "फर्नीचर"
},

{
    question: "कर्मचारियों के विकास में सम्मिलित है :",
    option: [
        "पदोन्नति",
        "स्थानान्तरण",
        "प्रशिक्षण",
        "ये सभी"
    ],
    answer: "ये सभी"
},

{
    question: "................ विज्ञापन का लाभ है।",
    option: [
        "अधिक पहुँच",
        "कम शक्तिशाली",
        "अलोकप्रियता",
        "प्रतिपुष्टि का अभाव"
    ],
    answer: "अधिक पहुँच"
},

{
    question: ".................... वित्तीय निर्णय का उदाहरण है।",
    option: [
        "विनियोग निर्णय",
        "वित्त व्यवस्था निर्णय",
        "लाभांश निर्णय",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "प्रशिक्षण, कार्य पर केन्द्रित है। विकास, कैरियर केन्द्रित है। प्रशिक्षण एक विस्तृत प्रक्रिया है। विकास सीमित प्रक्रिया है।",
    option: [
        "सत्य है",
        "असत्य है",
        "कथन (1) सत्य है तथा कथन (II) असत्य है",
        "कथन (I) असत्य है तथा कथन (II) सत्य है"
    ],
    answer: "कथन (1) सत्य है तथा कथन (II) असत्य है"
},

{
    question: "पर्यवेक्षण प्रबन्ध का ............ स्तर है।",
    option: [
        "उच्च",
        "मध्यम",
        "निम्न",
        "इनमें से सभी"
    ],
    answer: "निम्न"
},

{
    question: "विचलन निम्न में से किस प्रकार का हो सकता है ?",
    option: [
        "नकारात्मक",
        "धनात्मक",
        "शून्य",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "वित्तीय उतोलन अनुकूल कहलाता है यदि :",
    option: [
        "ऋणों की लागत से निवेश पर आय कम होती है।",
        "निवेश पर आय, ऋणों की लागत से ऊँची है",
        "ऋण आसानी से उपलब्ध है।",
        "यदि विद्यमान वित्तीय कोष की मात्रा कम है"
    ],
    answer: "निवेश पर आय, ऋणों की लागत से ऊँची है"
},

{
    question: "उपभोक्ता संगठन उत्पादों के नमूने इकट्ठे करके ................. करते हैं।",
    option: [
        "उन्हें बेचा",
        "उनका निरीक्षण",
        "विक्रेताओं से रिझाने लेने का काम",
        "गरीबों में बाँटा"
    ],
    answer: "उनका निरीक्षण"
},

{
    question: "वीटो का प्रावधान का फैसला किस सम्मेलन में किया गया?",
    option: [
        "डम्बार्टन ओक्स",
        "याल्टा",
        "सैन फ्रांसिस्को",
        "लन्दन"
    ],
    answer: "याल्टा"
},

{
    question: "प्रबंधकीय नियंत्रण किया जाता है :",
    option: [
        "निम्न प्रबंधकों द्वारा",
        "मध्यम स्तरीय प्रबंधकों द्वारा",
        "उच्चतम स्तरीय प्रबंधकों द्वारा",
        "सभी स्तरीय प्रबंधकों द्वारा"
    ],
    answer: "सभी स्तरीय प्रबंधकों द्वारा"
},

{
    question: "मानसिक कार्य से ………है :",
    option: [
        "उत्पादन",
        "प्रबंध",
        "विपणन",
        "इनमें से कोई नहीं"
    ],
    answer: "उत्पादन"
},

{
    question: "एक संगठनात्मक का नियंत्रण करना कार्य है:",
    option: [
        "आगे देखना",
        "पीछे देखना",
        "आगे, साथ ही साथ पीछे देखना",
        "उपयुक्त सभी"
    ],
    answer: "आगे, साथ ही साथ पीछे देखना"
},

{
    question: "निम्न में से किसके अंतर्गत उपभोक्ता की संतुष्टि को महत्व दिया जाता है?",
    option: [
        "विपणन",
        "विक्रय एवं उत्पादन",
        "उत्पादन",
        "विक्रय"
    ],
    answer: "विक्रय एवं उत्पादन"
},

{
    question: "प्रति इकाई लागत ₹ 100 होना ................ प्रमाण का उदाहरण है।",
    option: [
        "संख्यात्मक",
        "गुणात्मक",
        "उपरोक्त दोनों",
        "इनमें कोई नहीं"
    ],
    answer: "संख्यात्मक"
},

{
    question: "शेनजेन देशों में शामिल हैं",
    option: [
        "यूरोपीय देश",
        "एशियाई देश",
        "अफ्रीकी देश",
        "इनमें से कोई नहीं"
    ],
    answer: "यूरोपीय देश"
},

{
    question: "पद-भिन्नता किस प्रकार की सम्प्रेषण बाधा के अन्तर्गत आती है?",
    option: [
        "सांकेतिक बाधा",
        "संगठनात्मक बाधा",
        "सांकेतिक बाधा",
        "मनोवैज्ञानिक बाधा"
    ],
    answer: "संगठनात्मक बाधा"
},

{
    question: "नियंत्रण प्रबन्ध का पहलू है:",
    option: [
        "सैद्धांतिक",
        "व्यावहारिक",
        "मानसिक",
        "भौतिक"
    ],
    answer: "व्यावहारिक"
},

{
    question: "महासभा के कुल सदस्यों की संख्या है-",
    option: [
        "193",
        "192",
        "196",
        "197"
    ],
    answer: "193"
},

{
    question: "निम्न में से कौन-सा कथन असंगत है?",
    option: [
        "प्रबंध उद्देश्यपूर्ण",
        "विशिष्ट प्रक्रिया",
        "सार्वभौमिक",
        "प्रबंध स्वामित्व से अलग नहीं"
    ],
    answer: "प्रबंध स्वामित्व से अलग नहीं"
},

{
    question: "विज्ञापन का सबसे महँगा साधन है",
    option: [
        "विज्ञापन",
        "व्यक्तिगत विक्रय",
        "विक्रय संवर्धन",
        "जन सम्पर्क"
    ],
    answer: "व्यक्तिगत विक्रय"
},

{
    question: "निम्न में से कौन G-8 का सदस्य नहीं है?",
    option: [
        "जापान",
        "कनाडा",
        "इटली",
        "चीन"
    ],
    answer: "चीन"
},

{
    question: "कार्यशील पूँजी का स्रोत है :",
    option: [
        "देनदार",
        "बैंक अधिविकर्ष",
        "रोकड़ विक्रय",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "औद्योगिक उत्पादों के क्रेताओं की संख्या कम होने के कारण कौन-से वितरण मार्ग को अपनाया जाता है।",
    option: [
        "लम्बे",
        "छोटे",
        "वायु",
        "रेल"
    ],
    answer: "छोटे"
},

{
    question: "नियंत्रण प्रबंध का कौन-सा कार्य है ?",
    option: [
        "प्रथम",
        "द्वितीय",
        "तृतीय",
        "अंतिम"
    ],
    answer: "अंतिम"
},

{
    question: "उद्यमितीय लक्षण किससे सम्बन्धित हैं?",
    option: [
        "कार्य सृजक व्यवहार",
        "लाभ सृजन व्यवहार",
        "जोखिम वहन व्यवहार",
        "इनमें कोई नहीं"
    ],
    answer: "जोखिम वहन व्यवहार"
},

{
    question: "नियंत्रण की प्रकृति किस प्रकार की है ?",
    option: [
        "सकारात्मक पहलू",
        "नकारात्मक पहलू",
        "उपरोक्त दोनों",
        "उपरोक्त कोई नहीं"
    ],
    answer: "उपरोक्त दोनों"
},

{
    question: "नियुक्तिकरण पर व्यय किया गया धन है",
    option: [
        "धन की बर्बादी",
        "आवश्यक",
        "विनियोजन",
        "इनमें कोई नहीं"
    ],
    answer: "विनियोजन"
},

{
    question: "कर्मचारियों का चयन होता है:",
    option: [
        "निम्न श्रेणी के अधिकारियों का",
        "मध्यम श्रेणी के अधिकारियों का",
        "उच्चतम श्रेणी के अधिकारियों का",
        "ये सभी"
    ],
    answer: "ये सभी"
},

{
    question: "व्यावसायिक उपक्रम में नियंत्रण की आवश्यकता होती है :",
    option: [
        "व्यवसाय की स्थापना के समय",
        "व्यवसाय के संचालन के समय",
        "वर्ष के अन्त में",
        "निरन्तर"
    ],
    answer: "निरन्तर"
},

{
    question: "किसी भी देश के विकास में सबसे अधिक आवश्यकता है:",
    option: [
        "भौतिक संसाधन",
        "आर्थिक संसाधन",
        "मानवीय संसाधन",
        "कुशल प्रबंध"
    ],
    answer: "कुशल प्रबंध"
},

{
    question: "विश्व व्यापार संगठन निम्नांकित में किस संगठन का उत्तराधिकारी है?",
    option: [
        "जनरल एग्रीमेंट ऑन ट्रेड एण्ड टैरिफ",
        "राष्ट्र संघ की परिषद्",
        "विश्व स्वास्थ्य संगठन",
        "संयुक्त राष्ट्र विकास कार्यक्रम"
    ],
    answer: "जनरल एग्रीमेंट ऑन ट्रेड एण्ड टैरिफ"
},

{
    question: "नियंत्रण प्रक्रिया का प्रथम चरण ................ है।",
    option: [
        "सुधारात्मक कार्यवाही करना",
        "विचलनों का विश्लेषण करना",
        "प्रगति प्रमाप निर्धारित करना",
        "वास्तविक प्रगति का मापन"
    ],
    answer: "वास्तविक प्रगति का मापन"
},

{
    question: "वित्तीय नियोजन का अभिप्राय वित्तीय क्रियाओं के ............... करने से है।",
    option: [
        "निर्धारण",
        "पूर्व-निर्धारण",
        "बाद में निर्धारण",
        "निर्धारण नहीं"
    ],
    answer: "पूर्व-निर्धारण"
},

{
    question: "राष्ट्रीय आयोग उपभोक्ता विवादों का निपटारा कर सकता है",
    option: [
        "₹ 5 लाख तक",
        "₹ 10 लाख तक",
        "₹ 20 लाख तक",
        "₹ 1 करोड़ से अधिक"
    ],
    answer: "₹ 1 करोड़ से अधिक"
},

{
    question: "उद्यमिता विकास कार्यक्रम प्रदान करता",
    option: [
        "स्वरोजगार",
        "उद्यमी कौशल में वृद्धि",
        "शिक्षण एवं प्रशिक्षण",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "शुरू में श्रमिकों द्वारा वैज्ञानिक प्रबंध का…………..किया जाता है :",
    option: [
        "पक्ष",
        "विरोध",
        "दोनों",
        "सहायक"
    ],
    answer: "विरोध"
},

{
    question: "पितृसुलभ उच्च विकसित कम्पनियाँ पसंद करती हैं:",
    option: [
        "कम लाभांश देना",
        "अधिक लाभांश देना",
        "लाभांश पर विकास का कोई प्रभाव नहीं होता है",
        "इनमें कोई नहीं"
    ],
    answer: "कम लाभांश देना"
},

{
    question: "पर्यवेक्षण प्रबन्ध का स्तर है",
    option: [
        "उच्च",
        "मध्यम",
        "निम्न",
        "इनमें से सभी"
    ],
    answer: "निम्न"
},

{
    question: "शारीरिक परीक्षा बाधा पार कर लेने के बाद चयनित व्यक्ति को निम्न में से कौन-सा पत्र दिया जाता है ?",
    option: [
        "खेद पत्र",
        "नियुक्ति पत्र",
        "उपरोक्त दोनों",
        "इनमें कोई नहीं"
    ],
    answer: "नियुक्ति पत्र"
},

{
    question: "नवीन आर्थिक नीति घोषित हुई थी :",
    option: [
        "जुलाई 1990",
        "जुलाई 1991",
        "जुलाई 1992",
        "जुलाई 2001"
    ],
    answer: "जुलाई 1991"
},

{
    question: "समतल संदेशवाहन में सुझाव का प्रवाह होता है :",
    option: [
        "ऊपर की ओर",
        "नीचे की ओर",
        "समतल स्तर पर",
        "इनमें से सभी"
    ],
    answer: "समतल स्तर पर"
},

{
    question: "भारत में उद्यमिता विकास कार्यक्रम है:",
    option: [
        "आवश्यक",
        "अनावश्यक",
        "समय की बर्बादी",
        "धन की बर्बादी"
    ],
    answer: "आवश्यक"
},

{
    question: "संयुक्त राष्ट्र संघ के कुल सदस्यों की संख्या है-",
    option: [
        "192",
        "193",
        "194",
        "195"
    ],
    answer: "193"
},

{
    question: "उपभोक्ताओं के समूह का अभिप्राय ......................... से है।",
    option: [
        "क्रेता",
        "विक्रेता",
        "उत्पाद",
        "बाजार"
    ],
    answer: "क्रेता"
},

{
    question: "................ तीन स्तरीय न्यायिक तंत्र का अंग नहीं है",
    option: [
        "तहसील फोरम",
        "जिला फोरम",
        "राज्य आयोग",
        "राष्ट्रीय आयोग"
    ],
    answer: "तहसील फोरम"
},

{
    question: "उच्चस्तरीय प्रबन्धकों को निम्न में से किसका प्रशिक्षण दिया जाता है।",
    option: [
        "श्रम सम्बन्धी",
        "वित्तीय प्रबन्ध",
        "उत्पादन प्रबन्ध",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "उपभोक्ता संरक्षण के संबंध में 'अपने अधिकार' कार्यक्रम ................. प्रसारित करता है।",
    option: [
        "ऑल इंडिया रेडियो",
        "दूरदर्शन",
        "विज्ञापन एजेंसी",
        "उपरोक्त सभी"
    ],
    answer: "ऑल इंडिया रेडियो"
},

{
    question: "नियोजन प्रबंधक का कार्य है :",
    option: [
        "प्राथमिक",
        "द्वितीयक",
        "तृतीयक",
        "इनमें से सभी"
    ],
    answer: "प्राथमिक"
},

{
    question: "उद्यमिता नेतृत्व प्रदान नहीं करती-",
    option: [
        "साझेदारी फर्म में",
        "नए निगम विभाजन में",
        "नवीन अनुदान उद्यम में",
        "इनमें कोई नहीं"
    ],
    answer: "साझेदारी फर्म में"
},

{
    question: "निम्न में से कौन-सा नकारात्मक अभिप्रेरणा का उदाहरण है?",
    option: [
        "पदोन्नति",
        "निष्कासन",
        "पदच्युति",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "उच्च विकास की ओर अग्रसर कंपनियाँ ............... पसंद करती हैं :",
    option: [
        "कम लाभांश देना",
        "अधिक लाभांश देना",
        "लाभांश पर विकास का कोई प्रभाव नहीं होता है",
        "इनमें कोई नहीं"
    ],
    answer: "कम लाभांश देना"
},

{
    question: "सामर्थ्य व इच्छा की अधिकतम मात्रा .................... दर्शाती है।",
    option: [
        "तैयार उद्यमी",
        "इच्छुक उद्यमी",
        "क्षमतावान उद्यमी",
        "उद्यमी तैयार नहीं"
    ],
    answer: "तैयार उद्यमी"
},

{
    question: "बिजली पूर्ति में बाधा विचलन ................. का से संबंधित कारण है। घटनाओं",
    option: [
        "मानव",
        "अनिश्चित",
        "विभिन्न रुकावटों",
        "गलत प्रमापों"
    ],
    answer: "विभिन्न रुकावटों"
},

{
    question: "ग्राहक बाजार का ................ होता है।",
    option: [
        "राजा",
        "नौकर",
        "सम्राट",
        "विक्रेता"
    ],
    answer: "राजा"
},

{
    question: "एक कुशल नियंत्रण प्रणाली किसे मदद करती है ?",
    option: [
        "डेढ़यों की प्राप्ति",
        "कर्मचारियों के मनोबल में वृद्धि",
        "साधनों का कुशल प्रयोग",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "निम्न में से कौन सुरक्षा परिषद् का स्थायी सदस्य नहीं है?",
    option: [
        "फ्रांस",
        "ब्रिटन",
        "इटली",
        "चीन"
    ],
    answer: "इटली"
},

{
    question: "स्थाई संपत्तियों की वित्त व्यवस्था होनी चाहिए :",
    option: [
        "दीर्घकालीन दायित्वों से",
        "अल्पकालीन दायित्वों से",
        "दीर्घकालीन तथा अल्पकालीन दायित्वों के मिश्रण से",
        "इनमें कोई नहीं"
    ],
    answer: "दीर्घकालीन दायित्वों से"
},

{
    question: "निर्देशन के अन्तर्गत ............ को सम्मिलित किया जाता है।",
    option: [
        "नियोजन",
        "संगठन",
        "पर्यवेक्षण",
        "नियुक्तिकरण"
    ],
    answer: "पर्यवेक्षण"
},

{
    question: "उपभोक्ता विवाद निवारण एजेंसी है",
    option: [
        "जिला मंच",
        "राज्य आयोग",
        "राष्ट्रीय आयोग",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "वित्त व्यवस्था निर्णय ............... से संबंधित हैं",
    option: [
        "एजेंसी ढाँचा",
        "वित्तीय ढाँचा",
        "एजेंसीकरण",
        "वित्तीय नियोजन"
    ],
    answer: "वित्तीय नियोजन"
},

{
    question: "......................... क्रिया वस्तुओं के उत्पादन के बाद प्रारंभ होती है।",
    option: [
        "क्रय",
        "विक्रयण",
        "विपणन",
        "विज्ञापन"
    ],
    answer: "विक्रयण"
},

{
    question: "वैज्ञानिक प्रबंध में विश्लेषण है:",
    option: [
        "25%",
        "50%",
        "75%",
        "इनमें से कोई नहीं"
    ],
    answer: "75%"
},

{
    question: "सबसे अधिक व्यापक क्षेत्र है :",
    option: [
        "ब्राण्ड",
        "लेबलिंग",
        "पैकेजिंग",
        "व्यापार मार्क"
    ],
    answer: "पैकेजिंग"
},

{
    question: "विश्व व्यापार संगठन निम्नांकित में किस संगठन का उत्तराधिकारी है?",
    option: [
        "जनरल एग्रीमेंट ऑन ट्रेड एण्ड टैरिफ",
        "राष्ट्र संघ की परिषद्",
        "विश्व स्वास्थ्य संगठन",
        "संयुक्त राष्ट्र विकास कार्यक्रम"
    ],
    answer: "जनरल एग्रीमेंट ऑन ट्रेड एण्ड टैरिफ"
},

{
    question: "व्यवसाय के लिए विपणन है।",
    option: [
        "अनिवार्य",
        "आवश्यक",
        "अनावश्यक",
        "विलासिता"
    ],
    answer: "अनिवार्य"
},

{
    question: "कर्मचारी को कुछ समय के लिए नियोक्ता से दूर करने को क्या कहते हैं ?",
    option: [
        "पदावनति",
        "पदोन्नति",
        "स्थानांतरण",
        "अस्थाई अलगाव"
    ],
    answer: "अस्थाई अलगाव"
},

{
    question: "नेपाल में राजतंत्र कब समाप्त किया गया?",
    option: [
        "2006 ई. में",
        "2008 ई. में",
        "2009 ई. में",
        "2010 ई. में"
    ],
    answer: "2008 ई. में"
},

{
    question: "अंगूरलता जाल में किस प्रारूप में अपने चाहने वालों को उनसे सहायता (Favour) प्राप्त करने के उद्देश्य से संदेशवाहन किया जाता है?",
    option: [
        "गुच्छा",
        "पायिका",
        "गपशप श्रृंखला",
        "एकल रीति"
    ],
    answer: "गुच्छा"
},

{
    question: "स्कन्ध विपणियों के लिए सेबी की सेवाएँ हैं :",
    option: [
        "ऐच्छिक",
        "आवश्यक",
        "अनावश्यक",
        "अनिवार्य"
    ],
    answer: "अनिवार्य"
},

{
    question: "अंगूरलता संदेशवाहन होता है :",
    option: [
        "अनौपचारिक",
        "औपचारिक",
        "लिखित",
        "इनमें कोई नहीं"
    ],
    answer: "अनौपचारिक"
},

{
    question: "भारतीय विनियोग केंद्र की स्थापना की गयी थी :",
    option: [
        "भारत सरकार द्वारा",
        "मध्य प्रदेश सरकार द्वारा",
        "महाराष्ट्र सरकार द्वारा",
        "गुजरात सरकार द्वारा"
    ],
    answer: "मध्य प्रदेश सरकार द्वारा"
},

{
    question: "प्रति अंश उच्चतम लाभांश संबंधित है",
    option: [
        "ऊँची आय, ऊँचा रोकड़ प्रवाह, अनुपयुक्त आय तथा उच्चतम विकास अवसर",
        "ऊँची आय, ऊँचा रोकड़ प्रवाह, स्थिर आय तथा ऊँचे विकास अवसर",
        "ऊँची आय, ऊँचा रोकड़ प्रवाह, स्थिर आय तथा निम्नतम विकास अवसर",
        "ऊँची आय, निम्न रोकड़ प्रवाह, स्थिर आय तथा निम्नतम विकास अवसर"
    ],
    answer: "ऊँची आय, ऊँचा रोकड़ प्रवाह, स्थिर आय तथा निम्नतम विकास अवसर"
},

{
    question: "भारतीय उद्यमिता विकास संस्थान की स्थापना की गयी थी।",
    option: [
        "महाराष्ट्र सरकार द्वारा",
        "गुजरात सरकार द्वारा",
        "मध्य प्रदेश सरकार द्वारा",
        "तमिलनाडु सरकार द्वारा"
    ],
    answer: "गुजरात सरकार द्वारा"
},

{
    question: "नेता अधीनस्थों से काम लेता है :",
    option: [
        "चातुर्य से",
        "डण्डे से",
        "धमकाकर",
        "इनमें कोई नहीं"
    ],
    answer: "चातुर्य से"
},

{
    question: "................ आंतरिक भर्ती का लाभ है।",
    option: [
        "अभिप्रेरणा में वृद्धि",
        "औद्योगिक शान्ति",
        "उपरोक्त दोनों",
        "नवयुवक कर्मचारियों के प्रवेश पर रोक"
    ],
    answer: "उपरोक्त दोनों"
},

{
    question: "प्रशिक्षण की विधियाँ हैं-",
    option: [
        "कार्य बदली प्रशिक्षण",
        "कार्य पर प्रशिक्षण",
        "प्रशिक्षुता प्रशिक्षण",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "निम्न में से कौन-सा प्रबंध के सिद्धांत का महत्व नहीं है?",
    option: [
        "कार्य-कुशलता में वृद्धि",
        "पहल-क्षमता",
        "संसाधनों का अधिकतम उपयोग",
        "परिवर्तित तकनीकी को अपनाना"
    ],
    answer: "कार्य-कुशलता में वृद्धि"
},

{
    question: "एक संस्था के समक्ष मुख्य वित्तीय प्रश्न क्या होता है?",
    option: [
        "विभिन्न व्यावसायिक गतिविधियों के लिए कितने वित्त की आवश्यकता होगी ?",
        "इसे विभिन्न साधनों से कितनी मात्रा में प्राप्त किया जाएगा ?",
        "व्यवसाय के लाभ को किस प्रकार विभाजित किया जाएगा ?",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "निम्न में से संदेशवाहन का प्रकार कौन-सा है?",
    option: [
        "औपचारिक",
        "अनौपचारिक",
        "औपचारिक एवं अनौपचारिक",
        "लिखित"
    ],
    answer: "औपचारिक एवं अनौपचारिक"
},

{
    question: "नियोजन होता है:",
    option: [
        "भूतकाल के लिए",
        "भविष्यकाल के लिए",
        "वर्तमान के लिए",
        "सभी समय के लिए"
    ],
    answer: "भविष्यकाल के लिए"
},

{
    question: "प्रशिक्षण की विधियाँ हैं :",
    option: [
        "कार्य बदली प्रशिक्षण",
        "कार्य पर प्रशिक्षण",
        "प्रशिक्षुता प्रशिक्षण",
        "ये सभी"
    ],
    answer: "ये सभी"
},

{
    question: "बैज्ञानिक प्रबंध में टेलर ने प्रयोग किये:",
    option: [
        "गति अध्ययन",
        "थकान अध्ययन",
        "समय अध्ययन",
        "सभी"
    ],
    answer: "सभी"
},

{
    question: "कार्यशील पूँजी का सूत्र है:",
    option: [
        "सम्पत्तियाँ - देयताएँ",
        "चालू सम्पत्तियाँ - चालू देयताएँ",
        "स्थायी सम्पत्तियाँ - स्थायी देयताएँ",
        "देयताएँ - सम्पत्तियाँ"
    ],
    answer: "चालू सम्पत्तियाँ - चालू देयताएँ"
},

{
    question: "अल्पसूचना ऋण सर्वाधिक .................. होते हैं।",
    option: [
        "स्थाई",
        "तरल",
        "महंगे",
        "सस्ते"
    ],
    answer: "तरल"
},

{
    question: "किस वर्ष में विश्व व्यापार संगठन की स्थापना हुई?",
    option: [
        "1945",
        "1965",
        "1975",
        "1995"
    ],
    answer: "1995"
},

{
    question: "परमाणु प्रौद्योगिकी के शान्ति पूर्ण उपयोग और उसकी सुरक्षा से सम्बद्ध संयुक्त राष्ट्र संघ की एजेन्सी का नाम है",
    option: [
        "संयुक्त राष्ट्र संघ निरस्त्रीकरण समिति",
        "अन्तर्राष्ट्रीय आण्विक ऊर्जा एजेन्सी",
        "संयुक्त राष्ट्र संघ अन्तर्राष्ट्रीय सुरक्षा समिति",
        "इनमें से कोई नहीं"
    ],
    answer: "अन्तर्राष्ट्रीय आण्विक ऊर्जा एजेन्सी"
},

{
    question: "राज्य की अफसरशाही को हटाना' उद्यमियों की अपने उद्यम की निम्न में से किस भूमिका का उदाहरण है?",
    option: [
        "विनिमय संबंधों का विकास",
        "राजनैतिक प्रशासन",
        "प्रबंध-नियंत्रण",
        "तकनीकी"
    ],
    answer: "राजनैतिक प्रशासन"
},

{
    question: "नवीन निर्गमित अंशों में व्यवहार करता है :",
    option: [
        "गौण बाजार",
        "प्राथमिक बाजार",
        "गौण बाजार तथा प्राथमिक बाजार दोनों",
        "उपर्युक्त में से कोई नहीं"
    ],
    answer: "प्राथमिक बाजार"
},

{
    question: "निम्न में से किस विधि में तकनीकी संस्थाएँ एवं व्यावसायिक संस्थाएँ मिलकर अपने सदस्यों को प्रशिक्षण प्रदान करती है ?",
    option: [
        "अभिविन्यास प्रशिक्षण",
        "नवसिखुआ प्रशिक्षण",
        "प्रयोगशाला प्रशिक्षण",
        "संयुक्त प्रशिक्षण"
    ],
    answer: "संयुक्त प्रशिक्षण"
},

{
    question: "नियंत्रण सम्बन्धित है :",
    option: [
        "परिणाम",
        "कार्य",
        "प्रयास",
        "इनमें कोई नहीं"
    ],
    answer: "परिणाम"
},

{
    question: "नियोजन प्रबंध का कार्य है :",
    option: [
        "सहायक",
        "प्राथमिक",
        "अनावश्यक",
        "इनमें से कोई नहीं"
    ],
    answer: "प्राथमिक"
},

{
    question: "विकास का अभिप्राय कर्मचारियों को ................ क्षेत्र/क्षेत्रों में निपुण बनाना है।",
    option: [
        "एक विशेष",
        "दो",
        "तीन",
        "सभी"
    ],
    answer: "सभी"
},

{
    question: "पुराने संयंत्र को उन्नतशील बनाने के लिए एक नए तथा आधुनिक संयंत्र के अधिग्रहण का निर्णय है:",
    option: [
        "वित्तीय निर्णय",
        "कार्यशील पूँजी निर्णय",
        "निवेश निर्णय",
        "लाभांश निर्णय"
    ],
    answer: "निवेश निर्णय"
},

{
    question: "संयुक्त राष्ट्र संघ के चार्टर में कितनी धाराएँ हैं?",
    option: [
        "111",
        "112",
        "115",
        "120"
    ],
    answer: "111"
},

{
    question: "'नियंत्रण, नियोजन के अभाव में अंधा है।' यह कथन दोनों के बारे में क्या बताता है ?",
    option: [
        "केवल नियोजन जरूरी है",
        "केवल नियंत्रण जरूरी है",
        "दोनों का होना जरूरी है",
        "दोनों अनावश्यक हैं"
    ],
    answer: "दोनों का होना जरूरी है"
},

{
    question: "एक व्यक्ति की उस आवश्यकता का क्या नाम है जिसमें वह अपनी क्षमता को उच्चतम स्तर तक ले जाना चाहता है।",
    option: [
        "सम्मान की आवश्यकता",
        "आत्म प्राप्ति की आवश्यकता",
        "सुरक्षा की आवश्यकता",
        "उपरोक्त सभी"
    ],
    answer: "आत्म प्राप्ति की आवश्यकता"
},

{
    question: "विज्ञापन पर किया गया व्यय अपव्यय होता है। यह कथन विज्ञापन के बारे में क्या बताता है।",
    option: [
        "लाभ",
        "सीमा",
        "आक्षेप",
        "आक्षेप का खंडन"
    ],
    answer: "आक्षेप"
},

{
    question: "वित्तीय प्रबन्ध है :",
    option: [
        "कला",
        "विज्ञान",
        "कला और विज्ञान दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "कला और विज्ञान दोनों"
},

{
    question: "नियंत्रण आवश्यक है",
    option: [
        "लघु उपक्रम के लिए",
        "मध्यम श्रेणी के उपक्रम के लिए",
        "बड़े आकार वाले उपक्रम के लिए",
        "इनमें से सभी के लिए"
    ],
    answer: "इनमें से सभी के लिए"
},

{
    question: "जब एक व्यक्ति इंजीनियरिंग का कोर्स करता है तो वह ............ है।",
    option: [
        "प्रशिक्षण",
        "शिक्षा",
        "विकास",
        "उपरोक्त सभी"
    ],
    answer: "शिक्षा"
},

{
    question: "विज्ञापन का माध्यम है :",
    option: [
        "नमूने",
        "प्रोमोशन",
        "कलेण्डर व डायरी आदि",
        "प्रदर्शन"
    ],
    answer: "कलेण्डर व डायरी आदि"
},

{
    question: "उद्यमिता एक ................. क्रिया है।",
    option: [
        "व्यवस्थित",
        "वैध",
        "जोखिमपूर्ण",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "अभिप्रेरित कर्मचारियों को पारितोषित किया जाता",
    option: [
        "ऋणात्मक",
        "धनात्मक",
        "वास्तविक",
        "इनमें कोई नहीं"
    ],
    answer: "धनात्मक"
},

{
    question: "संयुक्त राष्ट्र संघ का सबसे बड़ा अंग कौन है?",
    option: [
        "सुरक्षा परिषद",
        "महासभा",
        "सचिवालय",
        "अन्तर्राष्ट्रीय न्यायालय"
    ],
    answer: "महासभा"
},

{
    question: "निम्न में से कौन-सी व्यावहारिक पर्यावरण की विशेषता नहीं है?",
    option: [
        "शहरीकरण",
        "कर्मचारी",
        "तुलनात्मक",
        "अनिवार्यता ।"
    ],
    answer: "कर्मचारी"
},

{
    question: "विश्व महिला दिवस कब मनाया जाता है?",
    option: [
        "10 दिसम्बर को",
        "8 मार्च को",
        "1 दिसम्बर को",
        "2 अक्टूबर को"
    ],
    answer: "8 मार्च को"
},

{
    question: "प्राथमिक बाजार का संबंध .................. निर्गमनों से है",
    option: [
        "पुराने",
        "नये",
        "क्रय-विक्रय",
        "स्टॉक"
    ],
    answer: "नये"
},

{
    question: "सी.टी.बी.टी. प्रस्ताव संयुक्त राष्ट्र संघ द्वारा कब स्वीकारा गया?",
    option: [
        "1995 ई. में",
        "1996 ई. में",
        "1997 ई. में",
        "1998 ई. में"
    ],
    answer: "1996 ई. में"
},

{
    question: "प्रबंध की सफलता का प्राथमिक तत्व है:",
    option: [
        "सन्तुष्ट कर्मचारी",
        "अत्यधिक पूँजी",
        "बड़ा बाजार",
        "अधिकतम उत्पादन"
    ],
    answer: "सन्तुष्ट कर्मचारी"
},

{
    question: "व्यवसाय स्थापना की प्रक्रिया में निम्न में से किस व्यावहारिकता का आकलन किया जाता है?",
    option: [
        "तकनीकी",
        "आर्थिक",
        "वित्तीय",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "निम्न में से कौन यह सुनिश्चित करता है कि काम वांछित प्रगति से चल रहा है अथवा नहीं?",
    option: [
        "नियोजन",
        "संगठन",
        "सन्देशवाहन",
        "पर्यवेक्षण"
    ],
    answer: "पर्यवेक्षण"
},

{
    question: "विज्ञापन है :",
    option: [
        "विनियोग",
        "अनावश्यक",
        "धन की बर्बादी",
        "इनमें कोई नहीं"
    ],
    answer: "विनियोग"
},

{
    question: "नियोजन है:",
    option: [
        "लक्ष्य-अभिमुखी",
        "उद्देश्य-अभिमुखी",
        "मानसिक प्रक्रिया",
        "ये सभी"
    ],
    answer: "ये सभी"
},

{
    question: "वैज्ञानिक प्रबंध से श्रमिकों के कार्य के घंटों में होती है :",
    option: [
        "वृद्धि",
        "कमी",
        "कोई प्रभाव नहीं",
        "औसत"
    ],
    answer: "कमी"
},

{
    question: "1950 में संयुक्त राष्ट्र संघ की महासभा ने किस नयी व्यवस्था को जन्म दिया?",
    option: [
        "सामूहिक सुरक्षा",
        "सत्ता सन्तुलन",
        "शान्ति स्थापना",
        "शान्ति निर्माण"
    ],
    answer: "शान्ति स्थापना"
},

{
    question: "निर्देशन के प्रमुख तत्त्व हैं-",
    option: [
        "2",
        "3",
        "4",
        "6"
    ],
    answer: "4"
},

{
    question: "प्रबंध के सिद्धांतों की रचना किस प्रकार से की जाती है?",
    option: [
        "प्रयोगशाला में",
        "प्रबंधकों के अनुभव द्वारा",
        "ग्राहकों के अनुभव द्वारा",
        "समाज वैज्ञानिकों के द्वारा"
    ],
    answer: "प्रबंधकों के अनुभव द्वारा"
},

{
    question: "नियंत्रण प्रबंध का कार्य है :",
    option: [
        "प्रथम",
        "अन्तिम",
        "तृतीय",
        "द्वितीय"
    ],
    answer: "अन्तिम"
},

{
    question: "निम्न में कौन संवर्धन सम्मिश्रण का तत्व नहीं है?",
    option: [
        "विज्ञापन",
        "व्यक्तिगत विक्रय",
        "विक्रय संवर्धन",
        "उत्पाद विकास"
    ],
    answer: "उत्पाद विकास"
},

{
    question: "नियोजन में शामिल है……..",
    option: [
        "क्या करना है।",
        "कब करना है",
        "कैसे करना है",
        "उपर्युक्त सभी"
    ],
    answer: "उपर्युक्त सभी"
},

{
    question: "निम्नलिखित में से कौन संयुक्त राष्ट्र संघ का अंग नहीं है?",
    option: [
        "महासभा",
        "सुरक्षा परिषद",
        "अन्तर्राष्ट्रीय न्यायालय",
        "यूनेस्को"
    ],
    answer: "यूनेस्को"
},

{
    question: "यूरोपीय संघ के कितने सदस्य देश हैं?",
    option: [
        "27",
        "28",
        "26",
        "29"
    ],
    answer: "27"
},

{
    question: "विकास का उद्देश्य है :",
    option: [
        "योग्यता में वृद्धि",
        "श्रेष्ठ निष्पादन",
        "पदोन्नति के अवसर",
        "ये सभी"
    ],
    answer: "ये सभी"
},

{
    question: "यदि अन्य बातें समान रहें तो कर की दर में निगमित लाभ पर वृद्धि होगी :",
    option: [
        "ऋण अपेक्षाकृत सस्ते होंगे",
        "ऋण अपेक्षाकृत कम सस्ते होंगे",
        "ऋणों की लागत पर कोई प्रभाव नहीं होगा",
        "हम कुछ नहीं कर सकते"
    ],
    answer: "ऋण अपेक्षाकृत सस्ते होंगे"
},

{
    question: "निम्न में से CASH में ................. को सम्मिलित नहीं किया जाता।",
    option: [
        "Knowledge",
        "Attitude",
        "Skill and Habits",
        "CASH"
    ],
    answer: "CASH"
},

{
    question: "विकास शब्द को ................ के साथ जोड़ा जाता है।",
    option: [
        "प्रबन्धकों",
        "श्रमिकों",
        "पर्यवेक्षकों",
        "श्रमिकों व पर्यवेक्षकों"
    ],
    answer: "प्रबन्धकों"
},

{
    question: "सामाजिक उपगम्यता के अनुसार, उद्यमिता है :",
    option: [
        "भावुकता की प्रक्रिया",
        "भूमिका निष्पादन प्रक्रिया",
        "आर्थिक परिवर्तन की प्रक्रिया",
        "उपर्युक्त सभी"
    ],
    answer: "भूमिका निष्पादन प्रक्रिया"
},

{
    question: "चालू सम्पत्तियाँ वे सम्पत्तियाँ हैं जो रोकड़ में परिवर्तित होती हैं :",
    option: [
        "छः महीने के अन्दर",
        "एक वर्ष के अन्दर",
        "एक से तीन वर्ष के अन्दर",
        "तीन से पाँच वर्ष के अन्दर"
    ],
    answer: "एक वर्ष के अन्दर"
},

{
    question: "अकुशल कर्मचारी को निम्न पद पर भेजने को ................ कहते हैं।",
    option: [
        "स्थानांतरण",
        "पदोन्नति",
        "पदावनति",
        "अस्थायी अलगाव"
    ],
    answer: "पदावनति"
},

{
    question: "'एक उद्यमी को अपने निर्णय पर दृढ़ रहना चाहिए।' यह निम्न में से किस उद्यमी सामर्थ्य का अर्थ है?",
    option: [
        "वचनबद्धता",
        "समस्या समाधान",
        "दृढ़ता",
        "सूचना प्राप्त करना"
    ],
    answer: "दृढ़ता"
},

{
    question: "विपणन अवधारणा का महत्व है :",
    option: [
        "समाज के लिए",
        "उपभोक्ताओं के लिए",
        "उत्पादक के लिए",
        "इन तीनों के लिए"
    ],
    answer: "इन तीनों के लिए"
},

{
    question: "निम्न में से वित्तीय प्रबन्ध से संबंधित प्रमाप कौन-सा है ?",
    option: [
        "प्रति व्यक्ति उत्पादन",
        "विक्रिकताओं का लक्ष्य",
        "अनुपस्थिति दर",
        "पूंजी प्रवाह"
    ],
    answer: "पूंजी प्रवाह"
},

{
    question: "निम्न में से कौन-सा संदेशवाहन अफवाहें फैलाता है?",
    option: [
        "औपचारिक",
        "अनौपचारिक",
        "लिखित",
        "इनमें से सभी"
    ],
    answer: "अनौपचारिक"
},

{
    question: "हेनरी फेयोल के प्रबंध के सिद्धांत हैं:",
    option: [
        "10",
        "3",
        "14",
        "15"
    ],
    answer: "14"
},

{
    question: "एक कार्य के निष्पादन के लिये प्रबंध को ‘सर्वोत्तम रास्ता ढूँढना” चाहिए। वैज्ञानिक प्रबंध का कौन-सा सिद्धांत इस पंक्ति की व्याख्या करता है:",
    option: [
        "सार्वभौम",
        "लचीले",
        "सम्पूर्ण",
        "व्यावहारिक"
    ],
    answer: "व्यावहारिक"
},

{
    question: "1945 में संयुक्त राष्ट्र संघ की स्थापना हुई, उसका मौलिक सदस्य कौन था?",
    option: [
        "पाकिस्तान",
        "बांग्लादेश",
        "श्रीलंका",
        "भारत"
    ],
    answer: "भारत"
},

{
    question: "डनलप निम्न में से किसका उदाहरण है ?",
    option: [
        "नामकरण",
        "ब्रांड",
        "ब्रांड नाम",
        "ब्रांड मार्क"
    ],
    answer: "ब्रांड नाम"
},

{
    question: "पुराने संयंत्र को उन्नतशील बनाने के लिए एक नए तथा आधुनिक संयंत्र के अधिग्रहण का निर्णय है :",
    option: [
        "वित्तीय निर्णय",
        "कार्यशील पूँजी निर्णय",
        "निवेश निर्णय",
        "लाभांश निर्णय"
    ],
    answer: "निवेश निर्णय"
},

{
    question: "सुरक्षा परिषद् में स्थायी सदस्यों की संख्या कितनी है?",
    option: [
        "5",
        "6",
        "7",
        "14"
    ],
    answer: "5"
},

{
    question: "किर्जनर ने उद्यमी के जिन कार्यों को बताया है उनमें से नीचे कौन-सा राजनीतिक प्रशासन का पक्ष नहीं है?",
    option: [
        "सरकारी अफसरशाही से काम निकालना",
        "संगठन में मानवीय सम्बन्धों का प्रबन्धन",
        "उत्पादन के नये-नये तकनीक एवं नये-नये उत्पादों को लाना",
        "ग्राहक एवं आपूर्तिकर्ताओं से सम्बन्धों का प्रबन्धन"
    ],
    answer: "उत्पादन के नये-नये तकनीक एवं नये-नये उत्पादों को लाना"
},

{
    question: "बार-बार व न्यूनतम क्रय प्रयासों से खरीदे जाने वाले उत्पाद को ............... उत्पाद कहते हैं।",
    option: [
        "सुविधाजनक",
        "विलासिता",
        "विशिष्ट",
        "औद्योगिक"
    ],
    answer: "सुविधाजनक"
},

{
    question: "प्रशासनिक प्रबंध के प्रस्तुतकर्ता थे :",
    option: [
        "फयोल",
        "टेलर",
        "टैरी",
        "वाटसन"
    ],
    answer: "फयोल"
},

{
    question: "आदेश चालित पद्धति (Order Drive System) का प्रयोग ...... पर होता है।",
    option: [
        "BSE",
        "NSE",
        "DSE",
        "CSE"
    ],
    answer: "NSE"
},

{
    question: "वित्त व्यवस्था का प्रमुख अंग कौन-सा है ?",
    option: [
        "वित्तीय बाजार",
        "वित्तीय संस्थाएँ",
        "वित्तीय प्रतिभूतियाँ",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: ".................... में पर्याय लेशशीलता उपलब्ध रहती है।",
    option: [
        "प्रचार",
        "विज्ञापन",
        "विक्रय संवर्धन",
        "व्यक्तिगत विक्रय"
    ],
    answer: "व्यक्तिगत विक्रय"
},

{
    question: "एआरएफ का पूरा रूप क्या है?",
    option: [
        "एसोसिएशन फॉर रीजनल फोरम",
        "आसियान रीजनल फोरम",
        "एशियन रिसर्च फोरम",
        "इनमें से कोई नहीं"
    ],
    answer: "आसियान रीजनल फोरम"
},

{
    question: "वित्तीय प्रबन्ध की आधुनिक विचारधारा है:",
    option: [
        "कोषों को प्राप्त करना",
        "कोषों का उपयोग करना",
        "A तथा B दोनों",
        "इनमें कोई नहीं"
    ],
    answer: "A तथा B दोनों"
},

{
    question: "पर्यवेक्षक कौन है?",
    option: [
        "उच्च तथा मध्यम प्रबन्ध",
        "कर्मचारी तथा मध्यम प्रबन्ध",
        "कर्मचारी एवं निम्न प्रबन्ध",
        "कर्मचारी एवं संचालक"
    ],
    answer: "कर्मचारी तथा मध्यम प्रबन्ध"
},

{
    question: "वित्तीय व्यवसायकिता का अभिप्राय ................. से है।",
    option: [
        "लाभ",
        "वित्त",
        "वाणिज्यिक क्रियाओं",
        "सरकारी अनुमति"
    ],
    answer: "वित्त"
},

{
    question: "वैज्ञानिक प्रबंध के जनक थे:",
    option: [
        "गिलग्रंथ",
        "टेलर",
        "रॉबर्टसन",
        "वाटसन"
    ],
    answer: "टेलर"
},

{
    question: "वैज्ञानिक प्रबंध से अमिकों के पारिश्रमिक में……….होती है:",
    option: [
        "वृद्धि",
        "कमी",
        "दोनों",
        "न वृद्धि न कमी"
    ],
    answer: "वृद्धि"
},

{
    question: "नियंत्रण का कर्मचारी करते हैं",
    option: [
        "विरोध",
        "पसन्द",
        "समर्थन",
        "इनमें कोई नहीं"
    ],
    answer: "विरोध"
},

{
    question: "पर्यवेक्षण है—",
    option: [
        "आवश्यक",
        "अनावश्यक",
        "समय की बर्बादी",
        "इनमें कोई नहीं"
    ],
    answer: "आवश्यक"
},

{
    question: "प्रबंध का सार है।",
    option: [
        "समन्वय",
        "संगठन",
        "स्टाफिंग",
        "नियंत्रण"
    ],
    answer: "समन्वय"
},

{
    question: "............. OTCEI का प्रवर्तक है",
    option: [
        "UTI",
        "ICICI",
        "IDBI",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "एक प्रभावी नियंत्रण तंत्र सहायक होता है :",
    option: [
        "संगठनात्मक लक्ष्यों के निष्पादन में",
        "कर्मचारियों की मनोदशा के संवर्धन में",
        "मानकों की यथार्थता के निर्णय में",
        "उपयुक्त सभी में"
    ],
    answer: "उपयुक्त सभी में"
},

{
    question: "...................... में संबंध का विकास होता है।",
    option: [
        "प्रचार",
        "विज्ञापन",
        "विक्रय संवर्धन",
        "व्यक्तिगत विक्रय"
    ],
    answer: "व्यक्तिगत विक्रय"
},

{
    question: "निम्न में से कौन-सा टेलर का प्रबंध का सिद्धांत नहीं है?",
    option: [
        "विज्ञान न कि व्यवहाराधीन",
        "कार्यात्मक फोरमैनशिप",
        "अधिकतम न कि सीमित उत्पादन",
        "सहयोग न कि विरोध"
    ],
    answer: "कार्यात्मक फोरमैनशिप"
},

{
    question: "नेता के पास सत्ता होती है?",
    option: [
        "अनौपचारिक",
        "औपचारिक",
        "निजी",
        "सरकारी"
    ],
    answer: "औपचारिक"
},

{
    question: "उद्यमिता किसके द्वारा आश्वस्त होती है?",
    option: [
        "सहायक",
        "वृहताकार फर्में",
        "मध्यम फर्म",
        "लघु फर्म"
    ],
    answer: "वृहताकार फर्में"
},

{
    question: ".............. का अभिप्राय एक व्यक्ति द्वारा स्वयं की व्यावसायिक इकाई स्थापित करने वाली प्रक्रिया से है।",
    option: [
        "उद्यमी",
        "उद्यमिता",
        "उद्यम",
        "उपरोक्त सभी"
    ],
    answer: "उद्यमिता"
},

{
    question: "भारत में उद्यमिता का भविष्य है :",
    option: [
        "अन्धकार में",
        "उज्जवल",
        "कठिनाई में",
        "इनमें कोई नहीं"
    ],
    answer: "उज्जवल"
},

{
    question: "राजकोषीय बिल मूलतः होते हैं:",
    option: [
        "अल्पकालिक फंड उधार के प्रपत्र",
        "दीर्घकालिक फंड उधार के प्रपत्र",
        "पूँजी बाजार का एक प्रपत्र",
        "उपर्युक्त कुछ भी नहीं"
    ],
    answer: "अल्पकालिक फंड उधार के प्रपत्र"
},

{
    question: "जिला मंच विवादों का निपटारा कर सकता है :",
    option: [
        "₹5 लाख तक",
        "₹10 लाख तक",
        "₹15 लाख तक",
        "₹1 करोड़ तक"
    ],
    answer: "₹1 करोड़ तक"
},

{
    question: "एक निवेशक को रु........ लाख के जमा प्रमाण-पत्र लेने आवश्यक होते हैं।",
    option: [
        "5",
        "10",
        "25",
        "50"
    ],
    answer: "25"
},

{
    question: "संयुक्त राष्ट्र संघ के तत्वावधान में निःशस्त्रीकरण आयोग कब बना?",
    option: [
        "1945 ई. में",
        "1952 ई. में",
        "1959 ई. में",
        "1966 ई. में"
    ],
    answer: "1952 ई. में"
},

{
    question: "नियोजन, नियंत्रण के अभाव में अंधविश्वास है' यह कथन दोनों के बारे में क्या बताता है ?",
    option: [
        "केवल नियोजन जरूरी है",
        "केवल नियंत्रण जरूरी है",
        "दोनों का होना जरूरी है",
        "दोनों अनावश्यक हैं"
    ],
    answer: "दोनों का होना जरूरी है"
},

{
    question: "पूँजी बाजार व्यवहार करता है—",
    option: [
        "अल्पकालीन कोष",
        "मध्यकालीन कोष",
        "दीर्घकालीन कोष",
        "इनमें कोई नहीं"
    ],
    answer: "दीर्घकालीन कोष"
},

{
    question: "OTCEI व्यवहारों में .................. पैदा करती है।",
    option: [
        "तरलता",
        "पारदर्शकता",
        "उपरोक्त दोनों",
        "देरी"
    ],
    answer: "उपरोक्त दोनों"
},

{
    question: "प्रमाप निर्धारण का मुख्य आधार ................. है।",
    option: [
        "मात्रा",
        "किस्म",
        "समय",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "कार्यशील पूँजी का निर्धारक है:",
    option: [
        "संस्था का आकार",
        "निर्माण प्रक्रिया की अवधि",
        "कच्चे माल की उपलब्धता",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "जब एक अकेला उपभोक्ता अपने अधिकारों को पूरा कराने में असफल रहता है तो की मदद ले सकता है।",
    option: [
        "व्यापार संघ",
        "उपभोक्ता संघ",
        "श्रमिक वर्ग",
        "इनमें कोई नहीं"
    ],
    answer: "उपभोक्ता संघ"
},

{
    question: "भारत में उपभोक्ता संरक्षण अधिनियम प्रभावी है :",
    option: [
        "15 अप्रैल, 1986 से",
        "15 अप्रैल, 1987",
        "15 अप्रैल, 1988",
        "इनमें कोई नहीं"
    ],
    answer: "15 अप्रैल, 1987"
},

{
    question: "नाटो से कितने राष्ट्र संबंधित हैं?",
    option: [
        "ग्यारह राष्ट्र",
        "नौ राष्ट्र",
        "बारह राष्ट्र",
        "दस राष्ट्र"
    ],
    answer: "बारह राष्ट्र"
},

{
    question: "प्रबंध………।",
    option: [
        "कला",
        "कला और विज्ञान दोनों",
        "विज्ञान",
        "इनमें से कोई नहीं"
    ],
    answer: "कला और विज्ञान दोनों"
},

{
    question: "स्टाफिंग कार्य है",
    option: [
        "उच्च प्रबन्ध का",
        "मध्यम श्रेणी का प्रबन्ध का",
        "निम्न श्रेणी का प्रबन्ध का",
        "सरकार का"
    ],
    answer: "मध्यम श्रेणी का प्रबन्ध का"
},

{
    question: "संदेशवाहन प्रक्रिया को पूरा करने के लिए कम से कम ............ व्यक्ति होने चाहिए।",
    option: [
        "एक",
        "दो",
        "तीन",
        "चार"
    ],
    answer: "दो"
},

{
    question: "वैज्ञानिक प्रबंध से उपभोक्ताओं को:",
    option: [
        "कोई प्रभाव नहीं",
        "शोषण होता है",
        "लाभ होता है",
        "इनमें से कोई नहीं"
    ],
    answer: "लाभ होता है"
},

{
    question: "राजकोषीय बिल मूलतः होते हैं:",
    option: [
        "अल्पकालिक फंड उधार के प्रपत्र",
        "दीर्घकालिक फंड उधार के प्रपत्र",
        "पूँजी बाजार के एक प्रपत्र",
        "उपर्युक्त कुछ भी नहीं"
    ],
    answer: "अल्पकालिक फंड उधार के प्रपत्र"
},

{
    question: "सामर्थ्य व इच्छा दोनों की न्यूनतम मात्रा निम्न में से क्या दर्शाती है?",
    option: [
        "उद्यमी तैयार नहीं",
        "क्षमतावान उद्यमी",
        "इच्छुक उद्यमी",
        "तैयार उद्यमी"
    ],
    answer: "उद्यमी तैयार नहीं"
},

{
    question: "स्कन्ध विपणि हित की सुरक्षा करती है :",
    option: [
        "निवेशक",
        "कंपनी",
        "सरकार",
        "किसी का नहीं"
    ],
    answer: "निवेशक"
},

{
    question: "वित्त का सबसे सस्ता स्रोत है:",
    option: [
        "ऋणपत्र",
        "समता अंश पूँजी",
        "पूर्वाधिकार अंश",
        "प्रतिधारित उपार्जन"
    ],
    answer: "प्रतिधारित उपार्जन"
},

{
    question: "एक प्रबंधक उद्देश्यों को कैसे प्राप्त करना चाहता है?",
    option: [
        "कुशलता से",
        "प्रभावपूर्णता से",
        "कुशलता एवं प्रभावपूर्णता से",
        "इनमें कोई नहीं"
    ],
    answer: "कुशलता एवं प्रभावपूर्णता से"
},

{
    question: "निम्न में से कौन-सा व्यवसाय एक सफल उद्यमिता से नहीं जुड़ा है?",
    option: [
        "अनुसंधान एवं विकास",
        "अपने व्यवसाय को दिन-प्रतिदिन के आधार पर चलाना",
        "निरन्तर नवीनता एवं तत्कालिकता",
        "ग्राहक की आवश्यकतानुसार उत्पादन"
    ],
    answer: "अपने व्यवसाय को दिन-प्रतिदिन के आधार पर चलाना"
},

{
    question: "निम्न में कौन-सा अनुचित व्यापार व्यवहार का उदाहरण नहीं है ?",
    option: [
        "वस्तुओं/सेवाओं के बारे में गलत जानकारी देना",
        "गैर कनेक्शन देते समय चूल्हा भी खरीदने की शर्त लगाना",
        "निर्धारित प्रमाणों का पालन न करना",
        "जमाखोरी करना"
    ],
    answer: "वस्तुओं/सेवाओं के बारे में गलत जानकारी देना"
},

{
    question: "एक विकसित देश में उद्यमी का काम कब समाप्त हुआ माना जाता है?",
    option: [
        "व्यवसाय स्थापित होते ही",
        "व्यवसाय का विस्तार पैदा होते ही",
        "ग्राहक संतुष्टि के बाद",
        "व्यवसाय के समापन के बाद"
    ],
    answer: "व्यवसाय स्थापित होते ही"
},

{
    question: "निम्न में से टिकाऊ उत्पाद का उदाहरण कौन-सा है ?",
    option: [
        "फर्नीचर",
        "नमक",
        "मोमबत्ती",
        "दियासलाई"
    ],
    answer: "फर्नीचर"
},

{
    question: "संदेश को सम्प्रेषण प्रतीकों में बदलने की प्रक्रिया को जाना जाता है :",
    option: [
        "माध्यम",
        "एन्कोडिंग",
        "प्रतिपुष्टि",
        "डिकोडिंग"
    ],
    answer: "एन्कोडिंग"
},

{
    question: "नियम एवं अधिनियम किस प्रकार की सम्प्रेषण बाधा के अंतर्गत आती है?",
    option: [
        "भाषा सम्बन्धी बाधा",
        "संगठनात्मक बाधा",
        "मनोवैज्ञानिक बाधा",
        "इनमें कोई नहीं"
    ],
    answer: "संगठनात्मक बाधा"
},

{
    question: "नारायण मूर्ति द्वारा प्रोत्साहित/प्रवर्तक सॉफ्टवेयर कंपनी है :",
    option: [
        "विप्रो",
        "इन्फोसिस",
        "सत्यम",
        "एच० सी० एल०"
    ],
    answer: "इन्फोसिस"
},

{
    question: "संयुक्त राष्ट्र संघ की स्थापना के उत्तरदायी तत्व इनमें से कौन नहीं है?",
    option: [
        "लन्दन घोषणा",
        "मॉस्को घोषणा",
        "अटलांटिक चार्टर",
        "चेनजुस समझौता"
    ],
    answer: "चेनजुस समझौता"
},

{
    question: "जॉर्ज आर, टैरी के अनुसार नियोजन के प्रकार हैं",
    option: [
        "8",
        "6",
        "4",
        "2"
    ],
    answer: "4"
},

{
    question: "विपणन प्रबन्ध अवधारणा का जन्म स्थान है।",
    option: [
        "इंग्लैण्ड",
        "अमेरिका",
        "फ्रांस",
        "जापान"
    ],
    answer: "अमेरिका"
},

{
    question: "निम्न में से कौन-सा निर्देशन का तत्त्व नहीं है?",
    option: [
        "अभिप्रेरण",
        "सम्प्रेषण",
        "हस्तांतरण",
        "पर्यवेक्षण"
    ],
    answer: "हस्तांतरण"
},

{
    question: "प्रमापों में निम्न में से कौन-सा गुण होना चाहिए ?",
    option: [
        "प्राप्त करने योग्य",
        "मापने योग्य",
        "लोचपूर्ण",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "उपयोगिताओं के समूह का अभिप्राय से है।",
    option: [
        "क्रेता",
        "विक्रेता",
        "उत्पाद",
        "बाजार"
    ],
    answer: "उत्पाद"
},

{
    question: "बिजली व टेलीफोन विभाग द्वारा गलत बिल देना निम्न में से किसका उदाहरण है ?",
    option: [
        "सेवाओं में न्यूनता",
        "दोषयुक्त वस्तुएँ",
        "अधिक कीमत लेना",
        "अनुचित व्यापार व्यवहार"
    ],
    answer: "सेवाओं में न्यूनता"
},

{
    question: "राष्ट्रीय शेयर बाजार का निपटान (उधार चुकता) चक्र",
    option: [
        "टी + 5",
        "टी + 3",
        "टी + 2",
        "टी + 1"
    ],
    answer: "टी + 2"
},

{
    question: "निम्न में से कौन संयुक्त राष्ट्र संघ का मुख्य अंग नहीं है?",
    option: [
        "महासभा",
        "अंतर्राष्ट्रीय न्यायालय",
        "सुरक्षा परिषद",
        "विश्व स्वास्थ्य संगठन"
    ],
    answer: "विश्व स्वास्थ्य संगठन"
},

{
    question: "तरलता का निर्माण करता है :",
    option: [
        "संगठित बाजार",
        "असंगठित बाजार",
        "प्राथमिक बाजार",
        "गौण बाजार"
    ],
    answer: "गौण बाजार"
},

{
    question: "भारत में कुल स्टॉक एक्सचेंज (शेयर बाजारों) की संख्या है :",
    option: [
        "20",
        "21",
        "22",
        "23"
    ],
    answer: "22"
},

{
    question: "पर्यवेक्षण निम्न में से क्या सुनिश्चित करता है?",
    option: [
        "सूचनाओं का प्रेषण सुनिश्चित करना",
        "नियंत्रण में सहायक",
        "उपरोक्त दोनों",
        "औद्योगिक झगड़े"
    ],
    answer: "उपरोक्त दोनों"
},

{
    question: "एक अच्छी योजना होती है:",
    option: [
        "खर्चीली",
        "समय लेने वाली",
        "लोचपूर्ण",
        "संकीर्ण"
    ],
    answer: "लोचपूर्ण"
},

{
    question: "वैज्ञानिक प्रबंध से श्रमिकों को होता है :",
    option: [
        "लाभ",
        "हानि",
        "कुछ भी नहीं",
        "लाभ और हानि दोनों"
    ],
    answer: "लाभ"
},

{
    question: "विश्व एड्स दिवस कब मनाया जाता है?",
    option: [
        "1 दिसम्बर को",
        "10 दिसम्बर को",
        "24 दिसम्बर को",
        "इनमें से कोई नहीं"
    ],
    answer: "1 दिसम्बर को"
},

{
    question: "निम्न में से कौन देश G-77 का सदस्य है?",
    option: [
        "अविकसित देश",
        "विकसित देश",
        "विकासशील देश मित्र",
        "इनमें से कोई नहीं"
    ],
    answer: "विकासशील देश मित्र"
},

{
    question: "निर्देशन कर्मचारियों से सम्बन्धित है।",
    option: [
        "उच्च स्तर",
        "मध्यम स्तर",
        "निम्न स्तर",
        "सभी स्तर"
    ],
    answer: "सभी स्तर"
},

{
    question: "जो व्यक्ति दूसरों को प्रभावित करने की योग्यता रखता है उसे ............ कहते हैं।",
    option: [
        "नेता",
        "प्रबंधक",
        "मुख्य प्रबंधक",
        "पर्यवेक्षक"
    ],
    answer: "नेता"
},

{
    question: "विज्ञापन माना जाता है।",
    option: [
        "अपव्यय",
        "विनियोग",
        "विलासिता",
        "इनमें कोई नहीं"
    ],
    answer: "विनियोग"
},

{
    question: "‘निवेशकों को शिक्षा प्रदान करना सेबी का ................. कार्य हैं",
    option: [
        "संरक्षणात्मक",
        "संचालन संबंधी",
        "उपरोक्त दोनों",
        "विकास संबंधी"
    ],
    answer: "संरक्षणात्मक"
},

{
    question: "उपभोक्ता संगठन अपनी संख्या में ................. का प्रयास कर रहे हैं।",
    option: [
        "वृद्धि",
        "कमी",
        "स्थिरता",
        "इनमें कोई नहीं"
    ],
    answer: "वृद्धि"
},

{
    question: "प्रबंध व्यक्तियों का विकास है, न कि वस्तुओं का निर्देशन……. । यह कथन है",
    option: [
        "एल. पी. एप्पल",
        "आर. सी. डेविस",
        "कीथ एण्ड गुबेलौन",
        "हेनरी फेयोल"
    ],
    answer: "एल. पी. एप्पल"
},

{
    question: "............... के अन्तर्गत पिछले वर्षों के आँकड़ों के आधार पर निष्कर्ष निकाले जाते हैं।",
    option: [
        "रोकड़ बजट",
        "सांख्यिकीय आँकड़े",
        "पर्ट",
        "बजटीय नियंत्रण"
    ],
    answer: "सांख्यिकीय आँकड़े"
},

{
    question: "वित्तीय नियोजन में भावी प्राप्तियों एवं भुगतानों का पूर्वानुमान लगाकर ............... की कमी व आधिक्य का उचित प्रबन्ध किया जाता है।",
    option: [
        "पूँजी",
        "मानव शक्ति",
        "माल",
        "उपरोक्त सभी"
    ],
    answer: "पूँजी"
},

{
    question: "1950 में संयुक्त राष्ट्र संघ की महासभा ने किस नयी व्यवस्था को जन्म दिया?",
    option: [
        "सामूहिक सुरक्षा",
        "सत्ता सन्तुलन",
        "शान्ति स्थापना",
        "शान्ति निर्माण"
    ],
    answer: "शान्ति स्थापना"
},

{
    question: "पदों को लोगों से भरने का काम प्रबन्ध के किस कार्य के अंतर्गत आता है ?",
    option: [
        "नियोजन",
        "संगठन",
        "नियुक्तिकरण",
        "निर्देशन"
    ],
    answer: "नियुक्तिकरण"
},

{
    question: "संयुक्त राष्ट्र महासभा की बैठक वर्ष में कितनी बार होती है?",
    option: [
        "एक बार",
        "दो बार",
        "तीन बार",
        "चार बार"
    ],
    answer: "एक बार"
},

{
    question: "…………. के अनुसार, “प्रबंध व्यक्तियों का विकास है, न कि वस्तुओं का निर्देशन।”",
    option: [
        "हेनरी फेयोल",
        "लॉरेन्स एप्पले",
        "एफ. डब्ल्यू. टेलर",
        "आर. सी. डेविस"
    ],
    answer: "लॉरेन्स एप्पले"
},

{
    question: "निम्न में से कौन शिकायत दायर नहीं कर सकता ?",
    option: [
        "एक उपभोक्ता",
        "उपभोक्ता संघ जिसे मान्यता प्राप्त न हो",
        "केंद्रीय सरकार",
        "राज्य सरकार"
    ],
    answer: "उपभोक्ता संघ जिसे मान्यता प्राप्त न हो"
},

{
    question: "विश्व बैंक की स्थापना कब हुई?",
    option: [
        "1945 ई. में",
        "1947 ई. में",
        "1948 ई. में",
        "1944 ई. में"
    ],
    answer: "1944 ई. में"
},

{
    question: "नियंत्रण प्रक्रिया में निम्न में से कौन-सा कदम शामिल नहीं होता ?",
    option: [
        "वास्तविक प्रगति का मापना",
        "वास्तविक प्रगति की प्रमापों से तुलना",
        "वित्त प्रबंध का कार्य करना",
        "विचलनों का विश्लेषण करना"
    ],
    answer: "वित्त प्रबंध का कार्य करना"
},

{
    question: "निम्न में से उपभोक्ताओं को विशेषज्ञ सलाह किसके अंतर्गत दी जा सकती है?",
    option: [
        "प्रचार",
        "विज्ञापन",
        "विक्रय संवर्धन",
        "व्यक्तिगत विक्रय"
    ],
    answer: "व्यक्तिगत विक्रय"
},

{
    question: "निम्नलिखित में से कौन-सा व्यावसायिक वातावरण का लक्षण नहीं है :",
    option: [
        "अनिश्चितता",
        "कर्मचारी",
        "सम्बन्धता",
        "झंझट"
    ],
    answer: "कर्मचारी"
},

{
    question: "एक प्रभावी नियंत्रण तंत्र सहायक होता है :",
    option: [
        "संगठनात्मक लक्ष्यों के निष्पादन में",
        "कर्मचारियों की मनोदशा के संवर्धन में",
        "मानकों की यथार्थता के निर्णय में",
        "उपरोक्त सभी"
    ],
    answer: "मानकों की यथार्थता के निर्णय में"
},

{
    question: "एक उद्यमी कहा जाता है",
    option: [
        "आर्थिक विकास का प्रवर्तक",
        "आर्थिक विकास का प्रेरक",
        "'A' और 'B' दोनों",
        "इनमें कोई नहीं"
    ],
    answer: "'A' और 'B' दोनों"
},

{
    question: "अभिप्रेरणा का अभिप्राय उस प्रक्रिया से है जो वांछित उद्देश्य प्राप्ति हेतु लोगों में",
    option: [
        "प्रतियोगिता",
        "उत्तेजना",
        "झगड़ा",
        "मेल-जोल होने की है"
    ],
    answer: "उत्तेजना"
},

{
    question: "कैसे तो सभी विचलन महत्वपूर्ण है लेकिन सर्वाधिक महत्वपूर्ण विचलन कौन-सा है ?",
    option: [
        "नकारात्मक",
        "धनात्मक",
        "शून्य",
        "उपरोक्त सभी"
    ],
    answer: "नकारात्मक"
},

{
    question: "परंपरागत विचार के अनुसार .................. को बाजार कहा जाता है।",
    option: [
        "वास्तविक क्रेता",
        "संभावित क्रेता",
        "वास्तविक व संभावित क्रेताओं का समूह",
        "विशेष स्थान"
    ],
    answer: "विशेष स्थान"
},

{
    question: "व्यवसाय के आर्थिक वातावरण को………….प्रभावित करती है।",
    option: [
        "आर्थिक प्रणाली",
        "उदारीकरण",
        "वैश्वीकरण",
        "निजीकरण"
    ],
    answer: "आर्थिक प्रणाली"
},

{
    question: "नियुक्तिकरण का संबंध किस उत्तरदायित्व से है ?",
    option: [
        "सामाजिक",
        "राजनीतिक",
        "सरकारी",
        "व्यक्तिगत"
    ],
    answer: "सामाजिक"
},

{
    question: "निम्न में से उपभोक्ता संरक्षण से संबंधित कौन-सा अधिनियम है ?",
    option: [
        "उपभोक्ता संरक्षण अधिनियम, 1986",
        "भारतीय कंपनी अधिनियम, 1956",
        "भारतीय साझेदारी अधिनियम",
        "भारतीय अनुबंध अधिनियम"
    ],
    answer: "उपभोक्ता संरक्षण अधिनियम, 1986"
},

{
    question: "“प्रबंध एक पेशा है।” यह कथन है:",
    option: [
        "जार्ज आर. टैरी",
        "अमेरिकन प्रबंध एसोसिएशन",
        "हेनरी फेयोल",
        "लॉरेन्स ए, एप्पल"
    ],
    answer: "अमेरिकन प्रबंध एसोसिएशन"
},

{
    question: "मानव संसाधन प्रबन्ध व नियुक्तिकरण में क्या संबंध है ?",
    option: [
        "मानव संसाधन प्रबन्ध नियुक्तिकरण से बड़ा है",
        "नियुक्तिकरण मानव संसाधन प्रबन्ध से बड़ा है",
        "दोनों बराबर हैं",
        "दोनों में कोई संबंध नहीं है"
    ],
    answer: "मानव संसाधन प्रबन्ध नियुक्तिकरण से बड़ा है"
},

{
    question: "एक संगठन का नियंत्रण करना कार्य है :",
    option: [
        "आगे देखना",
        "पीछे देखना",
        "आगे, साथ ही साथ पीछे देखना",
        "उपरोक्त में से कोई नहीं"
    ],
    answer: "आगे, साथ ही साथ पीछे देखना"
},

{
    question: "सुरक्षा परिषद् में कुल अस्थायी सदस्यों की संख्या कितनी है?",
    option: [
        "10",
        "6",
        "7",
        "14"
    ],
    answer: "10"
},

{
    question: "निम्न में कौन-सा वित्तीय प्रोत्साहन है?",
    option: [
        "पदोन्नति",
        "सेवानिवृत्ति प्रोत्साहन",
        "पद-सुरक्षा",
        "कर्मचारी भागीदारी"
    ],
    answer: "सेवानिवृत्ति प्रोत्साहन"
},

{
    question: "डैब्ट ऋण अनुपात [ ---- ] परिणाम में होता है :",
    option: [
        "निम्नस्तर वित्तीय जोखिम",
        "उच्चस्तरीय संचालन",
        "उच्चस्तरीय वित्तीय जोखिम",
        "उच्चस्तरीय प्रति अंश आय"
    ],
    answer: "उच्चस्तरीय वित्तीय जोखिम"
},

{
    question: "भारत में कार्यरत गैर-सरकारी संगठन है:",
    option: [
        "वॉइस",
        "कॉमन कॉज",
        "'a' तथा 'b' दोनों",
        "कोई नहीं"
    ],
    answer: "'a' तथा 'b' दोनों"
},

{
    question: "निम्न में कौन-सम्प्रेषण प्रक्रिया का तत्त्व नहीं है",
    option: [
        "डिकोडिंग",
        "सम्प्रेषण",
        "माध्यम",
        "संदेश प्रापक"
    ],
    answer: "सम्प्रेषण"
},

{
    question: "विकास की विधियाँ हैं :",
    option: [
        "पद हेरफेर",
        "अल्पकालीन पाठ्यक्रम",
        "कार्य पर विकास",
        "ये सभी"
    ],
    answer: "ये सभी"
},

{
    question: "उद्यमिता निम्न में से किसके लिए रोजगार के अवसर उपलब्ध करती है?",
    option: [
        "उद्यमी के लिए",
        "आपूर्तिकर्ताओं के लिए",
        "मध्यस्थों के लिए",
        "उपरोक्त सभी के लिए"
    ],
    answer: "उपरोक्त सभी के लिए"
},

{
    question: "निम्न में से कौन उद्यमिता की विशेषता नहीं है?",
    option: [
        "जोखिम लेना",
        "नवाचार",
        "सृजनात्मक क्रिया",
        "प्रबंधकीय प्रशिक्षण"
    ],
    answer: "प्रबंधकीय प्रशिक्षण"
},

{
    question: "वित्तीय नियोजन से पूँजी को ........ लागत पर उपलब्ध कराया जा सकता है।",
    option: [
        "अधिक",
        "मध्यम",
        "न्यूनतम",
        "शून्य"
    ],
    answer: "न्यूनतम"
},

{
    question: ".............. के द्वारा उद्यमिता आश्वस्त होती है",
    option: [
        "सहायक",
        "वृहताकार फर्में",
        "मध्यम फर्म",
        "लघु फर्म"
    ],
    answer: "वृहताकार फर्में"
},

{
    question: "हेनरी फेयॉल था एक",
    option: [
        "समाज वैज्ञानिक",
        "खनन इंजीनियर",
        "लेखाकार",
        "उत्पादन इंजीनियर"
    ],
    answer: "खनन इंजीनियर"
},

{
    question: "10 दिसम्बर को क्या मनाया जाता है?",
    option: [
        "मानवाधिकार दिवस",
        "पर्यावरण दिवस",
        "महिला दिवस",
        "मजदूर दिवस"
    ],
    answer: "मानवाधिकार दिवस"
},

{
    question: "यदि आप संदेशवाहन का प्रमाण रखना चाहते हैं तो आपको संदेशवाहन का उपयोग करना चाहिए :",
    option: [
        "अनौपचारिक",
        "औपचारिक",
        "मौखिक",
        "इनमें कोई नहीं"
    ],
    answer: "औपचारिक"
},

{
    question: "समन्वय है:",
    option: [
        "ऐच्छिक",
        "आवश्यक",
        "अनावश्यक",
        "समय की बर्बादी"
    ],
    answer: "आवश्यक"
},

{
    question: "संयुक्त राष्ट्र संघ की आर्थिक व सामाजिक परिषद् में कुल कितने सदस्य हैं?",
    option: [
        "9",
        "18",
        "27",
        "54"
    ],
    answer: "54"
},

{
    question: "मुद्रा बाजार व्यवहार करता है—",
    option: [
        "अल्पकालीन कोष",
        "मध्यकालीन कोष",
        "दीर्घकालीन कोष",
        "इनमें कोई नहीं"
    ],
    answer: "अल्पकालीन कोष"
},

{
    question: ".................. पूँजी बाजार का अंग है।",
    option: [
        "मांग मुद्रा",
        "प्राथमिक बाजार",
        "गौण बाजार",
        "प्राथमिक व गौण बाजार"
    ],
    answer: "प्राथमिक व गौण बाजार"
},

{
    question: "एक व्यवसाय की चालू संपत्तियों की वित्त व्यवस्था होनी चाहिए:",
    option: [
        "केवल चालू दायित्वों से",
        "केवल दीर्घकालीन दायित्वों से",
        "दीर्घकालीन तथा अल्पकालीन दोनों से अंशतः",
        "इनमें कोई नहीं"
    ],
    answer: "दीर्घकालीन तथा अल्पकालीन दोनों से अंशतः"
},

{
    question: "कून्टज ओ डोनेल के अनुसार प्रबंध के कार्य हैं:",
    option: [
        "2",
        "4",
        "6",
        "8"
    ],
    answer: "2"
},

{
    question: "निम्न में से उपभोक्ता संगठन कौन-सा है ?",
    option: [
        "Common Cause, New Delhi",
        "VOICE, New Delhi",
        "Consumers' Forum, Udupi",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "बिना के किसी भी व्यावसायिक योजना को सफलतापूर्वक लागू नहीं किया जा सकता।",
    option: [
        "लाभांश निर्णय",
        "विनियोग निर्णय",
        "उपरोक्त",
        "वित्तीय नियोजन"
    ],
    answer: "वित्तीय नियोजन"
},

{
    question: "उपभोक्ता संरक्षण अधिनियम में 1993 के संशोधन के दौरान शिकायत करने की समय सीमा को वर्ष तक करने का प्रावधान रखा गया।",
    option: [
        "दो",
        "तीन",
        "चार",
        "पाँच"
    ],
    answer: "तीन"
},

{
    question: "प्रबंध है:",
    option: [
        "कला",
        "विज्ञान",
        "कला और विज्ञान दोनों",
        "पेशा"
    ],
    answer: "कला और विज्ञान दोनों"
},

{
    question: "'10% पर पूरा वित्त प्रदान करना' निम्न में से किसकी विधि है ?",
    option: [
        "विज्ञापन",
        "व्यक्तिगत विक्रय",
        "विक्रय संवर्धन",
        "प्रचार"
    ],
    answer: "विक्रय संवर्धन"
},

{
    question: "कार्यक्रम का निर्धारण आवश्यक है वैज्ञानिक….के लिए :",
    option: [
        "नियोजन",
        "प्रबंध",
        "संगठन",
        "नियंत्रण"
    ],
    answer: "प्रबंध"
},

{
    question: "अनुकूलतम पूँजी ढाँचे से निम्न में से कौन-सा प्रभाव पड़ता है ?",
    option: [
        "पूँजी लागत न्यूनतम",
        "कंपनी का कुल मूल्य अधिकतम",
        "उपरोक्त दोनों",
        "अंशों का बाजार मूल्य न्यूनतम"
    ],
    answer: "उपरोक्त दोनों"
},

{
    question: "................ प्रमाण उत्पादन से संबंधित है।",
    option: [
        "किस्म",
        "मात्रा",
        "किस्म व मात्रा",
        "श्रम संबंध"
    ],
    answer: "किस्म व मात्रा"
},

{
    question: "उद्यमिता विशेषतः .................. के जीवनयापन का एक आकर्षक विकल्प है।",
    option: [
        "पिछड़े वर्ग",
        "अमीरी वर्ग",
        "स्त्री वर्ग",
        "पुरुष वर्ग"
    ],
    answer: "पिछड़े वर्ग"
},

{
    question: "मानव संसाधन प्रबन्ध में सम्मिलित हैं:",
    option: [
        "भर्ती",
        "चयन",
        "प्रशिक्षण",
        "ये सभी"
    ],
    answer: "ये सभी"
},

{
    question: "विश्व के देशों के बीच व्यापार संगठनों के लिए कौन सा अन्तर्राष्ट्रीय संगठन है?",
    option: [
        "विश्व व्यापार संगठन",
        "अन्तर्राष्ट्रीय मुद्रा कोष",
        "विश्व बैंक",
        "इनमें से सभी"
    ],
    answer: "विश्व व्यापार संगठन"
},

{
    question: "काउंटर रसीद का प्रयोग कर किया जाता है।",
    option: [
        "NSE",
        "OTCEI",
        "BSE",
        "DSE"
    ],
    answer: "OTCEI"
},

{
    question: "संदेशवाहन प्रक्रिया में प्रतिपुष्टि का अभिप्राय यह देखने से है कि क्या...........।",
    option: [
        "संदेश को ठीक प्राप्त कर लिया है",
        "संदेश को समझ लिया है",
        "उपरोक्त दोनों",
        "संदेश का पालन कर लिया है"
    ],
    answer: "उपरोक्त दोनों"
},

{
    question: "अन्तर्राष्ट्रीय न्यायालय का मुख्यालय कहाँ अवस्थित है?",
    option: [
        "जेनेवा",
        "बर्लिन",
        "न्यूयॉर्क",
        "हेग"
    ],
    answer: "हेग"
},

{
    question: "विपणन में शामिल होता है ?",
    option: [
        "क्रय",
        "विक्रय",
        "भंडारण",
        "सभी"
    ],
    answer: "सभी"
},

{
    question: "उद्यमिता विकास कार्यक्रम के प्रति भारत के सरकारी तंत्र का दृष्टिकोण है",
    option: [
        "विनाशात्मक",
        "नकारात्मक",
        "रचनात्मक",
        "असहयोगात्मक"
    ],
    answer: "असहयोगात्मक"
},

{
    question: "विपणन व्यय भार है :",
    option: [
        "उद्योग पर",
        "व्यवसायियों पर",
        "उपभोक्ताओं पर",
        "इनमें से सभी पर"
    ],
    answer: "उपभोक्ताओं पर"
},

{
    question: "…………..एक ऐसी विधि है जो कार्य को पूरा करती है :",
    option: [
        "प्रक्रिया",
        "उद्योग",
        "उद्देश्य",
        "व्यापार"
    ],
    answer: "प्रक्रिया"
},

{
    question: "सेबी का क्षेत्रीय कार्यालय स्थित है :",
    option: [
        "दिल्ली",
        "कोलकाता",
        "चेन्नई",
        "इन तीनों जगह"
    ],
    answer: "इन तीनों जगह"
},

{
    question: "विपणन पर व्यय किया गया धन है",
    option: [
        "बर्बादी",
        "अनावश्यक व्यय",
        "ग्राहकों पर भार",
        "विनियोजन"
    ],
    answer: "विनियोजन"
},

{
    question: "वर्तमान में आसियान के कितने सदस्य देश हैं?",
    option: [
        "10",
        "12",
        "13",
        "15"
    ],
    answer: "10"
},

{
    question: "निम्न में से शिकायत का आधार कौन-सा है ?",
    option: [
        "दोषयुक्त वस्तुएँ",
        "सेवाओं में न्यूनता",
        "अधिक कीमत लेना",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "...................... में संदेशों का तुरंत समाधान होता है।",
    option: [
        "विज्ञापन",
        "व्यक्तिगत विक्रय",
        "विक्रय संवर्धन",
        "प्रचार"
    ],
    answer: "व्यक्तिगत विक्रय"
},

{
    question: "चयन प्रक्रिया में भरे जाने वाले रिक्त आवेदन पत्र में .......... भरी जाती हैं।",
    option: [
        "योग्यताएँ",
        "व्यक्तिगत सूचनाएँ",
        "न्यूनतम स्वीकार्य वेतन संबंधी सूचनाएँ",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "केन्द्रीकरण से तात्पर्य होता है-",
    option: [
        "निर्णय लेने में अधिकारियों को सुरक्षित रखना",
        "निर्णय लेने के अधिकारों का विकेन्द्रीकरण करना",
        "प्रभागों का लाभ केन्द्र बनाना",
        "नये केन्द्र अथवा शाखाओं को खोलना"
    ],
    answer: "निर्णय लेने में अधिकारियों को सुरक्षित रखना"
},

{
    question: "रोकड़ प्रवाह स्थिति बेहतर होने पर निम्न में से कौन-सी पूँजी का प्रयोग करना चाहिए ?",
    option: [
        "ऋण पूँजी",
        "समता अंश पूँजी",
        "उपरोक्त दोनों",
        "इनमें कोई नहीं"
    ],
    answer: "ऋण पूँजी"
},

{
    question: "बजट का अर्थ है:",
    option: [
        "निष्पादन का नियोजित लक्ष्य",
        "भविष्य के कार्यकलाप का प्रयोग",
        "संसाधनों का सही विवरण",
        "आशान्वित परिणाम का अंकों में वितरण"
    ],
    answer: "आशान्वित परिणाम का अंकों में वितरण"
},

{
    question: "उपभोक्ता संरक्षण अधिनियम के अन्तर्गत विवाद आते हैं :",
    option: [
        "कंपनी के अंश सम्बन्धी विवाद",
        "दण्डित प्रकृति के विवाद",
        "विक्रेता द्वारा दोषी माल के विक्रय सम्बन्धी विवाद",
        "नौकरी सम्बन्धी"
    ],
    answer: "विक्रेता द्वारा दोषी माल के विक्रय सम्बन्धी विवाद"
},

{
    question: "संयुक्त राष्ट्र दिवस मनाया जाता है-",
    option: [
        "24 सितम्बर को",
        "28 सितम्बर को",
        "24 अक्टूबर को",
        "28 अक्टूबर को"
    ],
    answer: "24 अक्टूबर को"
},

{
    question: "निम्न में से कौन-सा पूँजी संरचना को निर्धारित करने वाला तत्व है ?",
    option: [
        "रोकड़ प्रवाह स्थिति",
        "ब्याज आवरण अनुपात",
        "ऋण भुगतान आवरण अनुपात",
        "उपर्युक्त सभी"
    ],
    answer: "उपर्युक्त सभी"
},

{
    question: "आर्थिक विकास के लिए ................. की आवश्यकता होती है।",
    option: [
        "अन्वेषण",
        "प्रयोग",
        "साहस",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "अच्छे ब्राण्ड की विशेषताएँ हैं :",
    option: [
        "सूक्ष्म नाम",
        "स्मरणीय",
        "आकर्षक",
        "ये सभी"
    ],
    answer: "ये सभी"
},

{
    question: "नियंत्रण प्रबंधकीय कार्य है:",
    option: [
        "अनिवार्य",
        "आवश्यक",
        "ऐच्छिक",
        "इनमें कोई नहीं"
    ],
    answer: "अनिवार्य"
},

{
    question: "नेतृत्व है :",
    option: [
        "समय की बर्बादी",
        "आवश्यक",
        "धन की बर्बादी",
        "अनावश्यक"
    ],
    answer: "आवश्यक"
},

{
    question: "वैधानिक रूप में सेबी की स्थापना हुई थी :",
    option: [
        "1988",
        "1990",
        "1992",
        "1994"
    ],
    answer: "1992"
},

{
    question: "निम्न में से टिकाऊ उत्पाद का उदाहरण कौन-सा है?",
    option: [
        "फर्नीचर",
        "नमक",
        "मोमबत्ती",
        "डिस्पासलाई"
    ],
    answer: "फर्नीचर"
},

{
    question: "निम्न में से कौन सुरक्षा परिषद् का स्थायी सदस्य नहीं है?",
    option: [
        "फ्रांस",
        "ब्रिटन",
        "इटली",
        "चीन"
    ],
    answer: "इटली"
},

{
    question: "अंशधारी की कंपनी में वर्तमान संपदा =",
    option: [
        "अंशों का अंकित मूल्य प्रति अंश बाजार मूल्य",
        "अंशों की संख्या × अंशों का अंकित मूल्य",
        "अंशों की संख्या × प्रति अंश बाजार मूल्य",
        "अंशों की संख्या × प्रति अंश लाभ"
    ],
    answer: "अंशों की संख्या × प्रति अंश बाजार मूल्य"
},

{
    question: "वित्तीय प्रबन्धक निर्णय लेता है:",
    option: [
        "वित्तीय",
        "विनियोग",
        "लाभांश",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "भारतीय राष्ट्रीय शेयर बाजार को स्टॉक एक्सचेंज (शेयर बाजार) के रूप में मान्यता किस वर्ष में मिली थी ?",
    option: [
        "1992",
        "1993",
        "1994",
        "1955"
    ],
    answer: "1993"
},

{
    question: "अन्तर्राष्ट्रीय मुद्रा कोष का मुख्यालय कहाँ है?",
    option: [
        "मनीला में",
        "जकार्ता में",
        "पेरिस में",
        "वाशिंगटन में"
    ],
    answer: "वाशिंगटन में"
},

{
    question: "वित्तीय नियोजन से लगातार ............... की स्थिति बनाकर रखी जा सकती है।",
    option: [
        "न्यूनतम पूँजी",
        "तरलता",
        "अधिकतम पूँजी",
        "(B) तथा (C)"
    ],
    answer: "तरलता"
},

{
    question: "अब्राहम मास्लो ने आवश्यकता-प्राथमिकता सिद्धांत का प्रतिपादन वर्ष में किया।",
    option: [
        "1843",
        "1943",
        "1893",
        "1963"
    ],
    answer: "1943"
},

{
    question: "मानवाधिकार परिषद कब से सक्रिय है?",
    option: [
        "2005 ई. से",
        "2004 ई. से",
        "2006 ई. से",
        "2007 ई. से"
    ],
    answer: "2006 ई. से"
},

{
    question: "हेनरी फेयोल का जन्म हुआ था :",
    option: [
        "जापान",
        "फ्रांस",
        "जर्मनी",
        "अमरीका"
    ],
    answer: "फ्रांस"
},

{
    question: "पर्यवेक्षक कर्मचारियों का है—",
    option: [
        "मित्र",
        "मार्गदर्शक",
        "दार्शनिक",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "उत्पाद अन्तराल (मिश्रण) को प्रभावित करने वाले घटक",
    option: [
        "विपणन",
        "उत्पाद",
        "वित्तीय",
        "ये सभी"
    ],
    answer: "विपणन"
},

{
    question: "वाणिज्यिक प्रपत्र की अधिकतम अवधि होती है।",
    option: [
        "3 महीना",
        "6 महीना",
        "12 महीना",
        "24 महीना"
    ],
    answer: "12 महीना"
},

{
    question: "1945 में संयुक्त राष्ट्र संघ की स्थापना हुई, इसका मौलिक सदस्य कौन था?",
    option: [
        "पाकिस्तान",
        "बांग्लादेश",
        "श्रीलंका",
        "भारत"
    ],
    answer: "भारत"
},

{
    question: "सामाजिक वातावरण का निम्नलिखित में से कौन-सा उदाहरण है ?",
    option: [
        "मुद्रा की आपूर्ति",
        "उपभोक्ता संरक्षण अधिनियम",
        "भारतीय संविधान",
        "परिवार की संरचना"
    ],
    answer: "परिवार की संरचना"
},

{
    question: "अन्तर्राष्ट्रीय अणु ऊर्जा अभिकरण की स्थापना कब हुई?",
    option: [
        "1956",
        "1957",
        "1958",
        "1959"
    ],
    answer: "1957"
},

{
    question: "उत्पादकों एवं विक्रेताओं के अनुचित व्यवहार से उपभोक्ताओं को कहते हैं। सुरक्षा प्रदान करने को",
    option: [
        "उपभोक्ता संरक्षण अधिनियम",
        "उपभोक्ता संरक्षण",
        "उपभोक्ता कल्याण",
        "उपभोक्ता शिक्षा"
    ],
    answer: "उपभोक्ता संरक्षण"
},

{
    question: "प्रबंध के कितने स्तर हैं?",
    option: [
        "3",
        "4",
        "5",
        "6"
    ],
    answer: "3"
},

{
    question: "एक व्यक्ति XYZ कंपनी के 100 अंश ₹ 100 प्रति अंश की दर से खरीदता है। कुछ समय बाद अंशों का बाजार मूल्य ₹ 120 हो जाता है। उसकी कंपनी में संपदा कितनी होगी ?",
    option: [
        "₹12,000/",
        "₹8,000",
        "₹10,000",
        "₹10,120"
    ],
    answer: "₹12,000/"
},

{
    question: "निम्न में से कौन-सा सरकारी नीतियों में परिवर्तन का व्यवसाय एवं उद्योग पर प्रभाव का वर्णन नहीं करता?",
    option: [
        "ग्राहकों की बढ़ती माँग",
        "प्रतियोगिता में वृद्धि",
        "कृषि में परिवर्तन",
        "बाजार मूलकता"
    ],
    answer: "कृषि में परिवर्तन"
},

{
    question: "प्रबंध के सिद्धांत हैं :",
    option: [
        "सार्वभौम",
        "लचीले",
        "सम्पूर्ण",
        "व्यावहारिक"
    ],
    answer: "सम्पूर्ण"
},

{
    question: "गौण बाजार में पूर्व निर्मित प्रतिभूतियों का .................. होता है।",
    option: [
        "क्रय",
        "विक्रय",
        "क्रय-विक्रय",
        "स्टॉक"
    ],
    answer: "क्रय-विक्रय"
},

{
    question: "प्रभावी संदेशवाहन के लिए आवश्यक हैं :",
    option: [
        "स्पष्टता",
        "शिष्टता",
        "निरन्तरता",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "निम्नलिखित में कौन-सी उपभोक्ता संरक्षण अधिनियम की विशेषता है ?",
    option: [
        "भंडों का फैलाव",
        "क्षेत्र का फैलाव",
        "प्रावधानों की अतिपूरक प्रकृति",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "शॉपिंग कीमत दृश्य निम्न में से किसका उदाहरण है ?",
    option: [
        "प्राथमिक पैकेजिंग",
        "द्वितीयक पैकेजिंग",
        "परिवहन पैकेजिंग",
        "इनमें कोई नहीं"
    ],
    answer: "प्राथमिक पैकेजिंग"
},

{
    question: "विपणन विचारधारा का केन्द्र-बिन्दु .................. होता है।",
    option: [
        "उपभोक्ता संतुष्टि",
        "उपभोक्ता कल्याण",
        "उत्पाद की गुणवत्ता",
        "उत्पादन की मात्रा"
    ],
    answer: "उपभोक्ता संतुष्टि"
},

{
    question: "उपभोक्ता संरक्षण पारित हुआ था :",
    option: [
        "1786",
        "1886",
        "1986",
        "1996"
    ],
    answer: "1986"
},

{
    question: "प्रबंध का सामाजिक उत्तरदायित्व है।",
    option: [
        "सभी के प्रति",
        "कर्मचारियों के प्रति",
        "सरकार के प्रति",
        "समाज के प्रति"
    ],
    answer: "सभी के प्रति"
},

{
    question: "अन्तर्राष्ट्रीय अणु ऊर्जा अभिकरण की स्थापना कब हुई?",
    option: [
        "1956",
        "1957",
        "1958",
        "1959"
    ],
    answer: "1957"
},

{
    question: "एक पर्यवेक्षक ............ भूमिका अदा करता है।",
    option: [
        "एक मुख्य व्यक्ति के रूप में",
        "एक मध्यस्थ के रूप में",
        "एक मानवीय संबंध विशेषज्ञ के रूप में",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "कम प्रभावपूर्णता विज्ञापन के बारे में क्या बताती है।",
    option: [
        "लाभ",
        "सीमा",
        "आक्षेप",
        "आक्षेप का खंडन"
    ],
    answer: "सीमा"
},

{
    question: "निर्देशन की प्रबन्ध के स्तर पर आवश्यकता होती है—",
    option: [
        "उच्च",
        "मध्यम",
        "निम्न",
        "सभी स्तर"
    ],
    answer: "सभी स्तर"
},

{
    question: "बिल्कुल बड़ी परियोजनाओं के लिए निम्न में से क्या अपनाया जाता है ?",
    option: [
        "पर्ट",
        "सी० पी० एम०",
        "उपरोक्त दोनों",
        "प्रबंध अंकेक्षण"
    ],
    answer: "पर्ट"
},

{
    question: "उद्यमितीय लक्षण से सम्बन्धित हैं।",
    option: [
        "कार्य सृजन व्यवहार",
        "लाभ सृजन व्यवहार",
        "जोखिम वहन व्यवहार",
        "इनमें कोई नहीं"
    ],
    answer: "जोखिम वहन व्यवहार"
},

{
    question: "कार्य पर स्वयं विकास आवश्यकताएँ पूर्ण की जाती हैं, के द्वारा :",
    option: [
        "कार्य में मेहनत",
        "किस्म उत्पाद आश्वस्त करना",
        "प्रशिक्षण कार्यक्रम में भागीदारी",
        "उपरोक्त में से कोई नहीं"
    ],
    answer: "प्रशिक्षण कार्यक्रम में भागीदारी"
},

{
    question: "उत्तरदायित्व लेखांकन में निम्न में से व्यक्तियों की किस चीज का लेखा रखा जाता हैं।",
    option: [
        "सम्पत्ति",
        "आय",
        "उत्तरदायित्व",
        "उपरोक्त सभी"
    ],
    answer: "उत्तरदायित्व"
},

{
    question: "'सूरजमुखी के एक निर्माता ने एक राष्ट्रीय समाचार पत्र में दिए गए विज्ञापन में कहा कि उसका उत्पाद Vitamins, Minerals व Protein से भरपूर है। टेस्ट करने पर सभी दावे झूठे पाए गए। वह किसका उदाहरण है।",
    option: [
        "उपभोक्ता शोषण",
        "उपभोक्ता भलाई",
        "उपभोक्ता जानकारी",
        "कोई नहीं"
    ],
    answer: "उपभोक्ता शोषण"
},

{
    question: "अंतर्राष्ट्रीय न्यायालय में न्यायाधीशों की संख्या कितनी होती है?",
    option: [
        "5",
        "8",
        "10",
        "15"
    ],
    answer: "15"
},

{
    question: "संयुक्त राष्ट्रसंघ के महासचिव कौन हैं?",
    option: [
        "मनमोहन सिंह",
        "बान की मून",
        "बाराक ओबामा",
        "माधव नेपाली"
    ],
    answer: "बान की मून"
},

{
    question: "वित्तीय प्रबन्ध की परम्परागत विचारधारा को त्याग दिया गया था :",
    option: [
        "1910-20 में",
        "1920-30 में",
        "1930-40 में",
        "1940-50 में"
    ],
    answer: "1930-40 में"
},

{
    question: "वित्तीय प्रबन्ध के मुख्य कार्य हैं:",
    option: [
        "वित्तीय नियोजन",
        "कोषों को प्राप्त करना",
        "शुद्ध लाभ का आवंटन",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "परम्परागत प्रबन्ध में श्रमिकों को मजदूरी दी जाती है-",
    option: [
        "कम",
        "अधिक",
        "अधिकतम",
        "इनमें कोई नहीं"
    ],
    answer: "कम"
},

{
    question: "वस्तुएँ खरीदी नहीं जाती बल्कि उन्हें बेचा जाता है। यह कथन ................ विचारधारा से संबंधित है।",
    option: [
        "उत्पाद",
        "बिक्री",
        "उत्पादन",
        "विपणन"
    ],
    answer: "बिक्री"
},

{
    question: "वैज्ञानिक प्रबंध स्वामियों के…………….है :",
    option: [
        "पक्ष में",
        "विपक्ष में",
        "दोनों",
        "सहायक"
    ],
    answer: "पक्ष में"
},

{
    question: "भारत में सबसे पहले स्कन्ध विपणि की स्थापना हुई थी",
    option: [
        "1857",
        "1877",
        "1887",
        "1987"
    ],
    answer: "1887"
},

{
    question: "यदि अन्य बातें समान रहें तो कर की दर में निगमित लाभ पर वृद्धि होगी :",
    option: [
        "ऋण अपेक्षाकृत सस्ते होंगे",
        "ऋण अपेक्षाकृत कम सस्ते होंगे",
        "ऋणों की लागत पर कोई प्रभाव नहीं होगा",
        "हम कुछ नहीं कर सकते"
    ],
    answer: "ऋण अपेक्षाकृत सस्ते होंगे"
},

{
    question: "वित्तीय नियोजन में क्या सम्मिलित किया जाता है ?",
    option: [
        "वित्तीय उद्देश्यों का निर्धारण",
        "वित्तीय नीतियों का निर्धारण",
        "वित्तीय कार्यविधियों का निर्धारण",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "................ विज्ञापन के विरुद्ध आक्षेप है।",
    option: [
        "सामाजिक मूल्यों को अहेलनना",
        "मूल्य की कमी",
        "विभिन्न उत्पादों का ज्ञान",
        "उत्पाद किस्म में सुधार"
    ],
    answer: "सामाजिक मूल्यों को अहेलनना"
},

{
    question: "संयुक्त राष्ट्र संघ की स्थापना के उत्तरदायी तत्व इनमें से कौन नहीं है?",
    option: [
        "लन्दन घोषणा",
        "मॉस्को घोषणा",
        "अटलांटिक चार्टर",
        "चेनजुस समझौता"
    ],
    answer: "चेनजुस समझौता"
},

{
    question: "राज्य आयोग विवादों का निपटारा कर सकता है",
    option: [
        "₹ 5 लाख तक",
        "₹ 10 लाख तक",
        "₹ 20 लाख तक",
        "₹1 करोड़ से अधिक"
    ],
    answer: "₹1 करोड़ से अधिक"
},

{
    question: "उद्यमिता की आवश्यकता ................. के लिए होती है।",
    option: [
        "विकास प्रक्रिया का प्रारंभ करने",
        "विकास को बनाए रखने",
        "रोजगार अवसर उपलब्ध करने",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "निम्न में से कौन-सा तीन स्तरीय शिकायत निवारण तंत्र का अंग नहीं है ?",
    option: [
        "अंतर्राष्ट्रीय आयोग",
        "राष्ट्रीय आयोग",
        "राज्य आयोग",
        "जिला फोरम"
    ],
    answer: "अंतर्राष्ट्रीय आयोग"
},

{
    question: "नियोजन सभी प्रबंधकीय क्रियाओं का है:",
    option: [
        "प्रारम्भ",
        "अन्त",
        "प्रारम्भ तथा अन्त दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "प्रारम्भ तथा अन्त दोनों"
},

{
    question: "एक उद्यमी का ध्यान कहाँ केन्द्रित होता है?",
    option: [
        "व्यवसाय प्रारंभ करने संबंधी क्रियाओं पर",
        "व्यवसाय संचालन संबंधी क्रियाओं पर",
        "अत्यधिक लाभ अर्जित करने पर",
        "प्रतियोगिता का सामना करने पर"
    ],
    answer: "व्यवसाय प्रारंभ करने संबंधी क्रियाओं पर"
},

{
    question: "....................... विज्ञापन की सीमा का उदाहरण है।",
    option: [
        "कम शक्तिशाली",
        "अलोकप्रियता",
        "प्रतिपुष्टि का अभाव",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "जार्ज आर. टैरी के अनुसार प्रबंध के कार्य हैं :",
    option: [
        "2",
        "4",
        "6",
        "7"
    ],
    answer: "4"
},

{
    question: "संयुक्त राष्ट्र संघ की स्थापना कब हुई?",
    option: [
        "1945",
        "1950",
        "1952",
        "1955"
    ],
    answer: "1945"
},

{
    question: "एक अच्छी योजना होती है :",
    option: [
        "सर्चीली",
        "समय लेने वाली",
        "लोचपूर्ण",
        "संकीर्ण"
    ],
    answer: "लोचपूर्ण"
},

{
    question: "मनोवैज्ञानिक परीक्षा में ............... को सम्मिलित किया जाता",
    option: [
        "रुचि परीक्षा",
        "बुद्धिमत्ता परीक्षा",
        "उपरोक्त दोनों",
        "सामान्य ज्ञान परीक्षा"
    ],
    answer: "उपरोक्त दोनों"
},

{
    question: "निम्न में से कौन मानवाधिकार का एक प्रकार है?",
    option: [
        "अभिव्यक्ति की स्वतंत्रता",
        "सामाजिक समानता",
        "आर्थिक अधिकार",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "नियंत्रण की आवश्यकता स्तरों पर होती है।",
    option: [
        "उच्च",
        "मध्य",
        "निम्न",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "कर्मचारियों की माँग भर्ती प्रक्रिया का कौन-सा चरण है ?",
    option: [
        "प्रथम",
        "द्वितीय",
        "तृतीय",
        "चतुर्थ"
    ],
    answer: "द्वितीय"
},

{
    question: "वस्तु निर्माण का विचार आते ही ............... क्रिया प्रारंभ हो जाती है।",
    option: [
        "क्रय",
        "विक्रय",
        "विपणन",
        "उत्पादन"
    ],
    answer: "विपणन"
},

{
    question: "...................... को विपणनकर्ता कहते हैं।",
    option: [
        "संतुष्टि खोजने वाला",
        "संतुष्टि प्रदान करने वाला",
        "वस्तुएँ बेचने वाला",
        "सेवाएँ बेचने वाला"
    ],
    answer: "संतुष्टि प्रदान करने वाला"
},

{
    question: "भारत की उदारीकरण की नीति रही है:",
    option: [
        "सफल",
        "असफल",
        "अंशत: सफल",
        "इनमें से कोई नहीं"
    ],
    answer: "सफल"
},

{
    question: "कर्मचारियों का प्रशिक्षण है",
    option: [
        "आवश्यक",
        "अनावश्यक",
        "अनिवार्य",
        "धन की बर्बादी"
    ],
    answer: "आवश्यक"
},

{
    question: "नियोजन आधारित है…………..",
    option: [
        "भूतकाल पर",
        "आगे आने पर",
        "भविष्य पर",
        "उपर्युक्त सभी"
    ],
    answer: "भविष्य पर"
},

{
    question: "संयुक्त राष्ट्र संघ के किस महासचिव की वायु दुर्घटना में मृत्यु हुई?",
    option: [
        "ट्रागिव लॉर्ड",
        "डैग हमरशोल्ड",
        "कथांट",
        "डॉ. बी.बी. घाली"
    ],
    answer: "डैग हमरशोल्ड"
},

{
    question: "बोनस निर्णय के निर्धारक हैं :",
    option: [
        "लाभों की मात्रा",
        "कोषों में तरलता",
        "कंपनी की आयु",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "भर्ती का कौन-सा स्रोत नये संगठन के लिए उपलब्ध नहीं होता है ?",
    option: [
        "आंतरिक",
        "बाह्य",
        "उपरोक्त दोनों",
        "प्रत्यक्ष भर्ती"
    ],
    answer: "आंतरिक"
},

{
    question: "किस वर्ष में विश्व व्यापार संगठन की स्थापना हुई?",
    option: [
        "1945",
        "1965",
        "1975",
        "1995"
    ],
    answer: "1995"
},

{
    question: "उपभोक्ता विवादों के निपटारे की अवस्था तंत्र है:",
    option: [
        "एक स्तरीय",
        "द्विस्तरीय",
        "त्रि-स्तरीय",
        "कोई नहीं"
    ],
    answer: "द्विस्तरीय"
},

{
    question: "रोजगार अनुबंध में ................. सूचनाएँ दी जाती हैं।",
    option: [
        "जॉब का नाम",
        "उत्तरदायित्व",
        "वेतन",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "निर्देशन के तत्त्व हैं:",
    option: [
        "पर्यवेक्षण",
        "सभी",
        "नेतृत्व",
        "अभिप्रेरण"
    ],
    answer: "सभी"
},

{
    question: "“नियोजन भविष्य को पकड़ने के लिए बनाया गया पिंजरा है।” यह कथन है",
    option: [
        "न्यूमैन",
        "हर्ले",
        "एलन",
        "टेरी"
    ],
    answer: "एलन"
},

{
    question: "प्रबन्धकीय अंकेक्षण में निम्न में से किसकी जाँच की जाती है ?",
    option: [
        "प्रबन्धकीय निर्णयों की क्वालिटी",
        "प्रबंध पद्धतियों की कुशलता",
        "उपरोक्त दोनों",
        "लाभ-हानि खाता"
    ],
    answer: "उपरोक्त दोनों"
},

{
    question: "संयुक्त राष्ट्रसंघ का मुख्यालय कहाँ है?",
    option: [
        "लंदन में",
        "वाशिंगटन में",
        "पेरिस में",
        "न्यूयॉर्क में"
    ],
    answer: "न्यूयॉर्क में"
},

{
    question: "विक्रय संवर्धन के उद्देश्य हैं",
    option: [
        "नई वस्तु से अवगत कराना मात्र",
        "नये ग्राहक आकर्षित करने हेतु मात्र",
        "प्रतिस्पर्धा का सामना करने हेतु मात्र",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "प्राथमिक एवं द्वितीयक बाजार",
    option: [
        "एक-दूसरे से प्रतिस्पर्धा करते हैं",
        "एक दूसरे को सहयोग देते (संपूरक) हैं",
        "स्वतंत्र रूप से कार्य करते हैं",
        "एक-दूसरे को नियंत्रित करते हैं"
    ],
    answer: "एक दूसरे को सहयोग देते (संपूरक) हैं"
},

{
    question: "नेतृत्व का उद्देश्य एक व्यक्ति की ........ प्रतिशत क्षमता का प्रयोग करना है।",
    option: [
        "40",
        "50",
        "80",
        "100"
    ],
    answer: "100"
},

{
    question: "समय के तीन अनुमान निम्न में से किसमें लगाए जाते हैं ?",
    option: [
        "पर्ट",
        "सी० पी० एम०",
        "उपरोक्त दोनों",
        "प्रबंध अंकेक्षण"
    ],
    answer: "पर्ट"
},

{
    question: "निम्न में से विक्रय संवर्धन क्रिया कौन-सी है ?",
    option: [
        "छूट",
        "कटौती",
        "उत्पाद संयोजन",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "परमाणु प्रौद्योगिकी के शान्ति पूर्ण उपयोग और उसकी सुरक्षा से सम्बद्ध संयुक्त राष्ट्र संघ की एजेन्सी का नाम है",
    option: [
        "संयुक्त राष्ट्र संघ निरस्त्रीकरण समिति",
        "अन्तर्राष्ट्रीय आण्विक ऊर्जा एजेन्सी",
        "संयुक्त राष्ट्र संघ अन्तर्राष्ट्रीय सुरक्षा समिति",
        "इनमें से कोई नहीं"
    ],
    answer: "अन्तर्राष्ट्रीय आण्विक ऊर्जा एजेन्सी"
},

{
    question: "समन्वय स्थापित किया जाता है:",
    option: [
        "उच्चतम स्तर के प्रबंध द्वारा",
        "मध्यम स्तरीय प्रबंध के द्वारा",
        "निम्न स्तर के प्रबंध द्वारा",
        "इनमें से किसी के द्वारा नहीं"
    ],
    answer: "उच्चतम स्तर के प्रबंध द्वारा"
},

{
    question: "आंतरिक ट्रेडिंग का लाभ निम्न में से कौन उठाता है ?",
    option: [
        "सभी अंशधारी",
        "सभी ऋणपत्रधारी",
        "कंपनी की गुप्त सूचना रखने वाले",
        "सभी कर्मचारी"
    ],
    answer: "कंपनी की गुप्त सूचना रखने वाले"
},

{
    question: "संयुक्त राष्ट्र पदबन्ध की रचना किसने की?",
    option: [
        "एफ.डी. रूजवेल्ट",
        "जोसेफ स्टालिन",
        "विन्सटन चर्चिल",
        "च्यांग काई शेक"
    ],
    answer: "एफ.डी. रूजवेल्ट"
},

{
    question: "सुरक्षा परिषद के कोई अस्थायी सदस्य का कार्यकाल क्या होता है?",
    option: [
        "1 वर्ष",
        "2 वर्ष",
        "3 वर्ष",
        "4 वर्ष"
    ],
    answer: "2 वर्ष"
},

{
    question: "निम्न में से कौन संयुक्त राष्ट्र संघ की एक आधिकारिक भाषा नहीं है?",
    option: [
        "अरबी",
        "जापानी",
        "स्पेनिश",
        "चीनी"
    ],
    answer: "जापानी"
},

{
    question: "निम्न में से कौन-सा व्यावसायिक पर्यावरण का सर्वश्रेष्ठ द्योतक है।",
    option: [
        "पहचान करना",
        "निष्पादन करना",
        "हो रहे परिवर्तनों का सामना करना",
        "यह सभी"
    ],
    answer: "यह सभी"
},

{
    question: "वैज्ञानिक प्रबंध का मूलाधार………:",
    option: [
        "मानसिक क्रांति",
        "पारिश्रमिक",
        "मानसिक क्रांति नहीं",
        "उपर्युक्त सभी"
    ],
    answer: "मानसिक क्रांति"
},

{
    question: "प्रबंध की सामाजिक उत्तरदायित्व की प्रकृति में लागू होता है :",
    option: [
        "क्रेता की सावधानी का नियम",
        "विक्रेता को सावधानी का नियमन",
        "इन दोनों में से कोई भी नहीं",
        "इनमें से कोई नहीं"
    ],
    answer: "विक्रेता को सावधानी का नियमन"
},

{
    question: "संयुक्त राष्ट्र संघ की स्थापना समय उसके घोषणा-पत्र पर कितने देशों ने हस्ताक्षर किए?",
    option: [
        "50",
        "51",
        "53",
        "54"
    ],
    answer: "51"
},

{
    question: "मुद्रा बाजार में ................. प्रतिभूतियों में व्यवहार किया जाता है।",
    option: [
        "अल्पकालीन",
        "दीर्घकालीन",
        "उपरोक्त दोनों",
        "BSE"
    ],
    answer: "उपरोक्त दोनों"
},

{
    question: "अभिप्रेरणा की विशेषता",
    option: [
        "सकारात्मक",
        "नकारात्मक",
        "सकारात्मक व नकारात्मक",
        "संख्यात्मक"
    ],
    answer: "सकारात्मक व नकारात्मक"
},

{
    question: "संयुक्त पूँजी वाली कंपनी के लिए लाभांश देना है :",
    option: [
        "ऐच्छिक",
        "अनिवार्य",
        "आवश्यक",
        "इनमें कोई नहीं"
    ],
    answer: "ऐच्छिक"
},

{
    question: "निम्नलिखित में से कौन-सी नियोजन की सीमा नहीं है :",
    option: [
        "समय की बर्बादी",
        "नियंत्रण का आधार",
        "कटोरता",
        "अत्यधिक लागत"
    ],
    answer: "नियंत्रण का आधार"
},

{
    question: "स्टाफिंग क्रिया है",
    option: [
        "सेविवर्गीय विभाग का",
        "उत्पादन विभाग का",
        "विपणन विभाग का",
        "वित्तीय विभाग का"
    ],
    answer: "सेविवर्गीय विभाग का"
},

{
    question: "लेबलिंग है :",
    option: [
        "अनिवार्य",
        "आवश्यक",
        "ऐच्छिक",
        "धन की बर्बादी"
    ],
    answer: "आवश्यक"
},

{
    question: "उस औपचारिक संदेशवाहन का क्या नाम है जिसमें अधिकारी एक पहिए के केंद्र (हब) के रूप में काम करता है?",
    option: [
        "श्रृंखला संदेशवाहन",
        "चक्रिय संदेशवाहन",
        "घूमता हुआ संदेशवाहन",
        "मुक्त प्रवाह संदेशवाहन"
    ],
    answer: "चक्रिय संदेशवाहन"
},

{
    question: "................ अनुचित व्यापार व्यवहार का उदाहरण है।",
    option: [
        "जमाखोरी करना",
        "गिफ्ट स्कीम जारी करना",
        "निर्धारित प्रमाणों का पालन न करना",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "भारत में प्रबंध……………..।",
    option: [
        "आवश्यक",
        "अनावश्यक",
        "विलासिता",
        "इनमें से कोई नहीं"
    ],
    answer: "आवश्यक"
},

{
    question: "पैकेज वाली उपभोक्ता उत्पादों पर लेबलिंग अनिवार्य है",
    option: [
        "कुछेक पर",
        "सभी पर",
        "किसी पर नहीं",
        "इनमें कोई नहीं"
    ],
    answer: "कुछेक पर"
},

{
    question: "प्रशिक्षण शब्द को ................. के साथ जोड़ा जाता है।",
    option: [
        "प्रबन्धकों",
        "श्रमिकों",
        "पर्यवेक्षकों",
        "श्रमिकों व पर्यवेक्षकों"
    ],
    answer: "श्रमिकों व पर्यवेक्षकों"
},

{
    question: "उपभोक्ता संरक्षण अधिनियम के अन्तर्गत शिकायतकर्ता से आशय है :",
    option: [
        "उपभोक्ता",
        "राज्य सरकार",
        "केंद्रीय सरकार",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "वैश्वीकरण का अर्थ है…….",
    option: [
        "विश्व की विभिन्न अर्थव्यवस्थाओं का एकीकरण",
        "सार्वजनिक क्षेत्र में विनियोग",
        "निजी क्षेत्र में निवेश",
        "उपरोक्त सभी"
    ],
    answer: "विश्व की विभिन्न अर्थव्यवस्थाओं का एकीकरण"
},

{
    question: "किस देश ने सुरक्षा परिषद् में निषेधाधिकार का सर्वाधिक बार प्रयोग किया?",
    option: [
        "यू.एस.ए.",
        "फ्रांस",
        "रूस",
        "चीन"
    ],
    answer: "रूस"
},

{
    question: "निम्न में कौन विक्रय संवर्धन उपकरण नहीं है?",
    option: [
        "नमूने",
        "पैक के अन्दर इनाम",
        "कूपन",
        "वारण्टी"
    ],
    answer: "वारण्टी"
},

{
    question: "उदारीकरण का अर्थ है…………",
    option: [
        "विश्व की विभिन्न अर्थव्यवस्थाओं का एकीकरण",
        "लाइसेंस की आवश्यकताओं एवं अनियंत्रणों को आसान करना",
        "सार्वजनिक क्षेत्र में विनिवेश",
        "इनमें से कोई नहीं"
    ],
    answer: "लाइसेंस की आवश्यकताओं एवं अनियंत्रणों को आसान करना"
},

{
    question: "विश्व में सबसे पहले स्कन्ध विपणि की स्थापना हुई थी",
    option: [
        "दिल्ली",
        "लन्दन",
        "अमेरिका",
        "जापान"
    ],
    answer: "अमेरिका"
},

{
    question: "उच्चस्तरीय कार्यशील पूँजी का सामान्यतः परिणाम होता है:",
    option: [
        "उच्चतम चालू अनुपात, उच्चतम जोखिम तथा ऊँचा लाभ",
        "निम्नतम चालू अनुपात, उच्चतम जोखिम तथा लाभ",
        "उच्चतम समता, निम्नतम जोखिम तथा निम्नतम लाभ",
        "निम्नतम समता, निम्नतम जोखिम तथा उच्चतम लाभ"
    ],
    answer: "उच्चतम चालू अनुपात, उच्चतम जोखिम तथा ऊँचा लाभ"
},

{
    question: "ग्राहक बाजार का .................. होता है।",
    option: [
        "राजा",
        "नौकर",
        "हमदर्द",
        "विक्रेता"
    ],
    answer: "राजा"
},
];

// English Questions
const businessStudiesEnglish = [
{
    question: "management art is:",
    option: [
        "self work doing of",
        "others from work taking of",
        "self work doing and others from work taking both of",
        "none of these / "
    ],
    answer: "self work doing and others from work taking both of"
},

{
    question: "marketing concept is-",
    option: [
        "production-oriented",
        "sales-oriented",
        "customer-oriented",
        "all of these"
    ],
    answer: "all of these"
},

{
    question: "training under employees to ............... area/kssetroN in nipunn bnaayaa goes hai / ",
    option: [
        "one particular",
        "two",
        "three",
        "all"
    ],
    answer: "one particular"
},

{
    question: "among the following who/which-saa equity on trade of prkaar is ?",
    option: [
        "alp-equity on trade",
        "high equity on trade",
        "A and B both",
        "none of these"
    ],
    answer: "A and B both"
},

{
    question: "United Nations of how many organs are?",
    option: [
        "2",
        "4",
        "6",
        "8"
    ],
    answer: "6"
},

{
    question: "master budget ...............for bnaayaa goes hai / ",
    option: [
        "one department",
        "two departments",
        "cash department",
        "all departments"
    ],
    answer: "all departments"
},

{
    question: "scientific management of father who/which were:",
    option: [
        "H.es. Person",
        "Diemer",
        "F. W. Taylor",
        "Charles Babbage"
    ],
    answer: "F. W. Taylor"
},

{
    question: "staffing is :",
    option: [
        "planning do",
        "control do",
        "directing do",
        "persons to work on lgaanaa"
    ],
    answer: "persons to work on lgaanaa"
},

{
    question: "Security Council in total temporary members of number how much is?",
    option: [
        "10",
        "6",
        "7",
        "14"
    ],
    answer: "10"
},

{
    question: "district forum disputes of settlement tax can is",
    option: [
        "₹ 5 lakh up to",
        "₹ 10 lakh up to",
        "₹ 15 lakh up to",
        "₹ 20 lakh up to"
    ],
    answer: "₹ 20 lakh up to"
},

{
    question: "management of nature is:",
    option: [
        "innate talent of ruup in",
        "acquired talent of ruup in",
        "innate talent and acquired talent both of ruup in",
        "any not"
    ],
    answer: "innate talent and acquired talent both of ruup in"
},

{
    question: "manager + leadership ability = ............ / ",
    option: [
        "haani",
        "success",
        "failure",
        "zero"
    ],
    answer: "success"
},

{
    question: "management audit kiske performance on monitoring rkhne of one tkniik is :",
    option: [
        "company",
        "company of management",
        "shareholder",
        "customer"
    ],
    answer: "company of management"
},

{
    question: "among the following marketing mix of element who/which-saa is ?",
    option: [
        "product",
        "value",
        "promotion",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "capital market deals does is",
    option: [
        "long-term funds",
        "medium-term funds",
        "short-term funds",
        "none of these"
    ],
    answer: "long-term funds"
},

{
    question: "top-level management planning on their time of part expenditure does is:",
    option: [
        "35%",
        "50%",
        "75%",
        "100%"
    ],
    answer: "35%"
},

{
    question: "League of Nations of establishment when occurred?",
    option: [
        "10 jnvrii, 1920",
        "10 jnvrii, 1919",
        "24 akttuubr, 1945",
        "15 agst, 1948"
    ],
    answer: "10 jnvrii, 1920"
},

{
    question: "year 2004 in India in stock markets of number was :",
    option: [
        "20",
        "21",
        "23",
        "24"
    ],
    answer: "24"
},

{
    question: "social approach of anusaar entrepreneurship is—",
    option: [
        "emotionality of prkriyaa",
        "role performance process",
        "economic change of prkriyaa",
        "all of these"
    ],
    answer: "role performance process"
},

{
    question: "one person to among the following who/which-sii need motivated does haiN / ",
    option: [
        "achievement",
        "power",
        "affiliation and independence",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "staffing responsibility is :",
    option: [
        "low management",
        "middle management",
        "high management",
        "these all of"
    ],
    answer: "these all of"
},

{
    question: "SEBI of head office is :",
    option: [
        "Delhi",
        "Mumbai",
        "Kolkata",
        "Chennai"
    ],
    answer: "Mumbai"
},

{
    question: "Abraham Maslow of hierarchy of needs in most high need str is :",
    option: [
        "Security need",
        "sNbNdh need",
        "self-actualization need",
        "esteem need"
    ],
    answer: "self-actualization need"
},

{
    question: "staffing of work is",
    option: [
        "recruitment do",
        "training provides do",
        "work on appointment do",
        "ye all work smpnn do"
    ],
    answer: "ye all work smpnn do"
},

{
    question: "business environment……….to mdd not does hai / ",
    option: [
        "barrier",
        "opportunities",
        "resources",
        "certainty"
    ],
    answer: "certainty"
},

{
    question: "fixed capital of need is is",
    option: [
        "daily expenses of bhugtaan doing for",
        "land purchasing for",
        "stock purchasing for",
        "lendaaroN of bhugtaan doing for"
    ],
    answer: "land purchasing for"
},

{
    question: "one entrepreneur to of condition in capable entrepreneur khaa goes is",
    option: [
        "minimum ability and minimum desire",
        "minimum ability and maximum desire",
        "maximum ability and minimum desire",
        "maximum ability and maximum desire"
    ],
    answer: "maximum ability and minimum desire"
},

{
    question: "India in stock markets of future is :",
    option: [
        "bright",
        "darkness in",
        "normal",
        "any future not"
    ],
    answer: "bright"
},

{
    question: "nirdeshn management of ............ phluu not hai / ",
    option: [
        "practical",
        "theoretical",
        "antr-personal",
        "positive"
    ],
    answer: "theoretical"
},

{
    question: "United Nations of first Asian mhaasciv who/which were?",
    option: [
        "Ban of Moon",
        "U Thant",
        "Kofi Annan",
        "Boutros Ghali"
    ],
    answer: "U Thant"
},

{
    question: "New Economic Policy of major organs are :",
    option: [
        "liberalization",
        "globalization",
        "privatization",
        "ye all"
    ],
    answer: "ye all"
},

{
    question: "Human Resource Management in among the following what smmilit done goes is ?",
    option: [
        "recruitment",
        "specialist services",
        "complaint redressal",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "entrepreneurship of available/obstacles foster do are",
    option: [
        "new creation",
        "profitability",
        "anishcittaa",
        "none of these"
    ],
    answer: "new creation"
},

{
    question: "United Nations of most bdd'aa organs who/which is?",
    option: [
        "Security prissd",
        "General Assembly",
        "Secretariat",
        "International Court of Justice"
    ],
    answer: "General Assembly"
},

{
    question: "Narayan Murthy by promoted/promoter software company is :",
    option: [
        "Wipro",
        "Infosys",
        "Satyam",
        "one sii0 el0"
    ],
    answer: "Infosys"
},

{
    question: "among the following whom consumer not considered jaa can ?",
    option: [
        "that person which again selling for goods khriidtaa is",
        "that person which without consideration of goods received does is",
        "that person which buyer of consent of without goods use does",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "budgetary control for preparation necessary are",
    option: [
        "training time-saarnnii",
        "budget",
        "network diagram",
        "responsibility"
    ],
    answer: "budget"
},

{
    question: "NSE of index to .................. khte are",
    option: [
        "INDEX",
        "NIFTY",
        "SENSEX",
        "LISTING"
    ],
    answer: "NIFTY"
},

{
    question: "scientific management in production is is :",
    option: [
        "maximum",
        "minimum",
        "normal",
        "average"
    ],
    answer: "maximum"
},

{
    question: "entrepreneurship of result to among the following what khaa goes is?",
    option: [
        "entrepreneur",
        "entrepreneurship",
        "enterprise",
        "entrepreneur and entrepreneurial"
    ],
    answer: "enterprise"
},

{
    question: "world peace maintaining of responsibility which on is?",
    option: [
        "General Assembly",
        "Security prissd",
        "economic and social prissd",
        "mhaasciv"
    ],
    answer: "Security prissd"
},

{
    question: ".................communication of medium of udaahrnn hai / ",
    option: [
        "letter",
        "telephone",
        "ii-mel",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "State Commission disputes of settlement tax can is",
    option: [
        "₹ 5 lakh up to",
        "₹ 10 lakh up to",
        "₹ 20 lakh up to",
        "₹ 20 lakh from adhik"
    ],
    answer: "₹ 20 lakh from adhik"
},

{
    question: "Sensex .................. companies on aadhaarit hai / ",
    option: [
        "30",
        "50",
        "100",
        "500"
    ],
    answer: "30"
},

{
    question: "supervisor employees of is",
    option: [
        "friend",
        "guide",
        "philosopher",
        "all of these"
    ],
    answer: "all of these"
},

{
    question: "fixed capital in investment smbndhii nirnny khlaataa is :",
    option: [
        "fixed capital nirnny",
        "working capital nirnny",
        "both of the above",
        "any not"
    ],
    answer: "fixed capital nirnny"
},

{
    question: "primary and secondary markets :",
    option: [
        "one-duusre from competition do are",
        "one-duusre to cooperation dete (complementary) are",
        "independent ruup from work do are",
        "one-duusre to niyNtrit do are"
    ],
    answer: "one-duusre to cooperation dete (complementary) are"
},

{
    question: "en. es. ii. of futures trade of start which year in occurred ?",
    option: [
        "1999",
        "2000",
        "2001",
        "2002"
    ],
    answer: "2000"
},

{
    question: "effective control is",
    option: [
        "stable",
        "set",
        "dynamic",
        "all of these"
    ],
    answer: "dynamic"
},

{
    question: "staffing is :",
    option: [
        "organization of part",
        "employee management work",
        "management of work",
        "ye all"
    ],
    answer: "ye all"
},

{
    question: "entrepreneur of work are",
    option: [
        "business vicaar of klpnaap",
        "priyojnaa smbhaavytaa adhyyn",
        "enterprise of establishment do",
        "all of these"
    ],
    answer: "all of these"
},

{
    question: "NSE on listed hone for minimum puuNjii of limit hai / ",
    option: [
        "₹3 crore and adhik",
        "₹30 lakh and adhik",
        "₹10 crore and adhik",
        "₹10 lakh and adhik"
    ],
    answer: "₹3 crore and adhik"
},

{
    question: "International Labour Organization of headquarters located is-",
    option: [
        "Geneva in",
        "Paris in",
        "Delhi in",
        "lNdn in"
    ],
    answer: "Geneva in"
},

{
    question: "among the following marketing of work who/which-saa is ?",
    option: [
        "promotion",
        "physical distribution",
        "transportation",
        "all of these"
    ],
    answer: "promotion"
},

{
    question: "Maslow’s hierarchy of needs theory and by governed is is ki :",
    option: [
        "log universal ruup in needs by prerit are are",
        "log needs by social ruup in prerit are are",
        "log political taur on needs from prerit are are",
        "none of the above"
    ],
    answer: "log universal ruup in needs by prerit are are"
},

{
    question: "National Commission consumer disputes of settlement tax can is",
    option: [
        "₹5 lakh up to",
        "₹ 10 lakh up to",
        "₹ 1 crore up to",
        "₹ 10 crore from adhik"
    ],
    answer: "₹ 10 crore from adhik"
},

{
    question: "United Nations of puurv mhaasciv Ban of-Moon which desh of are?",
    option: [
        "America",
        "britten",
        "China",
        "South Korea"
    ],
    answer: "South Korea"
},

{
    question: "hdd'taal, vicln of .................. from sNbNdhit kaarnn hai / ",
    option: [
        "human",
        "anishcit events",
        "various interruptions",
        "wrong standards"
    ],
    answer: "anishcit events"
},

{
    question: "baijnyaanik management when praarmbh huaa?",
    option: [
        "1913",
        "1832",
        "1903",
        "1920"
    ],
    answer: "1913"
},

{
    question: "value of the company (Value of Company) on whose prbhaav pdd'taa is ?",
    option: [
        "cost of capital",
        "market value of shares",
        "both of the above",
        "any not"
    ],
    answer: "both of the above"
},

{
    question: "mental revolution muulaadhaar hai / ",
    option: [
        "scientific management",
        "sNyojn",
        "vivekiikrnn",
        "peshaa"
    ],
    answer: "scientific management"
},

{
    question: "pepr is",
    option: [
        "punrkhriid smjhautaa (vilekh)",
        "rilaayns pettroliym",
        "riidd and proses (pddh'o and prkrm kro)",
        "upryukt some also not"
    ],
    answer: "punrkhriid smjhautaa (vilekh)"
},

{
    question: "entrepreneur utthaataa is :",
    option: [
        "socii-smjhii risk",
        "high risk",
        "low risk",
        "normal and tyaag of gii risk"
    ],
    answer: "normal and tyaag of gii risk"
},

{
    question: "work doing of ability among the following kisse paidaa is is?",
    option: [
        "education",
        "training",
        "education and training",
        "abhiprernnaa"
    ],
    answer: "education and training"
},

{
    question: "world of deshoN of biic trade sNgtthnoN for who/which-saa International organization is?",
    option: [
        "World Trade Organization",
        "International Monetary Fund",
        "World Bank",
        "all of these"
    ],
    answer: "World Trade Organization"
},

{
    question: "Entrepreneurship Development Programme of aalocnaatmk muulyaaNkn bindu are :",
    option: [
        "organizational niitiyaaN",
        "appropriate selection prkriyaa of absence",
        "low category of tkniikii and business shikssaa and training",
        "appropriate all"
    ],
    answer: "appropriate all"
},

{
    question: "United Nations of how many organs are?",
    option: [
        "two",
        "four",
        "six",
        "eight"
    ],
    answer: "six"
},

{
    question: "prmpraagt management in shrmikoN to mjduurii dii goes thii / ",
    option: [
        "km",
        "adhik",
        "maximum",
        "normal"
    ],
    answer: "km"
},

{
    question: "which desh by Security Council in veto power of srvaadhik baar use done?",
    option: [
        "U.es.e.",
        "France",
        "ruus",
        "China"
    ],
    answer: "ruus"
},

{
    question: "working capital kyoN necessary is is ?",
    option: [
        "land purchase doing for",
        "bhvn purchase doing for",
        "daily expenses of bhugtaan for",
        "mshiin purchase doing for"
    ],
    answer: "daily expenses of bhugtaan for"
},

{
    question: "Universal Declaration of Human Rights when of gii?",
    option: [
        "1945 ii. in",
        "1946 ii. in",
        "1947 ii. in",
        "1948 ii. in"
    ],
    answer: "1948 ii. in"
},

{
    question: "effective communication in barrier is :",
    option: [
        "language",
        "distance",
        "personal differences",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "any non-governmental organization to ad hoc recognition who/which de can is?",
    option: [
        "mhaasciv",
        "General Assembly of adhykss",
        "Security Council of adhykss",
        "International Court of Justice of adhykss"
    ],
    answer: "mhaasciv"
},

{
    question: "new product from consumers to pricit kraane in among the following kiskii major role rhtii is ?",
    option: [
        "publicity",
        "personal selling",
        "sales promotion",
        "advertising"
    ],
    answer: "personal selling"
},

{
    question: "......................... vicaardhaaraa consumer welfare on jor detii hai / ",
    option: [
        "production",
        "product",
        "marketing",
        "social"
    ],
    answer: "social"
},

{
    question: "Entrepreneurship Development Programme provides does is :",
    option: [
        "unemployment",
        "employment",
        "dishonesty",
        "corruption"
    ],
    answer: "employment"
},

{
    question: "for advertising .................. of to be necessary is",
    option: [
        "expenditure",
        "effort",
        "(A) and (B) both",
        "television"
    ],
    answer: "(A) and (B) both"
},

{
    question: "World Bank of establishment when occurred?",
    option: [
        "1945 ii. in",
        "1947 ii. in",
        "1948 ii. in",
        "1944 ii. in"
    ],
    answer: "1944 ii. in"
},

{
    question: "communication process in letter of sent jaanaa ............ of udaahrnn hai / ",
    option: [
        "communication",
        "message",
        "sNdeshbddhtaa",
        "noise"
    ],
    answer: "noise"
},

{
    question: "among the following which leadership style in high striiy abhiprernnaa of profit miltaa is?",
    option: [
        "autocratic leadership style",
        "democratic leadership style",
        "free-rein leadership style",
        "among these from any in not"
    ],
    answer: "free-rein leadership style"
},

{
    question: "U.en. viimen of establishment occurred is-",
    option: [
        "2009 ii. in",
        "2010 ii. in",
        "2011 ii. in",
        "2012 ii. in"
    ],
    answer: "2010 ii. in"
},

{
    question: "communication process in .......... of exchange is hai / ",
    option: [
        "ideas",
        "orders",
        "emotions",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "working capital of nirdhaark is:",
    option: [
        "sNsthaa of aakaar",
        "nirmaann prkriyaa of avdhi",
        "kcce maal of uplbdhtaa",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "India of progress of dhiimii gti of major kaarnn……….of absence hai / ",
    option: [
        "efficient management",
        "human power",
        "resources",
        "ye all"
    ],
    answer: "efficient management"
},

{
    question: "'jldbaajii in purchase n kreN' this consumers of one mhtvpuurnn ................. hai / ",
    option: [
        "responsibility",
        "adhikaar",
        "adhiniym",
        "all of the above"
    ],
    answer: "responsibility"
},

{
    question: "District Forum in ₹ up to of value of disputes from sNbNdhit shikaaytoN of smaadhaan done goes hai / ",
    option: [
        "₹ 10 lakh",
        "₹ 30 lakh",
        "₹ 50 lakh",
        "₹ 20 lakh"
    ],
    answer: "₹ 20 lakh"
},

{
    question: ".................. capital market of organs hai / ",
    option: [
        "demand currency",
        "primary market",
        "secondary market",
        "primary and secondary markets"
    ],
    answer: "primary and secondary markets"
},

{
    question: "potential consumer up to personal reach established of goes is ?",
    option: [
        "advertising by",
        "sales promotion measures by",
        "personal selling by",
        "none of these"
    ],
    answer: "personal selling by"
},

{
    question: "for advertising ................. of to be necessary hai / ",
    option: [
        "expenditure",
        "effort",
        "both of the above",
        "television"
    ],
    answer: "both of the above"
},

{
    question: "that smpressnn tNtr jismeN all adhiinsth which supervisor by sNvaad do are:",
    option: [
        "single system / chain",
        "inverted",
        "wheel",
        "any also direction in"
    ],
    answer: "wheel"
},

{
    question: "nirdeshn management process of ............ stage hai / ",
    option: [
        "first",
        "second",
        "third",
        "fourth"
    ],
    answer: "fourth"
},

{
    question: "kiskii recommendation on General Assembly appointment of the Secretary-General does is?",
    option: [
        "Security Council",
        "Economic and Social Council",
        "International Court of Justice",
        "Trusteeship Council"
    ],
    answer: "Security Council"
},

{
    question: "management of employees to srvaadhik prernnaa dene vaalaa work is:",
    option: [
        "staffing",
        "motivation",
        "organization",
        "control"
    ],
    answer: "motivation"
},

{
    question: "one entrepreneur ................... motivated is hai / ",
    option: [
        "power received hone from",
        "objective to complete are seeing",
        "adhik salary received krke",
        "adhik profit received krke"
    ],
    answer: "objective to complete are seeing"
},

{
    question: "economics in among the following who/which-saa entrepreneur of work not is?",
    option: [
        "risk-taking",
        "provision of capital and organization of production",
        "innovation",
        "day-to-day business of operation"
    ],
    answer: "day-to-day business of operation"
},

{
    question: "marketing of profit is-",
    option: [
        "consumers to",
        "businessmen to",
        "manufacturers to",
        "all of these"
    ],
    answer: "all of these"
},

{
    question: "among the following who/which-saa desh member of SAARC not is?",
    option: [
        "India",
        "Pakistan",
        "Nepal",
        "Japan"
    ],
    answer: "Japan"
},

{
    question: "among the following whom current smpttiyoN in shaamil not done goes is?",
    option: [
        "nkd raashi",
        "stock-dh",
        "dendaar",
        "furniture"
    ],
    answer: "furniture"
},

{
    question: "employee development in smmilit is :",
    option: [
        "promotion",
        "transfer",
        "training",
        "ye all"
    ],
    answer: "ye all"
},

{
    question: "................ advertising of profit hai / ",
    option: [
        "adhik reach",
        "km shktishaalii",
        "alokpriytaa",
        "prtipusstti of absence"
    ],
    answer: "adhik reach"
},

{
    question: ".................... financial nirnny of udaahrnn hai / ",
    option: [
        "investment nirnny",
        "financing decisions",
        "dividend nirnny",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "training, work on kendrit hai /  development, kairiyr kendrit hai /  training one vistRt prkriyaa hai /  development siimit prkriyaa hai / ",
    option: [
        "true is",
        "false is",
        "statement (1) true is and statement (II) false is",
        "statement (I) false is and statement (II) true is"
    ],
    answer: "statement (1) true is and statement (II) false is"
},

{
    question: "supervision management of ............ str hai / ",
    option: [
        "high",
        "middle",
        "low",
        "all of these"
    ],
    answer: "low"
},

{
    question: "vicln among the following which prkaar of ho can is ?",
    option: [
        "negative",
        "dhnaatmk",
        "zero",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "financial leverage is favorable is ydi :",
    option: [
        "cost of debt from return on investment km is hai / ",
        "return on investment, cost of debt from uuNcii is",
        "debt aasaanii from available hai / ",
        "ydi vidymaan financial funds of quantity km is"
    ],
    answer: "return on investment, cost of debt from uuNcii is"
},

{
    question: "consumer organization product samples iktttthe krke ................. do haiN / ",
    option: [
        "unheN becaa",
        "unkaa niriikssnn",
        "vikretaaoN from rijhaane taking of work",
        "griiboN in baaNttaa"
    ],
    answer: "unkaa niriikssnn"
},

{
    question: "veto provision of phaislaa which smmeln in done gyaa?",
    option: [
        "ddmbaarttn oks",
        "yaalttaa",
        "sain phraaNsisko",
        "London"
    ],
    answer: "yaalttaa"
},

{
    question: "prbNdhkiiy control done goes is :",
    option: [
        "low prbNdhkoN by",
        "middle striiy prbNdhkoN by",
        "highest striiy prbNdhkoN by",
        "all striiy prbNdhkoN by"
    ],
    answer: "all striiy prbNdhkoN by"
},

{
    question: "mental work from ………is :",
    option: [
        "production",
        "management",
        "marketing",
        "none of these"
    ],
    answer: "production"
},

{
    question: "one organizational of control do work is:",
    option: [
        "aage dekhnaa",
        "piiche dekhnaa",
        "aage, with only with piiche dekhnaa",
        "appropriate all"
    ],
    answer: "aage, with only with piiche dekhnaa"
},

{
    question: "among the following whichunder consumer of satisfaction to mhtv diyaa goes is?",
    option: [
        "marketing",
        "sales and production",
        "production",
        "sales"
    ],
    answer: "sales and production"
},

{
    question: "prti ikaaii cost ₹ 100 to be ................ prmaann of udaahrnn hai / ",
    option: [
        "sNkhyaatmk",
        "gunnaatmk",
        "both of the above",
        "none of these"
    ],
    answer: "sNkhyaatmk"
},

{
    question: "Schengen countries in shaamil are",
    option: [
        "European desh",
        "Asian desh",
        "African desh",
        "none of these"
    ],
    answer: "European desh"
},

{
    question: "pd-bhinntaa which prkaar of communication barrier of under aatii is?",
    option: [
        "semantic barrier",
        "organizational barrier",
        "semantic barrier",
        "psychological barrier"
    ],
    answer: "organizational barrier"
},

{
    question: "control management of phluu is:",
    option: [
        "saiddhaaNtik",
        "practical",
        "mental",
        "physical"
    ],
    answer: "practical"
},

{
    question: "General Assembly of total members of number is-",
    option: [
        "193",
        "192",
        "196",
        "197"
    ],
    answer: "193"
},

{
    question: "among the following who/which-saa statement asNgt is?",
    option: [
        "management uddeshypuurnn",
        "vishisstt prkriyaa",
        "universal",
        "management ownership from separate not"
    ],
    answer: "management ownership from separate not"
},

{
    question: "advertising of most expensive saadhn is",
    option: [
        "advertising",
        "personal selling",
        "sales promotion",
        "public relations"
    ],
    answer: "personal selling"
},

{
    question: "among the following who/which G-8 of member not is?",
    option: [
        "Japan",
        "knaaddaa",
        "Italy",
        "China"
    ],
    answer: "China"
},

{
    question: "working capital of srot is :",
    option: [
        "dendaar",
        "baiNk adhivikrss",
        "cash sales",
        "all of these"
    ],
    answer: "all of these"
},

{
    question: "audyogik utpaadoN of kretaaoN of number km hone of kaarnn who/which-from vitrnn channel to apnaayaa goes hai / ",
    option: [
        "long",
        "short",
        "air",
        "rail"
    ],
    answer: "short"
},

{
    question: "control management of who/which-saa work is ?",
    option: [
        "first",
        "second",
        "third",
        "final"
    ],
    answer: "final"
},

{
    question: "entrepreneurial traits kisse related are?",
    option: [
        "work sRjk deals",
        "profit creation deals",
        "risk bearing deals",
        "none of these"
    ],
    answer: "risk bearing deals"
},

{
    question: "control of nature which prkaar of is ?",
    option: [
        "positive phluu",
        "negative phluu",
        "both of the above",
        "above any not"
    ],
    answer: "both of the above"
},

{
    question: "expenditure on staffing done gyaa money is",
    option: [
        "money of waste",
        "necessary",
        "allocation",
        "none of these"
    ],
    answer: "allocation"
},

{
    question: "employees of selection is is:",
    option: [
        "low category of adhikaariyoN of",
        "middle category of adhikaariyoN of",
        "highest category of adhikaariyoN of",
        "ye all"
    ],
    answer: "ye all"
},

{
    question: "business enterprise in control of need is is :",
    option: [
        "business of establishment at the time of",
        "business of operation at the time of",
        "year of ant in",
        "continuous"
    ],
    answer: "continuous"
},

{
    question: "any also desh of development in most adhik need is:",
    option: [
        "physical resources",
        "economic resources",
        "maanviiy resources",
        "efficient management"
    ],
    answer: "efficient management"
},

{
    question: "World Trade Organization nimnaaNkit in which organization of successor is?",
    option: [
        "General Agreement oNn Trade and Tariffs",
        "Nations Union of Council",
        "world health organization",
        "United Nations development kaarykrm"
    ],
    answer: "General Agreement oNn Trade and Tariffs"
},

{
    question: "control process of first stage ................ hai / ",
    option: [
        "corrective action do",
        "deviations of analysis do",
        "progress standards set do",
        "actual progress of measurement"
    ],
    answer: "actual progress of measurement"
},

{
    question: "financial planning of abhipraay financial kriyaaoN of ............... doing from hai / ",
    option: [
        "determination",
        "puurv-determination",
        "after in determination",
        "determination not"
    ],
    answer: "puurv-determination"
},

{
    question: "National Commission consumer disputes of settlement tax can is",
    option: [
        "₹ 5 lakh up to",
        "₹ 10 lakh up to",
        "₹ 20 lakh up to",
        "₹ 1 crore from adhik"
    ],
    answer: "₹ 1 crore from adhik"
},

{
    question: "Entrepreneurship Development Programme provides does",
    option: [
        "self-employment",
        "entrepreneur skills in increase",
        "education and training",
        "all of these"
    ],
    answer: "all of these"
},

{
    question: "shuruu in shrmikoN by scientific management of…………..done goes is :",
    option: [
        "pkss",
        "virodh",
        "both",
        "shaayk"
    ],
    answer: "virodh"
},

{
    question: "patronizing high developed kmpniyaaN psNd does are:",
    option: [
        "km dividend giving",
        "adhik dividend giving",
        "dividend on development of any prbhaav not is is",
        "none of these"
    ],
    answer: "km dividend giving"
},

{
    question: "supervision management of str is",
    option: [
        "high",
        "middle",
        "low",
        "all of these"
    ],
    answer: "low"
},

{
    question: "physical examination barrier paar tax taking after cynit person to among the following who/which-saa letter diyaa goes is ?",
    option: [
        "regret letter",
        "appointment letter",
        "both of the above",
        "none of these"
    ],
    answer: "appointment letter"
},

{
    question: "New Economic Policy ghossit occurred was :",
    option: [
        "July 1990",
        "July 1991",
        "July 1992",
        "July 2001"
    ],
    answer: "July 1991"
},

{
    question: "horizontal communication in suggestions of flow is is :",
    option: [
        "upward of or",
        "downward of or",
        "horizontal level on",
        "all of these"
    ],
    answer: "horizontal level on"
},

{
    question: "India in Entrepreneurship Development Programme is:",
    option: [
        "necessary",
        "unnecessary",
        "time of waste",
        "money of waste"
    ],
    answer: "necessary"
},

{
    question: "United Nations of total members of number is-",
    option: [
        "192",
        "193",
        "194",
        "195"
    ],
    answer: "193"
},

{
    question: "consumers of group of abhipraay ......................... from hai / ",
    option: [
        "buyer",
        "seller",
        "product",
        "market"
    ],
    answer: "buyer"
},

{
    question: "................ three-tier judicial system of organs not is",
    option: [
        "tehsil phorm",
        "District Forum",
        "State Commission",
        "National Commission"
    ],
    answer: "tehsil phorm"
},

{
    question: "top-level managers to among the following whose training diyaa goes hai / ",
    option: [
        "shrm smbndhii",
        "financial management",
        "production management",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "consumer protection of sNbNdh in 'your rights' kaarykrm ................. broadcast does hai / ",
    option: [
        "All India Radio",
        "Doordarshan",
        "advertising agency",
        "all of the above"
    ],
    answer: "All India Radio"
},

{
    question: "planning manager of work is :",
    option: [
        "primary",
        "secondary",
        "tRtiiyk",
        "all of these"
    ],
    answer: "primary"
},

{
    question: "entrepreneurship leadership provides not does-",
    option: [
        "partnership firm in",
        "ne corporate division in",
        "new grant udym in",
        "none of these"
    ],
    answer: "partnership firm in"
},

{
    question: "among the following who/which-saa negative abhiprernnaa of udaahrnn is?",
    option: [
        "promotion",
        "dismissal",
        "removal",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "high-growth kNpniyaaN ............... psNd does are :",
    option: [
        "km dividend giving",
        "adhik dividend giving",
        "dividend on development of any prbhaav not is is",
        "none of these"
    ],
    answer: "km dividend giving"
},

{
    question: "ability and desire of maximum quantity .................... drshaatii hai / ",
    option: [
        "ready entrepreneur",
        "willing entrepreneur",
        "capable entrepreneur",
        "entrepreneur ready not"
    ],
    answer: "ready entrepreneur"
},

{
    question: "power supply interruption vicln ................. of from sNbNdhit kaarnn hai /  events",
    option: [
        "human",
        "anishcit",
        "various interruptions",
        "wrong standards"
    ],
    answer: "various interruptions"
},

{
    question: "customer market of ................ is hai / ",
    option: [
        "king",
        "naukr",
        "emperor",
        "seller"
    ],
    answer: "king"
},

{
    question: "one efficient control system whom mdd does is ?",
    option: [
        "? of receipt",
        "employees of mnobl in increase",
        "means of efficient use",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "among the following who/which Security Council of fixed member not is?",
    option: [
        "France",
        "Britain",
        "Italy",
        "China"
    ],
    answer: "Italy"
},

{
    question: "fixed assets of finance vyvsthaa honii caahie :",
    option: [
        "long-term liabilities from",
        "short-term liabilities from",
        "long-term and short-term liabilities of mix from",
        "none of these"
    ],
    answer: "long-term liabilities from"
},

{
    question: "nirdeshn of under ............ to smmilit done goes hai / ",
    option: [
        "planning",
        "organization",
        "supervision",
        "staffing"
    ],
    answer: "supervision"
},

{
    question: "consumer dispute redressal agency is",
    option: [
        "district forum",
        "State Commission",
        "National Commission",
        "all of these"
    ],
    answer: "all of these"
},

{
    question: "financing decisions ............... from sNbNdhit are",
    option: [
        "agency structure",
        "financial structure",
        "agency formation",
        "financial planning"
    ],
    answer: "financial planning"
},

{
    question: "......................... activity goods of after production praarNbh is hai / ",
    option: [
        "purchase",
        "selling",
        "marketing",
        "advertising"
    ],
    answer: "selling"
},

{
    question: "scientific management in analysis is:",
    option: [
        "25%",
        "50%",
        "75%",
        "none of these"
    ],
    answer: "75%"
},

{
    question: "most adhik vyaapk area is :",
    option: [
        "brand",
        "labeling",
        "packaging",
        "trade maark"
    ],
    answer: "packaging"
},

{
    question: "World Trade Organization nimnaaNkit in which organization of successor is?",
    option: [
        "General Agreement oNn Trade and Tariffs",
        "Nations Union of Council",
        "world health organization",
        "United Nations development kaarykrm"
    ],
    answer: "General Agreement oNn Trade and Tariffs"
},

{
    question: "for business marketing hai / ",
    option: [
        "mandatory",
        "necessary",
        "unnecessary",
        "vilaasitaa"
    ],
    answer: "mandatory"
},

{
    question: "employee to some time for niyoktaa from duur doing to what khte are ?",
    option: [
        "demotion",
        "promotion",
        "sthaanaaNtrnn",
        "temporary separation"
    ],
    answer: "temporary separation"
},

{
    question: "Nepal in monarchy when abolished done gyaa?",
    option: [
        "2006 ii. in",
        "2008 ii. in",
        "2009 ii. in",
        "2010 ii. in"
    ],
    answer: "2008 ii. in"
},

{
    question: "grapevine network in which form in their caahne vaaloN to unse favor (Favour) received doing of objective from communication done goes is?",
    option: [
        "cluster",
        "?",
        "gossip chain",
        "single riiti"
    ],
    answer: "cluster"
},

{
    question: "stock markets for SEBI of services are :",
    option: [
        "optional",
        "necessary",
        "unnecessary",
        "mandatory"
    ],
    answer: "mandatory"
},

{
    question: "grapevine communication is is :",
    option: [
        "informal",
        "formal",
        "likhit",
        "none of these"
    ],
    answer: "informal"
},

{
    question: "bhaartiiy investment center of establishment of gyii was :",
    option: [
        "India srkaar by",
        "Madhya Pradesh srkaar by",
        "Maharashtra srkaar by",
        "Gujarat srkaar by"
    ],
    answer: "Madhya Pradesh srkaar by"
},

{
    question: "per share highest dividend sNbNdhit is",
    option: [
        "uuNcii income, uuNcaa cash flow, anupyukt income and highest growth opportunities",
        "uuNcii income, uuNcaa cash flow, stable income and uuNce growth opportunities",
        "uuNcii income, uuNcaa cash flow, stable income and lowest growth opportunities",
        "uuNcii income, low cash flow, stable income and lowest growth opportunities"
    ],
    answer: "uuNcii income, uuNcaa cash flow, stable income and lowest growth opportunities"
},

{
    question: "bhaartiiy entrepreneurship development sNsthaan of establishment of gyii thii / ",
    option: [
        "Maharashtra srkaar by",
        "Gujarat srkaar by",
        "Madhya Pradesh srkaar by",
        "Tamil Nadu srkaar by"
    ],
    answer: "Gujarat srkaar by"
},

{
    question: "netaa adhiinsthoN from work letaa is :",
    option: [
        "caatury from",
        "ddnndde from",
        "dhmkaakr",
        "none of these"
    ],
    answer: "caatury from"
},

{
    question: "................ internal recruitment of profit hai / ",
    option: [
        "abhiprernnaa in increase",
        "audyogik peace",
        "both of the above",
        "nvyuvk employees of prvesh on rok"
    ],
    answer: "both of the above"
},

{
    question: "training of vidhiyaaN are-",
    option: [
        "job rotation training",
        "on-the-job training",
        "apprenticeship training",
        "all of these"
    ],
    answer: "all of these"
},

{
    question: "among the following who/which-saa management of siddhaaNt of mhtv not is?",
    option: [
        "efficiency in increase",
        "initiative",
        "sNsaadhnoN of maximum upyog",
        "changing technology to apnaanaa"
    ],
    answer: "efficiency in increase"
},

{
    question: "one sNsthaa of smkss main financial prshn what is is?",
    option: [
        "various business gtividhiyoN for how many finance of need hogii ?",
        "ise various means from how much quantity in received done jaaegaa ?",
        "business of profit to which prkaar vibhaajit done jaaegaa ?",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "among the following communication of prkaar who/which-saa is?",
    option: [
        "formal",
        "informal",
        "formal and informal",
        "likhit"
    ],
    answer: "formal and informal"
},

{
    question: "planning is is:",
    option: [
        "bhuutkaal for",
        "bhvissykaal for",
        "existing for",
        "all time for"
    ],
    answer: "bhvissykaal for"
},

{
    question: "training of vidhiyaaN are :",
    option: [
        "job rotation training",
        "on-the-job training",
        "apprenticeship training",
        "ye all"
    ],
    answer: "ye all"
},

{
    question: "baijnyaanik management in Taylor by use kiye:",
    option: [
        "gti adhyyn",
        "thkaan adhyyn",
        "time adhyyn",
        "all"
    ],
    answer: "all"
},

{
    question: "working capital of suutr is:",
    option: [
        "smpttiyaaN - deytaaeN",
        "current smpttiyaaN - current deytaaeN",
        "fixed smpttiyaaN - fixed deytaaeN",
        "deytaaeN - smpttiyaaN"
    ],
    answer: "current smpttiyaaN - current deytaaeN"
},

{
    question: "alpsuucnaa debt srvaadhik .................. are haiN / ",
    option: [
        "fixed",
        "trl",
        "mhNge",
        "sste"
    ],
    answer: "trl"
},

{
    question: "which year in World Trade Organization of establishment occurred?",
    option: [
        "1945",
        "1965",
        "1975",
        "1995"
    ],
    answer: "1995"
},

{
    question: "prmaannu praudyogikii of peace puurnn upyog and uskii Security from smbddh United Nations of ejensii of naam is",
    option: [
        "United Nations nirstriikrnn smiti",
        "International aannvik uurjaa ejensii",
        "United Nations International Security smiti",
        "none of these"
    ],
    answer: "International aannvik uurjaa ejensii"
},

{
    question: "state of aphsrshaahii to httaanaa' udymiyoN of their udym of among the following which role of udaahrnn is?",
    option: [
        "exchange sNbNdhoN of development",
        "political prshaasn",
        "management-control",
        "tkniikii"
    ],
    answer: "political prshaasn"
},

{
    question: "new nirgmit shares in deals does is :",
    option: [
        "secondary market",
        "primary market",
        "secondary market and primary market both",
        "upryukt in from any not"
    ],
    answer: "primary market"
},

{
    question: "among the following which vidhi in tkniikii sNsthaaeN and business sNsthaaeN milkr their members to training provides does is ?",
    option: [
        "abhivinyaas training",
        "nvsikhuaa training",
        "pryogshaalaa training",
        "United training"
    ],
    answer: "United training"
},

{
    question: "control related is :",
    option: [
        "result",
        "work",
        "effort",
        "none of these"
    ],
    answer: "result"
},

{
    question: "planning management of work is :",
    option: [
        "shaayk",
        "primary",
        "unnecessary",
        "none of these"
    ],
    answer: "primary"
},

{
    question: "development of abhipraay employees to ................ area/kssetroN in nipunn bnaanaa hai / ",
    option: [
        "one particular",
        "two",
        "three",
        "all"
    ],
    answer: "all"
},

{
    question: "puraane sNyNtr to unntshiil bnaane for one ne and aadhunik sNyNtr of adhigrhnn of nirnny is:",
    option: [
        "financial nirnny",
        "working capital nirnny",
        "nivesh nirnny",
        "dividend nirnny"
    ],
    answer: "nivesh nirnny"
},

{
    question: "United Nations of caarttr in how much dhaaraaeN are?",
    option: [
        "111",
        "112",
        "115",
        "120"
    ],
    answer: "111"
},

{
    question: "'control, planning of absence in aNdhaa hai / ' this statement both of baare in what btaataa is ?",
    option: [
        "kevl planning jruurii is",
        "kevl control jruurii is",
        "both of to be jruurii is",
        "both unnecessary are"
    ],
    answer: "both of to be jruurii is"
},

{
    question: "one person of us need of what naam is jismeN that apnii kssmtaa to highest str up to le jaanaa caahtaa hai / ",
    option: [
        "smmaan of need",
        "self receipt of need",
        "Security of need",
        "all of the above"
    ],
    answer: "self receipt of need"
},

{
    question: "advertising on done gyaa expenditure apvyy is hai /  this statement advertising of baare in what btaataa hai / ",
    option: [
        "profit",
        "limit",
        "aakssep",
        "aakssep of khNddn"
    ],
    answer: "aakssep"
},

{
    question: "financial management is :",
    option: [
        "art",
        "vijnyaan",
        "art and vijnyaan both",
        "none of these"
    ],
    answer: "art and vijnyaan both"
},

{
    question: "control necessary is",
    option: [
        "lghu enterprise for",
        "middle category of enterprise for",
        "bdd'e aakaar vaale enterprise for",
        "all of these for"
    ],
    answer: "all of these for"
},

{
    question: "jb one person iNjiiniyriNg of kors does is to that ............ hai / ",
    option: [
        "training",
        "shikssaa",
        "development",
        "all of the above"
    ],
    answer: "shikssaa"
},

{
    question: "advertising of medium is :",
    option: [
        "nmuune",
        "promoshn",
        "klennddr and ddaayrii aadi",
        "prdrshn"
    ],
    answer: "klennddr and ddaayrii aadi"
},

{
    question: "entrepreneurship one ................. activity hai / ",
    option: [
        "vyvsthit",
        "vaidh",
        "jokhimpuurnn",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "motivated employees to paaritossit done goes",
    option: [
        "Rnnaatmk",
        "dhnaatmk",
        "actual",
        "none of these"
    ],
    answer: "dhnaatmk"
},

{
    question: "United Nations of most bdd'aa organs who/which is?",
    option: [
        "Security prissd",
        "General Assembly",
        "Secretariat",
        "International Court of Justice"
    ],
    answer: "General Assembly"
},

{
    question: "among the following who/which-sii practical pryaavrnn of vishesstaa not is?",
    option: [
        "shhriikrnn",
        "employee",
        "tulnaatmk",
        "anivaarytaa  / "
    ],
    answer: "employee"
},

{
    question: "world mhilaa divs when mnaayaa goes is?",
    option: [
        "10 dismbr to",
        "8 maarc to",
        "1 dismbr to",
        "2 akttuubr to"
    ],
    answer: "8 maarc to"
},

{
    question: "primary market of sNbNdh .................. nirgmnoN from is",
    option: [
        "puraane",
        "new",
        "purchase-sales",
        "stock"
    ],
    answer: "new"
},

{
    question: "sii.ttii.bii.ttii. prstaav United Nations by when sviikaaraa gyaa?",
    option: [
        "1995 ii. in",
        "1996 ii. in",
        "1997 ii. in",
        "1998 ii. in"
    ],
    answer: "1996 ii. in"
},

{
    question: "management of success of primary element is:",
    option: [
        "sntusstt employee",
        "atydhik capital",
        "bdd'aa market",
        "maximum production"
    ],
    answer: "sntusstt employee"
},

{
    question: "business establishment of prkriyaa in among the following which vyaavhaariktaa of aakln done goes is?",
    option: [
        "tkniikii",
        "economic",
        "financial",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "among the following who/which this sunishcit does is ki work vaaNchit progress from cl rhaa is athvaa not?",
    option: [
        "planning",
        "organization",
        "sndeshvaahn",
        "supervision"
    ],
    answer: "supervision"
},

{
    question: "advertising is :",
    option: [
        "investment",
        "unnecessary",
        "money of waste",
        "none of these"
    ],
    answer: "investment"
},

{
    question: "planning is:",
    option: [
        "lkssy-abhimukhii",
        "objective-abhimukhii",
        "mental prkriyaa",
        "ye all"
    ],
    answer: "ye all"
},

{
    question: "scientific management from shrmikoN of work of ghNttoN in is is :",
    option: [
        "increase",
        "kmii",
        "any prbhaav not",
        "average"
    ],
    answer: "kmii"
},

{
    question: "1950 in United Nations of General Assembly by which nyii vyvsthaa to jnm diyaa?",
    option: [
        "saamuuhik Security",
        "sttaa sntuln",
        "peace establishment",
        "peace nirmaann"
    ],
    answer: "peace establishment"
},

{
    question: "nirdeshn of major tttv are-",
    option: [
        "2",
        "3",
        "4",
        "6"
    ],
    answer: "4"
},

{
    question: "management of siddhaaNtoN of rcnaa which prkaar from of goes is?",
    option: [
        "pryogshaalaa in",
        "prbNdhkoN of anubhv by",
        "graahkoN of anubhv by",
        "smaaj vaijnyaanikoN by"
    ],
    answer: "prbNdhkoN of anubhv by"
},

{
    question: "control management of work is :",
    option: [
        "first",
        "antim",
        "third",
        "second"
    ],
    answer: "antim"
},

{
    question: "low in who/which promotion smmishrnn of element not is?",
    option: [
        "advertising",
        "personal selling",
        "sales promotion",
        "product development"
    ],
    answer: "product development"
},

{
    question: "planning in shaamil is……..",
    option: [
        "what do hai / ",
        "when do is",
        "kaise do is",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "among the following who/which United Nations of organs not is?",
    option: [
        "General Assembly",
        "Security prissd",
        "International Court of Justice",
        "yuunesko"
    ],
    answer: "yuunesko"
},

{
    question: "European Union of how many member desh are?",
    option: [
        "27",
        "28",
        "26",
        "29"
    ],
    answer: "27"
},

{
    question: "development of objective is :",
    option: [
        "ability in increase",
        "shresstth performance",
        "promotion of opportunities",
        "ye all"
    ],
    answer: "ye all"
},

{
    question: "ydi any baateN smaan rheN to tax of dr in nigmit profit on increase hogii :",
    option: [
        "debt apekssaakRt sste hoNge",
        "debt apekssaakRt km sste hoNge",
        "cost of debt on any prbhaav not hogaa",
        "hm some not tax skte"
    ],
    answer: "debt apekssaakRt sste hoNge"
},

{
    question: "among the following CASH in ................. to smmilit not done jaataa / ",
    option: [
        "Knowledge",
        "Attitude",
        "Skill and Habits",
        "CASH"
    ],
    answer: "CASH"
},

{
    question: "development shbd to ................ of with jodd'aa goes hai / ",
    option: [
        "prbndhkoN",
        "shrmikoN",
        "pryveksskoN",
        "shrmikoN and pryveksskoN"
    ],
    answer: "prbndhkoN"
},

{
    question: "social approach of anusaar, entrepreneurship is :",
    option: [
        "emotionality of prkriyaa",
        "role performance process",
        "economic change of prkriyaa",
        "all of the above"
    ],
    answer: "role performance process"
},

{
    question: "current smpttiyaaN ve smpttiyaaN are which cash in privrtit is are :",
    option: [
        "six mhiine of andr",
        "one year of andr",
        "one from three year of andr",
        "three from paaNc year of andr"
    ],
    answer: "one year of andr"
},

{
    question: "akushl employee to low pd on bhejne to ................ khte haiN / ",
    option: [
        "sthaanaaNtrnn",
        "promotion",
        "demotion",
        "temporary separation"
    ],
    answer: "demotion"
},

{
    question: "'one entrepreneur to their nirnny on dRddh' rhnaa caahie / ' this among the following which entrepreneur ability of arth is?",
    option: [
        "vcnbddhtaa",
        "smsyaa smaadhaan",
        "dRddh'taa",
        "suucnaa received do"
    ],
    answer: "dRddh'taa"
},

{
    question: "marketing concept of mhtv is :",
    option: [
        "smaaj for",
        "consumers for",
        "utpaadk for",
        "these tiinoN for"
    ],
    answer: "these tiinoN for"
},

{
    question: "among the following financial management from sNbNdhit standards who/which-saa is ?",
    option: [
        "prti person production",
        "vikriktaaoN of lkssy",
        "anupsthiti dr",
        "puuNjii flow"
    ],
    answer: "puuNjii flow"
},

{
    question: "among the following who/which-saa communication aphvaaheN phailaataa is?",
    option: [
        "formal",
        "informal",
        "likhit",
        "all of these"
    ],
    answer: "informal"
},

{
    question: "henrii pheyol of management of siddhaaNt are:",
    option: [
        "10",
        "3",
        "14",
        "15"
    ],
    answer: "14"
},

{
    question: "one work of performance of liye management to ‘srvottm raastaa ddhuuNddhnaa” caahie /  scientific management of who/which-saa siddhaaNt is pNkti of vyaakhyaa does is:",
    option: [
        "saarvbhaum",
        "lciile",
        "smpuurnn",
        "practical"
    ],
    answer: "practical"
},

{
    question: "1945 in United Nations of establishment occurred, uskaa maulik member who/which was?",
    option: [
        "Pakistan",
        "baaNglaadesh",
        "shriilNkaa",
        "India"
    ],
    answer: "India"
},

{
    question: "ddnlp among the following whose udaahrnn is ?",
    option: [
        "naamkrnn",
        "braaNdd",
        "braaNdd naam",
        "braaNdd maark"
    ],
    answer: "braaNdd naam"
},

{
    question: "puraane sNyNtr to unntshiil bnaane for one ne and aadhunik sNyNtr of adhigrhnn of nirnny is :",
    option: [
        "financial nirnny",
        "working capital nirnny",
        "nivesh nirnny",
        "dividend nirnny"
    ],
    answer: "nivesh nirnny"
},

{
    question: "Security Council in fixed members of number how much is?",
    option: [
        "5",
        "6",
        "7",
        "14"
    ],
    answer: "5"
},

{
    question: "kirjnr by entrepreneur of jin kaaryoN to btaayaa is unmeN from downward who/which-saa raajniitik prshaasn of pkss not is?",
    option: [
        "srkaarii aphsrshaahii from work nikaalnaa",
        "organization in maanviiy smbndhoN of prbndhn",
        "production of new-new tkniik and new-new utpaadoN to laanaa",
        "customer and aapuurtikrtaaoN from smbndhoN of prbndhn"
    ],
    answer: "production of new-new tkniik and new-new utpaadoN to laanaa"
},

{
    question: "baar-baar and minimum purchase pryaasoN from khriide jaane vaale product to ............... product khte haiN / ",
    option: [
        "suvidhaajnk",
        "vilaasitaa",
        "vishisstt",
        "audyogik"
    ],
    answer: "suvidhaajnk"
},

{
    question: "prshaasnik management of prstutkrtaa were :",
    option: [
        "phyol",
        "Taylor",
        "ttairii",
        "vaattsn"
    ],
    answer: "phyol"
},

{
    question: "aadesh caalit pddhti (Order Drive System) of use ...... on is hai / ",
    option: [
        "BSE",
        "NSE",
        "DSE",
        "CSE"
    ],
    answer: "NSE"
},

{
    question: "finance vyvsthaa of major organs who/which-saa is ?",
    option: [
        "financial market",
        "financial sNsthaaeN",
        "financial prtibhuutiyaaN",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: ".................... in pryaay leshshiiltaa available rhtii hai / ",
    option: [
        "publicity",
        "advertising",
        "sales promotion",
        "personal selling"
    ],
    answer: "personal selling"
},

{
    question: "eaareph of complete ruup what is?",
    option: [
        "esosieshn phoNr riijnl phorm",
        "aasiyaan riijnl phorm",
        "eshiyn risrc phorm",
        "none of these"
    ],
    answer: "aasiyaan riijnl phorm"
},

{
    question: "financial management of aadhunik vicaardhaaraa is:",
    option: [
        "kossoN to received do",
        "kossoN of upyog do",
        "A and B both",
        "none of these"
    ],
    answer: "A and B both"
},

{
    question: "supervisor who/which is?",
    option: [
        "high and middle management",
        "employee and middle management",
        "employee and low management",
        "employee and sNcaalk"
    ],
    answer: "employee and middle management"
},

{
    question: "financial vyvsaaykitaa of abhipraay ................. from hai / ",
    option: [
        "profit",
        "finance",
        "vaannijyik kriyaaoN",
        "srkaarii anumti"
    ],
    answer: "finance"
},

{
    question: "scientific management of jnk were:",
    option: [
        "gilgrNth",
        "Taylor",
        "roNbrttsn",
        "vaattsn"
    ],
    answer: "Taylor"
},

{
    question: "scientific management from amikoN of paarishrmik in……….is is:",
    option: [
        "increase",
        "kmii",
        "both",
        "n increase n kmii"
    ],
    answer: "increase"
},

{
    question: "control of employee do are",
    option: [
        "virodh",
        "psnd",
        "smrthn",
        "none of these"
    ],
    answer: "virodh"
},

{
    question: "supervision is—",
    option: [
        "necessary",
        "unnecessary",
        "time of waste",
        "none of these"
    ],
    answer: "necessary"
},

{
    question: "management of saar hai / ",
    option: [
        "smnvy",
        "organization",
        "staffing",
        "control"
    ],
    answer: "smnvy"
},

{
    question: "............. OTCEI of promoter is",
    option: [
        "UTI",
        "ICICI",
        "IDBI",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "one effective control tNtr shaayk is is :",
    option: [
        "organizational lkssyoN of performance in",
        "employees of mnodshaa of promotion in",
        "maankoN of ythaarthtaa of nirnny in",
        "appropriate all in"
    ],
    answer: "appropriate all in"
},

{
    question: "...................... in sNbNdh of development is hai / ",
    option: [
        "publicity",
        "advertising",
        "sales promotion",
        "personal selling"
    ],
    answer: "personal selling"
},

{
    question: "among the following who/which-saa Taylor of management of siddhaaNt not is?",
    option: [
        "vijnyaan n ki vyvhaaraadhiin",
        "kaaryaatmk phormainship",
        "maximum n ki siimit production",
        "cooperation n ki virodh"
    ],
    answer: "kaaryaatmk phormainship"
},

{
    question: "netaa of paas sttaa is is?",
    option: [
        "informal",
        "formal",
        "nijii",
        "srkaarii"
    ],
    answer: "formal"
},

{
    question: "entrepreneurship whichby aashvst is is?",
    option: [
        "shaayk",
        "vRhtaakaar phrmeN",
        "middle firm",
        "lghu firm"
    ],
    answer: "vRhtaakaar phrmeN"
},

{
    question: ".............. of abhipraay one person by self of business ikaaii established doing vaalii prkriyaa from hai / ",
    option: [
        "entrepreneur",
        "entrepreneurship",
        "udym",
        "all of the above"
    ],
    answer: "entrepreneurship"
},

{
    question: "India in entrepreneurship of future is :",
    option: [
        "andhkaar in",
        "bright",
        "ktthinaaii in",
        "none of these"
    ],
    answer: "bright"
},

{
    question: "raajkossiiy bil muultH are are:",
    option: [
        "alpkaalik phNdd udhaar of prptr",
        "diirghkaalik phNdd udhaar of prptr",
        "capital market of one prptr",
        "upryukt some also not"
    ],
    answer: "alpkaalik phNdd udhaar of prptr"
},

{
    question: "district forum disputes of settlement tax can is :",
    option: [
        "₹5 lakh up to",
        "₹10 lakh up to",
        "₹15 lakh up to",
        "₹1 crore up to"
    ],
    answer: "₹1 crore up to"
},

{
    question: "one niveshk to ru........ lakh of jmaa prmaann-letter taking necessary are haiN / ",
    option: [
        "5",
        "10",
        "25",
        "50"
    ],
    answer: "25"
},

{
    question: "United Nations of ttvaavdhaan in niHshstriikrnn commission when bnaa?",
    option: [
        "1945 ii. in",
        "1952 ii. in",
        "1959 ii. in",
        "1966 ii. in"
    ],
    answer: "1952 ii. in"
},

{
    question: "planning, control of absence in aNdhvishvaas is' this statement both of baare in what btaataa is ?",
    option: [
        "kevl planning jruurii is",
        "kevl control jruurii is",
        "both of to be jruurii is",
        "both unnecessary are"
    ],
    answer: "both of to be jruurii is"
},

{
    question: "capital market deals does is—",
    option: [
        "short-term funds",
        "medium-term funds",
        "long-term funds",
        "none of these"
    ],
    answer: "long-term funds"
},

{
    question: "OTCEI vyvhaaroN in .................. paidaa does hai / ",
    option: [
        "trltaa",
        "paardrshktaa",
        "both of the above",
        "derii"
    ],
    answer: "both of the above"
},

{
    question: "standards determination of main aadhaar ................. hai / ",
    option: [
        "quantity",
        "kism",
        "time",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "working capital of nirdhaark is:",
    option: [
        "sNsthaa of aakaar",
        "nirmaann prkriyaa of avdhi",
        "kcce maal of uplbdhtaa",
        "all of these"
    ],
    answer: "all of these"
},

{
    question: "jb one akelaa consumer your rightsoN to complete kraane in asphl rhtaa is to of mdd le can hai / ",
    option: [
        "trade Union",
        "consumer Union",
        "shrmik vrg",
        "none of these"
    ],
    answer: "consumer Union"
},

{
    question: "India in consumer protection adhiniym effective is :",
    option: [
        "15 aprail, 1986 from",
        "15 aprail, 1987",
        "15 aprail, 1988",
        "none of these"
    ],
    answer: "15 aprail, 1987"
},

{
    question: "naatto from how many Nations sNbNdhit are?",
    option: [
        "gyaarh Nations",
        "nau Nations",
        "baarh Nations",
        "ds Nations"
    ],
    answer: "baarh Nations"
},

{
    question: "management……… / ",
    option: [
        "art",
        "art and vijnyaan both",
        "vijnyaan",
        "none of these"
    ],
    answer: "art and vijnyaan both"
},

{
    question: "staffing work is",
    option: [
        "high management of",
        "middle category of management of",
        "low category of management of",
        "srkaar of"
    ],
    answer: "middle category of management of"
},

{
    question: "communication process to complete doing for km from km ............ person hone caahie / ",
    option: [
        "one",
        "two",
        "three",
        "four"
    ],
    answer: "two"
},

{
    question: "scientific management from consumers to:",
    option: [
        "any prbhaav not",
        "shossnn is is",
        "profit is is",
        "none of these"
    ],
    answer: "profit is is"
},

{
    question: "raajkossiiy bil muultH are are:",
    option: [
        "alpkaalik phNdd udhaar of prptr",
        "diirghkaalik phNdd udhaar of prptr",
        "capital market of one prptr",
        "upryukt some also not"
    ],
    answer: "alpkaalik phNdd udhaar of prptr"
},

{
    question: "ability and desire both of minimum quantity among the following what drshaatii is?",
    option: [
        "entrepreneur ready not",
        "capable entrepreneur",
        "willing entrepreneur",
        "ready entrepreneur"
    ],
    answer: "entrepreneur ready not"
},

{
    question: "stock vipnni hit of Security does is :",
    option: [
        "niveshk",
        "company",
        "srkaar",
        "any of not"
    ],
    answer: "niveshk"
},

{
    question: "finance of most sstaa srot is:",
    option: [
        "Rnnptr",
        "equity aNsh capital",
        "puurvaadhikaar aNsh",
        "prtidhaarit upaarjn"
    ],
    answer: "prtidhaarit upaarjn"
},

{
    question: "one manager uddeshyoN to kaise received do caahtaa is?",
    option: [
        "kushltaa from",
        "prbhaavpuurnntaa from",
        "kushltaa and prbhaavpuurnntaa from",
        "none of these"
    ],
    answer: "kushltaa and prbhaavpuurnntaa from"
},

{
    question: "among the following who/which-saa business one sphl entrepreneurship from not judd'aa is?",
    option: [
        "anusNdhaan and development",
        "their business to din-prtidin of aadhaar on claanaa",
        "continuous nviintaa and ttkaaliktaa",
        "customer of aavshyktaanusaar production"
    ],
    answer: "their business to din-prtidin of aadhaar on claanaa"
},

{
    question: "low in who/which-saa anucit trade deals of udaahrnn not is ?",
    option: [
        "goods/sevaaoN of baare in wrong jaankaarii giving",
        "gair knekshn dete time cuulhaa also purchasing of shrt lgaanaa",
        "set prmaannoN of paaln n do",
        "jmaakhorii do"
    ],
    answer: "goods/sevaaoN of baare in wrong jaankaarii giving"
},

{
    question: "one developed desh in entrepreneur of work when abolished huaa considered goes is?",
    option: [
        "business established are only",
        "business of vistaar paidaa are only",
        "customer satisfaction after",
        "business of smaapn after"
    ],
    answer: "business established are only"
},

{
    question: "among the following ttikaauu product of udaahrnn who/which-saa is ?",
    option: [
        "furniture",
        "nmk",
        "mombttii",
        "diyaaslaaii"
    ],
    answer: "furniture"
},

{
    question: "message to smpressnn prtiikoN in bdlne of prkriyaa to jaanaa goes is :",
    option: [
        "medium",
        "enkoddiNg",
        "prtipusstti",
        "ddikoddiNg"
    ],
    answer: "enkoddiNg"
},

{
    question: "niym and adhiniym which prkaar of communication barrier under aatii is?",
    option: [
        "language smbndhii barrier",
        "organizational barrier",
        "psychological barrier",
        "none of these"
    ],
    answer: "organizational barrier"
},

{
    question: "Narayan Murthy by promoted/promoter software company is :",
    option: [
        "Wipro",
        "Infosys",
        "Satyam",
        "ec0 sii0 el0"
    ],
    answer: "Infosys"
},

{
    question: "United Nations of establishment of uttrdaayii element among these from who/which not is?",
    option: [
        "London ghossnnaa",
        "moNsko ghossnnaa",
        "attlaaNttik caarttr",
        "cenjus smjhautaa"
    ],
    answer: "cenjus smjhautaa"
},

{
    question: "joNrj aar, ttairii of anusaar planning of prkaar are",
    option: [
        "8",
        "6",
        "4",
        "2"
    ],
    answer: "4"
},

{
    question: "marketing management concept of jnm sthaan hai / ",
    option: [
        "iNglainndd",
        "America",
        "France",
        "Japan"
    ],
    answer: "America"
},

{
    question: "among the following who/which-saa nirdeshn of tttv not is?",
    option: [
        "motivation",
        "smpressnn",
        "hstaaNtrnn",
        "supervision"
    ],
    answer: "hstaaNtrnn"
},

{
    question: "prmaapoN in among the following who/which-saa gunn to be caahie ?",
    option: [
        "received doing yogy",
        "maapne yogy",
        "locpuurnn",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "upyogitaaoN of group of abhipraay from hai / ",
    option: [
        "buyer",
        "seller",
        "product",
        "market"
    ],
    answer: "product"
},

{
    question: "electricity and telephone department by wrong bil giving among the following whose udaahrnn is ?",
    option: [
        "sevaaoN in nyuuntaa",
        "dossyukt goods",
        "adhik kiimt lenaa",
        "anucit trade deals"
    ],
    answer: "sevaaoN in nyuuntaa"
},

{
    question: "raassttriiy sheyr market of nipttaan (udhaar cuktaa) ckr",
    option: [
        "ttii + 5",
        "ttii + 3",
        "ttii + 2",
        "ttii + 1"
    ],
    answer: "ttii + 2"
},

{
    question: "among the following who/which United Nations of main organs not is?",
    option: [
        "General Assembly",
        "aNtrraassttriiy Court",
        "Security prissd",
        "world health organization"
    ],
    answer: "world health organization"
},

{
    question: "trltaa of nirmaann does is :",
    option: [
        "sNgtthit market",
        "asNgtthit market",
        "primary market",
        "secondary market"
    ],
    answer: "secondary market"
},

{
    question: "India in total stock eksceNj (sheyr baajaaroN) of number is :",
    option: [
        "20",
        "21",
        "22",
        "23"
    ],
    answer: "22"
},

{
    question: "supervision among the following what sunishcit does is?",
    option: [
        "suucnaaoN of pressnn sunishcit do",
        "control in shaayk",
        "both of the above",
        "audyogik jhgdd'e"
    ],
    answer: "both of the above"
},

{
    question: "one acchii yojnaa is is:",
    option: [
        "khrciilii",
        "time taking vaalii",
        "locpuurnn",
        "sNkiirnn"
    ],
    answer: "locpuurnn"
},

{
    question: "scientific management from shrmikoN to is is :",
    option: [
        "profit",
        "haani",
        "some also not",
        "profit and haani both"
    ],
    answer: "profit"
},

{
    question: "world edds divs when mnaayaa goes is?",
    option: [
        "1 dismbr to",
        "10 dismbr to",
        "24 dismbr to",
        "none of these"
    ],
    answer: "1 dismbr to"
},

{
    question: "among the following who/which desh G-77 of member is?",
    option: [
        "aviksit desh",
        "developed desh",
        "vikaasshiil desh friend",
        "none of these"
    ],
    answer: "vikaasshiil desh friend"
},

{
    question: "nirdeshn employees from related hai / ",
    option: [
        "high str",
        "middle str",
        "low str",
        "all str"
    ],
    answer: "all str"
},

{
    question: "which person others to prbhaavit doing of ability rkhtaa is use ............ khte haiN / ",
    option: [
        "netaa",
        "manager",
        "main manager",
        "supervisor"
    ],
    answer: "netaa"
},

{
    question: "advertising considered goes hai / ",
    option: [
        "apvyy",
        "investment",
        "vilaasitaa",
        "none of these"
    ],
    answer: "investment"
},

{
    question: "‘niveshkoN to shikssaa provides do SEBI of ................. work are",
    option: [
        "sNrkssnnaatmk",
        "operation sNbNdhii",
        "both of the above",
        "development sNbNdhii"
    ],
    answer: "sNrkssnnaatmk"
},

{
    question: "consumer organization apnii number in ................. of effort tax rhe haiN / ",
    option: [
        "increase",
        "kmii",
        "sthirtaa",
        "none of these"
    ],
    answer: "increase"
},

{
    question: "management persons of development is, n ki goods of nirdeshn…….  /  this statement is",
    option: [
        "el. pii. eppl",
        "aar. sii. ddevis",
        "kiith and gubelaun",
        "henrii pheyol"
    ],
    answer: "el. pii. eppl"
},

{
    question: "............... of under pichle vrssoN of aaNkdd'oN of aadhaar on nisskrss nikaale jaate haiN / ",
    option: [
        "cash budget",
        "saaNkhyikiiy aaNkdd'e",
        "prtt",
        "budgetary control"
    ],
    answer: "saaNkhyikiiy aaNkdd'e"
},

{
    question: "financial planning in futures praaptiyoN and bhugtaanoN of puurvaanumaan lgaakr ............... of kmii and aadhiky of ucit management done goes hai / ",
    option: [
        "capital",
        "human power",
        "maal",
        "all of the above"
    ],
    answer: "capital"
},

{
    question: "1950 in United Nations of General Assembly by which nyii vyvsthaa to jnm diyaa?",
    option: [
        "saamuuhik Security",
        "sttaa sntuln",
        "peace establishment",
        "peace nirmaann"
    ],
    answer: "peace establishment"
},

{
    question: "pdoN to logoN from bhrne of work management of which work under aataa is ?",
    option: [
        "planning",
        "organization",
        "staffing",
        "nirdeshn"
    ],
    answer: "staffing"
},

{
    question: "United Nations General Assembly of baitthk year in how much baar is is?",
    option: [
        "one baar",
        "two baar",
        "three baar",
        "four baar"
    ],
    answer: "one baar"
},

{
    question: "…………. of anusaar, “management persons of development is, n ki goods of nirdeshn / ”",
    option: [
        "henrii pheyol",
        "loNrens epple",
        "F. W. Taylor",
        "aar. sii. ddevis"
    ],
    answer: "loNrens epple"
},

{
    question: "among the following who/which complaint daayr not tax can ?",
    option: [
        "one consumer",
        "consumer Union jise maanytaa received n ho",
        "keNdriiy srkaar",
        "state srkaar"
    ],
    answer: "consumer Union jise maanytaa received n ho"
},

{
    question: "World Bank of establishment when occurred?",
    option: [
        "1945 ii. in",
        "1947 ii. in",
        "1948 ii. in",
        "1944 ii. in"
    ],
    answer: "1944 ii. in"
},

{
    question: "control process in among the following who/which-saa kdm shaamil not is ?",
    option: [
        "actual progress of maapnaa",
        "actual progress of prmaapoN from tulnaa",
        "finance management of work do",
        "deviations of analysis do"
    ],
    answer: "finance management of work do"
},

{
    question: "among the following consumers to specialist slaah whichunder dii jaa sktii is?",
    option: [
        "publicity",
        "advertising",
        "sales promotion",
        "personal selling"
    ],
    answer: "personal selling"
},

{
    question: "among the following who/which-saa business environment of traits not is :",
    option: [
        "anishcittaa",
        "employee",
        "smbndhtaa",
        "jhNjhtt"
    ],
    answer: "employee"
},

{
    question: "one effective control tNtr shaayk is is :",
    option: [
        "organizational lkssyoN of performance in",
        "employees of mnodshaa of promotion in",
        "maankoN of ythaarthtaa of nirnny in",
        "all of the above"
    ],
    answer: "maankoN of ythaarthtaa of nirnny in"
},

{
    question: "one entrepreneur khaa goes is",
    option: [
        "economic development of promoter",
        "economic development of prerk",
        "'A' and 'B' both",
        "none of these"
    ],
    answer: "'A' and 'B' both"
},

{
    question: "abhiprernnaa of abhipraay us prkriyaa from is which vaaNchit objective receipt hetu logoN in",
    option: [
        "prtiyogitaa",
        "uttejnaa",
        "jhgdd'aa",
        "mel-jol hone of is"
    ],
    answer: "uttejnaa"
},

{
    question: "kaise to all vicln mhtvpuurnn is lekin srvaadhik mhtvpuurnn vicln who/which-saa is ?",
    option: [
        "negative",
        "dhnaatmk",
        "zero",
        "all of the above"
    ],
    answer: "negative"
},

{
    question: "prNpraagt vicaar of anusaar .................. to market khaa goes hai / ",
    option: [
        "actual buyer",
        "sNbhaavit buyer",
        "actual and sNbhaavit kretaaoN of group",
        "special sthaan"
    ],
    answer: "special sthaan"
},

{
    question: "business of economic environment to………….prbhaavit does hai / ",
    option: [
        "economic system",
        "liberalization",
        "globalization",
        "privatization"
    ],
    answer: "economic system"
},

{
    question: "staffing of sNbNdh which responsibility from is ?",
    option: [
        "social",
        "raajniitik",
        "srkaarii",
        "personal"
    ],
    answer: "social"
},

{
    question: "among the following consumer protection from sNbNdhit who/which-saa adhiniym is ?",
    option: [
        "consumer protection adhiniym, 1986",
        "bhaartiiy company adhiniym, 1956",
        "bhaartiiy partnership adhiniym",
        "bhaartiiy anubNdh adhiniym"
    ],
    answer: "consumer protection adhiniym, 1986"
},

{
    question: "“management one peshaa hai / ” this statement is:",
    option: [
        "jaarj aar. ttairii",
        "amerikn management esosieshn",
        "henrii pheyol",
        "loNrens e, eppl"
    ],
    answer: "amerikn management esosieshn"
},

{
    question: "Human Resource Management and staffing in what sNbNdh is ?",
    option: [
        "Human Resource Management staffing from bdd'aa is",
        "staffing Human Resource Management from bdd'aa is",
        "both braabr are",
        "both in any sNbNdh not is"
    ],
    answer: "Human Resource Management staffing from bdd'aa is"
},

{
    question: "one organization of control do work is :",
    option: [
        "aage dekhnaa",
        "piiche dekhnaa",
        "aage, with only with piiche dekhnaa",
        "none of the above"
    ],
    answer: "aage, with only with piiche dekhnaa"
},

{
    question: "Security Council in total temporary members of number how much is?",
    option: [
        "10",
        "6",
        "7",
        "14"
    ],
    answer: "10"
},

{
    question: "low in who/which-saa financial protsaahn is?",
    option: [
        "promotion",
        "sevaanivRtti protsaahn",
        "pd-Security",
        "employee bhaagiidaarii"
    ],
    answer: "sevaanivRtti protsaahn"
},

{
    question: "ddaibtt debt anupaat [ ---- ] result in is is :",
    option: [
        "nimnstr financial risk",
        "top-level operation",
        "top-level financial risk",
        "top-level per share income"
    ],
    answer: "top-level financial risk"
},

{
    question: "India in kaaryrt non-governmental organization is:",
    option: [
        "voNis",
        "koNmn koNj",
        "'a' and 'b' both",
        "any not"
    ],
    answer: "'a' and 'b' both"
},

{
    question: "low in who/which-smpressnn prkriyaa of tttv not is",
    option: [
        "ddikoddiNg",
        "smpressnn",
        "medium",
        "message praapk"
    ],
    answer: "smpressnn"
},

{
    question: "development of vidhiyaaN are :",
    option: [
        "pd herpher",
        "short-term paatthykrm",
        "work on development",
        "ye all"
    ],
    answer: "ye all"
},

{
    question: "entrepreneurship among the following whichfor employment of opportunities available does is?",
    option: [
        "entrepreneur for",
        "aapuurtikrtaaoN for",
        "mdhysthoN for",
        "all of the above for"
    ],
    answer: "all of the above for"
},

{
    question: "among the following who/which entrepreneurship of vishesstaa not is?",
    option: [
        "risk lenaa",
        "nvaacaar",
        "sRjnaatmk activity",
        "prbNdhkiiy training"
    ],
    answer: "prbNdhkiiy training"
},

{
    question: "financial planning from capital to ........ cost on available kraayaa jaa can hai / ",
    option: [
        "adhik",
        "middle",
        "minimum",
        "zero"
    ],
    answer: "minimum"
},

{
    question: ".............. by entrepreneurship aashvst is is",
    option: [
        "shaayk",
        "vRhtaakaar phrmeN",
        "middle firm",
        "lghu firm"
    ],
    answer: "vRhtaakaar phrmeN"
},

{
    question: "henrii pheyoNl was one",
    option: [
        "smaaj scientific",
        "khnn iNjiiniyr",
        "lekhaakaar",
        "production iNjiiniyr"
    ],
    answer: "khnn iNjiiniyr"
},

{
    question: "10 dismbr to what mnaayaa goes is?",
    option: [
        "maanvaadhikaar divs",
        "pryaavrnn divs",
        "mhilaa divs",
        "mjduur divs"
    ],
    answer: "maanvaadhikaar divs"
},

{
    question: "ydi aap communication of prmaann rkhnaa caahte are to aapko communication of upyog do caahie :",
    option: [
        "informal",
        "formal",
        "maukhik",
        "none of these"
    ],
    answer: "formal"
},

{
    question: "smnvy is:",
    option: [
        "optional",
        "necessary",
        "unnecessary",
        "time of waste"
    ],
    answer: "necessary"
},

{
    question: "United Nations of Economic and Social Council in total how many member are?",
    option: [
        "9",
        "18",
        "27",
        "54"
    ],
    answer: "54"
},

{
    question: "currency market deals does is—",
    option: [
        "short-term funds",
        "medium-term funds",
        "long-term funds",
        "none of these"
    ],
    answer: "short-term funds"
},

{
    question: ".................. capital market of organs hai / ",
    option: [
        "demand currency",
        "primary market",
        "secondary market",
        "primary and secondary markets"
    ],
    answer: "primary and secondary markets"
},

{
    question: "one business of current assets of finance vyvsthaa honii caahie:",
    option: [
        "kevl current liabilities from",
        "kevl long-term liabilities from",
        "long-term and short-term both from aNshtH",
        "none of these"
    ],
    answer: "long-term and short-term both from aNshtH"
},

{
    question: "kuunttj o ddonel of anusaar management of work are:",
    option: [
        "2",
        "4",
        "6",
        "8"
    ],
    answer: "2"
},

{
    question: "among the following consumer organization who/which-saa is ?",
    option: [
        "Common Cause, New Delhi",
        "VOICE, New Delhi",
        "Consumers' Forum, Udupi",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "without of any also business yojnaa to sphltaapuurvk laaguu not done jaa sktaa / ",
    option: [
        "dividend nirnny",
        "investment nirnny",
        "above",
        "financial planning"
    ],
    answer: "financial planning"
},

{
    question: "consumer protection adhiniym in 1993 of sNshodhn of dauraan complaint doing of time limit to year up to doing of praavdhaan rkhaa gyaa / ",
    option: [
        "two",
        "three",
        "four",
        "paaNc"
    ],
    answer: "three"
},

{
    question: "management is:",
    option: [
        "art",
        "vijnyaan",
        "art and vijnyaan both",
        "peshaa"
    ],
    answer: "art and vijnyaan both"
},

{
    question: "'10% on complete finance provides do' among the following kiskii vidhi is ?",
    option: [
        "advertising",
        "personal selling",
        "sales promotion",
        "publicity"
    ],
    answer: "sales promotion"
},

{
    question: "kaarykrm of determination necessary is scientific….for :",
    option: [
        "planning",
        "management",
        "organization",
        "control"
    ],
    answer: "management"
},

{
    question: "anukuultm capital ddhaaNce from among the following who/which-saa prbhaav pdd'taa is ?",
    option: [
        "cost of capital minimum",
        "company of total value maximum",
        "both of the above",
        "market value of shares minimum"
    ],
    answer: "both of the above"
},

{
    question: "................ prmaann production from sNbNdhit hai / ",
    option: [
        "kism",
        "quantity",
        "kism and quantity",
        "shrm sNbNdh"
    ],
    answer: "kism and quantity"
},

{
    question: "entrepreneurship vishesstH .................. of jiivnyaapn of one aakrssk viklp hai / ",
    option: [
        "pichdd'e vrg",
        "amiirii vrg",
        "strii vrg",
        "puruss vrg"
    ],
    answer: "pichdd'e vrg"
},

{
    question: "Human Resource Management in smmilit are:",
    option: [
        "recruitment",
        "selection",
        "training",
        "ye all"
    ],
    answer: "ye all"
},

{
    question: "world of deshoN of biic trade sNgtthnoN for who/which saa International organization is?",
    option: [
        "World Trade Organization",
        "International Monetary Fund",
        "World Bank",
        "all of these"
    ],
    answer: "World Trade Organization"
},

{
    question: "kaauNttr rsiid of use tax done goes hai / ",
    option: [
        "NSE",
        "OTCEI",
        "BSE",
        "DSE"
    ],
    answer: "OTCEI"
},

{
    question: "communication process in prtipusstti of abhipraay this dekhne from is ki what........... / ",
    option: [
        "message to tthiik received tax liyaa is",
        "message to smjh liyaa is",
        "both of the above",
        "message of paaln tax liyaa is"
    ],
    answer: "both of the above"
},

{
    question: "International Court of Justice of headquarters where located is?",
    option: [
        "jenevaa",
        "brlin",
        "nyuuyoNrk",
        "heg"
    ],
    answer: "heg"
},

{
    question: "marketing in shaamil is is ?",
    option: [
        "purchase",
        "sales",
        "bhNddaarnn",
        "all"
    ],
    answer: "all"
},

{
    question: "Entrepreneurship Development Programme of prti India of srkaarii tNtr of dRssttikonn is",
    option: [
        "vinaashaatmk",
        "negative",
        "rcnaatmk",
        "ashyogaatmk"
    ],
    answer: "ashyogaatmk"
},

{
    question: "marketing expenditure bhaar is :",
    option: [
        "udyog on",
        "businessmen on",
        "consumers on",
        "all of these on"
    ],
    answer: "consumers on"
},

{
    question: "…………..one aisii vidhi is which work to complete does is :",
    option: [
        "prkriyaa",
        "udyog",
        "objective",
        "trade"
    ],
    answer: "prkriyaa"
},

{
    question: "SEBI of kssetriiy office sthit is :",
    option: [
        "Delhi",
        "Kolkata",
        "Chennai",
        "these tiinoN jgh"
    ],
    answer: "these tiinoN jgh"
},

{
    question: "marketing on expenditure done gyaa money is",
    option: [
        "waste",
        "unnecessary expenditure",
        "graahkoN on bhaar",
        "allocation"
    ],
    answer: "allocation"
},

{
    question: "existing in aasiyaan of how many member desh are?",
    option: [
        "10",
        "12",
        "13",
        "15"
    ],
    answer: "10"
},

{
    question: "among the following complaint of aadhaar who/which-saa is ?",
    option: [
        "dossyukt goods",
        "sevaaoN in nyuuntaa",
        "adhik kiimt lenaa",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "...................... in sNdeshoN of turNt smaadhaan is hai / ",
    option: [
        "advertising",
        "personal selling",
        "sales promotion",
        "publicity"
    ],
    answer: "personal selling"
},

{
    question: "selection prkriyaa in bhre jaane vaale rikt aavedn letter in .......... bhrii goes haiN / ",
    option: [
        "yogytaaeN",
        "personal suucnaaeN",
        "minimum sviikaary salary sNbNdhii suucnaaeN",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "kendriikrnn from taatpry is is-",
    option: [
        "nirnny taking in adhikaariyoN to surkssit rkhnaa",
        "nirnny taking of adhikaaroN of vikendriikrnn do",
        "prbhaagoN of profit kendr bnaanaa",
        "new kendr athvaa shaakhaaoN to kholnaa"
    ],
    answer: "nirnny taking in adhikaariyoN to surkssit rkhnaa"
},

{
    question: "cash flow condition behtr hone on among the following who/which-sii capital of use do caahie ?",
    option: [
        "debt capital",
        "equity aNsh capital",
        "both of the above",
        "none of these"
    ],
    answer: "debt capital"
},

{
    question: "budget of arth is:",
    option: [
        "performance of niyojit lkssy",
        "future of kaaryklaap of use",
        "sNsaadhnoN of shii vivrnn",
        "aashaanvit result of aNkoN in vitrnn"
    ],
    answer: "aashaanvit result of aNkoN in vitrnn"
},

{
    question: "consumer protection adhiniym of under vivaad aate are :",
    option: [
        "company of aNsh smbndhii vivaad",
        "dnnddit nature of vivaad",
        "seller by dossii maal of sales smbndhii vivaad",
        "naukrii smbndhii"
    ],
    answer: "seller by dossii maal of sales smbndhii vivaad"
},

{
    question: "United Nations divs mnaayaa goes is-",
    option: [
        "24 sitmbr to",
        "28 sitmbr to",
        "24 akttuubr to",
        "28 akttuubr to"
    ],
    answer: "24 akttuubr to"
},

{
    question: "among the following who/which-saa capital sNrcnaa to set doing vaalaa element is ?",
    option: [
        "cash flow condition",
        "byaaj aavrnn anupaat",
        "debt bhugtaan aavrnn anupaat",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "economic development for ................. of need is hai / ",
    option: [
        "anvessnn",
        "use",
        "saahs",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "acche brand of vishesstaaeN are :",
    option: [
        "suukssm naam",
        "smrnniiy",
        "aakrssk",
        "ye all"
    ],
    answer: "ye all"
},

{
    question: "control prbNdhkiiy work is:",
    option: [
        "mandatory",
        "necessary",
        "optional",
        "none of these"
    ],
    answer: "mandatory"
},

{
    question: "leadership is :",
    option: [
        "time of waste",
        "necessary",
        "money of waste",
        "unnecessary"
    ],
    answer: "necessary"
},

{
    question: "vaidhaanik ruup in SEBI of establishment occurred was :",
    option: [
        "1988",
        "1990",
        "1992",
        "1994"
    ],
    answer: "1992"
},

{
    question: "among the following ttikaauu product of udaahrnn who/which-saa is?",
    option: [
        "furniture",
        "nmk",
        "mombttii",
        "ddispaaslaaii"
    ],
    answer: "furniture"
},

{
    question: "among the following who/which Security Council of fixed member not is?",
    option: [
        "France",
        "Britain",
        "Italy",
        "China"
    ],
    answer: "Italy"
},

{
    question: "shareholder of company in existing sNpdaa =",
    option: [
        "shares of aNkit value per share market value",
        "shares of number × shares of aNkit value",
        "shares of number × per share market value",
        "shares of number × per share profit"
    ],
    answer: "shares of number × per share market value"
},

{
    question: "financial prbndhk nirnny letaa is:",
    option: [
        "financial",
        "investment",
        "dividend",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "bhaartiiy raassttriiy sheyr market to stock eksceNj (sheyr market) of ruup in maanytaa which year in milii was ?",
    option: [
        "1992",
        "1993",
        "1994",
        "1955"
    ],
    answer: "1993"
},

{
    question: "International Monetary Fund of headquarters where is?",
    option: [
        "mniilaa in",
        "jkaartaa in",
        "Paris in",
        "vaashiNgttn in"
    ],
    answer: "vaashiNgttn in"
},

{
    question: "financial planning from lgaataar ............... of condition bnaakr rkhii jaa sktii hai / ",
    option: [
        "minimum capital",
        "trltaa",
        "maximum capital",
        "(B) and (C)"
    ],
    answer: "trltaa"
},

{
    question: "Abraham Maslow by need-praathmiktaa siddhaaNt of prtipaadn year in kiyaa / ",
    option: [
        "1843",
        "1943",
        "1893",
        "1963"
    ],
    answer: "1943"
},

{
    question: "maanvaadhikaar prissd when from skriy is?",
    option: [
        "2005 ii. from",
        "2004 ii. from",
        "2006 ii. from",
        "2007 ii. from"
    ],
    answer: "2006 ii. from"
},

{
    question: "henrii pheyol of jnm huaa was :",
    option: [
        "Japan",
        "France",
        "jrmnii",
        "amriikaa"
    ],
    answer: "France"
},

{
    question: "supervisor employees of is—",
    option: [
        "friend",
        "guide",
        "philosopher",
        "all of these"
    ],
    answer: "all of these"
},

{
    question: "product antraal (mix) to prbhaavit doing vaale ghttk",
    option: [
        "marketing",
        "product",
        "financial",
        "ye all"
    ],
    answer: "marketing"
},

{
    question: "vaannijyik prptr of maximum avdhi is hai / ",
    option: [
        "3 mhiinaa",
        "6 mhiinaa",
        "12 mhiinaa",
        "24 mhiinaa"
    ],
    answer: "12 mhiinaa"
},

{
    question: "1945 in United Nations of establishment occurred, iskaa maulik member who/which was?",
    option: [
        "Pakistan",
        "baaNglaadesh",
        "shriilNkaa",
        "India"
    ],
    answer: "India"
},

{
    question: "social environment of among the following who/which-saa udaahrnn is ?",
    option: [
        "currency of aapuurti",
        "consumer protection adhiniym",
        "bhaartiiy sNvidhaan",
        "privaar of sNrcnaa"
    ],
    answer: "privaar of sNrcnaa"
},

{
    question: "International annu uurjaa abhikrnn of establishment when occurred?",
    option: [
        "1956",
        "1957",
        "1958",
        "1959"
    ],
    answer: "1957"
},

{
    question: "utpaadkoN and vikretaaoN of anucit deals from consumers to khte haiN /  Security provides doing to",
    option: [
        "consumer protection adhiniym",
        "consumer protection",
        "consumer welfare",
        "consumer shikssaa"
    ],
    answer: "consumer protection"
},

{
    question: "management of how many str are?",
    option: [
        "3",
        "4",
        "5",
        "6"
    ],
    answer: "3"
},

{
    question: "one person XYZ company of 100 aNsh ₹ 100 per share of dr from khriidtaa hai /  some time after market value of shares ₹ 120 ho goes hai /  uskii company in sNpdaa how much hogii ?",
    option: [
        "₹12,000/",
        "₹8,000",
        "₹10,000",
        "₹10,120"
    ],
    answer: "₹12,000/"
},

{
    question: "among the following who/which-saa srkaarii niitiyoN in change of business and udyog on prbhaav of vrnnn not does?",
    option: [
        "graahkoN of bddh'tii maaNg",
        "prtiyogitaa in increase",
        "kRssi in change",
        "market muulktaa"
    ],
    answer: "kRssi in change"
},

{
    question: "management of siddhaaNt are :",
    option: [
        "saarvbhaum",
        "lciile",
        "smpuurnn",
        "practical"
    ],
    answer: "smpuurnn"
},

{
    question: "secondary market in puurv nirmit prtibhuutiyoN of .................. is hai / ",
    option: [
        "purchase",
        "sales",
        "purchase-sales",
        "stock"
    ],
    answer: "purchase-sales"
},

{
    question: "effective communication for necessary are :",
    option: [
        "spsstttaa",
        "shisstttaa",
        "nirntrtaa",
        "all of these"
    ],
    answer: "all of these"
},

{
    question: "nimnlikhit in who/which-sii consumer protection adhiniym of vishesstaa is ?",
    option: [
        "bhNddoN of phailaav",
        "area of phailaav",
        "praavdhaanoN of atipuurk nature",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "shoNpiNg kiimt dRshy among the following whose udaahrnn is ?",
    option: [
        "primary packaging",
        "secondary packaging",
        "transportation packaging",
        "none of these"
    ],
    answer: "primary packaging"
},

{
    question: "marketing vicaardhaaraa of kendr-bindu .................. is hai / ",
    option: [
        "consumer satisfaction",
        "consumer welfare",
        "product of gunnvttaa",
        "production of quantity"
    ],
    answer: "consumer satisfaction"
},

{
    question: "consumer protection paarit huaa was :",
    option: [
        "1786",
        "1886",
        "1986",
        "1996"
    ],
    answer: "1986"
},

{
    question: "management of social responsibility hai / ",
    option: [
        "all of prti",
        "employees of prti",
        "srkaar of prti",
        "smaaj of prti"
    ],
    answer: "all of prti"
},

{
    question: "International annu uurjaa abhikrnn of establishment when occurred?",
    option: [
        "1956",
        "1957",
        "1958",
        "1959"
    ],
    answer: "1957"
},

{
    question: "one supervisor ............ role adaa does hai / ",
    option: [
        "one main person of ruup in",
        "one mdhysth of ruup in",
        "one maanviiy sNbNdh specialist of ruup in",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "km prbhaavpuurnntaa advertising of baare in what btaatii hai / ",
    option: [
        "profit",
        "limit",
        "aakssep",
        "aakssep of khNddn"
    ],
    answer: "limit"
},

{
    question: "nirdeshn of management of str on need is is—",
    option: [
        "high",
        "middle",
        "low",
        "all str"
    ],
    answer: "all str"
},

{
    question: "bilkul bdd'ii priyojnaaoN for among the following what apnaayaa goes is ?",
    option: [
        "prtt",
        "sii0 pii0 em0",
        "both of the above",
        "management audit"
    ],
    answer: "prtt"
},

{
    question: "entrepreneurial traits from related haiN / ",
    option: [
        "work creation deals",
        "profit creation deals",
        "risk bearing deals",
        "none of these"
    ],
    answer: "risk bearing deals"
},

{
    question: "work on self development aavshyktaaeN puurnn of goes are, by :",
    option: [
        "work in mehnt",
        "kism product aashvst do",
        "training kaarykrm in bhaagiidaarii",
        "none of the above"
    ],
    answer: "training kaarykrm in bhaagiidaarii"
},

{
    question: "responsibility lekhaaNkn in among the following persons of which ciij of lekhaa rkhaa goes haiN / ",
    option: [
        "smptti",
        "income",
        "responsibility",
        "all of the above"
    ],
    answer: "responsibility"
},

{
    question: "'suurjmukhii of one nirmaataa by one raassttriiy smaacaar letter in die ge advertising in khaa ki uskaa product Vitamins, Minerals and Protein from bhrpuur hai /  ttestt doing on all daave jhuutthe paae ge /  that whose udaahrnn hai / ",
    option: [
        "consumer shossnn",
        "consumer bhlaaii",
        "consumer jaankaarii",
        "any not"
    ],
    answer: "consumer shossnn"
},

{
    question: "aNtrraassttriiy Court in nyaayaadhiishoN of number how much is is?",
    option: [
        "5",
        "8",
        "10",
        "15"
    ],
    answer: "15"
},

{
    question: "United League of Nations of mhaasciv who/which are?",
    option: [
        "mnmohn siNh",
        "Ban of Moon",
        "baaraak obaamaa",
        "maadhv nepaalii"
    ],
    answer: "Ban of Moon"
},

{
    question: "financial management of prmpraagt vicaardhaaraa to tyaag diyaa gyaa was :",
    option: [
        "1910-20 in",
        "1920-30 in",
        "1930-40 in",
        "1940-50 in"
    ],
    answer: "1930-40 in"
},

{
    question: "financial management of main work are:",
    option: [
        "financial planning",
        "kossoN to received do",
        "shuddh profit of aavNttn",
        "all of these"
    ],
    answer: "all of these"
},

{
    question: "prmpraagt management in shrmikoN to mjduurii dii goes is-",
    option: [
        "km",
        "adhik",
        "maximum",
        "none of these"
    ],
    answer: "km"
},

{
    question: "goods khriidii not goes blki unheN becaa goes hai /  this statement ................ vicaardhaaraa from sNbNdhit hai / ",
    option: [
        "product",
        "bikrii",
        "production",
        "marketing"
    ],
    answer: "bikrii"
},

{
    question: "scientific management svaamiyoN of…………….is :",
    option: [
        "pkss in",
        "vipkss in",
        "both",
        "shaayk"
    ],
    answer: "pkss in"
},

{
    question: "India in most phle stock vipnni of establishment occurred was",
    option: [
        "1857",
        "1877",
        "1887",
        "1987"
    ],
    answer: "1887"
},

{
    question: "ydi any baateN smaan rheN to tax of dr in nigmit profit on increase hogii :",
    option: [
        "debt apekssaakRt sste hoNge",
        "debt apekssaakRt km sste hoNge",
        "cost of debt on any prbhaav not hogaa",
        "hm some not tax skte"
    ],
    answer: "debt apekssaakRt sste hoNge"
},

{
    question: "financial planning in what smmilit done goes is ?",
    option: [
        "financial uddeshyoN of determination",
        "financial niitiyoN of determination",
        "financial kaaryvidhiyoN of determination",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "................ advertising of viruddh aakssep hai / ",
    option: [
        "social muulyoN to ahelnnaa",
        "value of kmii",
        "various utpaadoN of jnyaan",
        "product kism in sudhaar"
    ],
    answer: "social muulyoN to ahelnnaa"
},

{
    question: "United Nations of establishment of uttrdaayii element among these from who/which not is?",
    option: [
        "London ghossnnaa",
        "moNsko ghossnnaa",
        "attlaaNttik caarttr",
        "cenjus smjhautaa"
    ],
    answer: "cenjus smjhautaa"
},

{
    question: "State Commission disputes of settlement tax can is",
    option: [
        "₹ 5 lakh up to",
        "₹ 10 lakh up to",
        "₹ 20 lakh up to",
        "₹1 crore from adhik"
    ],
    answer: "₹1 crore from adhik"
},

{
    question: "entrepreneurship of need ................. for is hai / ",
    option: [
        "development prkriyaa of praarNbh doing",
        "development to maintaining",
        "employment opportunities available doing",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "among the following who/which-saa three striiy complaint redressal tNtr of organs not is ?",
    option: [
        "aNtrNational Commission",
        "National Commission",
        "State Commission",
        "District Forum"
    ],
    answer: "aNtrNational Commission"
},

{
    question: "planning all prbNdhkiiy kriyaaoN of is:",
    option: [
        "praarmbh",
        "ant",
        "praarmbh and ant both",
        "none of these"
    ],
    answer: "praarmbh and ant both"
},

{
    question: "one entrepreneur of dhyaan where kendrit is is?",
    option: [
        "business praarNbh doing sNbNdhii kriyaaoN on",
        "business operation sNbNdhii kriyaaoN on",
        "atydhik profit acquired doing on",
        "prtiyogitaa of saamnaa doing on"
    ],
    answer: "business praarNbh doing sNbNdhii kriyaaoN on"
},

{
    question: "....................... advertising of limit of udaahrnn hai / ",
    option: [
        "km shktishaalii",
        "alokpriytaa",
        "prtipusstti of absence",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "jaarj aar. ttairii of anusaar management of work are :",
    option: [
        "2",
        "4",
        "6",
        "7"
    ],
    answer: "4"
},

{
    question: "United Nations of establishment when occurred?",
    option: [
        "1945",
        "1950",
        "1952",
        "1955"
    ],
    answer: "1945"
},

{
    question: "one acchii yojnaa is is :",
    option: [
        "srciilii",
        "time taking vaalii",
        "locpuurnn",
        "sNkiirnn"
    ],
    answer: "locpuurnn"
},

{
    question: "psychological examination in ............... to smmilit done goes",
    option: [
        "ruci examination",
        "buddhimttaa examination",
        "both of the above",
        "normal jnyaan examination"
    ],
    answer: "both of the above"
},

{
    question: "among the following who/which maanvaadhikaar of one prkaar is?",
    option: [
        "abhivykti of independence",
        "social smaantaa",
        "economic adhikaar",
        "all of these"
    ],
    answer: "all of these"
},

{
    question: "control of need stroN on is hai / ",
    option: [
        "high",
        "Madhya",
        "low",
        "all of these"
    ],
    answer: "all of these"
},

{
    question: "employees of maaNg recruitment prkriyaa of who/which-saa stage is ?",
    option: [
        "first",
        "second",
        "third",
        "fourth"
    ],
    answer: "second"
},

{
    question: "vstu nirmaann of vicaar aate only ............... activity praarNbh ho goes hai / ",
    option: [
        "purchase",
        "sales",
        "marketing",
        "production"
    ],
    answer: "marketing"
},

{
    question: "...................... to vipnnnkrtaa khte haiN / ",
    option: [
        "satisfaction khojne vaalaa",
        "satisfaction provides doing vaalaa",
        "goods selling vaalaa",
        "services selling vaalaa"
    ],
    answer: "satisfaction provides doing vaalaa"
},

{
    question: "India of liberalization of niiti rhii is:",
    option: [
        "sphl",
        "asphl",
        "aNsht: sphl",
        "none of these"
    ],
    answer: "sphl"
},

{
    question: "employees of training is",
    option: [
        "necessary",
        "unnecessary",
        "mandatory",
        "money of waste"
    ],
    answer: "necessary"
},

{
    question: "planning aadhaarit is…………..",
    option: [
        "bhuutkaal on",
        "aage aane on",
        "future on",
        "all of the above"
    ],
    answer: "future on"
},

{
    question: "United Nations of which mhaasciv of air durghttnaa in mRtyu occurred?",
    option: [
        "ttraagiv loNrdd",
        "ddaig hmrsholdd",
        "kthaaNtt",
        "ddoN. bii.bii. Ghali"
    ],
    answer: "ddaig hmrsholdd"
},

{
    question: "bons nirnny of nirdhaark are :",
    option: [
        "laabhoN of quantity",
        "kossoN in trltaa",
        "company of aayu",
        "all of these"
    ],
    answer: "all of these"
},

{
    question: "recruitment of who/which-saa srot new organization for available not is is ?",
    option: [
        "aaNtrik",
        "baahy",
        "both of the above",
        "prtykss recruitment"
    ],
    answer: "aaNtrik"
},

{
    question: "which year in World Trade Organization of establishment occurred?",
    option: [
        "1945",
        "1965",
        "1975",
        "1995"
    ],
    answer: "1995"
},

{
    question: "consumer disputes of nipttaare of avsthaa tNtr is:",
    option: [
        "one striiy",
        "dvistriiy",
        "tri-striiy",
        "any not"
    ],
    answer: "dvistriiy"
},

{
    question: "employment anubNdh in ................. suucnaaeN dii goes haiN / ",
    option: [
        "joNb of naam",
        "responsibility",
        "salary",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "nirdeshn of tttv are:",
    option: [
        "supervision",
        "all",
        "leadership",
        "motivation"
    ],
    answer: "all"
},

{
    question: "“planning future to pkdd'ne for bnaayaa gyaa piNjraa hai / ” this statement is",
    option: [
        "nyuumain",
        "hrle",
        "eln",
        "tterii"
    ],
    answer: "eln"
},

{
    question: "prbndhkiiy audit in among the following kiskii jaaNc of goes is ?",
    option: [
        "prbndhkiiy nirnnyoN of kvaalittii",
        "management pddhtiyoN of kushltaa",
        "both of the above",
        "profit-haani khaataa"
    ],
    answer: "both of the above"
},

{
    question: "United League of Nations of headquarters where is?",
    option: [
        "lNdn in",
        "vaashiNgttn in",
        "Paris in",
        "nyuuyoNrk in"
    ],
    answer: "nyuuyoNrk in"
},

{
    question: "sales promotion of objective are",
    option: [
        "new vstu from avgt kraanaa maatr",
        "new customer aakrssit doing hetu maatr",
        "competition of saamnaa doing hetu maatr",
        "all of these"
    ],
    answer: "all of these"
},

{
    question: "primary and secondary markets",
    option: [
        "one-duusre from competition do are",
        "one duusre to cooperation dete (complementary) are",
        "independent ruup from work do are",
        "one-duusre to niyNtrit do are"
    ],
    answer: "one duusre to cooperation dete (complementary) are"
},

{
    question: "leadership of objective one person of ........ prtisht kssmtaa of use do hai / ",
    option: [
        "40",
        "50",
        "80",
        "100"
    ],
    answer: "100"
},

{
    question: "time of three anumaan among the following kismeN lgaae jaate are ?",
    option: [
        "prtt",
        "sii0 pii0 em0",
        "both of the above",
        "management audit"
    ],
    answer: "prtt"
},

{
    question: "among the following sales promotion activity who/which-sii is ?",
    option: [
        "chuutt",
        "kttautii",
        "product sNyojn",
        "all of these"
    ],
    answer: "all of these"
},

{
    question: "prmaannu praudyogikii of peace puurnn upyog and uskii Security from smbddh United Nations of ejensii of naam is",
    option: [
        "United Nations nirstriikrnn smiti",
        "International aannvik uurjaa ejensii",
        "United Nations International Security smiti",
        "none of these"
    ],
    answer: "International aannvik uurjaa ejensii"
},

{
    question: "smnvy established done goes is:",
    option: [
        "highest str of management by",
        "middle striiy management by",
        "low str of management by",
        "among these from any by not"
    ],
    answer: "highest str of management by"
},

{
    question: "aaNtrik ttreddiNg of profit among the following who/which utthaataa is ?",
    option: [
        "all shareholder",
        "all Rnnptrdhaarii",
        "company of gupt suucnaa rkhne vaale",
        "all employee"
    ],
    answer: "company of gupt suucnaa rkhne vaale"
},

{
    question: "United Nations pdbndh of rcnaa kisne of?",
    option: [
        "F.ddii. ruujveltt",
        "joseph sttaalin",
        "vinsttn crcil",
        "cyaaNg kaaii shek"
    ],
    answer: "F.ddii. ruujveltt"
},

{
    question: "Security prissd of any temporary member of kaarykaal what is is?",
    option: [
        "1 year",
        "2 year",
        "3 year",
        "4 year"
    ],
    answer: "2 year"
},

{
    question: "among the following who/which United Nations of one aadhikaarik language not is?",
    option: [
        "arbii",
        "jaapaanii",
        "spenish",
        "ciinii"
    ],
    answer: "jaapaanii"
},

{
    question: "among the following who/which-saa business pryaavrnn of srvshresstth dyotk hai / ",
    option: [
        "phcaan do",
        "performance do",
        "ho rhe privrtnoN of saamnaa do",
        "this all"
    ],
    answer: "this all"
},

{
    question: "scientific management of muulaadhaar………:",
    option: [
        "mental revolution",
        "paarishrmik",
        "mental revolution not",
        "all of the above"
    ],
    answer: "mental revolution"
},

{
    question: "management of social responsibility of nature in laaguu is is :",
    option: [
        "buyer of saavdhaanii of niym",
        "seller to saavdhaanii of niymn",
        "these both in from any also not",
        "none of these"
    ],
    answer: "seller to saavdhaanii of niymn"
},

{
    question: "United Nations of establishment time uske ghossnnaa-letter on how many deshoN by hstaakssr kie?",
    option: [
        "50",
        "51",
        "53",
        "54"
    ],
    answer: "51"
},

{
    question: "currency market in ................. prtibhuutiyoN in deals done goes hai / ",
    option: [
        "short-term",
        "long-term",
        "both of the above",
        "BSE"
    ],
    answer: "both of the above"
},

{
    question: "abhiprernnaa of vishesstaa",
    option: [
        "positive",
        "negative",
        "positive and negative",
        "sNkhyaatmk"
    ],
    answer: "positive and negative"
},

{
    question: "United capital vaalii company for dividend giving is :",
    option: [
        "optional",
        "mandatory",
        "necessary",
        "none of these"
    ],
    answer: "optional"
},

{
    question: "among the following who/which-sii planning of limit not is :",
    option: [
        "time of waste",
        "control of aadhaar",
        "kttortaa",
        "atydhik cost"
    ],
    answer: "control of aadhaar"
},

{
    question: "staffing activity is",
    option: [
        "sevivrgiiy department of",
        "production department of",
        "marketing department of",
        "financial department of"
    ],
    answer: "sevivrgiiy department of"
},

{
    question: "labeling is :",
    option: [
        "mandatory",
        "necessary",
        "optional",
        "money of waste"
    ],
    answer: "necessary"
},

{
    question: "us formal communication of what naam is jismeN officer one phie of center (hb) of ruup in work does is?",
    option: [
        "chain communication",
        "ckriy communication",
        "ghuumtaa huaa communication",
        "mukt flow communication"
    ],
    answer: "ckriy communication"
},

{
    question: "................ anucit trade deals of udaahrnn hai / ",
    option: [
        "jmaakhorii do",
        "giphtt skiim jaarii do",
        "set prmaannoN of paaln n do",
        "all of the above"
    ],
    answer: "all of the above"
},

{
    question: "India in management…………….. / ",
    option: [
        "necessary",
        "unnecessary",
        "vilaasitaa",
        "none of these"
    ],
    answer: "necessary"
},

{
    question: "paikej vaalii consumer utpaadoN on labeling mandatory is",
    option: [
        "kuchek on",
        "all on",
        "any on not",
        "none of these"
    ],
    answer: "kuchek on"
},

{
    question: "training shbd to ................. of with jodd'aa goes hai / ",
    option: [
        "prbndhkoN",
        "shrmikoN",
        "pryveksskoN",
        "shrmikoN and pryveksskoN"
    ],
    answer: "shrmikoN and pryveksskoN"
},

{
    question: "consumer protection adhiniym of under shikaaytkrtaa from aashy is :",
    option: [
        "consumer",
        "state srkaar",
        "keNdriiy srkaar",
        "all of these"
    ],
    answer: "all of these"
},

{
    question: "globalization of arth is…….",
    option: [
        "world of various arthvyvsthaaoN of ekiikrnn",
        "saarvjnik area in investment",
        "nijii area in nivesh",
        "all of the above"
    ],
    answer: "world of various arthvyvsthaaoN of ekiikrnn"
},

{
    question: "which desh by Security Council in veto power of srvaadhik baar use done?",
    option: [
        "U.es.e.",
        "France",
        "ruus",
        "China"
    ],
    answer: "ruus"
},

{
    question: "low in who/which sales promotion upkrnn not is?",
    option: [
        "nmuune",
        "paik of andr inaam",
        "kuupn",
        "vaarnnttii"
    ],
    answer: "vaarnnttii"
},

{
    question: "liberalization of arth is…………",
    option: [
        "world of various arthvyvsthaaoN of ekiikrnn",
        "laaiseNs of needs and aniyNtrnnoN to aasaan do",
        "saarvjnik area in vinivesh",
        "none of these"
    ],
    answer: "laaiseNs of needs and aniyNtrnnoN to aasaan do"
},

{
    question: "world in most phle stock vipnni of establishment occurred was",
    option: [
        "Delhi",
        "London",
        "America",
        "Japan"
    ],
    answer: "America"
},

{
    question: "top-level working capital of saamaanytH result is is:",
    option: [
        "highest current anupaat, highest risk and uuNcaa profit",
        "lowest current anupaat, highest risk and profit",
        "highest equity, lowest risk and lowest profit",
        "lowest equity, lowest risk and highest profit"
    ],
    answer: "highest current anupaat, highest risk and uuNcaa profit"
},

{
    question: "customer market of .................. is hai / ",
    option: [
        "king",
        "naukr",
        "hmdrd",
        "seller"
    ],
    answer: "king"
},
];

// --- Helper: Shuffle questions ---
const shuffleQuestions = (questions) => {
  const shuffled = [...questions];
  for (let i = shuffled.length - 1; i > 0; i--) {
    const j = Math.floor(Math.random() * (i + 1));
    [shuffled[i], shuffled[j]] = [shuffled[j], shuffled[i]];
  }
  return shuffled;
};

// --- Component ---
export default function BusinessStudies12thQuiz() {
  const [started, setStarted] = useState(false);
  const [submitted, setSubmitted] = useState(false);
  const [timer, setTimer] = useState(3600); // 60 minutes = 3600 seconds
  const [language, setLanguage] = useState('hi');
  const [questions, setQuestions] = useState([]);
  const [current, setCurrent] = useState(0);
  const [answers, setAnswers] = useState({});
  const [score, setScore] = useState(0);
  const [resultDetails, setResultDetails] = useState([]);
  const [showTimerWarning, setShowTimerWarning] = useState(false);
  const resultRef = useRef(null);

  useEffect(() => {
    if (started && !submitted && timer > 0) {
      const t = setInterval(() => {
        setTimer((p) => {
          if (p <= 60) setShowTimerWarning(true);
          return p - 1;
        });
      }, 1000);
      return () => clearInterval(t);
    }
    if (timer === 0 && started && !submitted) {
      submitExam();
    }
  }, [started, submitted, timer]);

  const startExam = () => {
    const questionBank = language === 'hi' ? businessStudiesHindi : businessStudiesEnglish;
    // Select only 100 questions (all of them)
    const selectedQuestions = shuffleQuestions(questionBank).slice(0, 100);
    setQuestions(selectedQuestions);
    setStarted(true);
    setTimer(3600);
    setAnswers({});
    setCurrent(0);
    setShowTimerWarning(false);
  };

  const submitExam = () => {
    let s = 0;
    const details = questions.map((q, i) => {
      const isCorrect = answers[i] === q.answer;
      if (isCorrect) s++;
      return {
        question: q.question,
        option: q.option,
        correctAnswer: q.answer,
        userAnswer: answers[i] || (language === 'hi' ? "प्रयास नहीं किया" : "Not Attempted"),
        isCorrect: isCorrect,
        isAttempted: answers[i] !== undefined,
      };
    });
    setScore(s);
    setResultDetails(details);
    setSubmitted(true);
  };

  const toggleLanguage = () => {
    if (!started) {
      setLanguage(language === 'hi' ? 'en' : 'hi');
    }
  };

  const downloadResult = () => {
    if (resultRef.current) {
      const printWindow = window.open('', '_blank');
      if (printWindow) {
        const content = resultRef.current.innerHTML;
        printWindow.document.write(`
          <html>
            <head>
              <title>${language === 'hi' ? 'व्यवसाय अध्ययन 12वीं परिणाम' : 'Business Studies 12th Result'}</title>
              <style>
                body { font-family: Arial, sans-serif; padding: 20px; }
                .result-container { max-width: 800px; margin: 0 auto; }
                .header { text-align: center; padding: 20px; background: linear-gradient(135deg, #1a237e, #3f51b5); color: white; border-radius: 10px; margin-bottom: 20px; }
                .score-card { text-align: center; padding: 20px; border: 2px solid #1a237e; border-radius: 10px; margin-bottom: 20px; }
                .score { font-size: 40px; font-weight: bold; color: #1a237e; }
                .status { font-size: 20px; margin: 10px 0; }
                .pass { color: #28a745; }
                .fail { color: #dc3545; }
                .question-item { padding: 15px; margin: 10px 0; border-radius: 8px; border-left: 4px solid #48bb78; background: #f8f9fa; }
                .question-item.wrong { border-left-color: #dc3545; background: #fff5f5; }
                .question-item .q { font-weight: bold; font-size: 14px; }
                .question-item .your-answer { margin-top: 5px; font-size: 13px; }
                .question-item .correct-answer { margin-top: 3px; font-size: 13px; color: #28a745; font-weight: bold; }
                .wrong-answer { color: #dc3545; }
                .correct-answer-text { color: #28a745; }
                .not-attempted { color: #ffc107; }
                .footer { text-align: center; margin-top: 20px; padding: 10px; color: #666; font-size: 12px; border-top: 1px solid #ddd; }
              </style>
            </head>
            <body>
              <div class="result-container">
                ${content}
              </div>
            </body>
          </html>
        `);
        printWindow.document.close();
        printWindow.print();
      }
    }
  };

  const getText = (key) => {
    const texts = {
      'title': { hi: '💼 व्यवसाय अध्ययन 12वीं', en: '💼 Business Studies 12th' },
      'subtitle': { hi: 'कक्षा 12 व्यवसाय अध्ययन प्रश्नोत्तरी', en: 'Class 12 Business Studies Quiz' },
      'questions': { hi: '📝 प्रश्न', en: '📝 Questions' },
      'time': { hi: '⏱️ समय', en: '⏱️ Time' },
      'instructions': { hi: '📋 निर्देश:', en: '📋 Instructions:' },
      'compulsory': { hi: 'सभी प्रश्न अनिवार्य हैं', en: 'All questions are compulsory' },
      'marks': { hi: 'प्रत्येक प्रश्न 1 अंक का है', en: 'Each question carries 1 mark' },
      'negative': { hi: 'कोई नकारात्मक अंकन नहीं', en: 'No negative marking' },
      'start': { hi: '🚀 क्विज़ शुरू करें', en: '🚀 Start Quiz' },
      'answered': { hi: 'उत्तर दिए:', en: 'Answered:' },
      'prev': { hi: '⬅ पिछला', en: '⬅ Prev' },
      'next': { hi: 'अगला ➡', en: 'Next ➡' },
      'submit': { hi: '📤 जमा करें', en: '📤 Submit' },
      'navigator': { hi: 'प्रश्न नेविगेटर', en: 'Question Navigator' },
      'answered_status': { hi: '🟢 उत्तर दिया', en: '🟢 Answered' },
      'current_status': { hi: '🔵 वर्तमान', en: '🔵 Current' },
      'unanswered_status': { hi: '⚪ अनुत्तरित', en: '⚪ Unanswered' },
      'congrats': { hi: '🎉 शानदार प्रदर्शन!', en: '🎉 Excellent Performance!' },
      'practice': { hi: '📖 सीखते रहें!', en: '📖 Keep Learning!' },
      'passed': { hi: '✔️ उत्तीर्ण', en: '✔️ Passed' },
      'failed': { hi: '❌ सुधार की आवश्यकता', en: '❌ Needs Improvement' },
      'review': { hi: '📋 उत्तर समीक्षा', en: '📋 Answer Review' },
      'your_answer': { hi: 'आपका उत्तर:', en: 'Your Answer:' },
      'correct_answer': { hi: 'सही उत्तर:', en: 'Correct Answer:' },
      'new_quiz': { hi: '🔄 नई क्विज़ लें', en: '🔄 Take New Quiz' },
      'warning': { hi: '⚠️ 1 मिनट से कम समय शेष!', en: '⚠️ Less than 1 minute remaining!' },
      'download': { hi: '📥 परिणाम डाउनलोड करें', en: '📥 Download Result' },
      'status': { hi: 'स्थिति', en: 'Status' },
      'correct': { hi: 'सही', en: 'Correct' },
      'wrong': { hi: 'गलत', en: 'Wrong' },
      'not_attempted': { hi: 'प्रयास नहीं किया', en: 'Not Attempted' },
    };
    return texts[key]?.[language] || texts[key]?.['en'] || key;
  };

  // Home Page
  if (!started) {
    return (
      <div style={{
        minHeight: "100vh",
        display: "flex",
        justifyContent: "center",
        alignItems: "center",
        background: "linear-gradient(135deg, #1a237e 0%, #283593 50%, #3f51b5 100%)",
        fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif",
        padding: "20px"
      }}>
        <div style={{
          backgroundColor: "white",
          padding: "25px 20px",
          borderRadius: "16px",
          boxShadow: "0 20px 60px rgba(0,0,0,0.6)",
          textAlign: "center",
          maxWidth: "500px",
          width: "100%",
          animation: "fadeInUp 0.6s ease"
        }}>
          <div style={{ fontSize: "48px", marginBottom: "5px" }}>💼</div>
          <h1 style={{ 
            color: "#1a237e", 
            marginBottom: "3px", 
            fontSize: "22px",
            fontWeight: "700"
          }}>
            {getText('title')}
          </h1>
          <p style={{ color: "#666", fontSize: "12px", marginBottom: "15px" }}>
            {getText('subtitle')}
          </p>
          <div style={{
            height: "3px",
            background: "linear-gradient(90deg, #1a237e, #3f51b5)",
            margin: "10px auto",
            width: "60px"
          }}></div>

          {/* Language Toggle */}
          <div style={{
            display: "flex",
            justifyContent: "center",
            alignItems: "center",
            gap: "12px",
            marginTop: "15px",
            marginBottom: "15px"
          }}>
            <span style={{ 
              fontSize: "14px", 
              fontWeight: language === 'hi' ? "700" : "400",
              color: language === 'hi' ? "#1a237e" : "#999"
            }}>हिन्दी</span>
            <button
              onClick={toggleLanguage}
              style={{
                width: "50px",
                height: "26px",
                borderRadius: "13px",
                background: language === 'hi' ? "#3f51b5" : "#4a90d9",
                border: "none",
                cursor: "pointer",
                position: "relative",
                transition: "all 0.3s ease"
              }}
            >
              <div style={{
                width: "20px",
                height: "20px",
                borderRadius: "50%",
                background: "white",
                position: "absolute",
                top: "3px",
                left: language === 'hi' ? "3px" : "27px",
                transition: "all 0.3s ease",
                boxShadow: "0 2px 4px rgba(0,0,0,0.2)"
              }}></div>
            </button>
            <span style={{ 
              fontSize: "14px", 
              fontWeight: language === 'en' ? "700" : "400",
              color: language === 'en' ? "#1a237e" : "#999"
            }}>English</span>
          </div>

          <div style={{
            display: "grid",
            gridTemplateColumns: "1fr 1fr",
            gap: "10px",
            marginTop: "10px"
          }}>
            <div style={{ 
              backgroundColor: "#e8f0fe", 
              padding: "12px", 
              borderRadius: "10px"
            }}>
              <div style={{ fontSize: "11px", color: "#666" }}>{getText('questions')}</div>
              <div style={{ fontSize: "22px", fontWeight: "bold", color: "#1a237e" }}>100</div>
            </div>
            <div style={{ 
              backgroundColor: "#e8f0fe", 
              padding: "12px", 
              borderRadius: "10px"
            }}>
              <div style={{ fontSize: "11px", color: "#666" }}>{getText('time')}</div>
              <div style={{ fontSize: "22px", fontWeight: "bold", color: "#1a237e" }}>60 Mins</div>
            </div>
          </div>

          <div style={{
            backgroundColor: "#e8f0fe",
            padding: "10px",
            borderRadius: "10px",
            marginTop: "10px",
            fontSize: "12px",
            color: "#1a237e"
          }}>
            💡 {language === 'hi' ? 'कक्षा 12 व्यवसाय अध्ययन के सभी अध्यायों की व्यापक कवरेज' : 'Comprehensive coverage of all Class 12 Business Studies chapters'}
          </div>

          <div style={{
            backgroundColor: "#f8f9fa",
            padding: "10px",
            borderRadius: "10px",
            marginTop: "10px",
            fontSize: "12px",
            color: "#555",
            textAlign: "left"
          }}>
            <strong>{getText('instructions')}</strong>
            <ul style={{ margin: "5px 0 0 0", paddingLeft: "18px" }}>
              <li>{getText('compulsory')}</li>
              <li>{getText('marks')}</li>
              <li>{getText('negative')}</li>
            </ul>
          </div>

          <button
            onClick={startExam}
            style={{
              padding: "14px 40px",
              fontSize: "18px",
              fontWeight: "bold",
              background: "linear-gradient(135deg, #1a237e 0%, #3f51b5 100%)",
              color: "white",
              border: "none",
              borderRadius: "50px",
              cursor: "pointer",
              marginTop: "20px",
              width: "100%",
              transition: "transform 0.3s, box-shadow 0.3s",
              boxShadow: "0 4px 15px rgba(63, 81, 181, 0.4)"
            }}
            onMouseEnter={(e) => e.target.style.transform = "scale(1.02)"}
            onMouseLeave={(e) => e.target.style.transform = "scale(1)"}
          >
            {getText('start')}
          </button>
        </div>
      </div>
    );
  }

  // Result Page
  if (submitted) {
    const percentage = ((score / questions.length) * 100).toFixed(2);
    const isPassed = percentage >= 60;
    return (
      <div style={{
        minHeight: "100vh",
        background: "#f5f7fa",
        padding: "15px",
        fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif"
      }}>
        <div style={{
          maxWidth: "800px",
          margin: "0 auto"
        }}>
          {/* Result Card - For Download */}
          <div ref={resultRef} style={{
            backgroundColor: "white",
            borderRadius: "16px",
            padding: "25px 20px",
            boxShadow: "0 10px 40px rgba(0,0,0,0.1)",
            textAlign: "center",
            marginBottom: "20px",
            animation: "slideIn 0.5s ease"
          }}>
            <div className="header" style={{
              background: "linear-gradient(135deg, #1a237e, #3f51b5)",
              color: "white",
              padding: "15px",
              borderRadius: "10px",
              marginBottom: "15px"
            }}>
              <h1 style={{ margin: "0", fontSize: "22px" }}>{getText('title')}</h1>
              <p style={{ margin: "5px 0 0", fontSize: "12px", opacity: 0.9 }}>
                {language === 'hi' ? 'कक्षा 12 व्यवसाय अध्ययन क्विज़' : 'Class 12 Business Studies Quiz'}
              </p>
            </div>
            
            <h2 style={{ 
              fontSize: "20px", 
              marginBottom: "5px",
              color: "#2d3748"
            }}>
              {isPassed ? getText('congrats') : getText('practice')}
            </h2>
            <div style={{
              width: "80px",
              height: "80px",
              borderRadius: "50%",
              background: isPassed ? "#d4edda" : "#f8d7da",
              display: "flex",
              alignItems: "center",
              justifyContent: "center",
              margin: "15px auto",
              fontSize: "32px"
            }}>
              {isPassed ? "✅" : "📝"}
            </div>
            <div style={{ fontSize: "40px", fontWeight: "bold", color: "#1a237e" }}>
              {score} <span style={{ fontSize: "20px", color: "#888" }}>/ {questions.length}</span>
            </div>
            <div style={{ 
              fontSize: "18px", 
              color: isPassed ? "#28a745" : "#dc3545", 
              marginTop: "5px",
              fontWeight: "600"
            }}>
              {percentage}% {isPassed ? getText('passed') : getText('failed')}
            </div>
            <div style={{
              marginTop: "10px",
              fontSize: "13px",
              color: "#718096"
            }}>
              {language === 'hi' ? "भाषा: हिन्दी" : "Language: English"} • {getText('negative')}
            </div>

            <div style={{
              marginTop: "15px",
              display: "grid",
              gridTemplateColumns: "1fr 1fr 1fr",
              gap: "10px",
              fontSize: "13px"
            }}>
              <div style={{ backgroundColor: "#d4edda", padding: "8px", borderRadius: "8px", color: "#155724" }}>
                ✅ {getText('correct')}: {resultDetails.filter(r => r.isCorrect).length}
              </div>
              <div style={{ backgroundColor: "#f8d7da", padding: "8px", borderRadius: "8px", color: "#721c24" }}>
                ❌ {getText('wrong')}: {resultDetails.filter(r => !r.isCorrect && r.isAttempted).length}
              </div>
              <div style={{ backgroundColor: "#fff3cd", padding: "8px", borderRadius: "8px", color: "#856404" }}>
                ⚪ {getText('not_attempted')}: {resultDetails.filter(r => !r.isAttempted).length}
              </div>
            </div>
          </div>

          {/* Download Button */}
          <div style={{ textAlign: "center", marginBottom: "20px" }}>
            <button
              onClick={downloadResult}
              style={{
                padding: "12px 30px",
                fontSize: "15px",
                fontWeight: "bold",
                background: "linear-gradient(135deg, #48bb78 0%, #38a169 100%)",
                color: "white",
                border: "none",
                borderRadius: "50px",
                cursor: "pointer",
                boxShadow: "0 4px 15px rgba(72, 187, 120, 0.4)",
                transition: "all 0.3s ease"
              }}
              onMouseEnter={(e) => e.target.style.transform = "scale(1.02)"}
              onMouseLeave={(e) => e.target.style.transform = "scale(1)"}
            >
              {getText('download')}
            </button>
          </div>

          {/* Answer Review */}
          <div style={{
            backgroundColor: "white",
            borderRadius: "16px",
            padding: "20px 15px",
            boxShadow: "0 10px 40px rgba(0,0,0,0.1)"
          }}>
            <h2 style={{ 
              borderBottom: "2px solid #eee", 
              paddingBottom: "12px", 
              marginBottom: "15px",
              fontSize: "18px",
              color: "#2d3748"
            }}>
              {getText('review')}
            </h2>
            {resultDetails.map((item, index) => (
              <div
                key={index}
                className={item.isCorrect ? '' : 'wrong'}
                style={{
                  backgroundColor: item.isCorrect ? "#f0fff4" : 
                                   item.isAttempted ? "#fff5f5" : "#fff3cd",
                  borderLeft: `4px solid ${item.isCorrect ? "#48bb78" : 
                              item.isAttempted ? "#fc8181" : "#ffc107"}`,
                  padding: "12px 15px",
                  marginBottom: "12px",
                  borderRadius: "8px",
                  animation: `fadeIn 0.3s ease ${index * 0.05}s`
                }}
              >
                <div style={{ display: "flex", justifyContent: "space-between", alignItems: "flex-start" }}>
                  <h4 style={{ 
                    margin: "0", 
                    fontSize: "14px", 
                    color: "#2d3748",
                    flex: 1,
                    marginRight: "10px"
                  }}>
                    Q{index + 1}. {item.question}
                  </h4>
                  <span style={{ fontSize: "18px", flexShrink: 0 }}>
                    {item.isCorrect ? "✅" : item.isAttempted ? "❌" : "⚪"}
                  </span>
                </div>
                <div style={{ marginTop: "8px", marginLeft: "5px", fontSize: "13px" }}>
                  <p style={{ margin: "3px 0" }}>
                    <strong>{getText('your_answer')}</strong>{" "}
                    <span style={{ 
                      color: item.isCorrect ? "#48bb78" : 
                             item.isAttempted ? "#dc3545" : "#ffc107",
                      fontWeight: item.isAttempted ? "bold" : "normal"
                    }}>
                      {item.userAnswer}
                    </span>
                    {!item.isAttempted && (
                      <span style={{ color: "#ffc107", marginLeft: "5px" }}>
                        ({getText('not_attempted')})
                      </span>
                    )}
                  </p>
                  {!item.isCorrect && (
                    <p style={{ margin: "3px 0" }}>
                      <strong>{getText('correct_answer')}</strong>{" "}
                      <span style={{ color: "#48bb78", fontWeight: "bold" }}>{item.correctAnswer}</span>
                    </p>
                  )}
                </div>
              </div>
            ))}
          </div>

          <div style={{ textAlign: "center", marginTop: "20px" }}>
            <button
              onClick={() => {
                setStarted(false);
                setSubmitted(false);
                setAnswers({});
                setResultDetails([]);
                setTimer(3600);
                setShowTimerWarning(false);
                setQuestions([]);
              }}
              style={{
                padding: "14px 35px",
                fontSize: "16px",
                fontWeight: "bold",
                background: "linear-gradient(135deg, #1a237e 0%, #3f51b5 100%)",
                color: "white",
                border: "none",
                borderRadius: "50px",
                cursor: "pointer",
                width: "100%",
                maxWidth: "300px",
                boxShadow: "0 4px 15px rgba(63, 81, 181, 0.4)",
                transition: "transform 0.3s ease"
              }}
              onMouseEnter={(e) => e.target.style.transform = "scale(1.02)"}
              onMouseLeave={(e) => e.target.style.transform = "scale(1)"}
            >
              {getText('new_quiz')}
            </button>
          </div>
        </div>
      </div>
    );
  }

  // Exam Page
  const q = questions[current] || { question: "", option: [], answer: "" };
  const answeredCount = Object.keys(answers).length;

  return (
    <div style={{
      minHeight: "100vh",
      background: "#f5f7fa",
      padding: "10px",
      fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif"
    }}>
      <div style={{
        maxWidth: "800px",
        margin: "0 auto"
      }}>
        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "10px 14px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginBottom: "10px",
          display: "flex",
          justifyContent: "space-between",
          alignItems: "center"
        }}>
          <div style={{ flex: 1 }}>
            <p style={{ 
              margin: "0", 
              fontSize: "11px", 
              color: "#718096"
            }}>
              Q{current + 1}/{questions.length}
            </p>
            <p style={{ 
              margin: "2px 0 0", 
              fontSize: "10px", 
              color: "#a0aec0"
            }}>
              {getText('answered')} {answeredCount}/{questions.length}
            </p>
          </div>
          <div style={{
            fontSize: "20px",
            fontWeight: "bold",
            color: timer < 60 ? "#fc8181" : "#1a237e",
            display: "flex",
            alignItems: "center",
            gap: "6px"
          }}>
            <span style={{ fontSize: "16px" }}>⏱️</span>
            <span>{Math.floor(timer / 60)}:{String(timer % 60).padStart(2, "0")}</span>
          </div>
        </div>

        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "16px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginBottom: "10px",
          animation: "fadeIn 0.3s ease"
        }}>
          <div style={{
            display: "inline-block",
            backgroundColor: "#e8f0fe",
            padding: "2px 10px",
            borderRadius: "12px",
            fontSize: "11px",
            color: "#1a237e",
            marginBottom: "12px"
          }}>
            📌 {language === 'hi' ? 'व्यवसाय अध्ययन 12वीं' : 'Business Studies 12th'}
          </div>
          <h3 style={{
            fontSize: "16px",
            color: "#1a237e",
            marginBottom: "16px",
            fontWeight: "600",
            lineHeight: "1.5"
          }}>
            {q.question}
          </h3>

          <div style={{ marginTop: "5px" }}>
            {q.option && q.option.map((op, idx) => (
              <div
                key={idx}
                style={{
                  padding: "10px 12px",
                  margin: "5px 0",
                  backgroundColor: answers[current] === op ? "#ebf8ff" : "#f7fafc",
                  border: answers[current] === op ? "2px solid #3f51b5" : "2px solid transparent",
                  borderRadius: "8px",
                  cursor: "pointer",
                  transition: "all 0.3s ease",
                  display: "flex",
                  alignItems: "center",
                  transform: answers[current] === op ? "scale(1.01)" : "scale(1)"
                }}
                onClick={() => setAnswers({ ...answers, [current]: op })}
                onMouseEnter={(e) => {
                  if (answers[current] !== op) {
                    e.currentTarget.style.backgroundColor = "#f0f0f0";
                    e.currentTarget.style.transform = "scale(1.005)";
                  }
                }}
                onMouseLeave={(e) => {
                  if (answers[current] !== op) {
                    e.currentTarget.style.backgroundColor = "#f7fafc";
                    e.currentTarget.style.transform = "scale(1)";
                  }
                }}
              >
                <input
                  type="radio"
                  id={`q${current}-opt${idx}`}
                  name={`question-${current}`}
                  checked={answers[current] === op}
                  onChange={() => {}}
                  style={{ marginRight: "10px", width: "16px", height: "16px", flexShrink: 0 }}
                />
                <label
                  htmlFor={`q${current}-opt${idx}`}
                  style={{
                    fontSize: "14px",
                    cursor: "pointer",
                    flex: 1,
                    margin: "0",
                    color: "#2d3748"
                  }}
                >
                  {op}
                </label>
              </div>
            ))}
          </div>
        </div>

        <div style={{
          display: "flex",
          gap: "8px",
          flexWrap: "wrap",
          justifyContent: "space-between"
        }}>
          <div style={{ display: "flex", gap: "8px" }}>
            <button
              onClick={() => setCurrent(Math.max(0, current - 1))}
              disabled={current === 0}
              style={{
                padding: "8px 14px",
                fontSize: "13px",
                backgroundColor: current === 0 ? "#e2e8f0" : "#3f51b5",
                color: current === 0 ? "#a0aec0" : "white",
                border: "none",
                borderRadius: "8px",
                cursor: current === 0 ? "not-allowed" : "pointer",
                fontWeight: "600",
                transition: "all 0.3s ease"
              }}
              onMouseEnter={(e) => {
                if (current !== 0) {
                  e.target.style.transform = "scale(1.05)";
                  e.target.style.boxShadow = "0 4px 12px rgba(63, 81, 181, 0.3)";
                }
              }}
              onMouseLeave={(e) => {
                e.target.style.transform = "scale(1)";
                e.target.style.boxShadow = "none";
              }}
            >
              {getText('prev')}
            </button>
            <button
              onClick={() => setCurrent(Math.min(questions.length - 1, current + 1))}
              disabled={current === questions.length - 1}
              style={{
                padding: "8px 14px",
                fontSize: "13px",
                backgroundColor: current === questions.length - 1 ? "#e2e8f0" : "#3f51b5",
                color: current === questions.length - 1 ? "#a0aec0" : "white",
                border: "none",
                borderRadius: "8px",
                cursor: current === questions.length - 1 ? "not-allowed" : "pointer",
                fontWeight: "600",
                transition: "all 0.3s ease"
              }}
              onMouseEnter={(e) => {
                if (current !== questions.length - 1) {
                  e.target.style.transform = "scale(1.05)";
                  e.target.style.boxShadow = "0 4px 12px rgba(63, 81, 181, 0.3)";
                }
              }}
              onMouseLeave={(e) => {
                e.target.style.transform = "scale(1)";
                e.target.style.boxShadow = "none";
              }}
            >
              {getText('next')}
            </button>
          </div>

          <button
            onClick={submitExam}
            style={{
              padding: "8px 18px",
              fontSize: "13px",
              backgroundColor: "#48bb78",
              color: "white",
              border: "none",
              borderRadius: "8px",
              cursor: "pointer",
              fontWeight: "600",
              transition: "all 0.3s ease",
              boxShadow: "0 2px 8px rgba(72, 187, 120, 0.3)"
            }}
            onMouseEnter={(e) => {
              e.target.style.transform = "scale(1.05)";
              e.target.style.boxShadow = "0 4px 15px rgba(72, 187, 120, 0.5)";
            }}
            onMouseLeave={(e) => {
              e.target.style.transform = "scale(1)";
              e.target.style.boxShadow = "0 2px 8px rgba(72, 187, 120, 0.3)";
            }}
          >
            {getText('submit')}
          </button>
        </div>

        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "12px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginTop: "10px"
        }}>
          <p style={{ 
            margin: "0 0 8px 0", 
            color: "#718096", 
            fontSize: "11px", 
            fontWeight: "600" 
          }}>
            {getText('navigator')}
          </p>
          <div style={{
            display: "flex",
            flexWrap: "wrap",
            gap: "5px"
          }}>
            {questions.map((_, idx) => (
              <button
                key={idx}
                onClick={() => setCurrent(idx)}
                style={{
                  width: "32px",
                  height: "32px",
                  fontSize: "11px",
                  backgroundColor: answers[idx] ? "#48bb78" : 
                                   current === idx ? "#3f51b5" : "#e2e8f0",
                  color: answers[idx] ? "white" :
                         current === idx ? "white" : "#4a5568",
                  border: current === idx ? "2px solid #3f51b5" : "none",
                  borderRadius: "6px",
                  cursor: "pointer",
                  fontWeight: "bold",
                  transition: "all 0.3s ease",
                  transform: answers[idx] ? "scale(1.05)" : "scale(1)"
                }}
                onMouseEnter={(e) => {
                  e.target.style.transform = "scale(1.1)";
                }}
                onMouseLeave={(e) => {
                  e.target.style.transform = answers[idx] ? "scale(1.05)" : "scale(1)";
                }}
              >
                {idx + 1}
              </button>
            ))}
          </div>
          <div style={{
            display: "flex",
            gap: "12px",
            marginTop: "8px",
            fontSize: "10px",
            color: "#4a5568",
            flexWrap: "wrap"
          }}>
            <span>{getText('answered_status')}</span>
            <span>{getText('current_status')}</span>
            <span>{getText('unanswered_status')}</span>
          </div>
        </div>

        {showTimerWarning && (
          <div style={{
            position: "fixed",
            bottom: "15px",
            right: "15px",
            left: "15px",
            backgroundColor: "#fc8181",
            color: "white",
            padding: "12px 18px",
            borderRadius: "10px",
            boxShadow: "0 4px 15px rgba(252, 129, 129, 0.4)",
            textAlign: "center",
            fontSize: "14px",
            fontWeight: "600",
            animation: "pulse 1.5s ease-in-out infinite",
            maxWidth: "400px",
            margin: "0 auto"
          }}>
            {getText('warning')}
          </div>
        )}
      </div>
      <style>
        {`
          @keyframes pulse {
            0% { opacity: 1; transform: scale(1); }
            50% { opacity: 0.6; transform: scale(0.98); }
            100% { opacity: 1; transform: scale(1); }
          }
          @keyframes fadeInUp {
            from { opacity: 0; transform: translateY(20px); }
            to { opacity: 1; transform: translateY(0); }
          }
          @keyframes fadeIn {
            from { opacity: 0; transform: translateX(-10px); }
            to { opacity: 1; transform: translateX(0); }
          }
          @keyframes slideIn {
            from { opacity: 0; transform: translateY(-30px); }
            to { opacity: 1; transform: translateY(0); }
          }
        `}
      </style>
    </div>
  );
}