// Biology12thQuiz.jsx
import React, { useState, useEffect, useRef } from "react";

// --- 12th Biology Question Bank (100 questions) - Hindi & English ---

// Hindi Questions
const biologyHindi = [
{
    question: "T-DNA का Vector कौन है?",
    option:["Thermus aquaticus","Salmonella typhimurium","Agrobacterium tumefaciens","Bacillus thuringiensis"],
    answer:"Agrobacterium tumefaciens"
},
{
    question: "Fertilizin प्रोटीन कहाँ पाया जाता है?",
    option:["एक्रोसोम पर","शुक्राणु सिर पर","शुक्राणु की सतह पर","अंडाणु झिल्ली पर"],
    answer:"शुक्राणु की सतह पर"
},
{
    question: "सोमैटिक संकरण का कार्य किया जा सकता है:",
    option:["प्रोटोप्लास्ट के फ्यूजन द्वारा","अर्धगुणित परागकोष द्वारा","कोशिका के कल्चर द्वारा","परागकण के कल्चर द्वारा"],
    answer:"प्रोटोप्लास्ट के फ्यूजन द्वारा"
},
{
    question: "निम्नांकित में वायु जनित रोग कौन-सा है?",
    option:["क्षय रोग","डिप्थीरिया","न्यूमोनिया","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "जीवमण्डल निचय किसके साथ चेतावग्रस्त हो रहा है?",
    option:["जनसंख्या वृद्धि","वर्षा","प्रदूषण","उपर्युक्त सभी"],
    answer:"प्रदूषण"
},
{
    question: "कौन-सा राष्ट्रीय पार्क एक सींग वाले गेंडे के लिए नया घर है",
    option:["दुधवा","कार्बेट","कान्हा","बन्धवगढ़"],
    answer:"दुधवा"
},
{
    question: "DNA में कौन-सा नाइट्रोजिनस क्षार है?",
    option:["ATUC","AUGC","UTGC","ATGC"],
    answer:"ATGC"
},
{
    question: "गोल्डेन राइस किस विटामिन से परिपूर्ण रहता है:",
    option:["A","C","D","E"],
    answer:"A"
},
{
    question: "SCP प्राप्त किया जाता है:",
    option:["क्लोरेला","स्पाइरुलिना","सेनेडेसमस","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "गुणसूत्र प्रारूप 2n - 1 को कहा जाता है",
    option:["मोनोसोमी","नलिसोमी","ट्राइसोमी","टेट्रासोमी"],
    answer:"मोनोसोमी"
},
{
    question: "खेती योग्य फसल की औसत आयु है:",
    option:["1-2 वर्ष","5-15 वर्ष","10-20 वर्ष","20-30 वर्ष"],
    answer:"5-15 वर्ष"
},
{
    question: "भारतीय भैंस का जंतु वैज्ञानिक नाम है।",
    option:["ब्यूबैलस ब्यूबैलस","बोस इंडिकस","बोस टॉरस","गैलस गैलस"],
    answer:"ब्यूबैलस ब्यूबैलस"
},
{
    question: "Spermatid का Spermatozoon में रूपांतरण को कहते हैं",
    option:["Spermatogenesis","Spermiogenesis","Spermatocytogenesis","Gametogenesis"],
    answer:"Spermiogenesis"
},
{
    question: "इनमें कौन द्विगुणित है",
    option:["अंड कोशिकाएँ","सहायक कोशिकाएँ","द्वितीयक केन्द्रक","एंटीपोडल कोशिकाएँ"],
    answer:"द्वितीयक केन्द्रक"
},
{
    question: "जेनिटिक कोड कहाँ रहता है?",
    option:["r-RNA","t-RNA","DNA","m-RNA"],
    answer:"m-RNA"
},
{
    question: "DNA पॉलीमरेज की खोज किसने की?",
    option:["ओकाजाकी","कार्नबर्ग","मेसलसन व स्टाहल","वाटसन व क्रिक"],
    answer:"कार्नबर्ग"
},
{
    question: "किसी परागकोश के Pollen sac में Microspore mother cell की संख्या होती है",
    option:["द्विगुणित","एकगुणित","त्रिगुणित","चतुर्गुणित"],
    answer:"द्विगुणित"
},
{
    question: "DNA अंगुलिका-प्रिंटिंग को किसने विकसित किया?",
    option:["फ्लेमिंग","एलेक जाफरी","स्मिथ","वाट्सन"],
    answer:"एलेक जाफरी"
},
{
    question: "जब किसी उत्परिवर्तन में प्यूरिन के स्थान पर पिरिमिडीन प्रतिस्थापित हो जाए तो इसे कहते हैं:",
    option:["ट्रांजिशन","ट्रांसवर्सन","ट्रांसलोकेशन","इनवर्सन"],
    answer:"ट्रांसवर्सन"
},
{
    question: "Inner cell mass किसका Precursor है?",
    option:["बाह्य स्तर","मध्य स्तर","अंतः स्तर","संपूर्ण भ्रूण"],
    answer:"संपूर्ण भ्रूण"
},
{
    question: "अगर माता एवं बच्चे दोनों का रुधिर समूह O हो तो पिता का रुधिर समूह हो सकता है",
    option:["A या B या O","A या B","सिर्फ O","सिर्फ AB"],
    answer:"A या B या O"
},
{
    question: "अंडे से लेकर वयस्क तक बनने की संपूर्ण प्रक्रिया को कहते हैं:",
    option:["गर्भाधान","निषेचन","परिवर्धन","विद्लन"],
    answer:"परिवर्धन"
},
{
    question: "वन पारिस्थितिक तंत्र में संख्या का पिरामिड होता है:",
    option:["सीधा","उल्टा","दोनों","उपरोक्त में से कोई नहीं"],
    answer:"उल्टा"
},
{
    question: "मादा विषमयुग्मता क्या है?",
    option:["मादा द्वारा दो भिन्न प्रकार के युग्मकों का निर्माण","नर द्वारा चार प्रकार के भिन्न युग्मकों का निर्माण","(A) और (B) दोनों","इनमें से कोई नहीं"],
    answer:"मादा द्वारा दो भिन्न प्रकार के युग्मकों का निर्माण"
},
{
    question: "जन्मदर नियंत्रण के लिए कौन-सी रासायनिक विधि उपयोग में लाई जाती है?",
    option:["कंडोम","लूप","जेली क्रीम","डायफ्राम"],
    answer:"जेली क्रीम"
},
{
    question: "हरा नारियल (डाभ) में निहित दुधिया जल है",
    option:["liquid chalaza","liquid nucellus","degenerated liquid free nuclear endosperm","liquid female gametophyte"],
    answer:"degenerated liquid free nuclear endosperm"
},
{
    question: "कौन जैव विकास का सबसे स्पष्ट प्रमाण देता है?",
    option:["जीवाश्म","अवशेषी अंग","भ्रूण","आकारिकी"],
    answer:"जीवाश्म"
},
{
    question: "DNA का एक जीवाणु कोशिका से दूसरे जीवाणु कोशिका में जीवाणुभोजी द्वारा स्थानांतरण को क्या कहते हैं?",
    option:["ट्रांसफॉरमेशन या रूपांतरण","ट्रांसडक्शन","इनवर्सन","ट्रांसलेशन"],
    answer:"ट्रांसडक्शन"
},
{
    question: "घटक जो विभेदी गुणों के जोड़े को दर्शाता हो, कहलाता है",
    option:["Dominance to Recessive","Alleles","Homologous pairs","Determinants"],
    answer:"Alleles"
},
{
    question: "शुक्राणु पूँछ में Microtubules का arrangement होता है",
    option:["9+0","9+2","7+0","7+2"],
    answer:"9+2"
},
{
    question: "हीमोकोरियल प्लासेंटा पाया जाता है",
    option:["शशक में","कुत्तों में","घोड़ा में","मनुष्य में"],
    answer:"मनुष्य में"
},
{
    question: "मासिक चक्र किसमें होता है?",
    option:["बंदर","कपि","मानव","सभी"],
    answer:"सभी"
},
{
    question: "बाँस जाति में पुष्पन (Flowering) होता है",
    option:["पूरे जीवनकाल में एक बार","12 वर्ष में एक बार","प्रतिवर्ष","50-100 वर्ष में दो बार"],
    answer:"पूरे जीवनकाल में एक बार"
},
{
    question: "‘ग्रीन हाउस प्रभाव’ का मुख्य कारक है:",
    option:["CFCs","CO₂","CO","CH₄"],
    answer:"CO₂"
},
{
    question: "लैक प्रचालेक नियमन दिया:",
    option:["वाटसन एवं क्रिक","बीडल एवं टैटम","मिलर एवं यूरे","जैकब एवं मोनॉड"],
    answer:"जैकब एवं मोनॉड"
},
{
    question: "लाइकेन सूचक है:",
    option:["CO₂ प्रदूषण का","SO₂ प्रदूषण का","CO प्रदूषण का","जल प्रदूषण का"],
    answer:"SO₂ प्रदूषण का"
},
{
    question: "जब जीव अप्रिय परिस्थिति को त्याग कर पलायन करता है, तो उसे कहते हैं:",
    option:["प्रव्रजन","वासंतीकरण","दोनों (A) तथा (B)","इनमें से कोई नहीं"],
    answer:"प्रव्रजन"
},
{
    question: "जैव व्यवस्था में सबसे स्पष्ट इकाई को क्या कहते हैं?",
    option:["कोशिका","ऊतक","अंग","जीव"],
    answer:"जीव"
},
{
    question: "स्तरविन्यास यहाँ मिलता है।",
    option:["ट्रॉपिकल रेनफॉरेस्ट","मरुस्थल","डिसिड्युअस वन","दोनों (A) और (B)"],
    answer:"ट्रॉपिकल रेनफॉरेस्ट"
},
{
    question: "विक्टोरिया झील स्थित है:",
    option:["दक्षिण अफ्रीका","दक्षिण अमेरिका","ऑस्ट्रेलिया","स्विट्जरलैंड"],
    answer:"दक्षिण अफ्रीका"
},
{
    question: "Anemophily में परागण किसके द्वारा होता है",
    option:["चमगादड़","वायु","पक्षी","घोंघा"],
    answer:"वायु"
},
{
    question: "रुधिर में पाया जाने वाला प्रमुख इम्युनोग्लोबुलिन है:",
    option:["IgA","IgD","IgG","IgM"],
    answer:"IgG"
},
{
    question: "विश्व जैव विविधता दिवस है:",
    option:["22 मई","5 जून","16 सितम्बर","29 दिसम्बर"],
    answer:"22 मई"
},
{
    question: "जंतु, जो शिशुओं को जन्म देते हैं, कहलाते हैं:",
    option:["अंडज","जरायुज","उभयचर","द्विलिंगी"],
    answer:"जरायुज"
},
{
    question: "Antifertilizin एक प्रोटीन है, जो पाया जाता है",
    option:["अंड झिल्ली पर","vitelline ficcit","शुक्राणु के मध्य पीस पर","शुक्राणु के अग्र सिर वाले भाग पर"],
    answer:"शुक्राणु के अग्र सिर वाले भाग पर"
},
{
    question: "किन प्रमाणों से यह साबित होता है कि मनुष्य लंगूरों की तुलना में चिम्पैंजी के अधिक निकट है?",
    option:["लिंग गुणसूत्रों के DNA से","गुणसूत्र की आकारिकी से","जीवाश्म अवशेष से","ऑटोसोम्स एवं हेट्रोसोम के DNA से"],
    answer:"ऑटोसोम्स एवं हेट्रोसोम के DNA से"
},
{
    question: "शहद का निर्माण करती है।",
    option:["नर मधुमक्खी या ड्रोन","कार्यकर्ता या सेवक मधुमक्खी","रानी मधुमक्खी","(A) तथा (C)"],
    answer:"कार्यकर्ता या सेवक मधुमक्खी"
},
{
    question: "अवरोधक तकनीक का प्रयोग जन्म दर के नियंत्रण के लिए कौन-सा है?",
    option:["कंडोम","Vaginal pouch","डायफ्राम","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "निम्नलिखित में से कौन-सा 16 विभिन्न युग्मक उत्पन्न करेगा?",
    option:["AaBbccDd","AaBbccDDEeFf","AaBbCcddEEFF","AaBbCcDDEeFf"],
    answer:"AaBbCcDDEeFf"
},
{
    question: "किसी मूल कोशिका में गुणसूत्र की संख्या 14 है। Synergids में इसकी संख्या क्या होगी",
    option:["14","21","7","28"],
    answer:"7"
},
{
    question: "बीटी (Bt) विष (Toxin) किससे प्राप्त होता है?",
    option:["प्रोकैरियोट से","यूकैरियोट से","(A) और (B) दोनों","इनमें से कोई नहीं"],
    answer:"प्रोकैरियोट से"
},
{
    question: "चिकेनपॉक्स किसके कारण होता है?",
    option:["एडिनो वायरस","वैरिसेला वायरस","जीवाणुभोजी T2","SV-40 वायरस"],
    answer:"वैरिसेला वायरस"
},
{
    question: "जीवाणु में पाया जाता है:",
    option:["प्लाजमिड DNA","RNA","प्लाजमिड DNA और RNA दोनों","इनमें से कोई नहीं"],
    answer:"प्लाजमिड DNA और RNA दोनों"
},
{
    question: "कौन अमर हैं?",
    option:["जनन कोशिकाएँ","यकृत कोशिकाएँ","वृक्क कोशिकाएँ","तंत्रिका कोशिकाएँ"],
    answer:"जनन कोशिकाएँ"
},
{
    question: "परागण सभी पुष्प अंगों के abscission को उकसाता है, अपवादस्वरूप",
    option:["परागकोश","Pistil","Sepals","Receptacles"],
    answer:"Pistil"
},
{
    question: "Clitoris किसका समजात अंग है?",
    option:["स्क्रोटम","शिश्न","अंडाशय","वल्भा"],
    answer:"शिश्न"
},
{
    question: "बायोलिस्टिक/जीन गन का उपयोग किसमें किया जाता है?",
    option:["प्लाज्मिड को काटने में","कटे DNA को जोड़ने में","विजातीय DNA को परपोषी कोशिकाओं में प्रवेश कराने के लिए","DNA को शुद्ध करने के लिए"],
    answer:"विजातीय DNA को परपोषी कोशिकाओं में प्रवेश कराने के लिए"
},
{
    question: "डायनासोर किस दौरान उपस्थित थे?",
    option:["पेलियोजोइक","प्रीकैम्ब्रियन","सीनोजोइक","मेसोजोइक"],
    answer:"मेसोजोइक"
},
{
    question: "मुंबई और कोलकाता के शहरों में मुख्य प्रदूषक हैं:",
    option:["CO, SO₂","ओजोन","हाइड्रोकार्बन और गर्म वायु","शैवालों के बीजाणु"],
    answer:"CO, SO₂"
},
{
    question: "किसी हत्या की जगह खून के धब्बे मिले। यदि DNA प्रोफाइल करना हो तो जाँच के लिए निम्नलिखित में से क्या सबसे उपयुक्त रहेगा?",
    option:["RBC","WBC","प्लेटलेट्स","प्लाज्मा"],
    answer:"WBC"
},
{
    question: "पूरक जीन में 9 : 3 : 3 : 1 का डाइहाइब्रिड अनुपात किसमें परिवर्तित हो जाता है?",
    option:["9 : 7","12 : 3 : 1","15 : 1","13 : 3"],
    answer:"9 : 7"
},
{
    question: "निम्नांकित में जैव-उर्वरक कौन है?",
    option:["साइनोबैक्टीरिया","विषाणु","विषाणुभोजी","सभी"],
    answer:"साइनोबैक्टीरिया"
},
{
    question: "निम्न में से कौन-सा एक कुक्कुट रोग है?",
    option:["स्मट","हैजा","रानीखेत","(B) एवं (C) दोनों"],
    answer:"(B) एवं (C) दोनों"
},
{
    question: "एस्ट्रोजेन तथा प्रोजेस्ट्रॉन हार्मोन का स्रवण किससे होता है?",
    option:["प्लासेन्टा","अंडाणु","वृषण","वृक्क"],
    answer:"प्लासेन्टा"
},
{
    question: "400 शुक्राणु निर्माण में कितने द्वितीयक शुक्राणु कोशिका की आवश्यकता होगी?",
    option:["100","200","40","400"],
    answer:"200"
},
{
    question: "अर्जित गुणों की वंशागति का सिद्धांत किनके द्वारा दिया गया?",
    option:["डार्विन","लैमार्क","डी व्रीज","हैकल"],
    answer:"लैमार्क"
},
{
    question: "निम्नांकित में से कौन क्राई जीन फसल को छेदक से बचाता है?",
    option:["Cry I Ab","Cry II Ab","Cry Ac","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "'नियासीन' विटामिन है:",
    option:["B₁","B₂","B₁₂","B₃"],
    answer:"B₃"
},
{
    question: "अल्कोहल द्वारा किस अंग पर कुप्रभाव पड़ता है?",
    option:["हृदय","यकृत","मस्तिष्क","फेफड़ा"],
    answer:"यकृत"
},
{
    question: "निम्नलिखित में से कौन-सा रेशेदार प्रोटीन का उदाहरण है?",
    option:["इंसुलिन","हीमोग्लोबिन","फाइब्रोइन","ग्लूकोजन"],
    answer:"फाइब्रोइन"
},
{
    question: "कवकमूल उदाहरण है:",
    option:["अपघटक","अंतः परजीविता","सहजीवी संबंध","बाह्य परजीविता"],
    answer:"सहजीवी संबंध"
},
{
    question: "Autogamy के लिए अनुकूल है",
    option:["Homogamy","Heterostyle","Dichogamy","स्वबंध्याकरण"],
    answer:"Homogamy"
},
{
    question: "कशेरुकियों के कौन-से समूह में संकटग्रस्त प्रजातियों की संख्या उच्चतम है?",
    option:["मछलियाँ","सरीसृप","चिड़िया","स्तनधारी"],
    answer:"स्तनधारी"
},
{
    question: "अंडोत्सर्जन किस हार्मोन के प्रयास से संभव है?",
    option:["LH","FSH","Estrogen","Progestrone"],
    answer:"LH"
},
{
    question: "इनमें से फफूंदी द्वारा उत्पन्न रोग कौन-सा है?",
    option:["क्षय रोग","चेचक","दाद एवं शल्की विक्षतियाँ","श्लीपद"],
    answer:"दाद एवं शल्की विक्षतियाँ"
},
{
    question: "Polymerase Chain Reaction (PCR) किसकी जाँच के लिए प्रयुक्त होता है?",
    option:["Genital herpes","मलेरिया","Small pox","Measles"],
    answer:"Genital herpes"
},
{
    question: "एक जीन के विभिन्न रूपों को कहते हैं",
    option:["एलील","परक जीन","परिपूरक जीन","इपीस्टेटिक जीन"],
    answer:"एलील"
},
{
    question: "किसी प्रजाति के अन्दर जीव-विविधता को कहते हैं",
    option:["प्रजाति विविधता","अल्फा विविधता","आनुवंशिक विविधता","प्रजातिकरण"],
    answer:"आनुवंशिक विविधता"
},
{
    question: "मनुष्य में गर्भाधान की अवधि दिनों में है",
    option:["200","250","260","270 दिन"],
    answer:"270 दिन"
},
{
    question: "AZT औषधि किसके इलाज में प्रयुक्त होता है?",
    option:["मलेरिया","एड्स","टी.बी.","काला ज्वरी"],
    answer:"एड्स"
},
{
    question: "अंडाणु बनने की विधि को कहते हैं:",
    option:["अंडजनन","अंडाशय","अंडोत्सर्ग","मादा जनन"],
    answer:"अंडजनन"
},
{
    question: "योक निर्माण को कहते हैं",
    option:["Histogenesis","Glycogenesis","Oogenesis","Proteolysis"],
    answer:"Histogenesis"
},
{
    question: "जैव विविधता में सम्मिलित हैं",
    option:["जमीनीय","जलीय","पारिस्थितिक तंत्र","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "कल्याण सोना किसकी किस्म है?",
    option:["गेहूँ की उन्नत किस्म","सोना","(A) और (B) दोनों","इनमें से कोई नहीं"],
    answer:"गेहूँ की उन्नत किस्म"
},
{
    question: "निम्नलिखित में कौन-सा अवशेषी अंग है?",
    option:["कान का पिन्ना","एपेंडिक्स","मछली का शल्क","मेंढक का अग्रबाहु"],
    answer:"एपेंडिक्स"
},
{
    question: "निम्न में से कौन-सी विधि के द्वारा रोग की प्रारंभिक पहचान की जा सकती है?",
    option:["मूत्र विश्लेषण","रक्त विश्लेषण","PCR","इनमें से कोई नहीं"],
    answer:"PCR"
},
{
    question: "इनमें से कौन पौधा जलोद्भिद है?",
    option:["सिंघाड़ा","नागफनी","शीशम","एकेसिया"],
    answer:"सिंघाड़ा"
},
{
    question: "इनमें से कौन ग्रीनहाउस गैस नहीं है?",
    option:["CO₂","CH₄","ओजोन","CFCs"],
    answer:"ओजोन"
},
{
    question: "इनमें से कौन अपने देश का पहला राष्ट्रीय उद्यान है",
    option:["बांदीपुर","कॉर्बेट","कान्हा","इनमें से कोई नहीं"],
    answer:"कॉर्बेट"
},
{
    question: "एलर्जी में बनने वाली प्रतिरक्षी है:",
    option:["IgA प्रकार की","IgE प्रकार की","IgM प्रकार की","IgG प्रकार की"],
    answer:"IgE प्रकार की"
},
{
    question: "वाहनों में ‘कैटेलिटिक कन्वर्टर’ का उपयोग किसके नियंत्रण के लिए किया जाता है?",
    option:["वायु प्रदूषण","जल प्रदूषण","रेडियोएक्टिव प्रदूषण","मृदा प्रदूषण"],
    answer:"वायु प्रदूषण"
},
{
    question: "किसी जीव का लक्षण प्रारूप किसका परिणाम होता है?",
    option:["उत्परिवर्तन तथा सहलग्नताएँ","कोशिकाद्रव्यी प्रभाव तथा लैंगिक विरूपता","पर्यावरणीय परिवर्तन तथा लैंगिक द्विरूपता","जीनप्ररूप तथा पर्यावरण की परस्पर क्रियाएँ"],
    answer:"जीनप्ररूप तथा पर्यावरण की परस्पर क्रियाएँ"
},
{
    question: "ऑन्कोलॉजी किसका अध्ययन है?",
    option:["कैंसर","ऑन्कोजीन्स","(A) और (B) दोनों","विषाणु"],
    answer:"कैंसर"
},
{
    question: "जब गर्भ ठहरने में असमर्थ हो तो कॉर्पस ल्यूटियम किसमें बदल जाता है?",
    option:["Corpus haemorrhagicum","कॉर्पस अलबिकंस","कॉर्पस कैवरनोसम","कॉर्पस स्पौंजियोसम"],
    answer:"कॉर्पस अलबिकंस"
},
{
    question: "क्रॉसिंग ओवर किस अवस्था में होता है?",
    option:["जाइगोटीन","लेप्टोटीन","पैकीटीन","मेटाफेज"],
    answer:"पैकीटीन"
},
{
    question: "एलर्जी के कारण निकलने वाले रसायन हैं:",
    option:["हिस्टामिन","सिरोटोनिन","(A) व (B) दोनों","इनमें से कोई नहीं"],
    answer:"(A) व (B) दोनों"
},
{
    question: "एक जाति का उद्विकासीय इतिहास जाना जाता है",
    option:["व्यक्तिवृत्त (Ontogeny)","जातिवृत्त (Phylogeny)","पूर्वजता","जीवाश्म विज्ञान"],
    answer:"जातिवृत्त (Phylogeny)"
},
{
    question: "विभिन्नताओं का स्रोत है",
    option:["समसूत्री","अर्द्धसूत्री","निवेशन","उत्परिवर्तन"],
    answer:"उत्परिवर्तन"
},
{
    question: "एकसंकर क्रॉस का फीनोटिपिक अनुपात क्या है?",
    option:["1 : 2 : 1","3 : 1","9 : 3 : 3 : 1","इनमें से कोई नहीं"],
    answer:"3 : 1"
},
{
    question: "नर हार्मोन की उत्पत्ति कहाँ से होती है?",
    option:["अंडाशय","वृषण","यकृत","आमाशय"],
    answer:"वृषण"
},
{
    question: "निम्नांकित में कौन द्विगुणित है?",
    option:["पराग","अंड","(A) तथा (B)","युग्मनज"],
    answer:"युग्मनज"
},
{
    question: "परखनली शिशु वह तकनीक है जिसमें:",
    option:["अण्डवाहिनी से युग्मनज लेकर संवर्धित किया जाता है, फिर इसे रोपित करते हैं","अण्डाणु लेकर, फिर इसे निषेचित कराकर रोपित करते हैं","शुक्राणु एवं अण्डाणु का संलयन होता है और युग्मनज का विकास परखनली में होता है","इनमें से कोई नहीं"],
    answer:"अण्डाणु लेकर, फिर इसे निषेचित कराकर रोपित करते हैं"
},
{
    question: "सहभोजिता में:",
    option:["दोनों साथियों को लाभ होता है","दोनों साथियों को हानि होती है","दुर्बल को लाभ जबकि प्रबल नुकसान-विहीन रहता है","उपर्युक्त में से कोई नहीं"],
    answer:"दुर्बल को लाभ जबकि प्रबल नुकसान-विहीन रहता है"
},
{
    question: "एड्स बीमारी में HIV किस कोशिका को नष्ट करता है?",
    option:["B-कोशिका","C-कोशिका","T-लिंफोसाइट","A और B दोनों"],
    answer:"T-लिंफोसाइट"
},
{
    question: "जब कोई गुण एक से अधिक विपरीत जोड़ों के एलील द्वारा संचालित होता है तो उसे कहते हैं",
    option:["बहुविकल्पता","बहुअण्डजता (पॉलीइम्ब्रियोनी)","अपूर्ण प्रभाविता","इनमें से कोई नहीं"],
    answer:"बहुविकल्पता"
},
{
    question: "एक क्षेत्र विशेष में प्राथमिक उत्पादकों की संख्या अधिकतम किसमें होगी?",
    option:["घास के मैदान पारिस्थितिक तंत्र में","जंगल पारिस्थितिक तंत्र में","जलाशय पारिस्थितिक तंत्र में","मरुस्थल में"],
    answer:"जलाशय पारिस्थितिक तंत्र में"
},
{
    question: "एक gene द्वारा कई फीनोटाइप के नियंत्रण की क्रियाविधि को कहते हैं",
    option:["Epistasis","Pleiotropism","सह-वर्चस्व","Multiple allelism"],
    answer:"Pleiotropism"
},
{
    question: "कृत्रिम वीर्य-सेचन में निषेचित अंडों को किस अवस्था में निकाला जाता है?",
    option:["4–12 कोशिका अवस्था में","8–16 कोशिका अवस्था में","8–32 कोशिका अवस्था में","इनमें सभी अवस्था में"],
    answer:"8–32 कोशिका अवस्था में"
},
{
    question: "पुनरावृत्ति का सिद्धांत प्रतिपादित किया गया है",
    option:["वॉन बेयर द्वारा","डार्विन द्वारा","हेकल द्वारा","अरस्तू द्वारा"],
    answer:"हेकल द्वारा"
},
{
    question: "निम्नांकित में कौन सहजीवी संबंध द्वारा नाइट्रोजन स्थिर करता है?",
    option:["वॉलवक्स","राइजोबियम","कारा","इनमें से कोई नहीं"],
    answer:"राइजोबियम"
},
{
    question: "प्रोटीन की मुख्य संरचनात्मक विशेषता है:",
    option:["ईथर बंधन","इस्टर बंधन","पेप्टाइड बंधन","उपरोक्त सभी"],
    answer:"पेप्टाइड बंधन"
},
{
    question: "निम्न में कौन एक औषधीय पौधा है?",
    option:["आम","बेल","पीपल","सर्पगन्धा"],
    answer:"सर्पगन्धा"
},
{
    question: "गर्भाशय में Decidua बाहर कब आता है?",
    option:["शिशु के जन्म के साथ","शिशु के जन्म के बाद","शिशु के जन्म के पहले","मासिक प्रवाह के समय"],
    answer:"शिशु के जन्म के बाद"
},
{
    question: "ओजोन स्तर को नष्ट कर रहा है:",
    option:["SO₂","CFCs","Smog","प्रकाश रासायनिक ऑक्सीजन"],
    answer:"CFCs"
},
{
    question: "प्लाज्मोटोमी किसमें होता है?",
    option:["हाइड्रा","ओबेलिया","ओपेलिना तथा प्लाज्मोडियम","प्लाज्मोडियम"],
    answer:"ओपेलिना तथा प्लाज्मोडियम"
},
{
    question: "निम्नलिखित में कौन-सा मक्का की प्रमुख किस्म है?",
    option:["गंगा 101","शरबती","सोनालिका","शक्ति"],
    answer:"गंगा 101"
},
{
    question: "किसी महिला में 21वें गुणसूत्र की तीन प्रतिकृतियों के कारण 47 गुणसूत्रों की उपस्थिति मुख्य लक्षण है",
    option:["डाउन-सिंड्रोम का","त्रिगुणिता का","टर्नर-सिंड्रोम का","सुपर-फीमेलनेस का"],
    answer:"डाउन-सिंड्रोम का"
},
{
    question: "चार्ल्स डार्विन ने जिस जहाज पर अपनी समुद्री यात्रा की उसका नाम था",
    option:["बीगल","फिलिप्स","एलेक्जेंडर","उपर्युक्त में कोई नहीं"],
    answer:"बीगल"
},
{
    question: "Cleavage के लिए क्या सही कथन है?",
    option:["भ्रूण का आकार बढ़ता है","कोशिका का आकार घटता है","कोशिका का आकार बढ़ता है","भ्रूण का आकार घटता है"],
    answer:"कोशिका का आकार घटता है"
},
{
    question: "अवसादी चक्र के अंतर्गत किसका चक्रीकरण होता है?",
    option:["लौह","फॉस्फोरस","(A) और (B) दोनों","इनमें से कोई नहीं"],
    answer:"फॉस्फोरस"
},
{
    question: "अंतरिक्ष यान में इनमें से मुख्यतः किनका उपयोग ऑक्सीजन उत्पादन हेतु किया जाता है?",
    option:["शैवाल","कवक","ब्रायोफैट्स","इनमें से कोई नहीं"],
    answer:"शैवाल"
},
{
    question: "पीडोजेनेसिस किस लार्वा में पाया जाता है?",
    option:["टीनिया","फैसियोला","राना","तितली"],
    answer:"फैसियोला"
},
{
    question: "छोटी गर्दन, छोटे कान और चौड़ी छाती के लक्षण संबंधित हैं",
    option:["XXX गुणसूत्र वाली महिला से","XO गुणसूत्र वाली महिला से","XX गुणसूत्र वाली महिला से","उपर्युक्त में से कोई नहीं"],
    answer:"XO गुणसूत्र वाली महिला से"
},
{
    question: "अमीबा में प्रजनन किस प्रकार होता है?",
    option:["कोनिडिया","कलिका","जेम्यूल्स","द्विखंडन द्वारा"],
    answer:"द्विखंडन द्वारा"
},
{
    question: "भारत में हरित क्रांति के लिए विकसित की गई ‘जया’ और ‘रत्ना’ किसमें हैं?",
    option:["चावल की","गेहूँ की","बाजरे की","मक्के की"],
    answer:"चावल की"
},
{
    question: "शुक्राणुजनन द्वारा एक प्राथमिक शुक्राणु कोशिका से कितने शुक्राणु बनते हैं?",
    option:["1","4","16","32"],
    answer:"4"
},
{
    question: "किसी रिट्रोवायरस में आनुवंशिक पदार्थ है:",
    option:["RNA","DNA","hn RNA","इनमें से कोई नहीं"],
    answer:"RNA"
},
{
    question: "मानवों में ‘क्राई-डु-चैट’ सिंड्रोम किसके कारण पैदा होता है?",
    option:["XX अंडे का सामान्य Y-धारक शुक्राणु द्वारा निषेचन","गुणसूत्र 5 की लघु भुजा के एक भाग की हानि","गुणसूत्र 5 की दीर्घ भुजा के एक भाग की हानि","21वें गुणसूत्र की त्रिसूत्रता"],
    answer:"गुणसूत्र 5 की लघु भुजा के एक भाग की हानि"
},
{
    question: "इनमें से किन दो विभिन्न प्रकार के जंतुओं के बीच आर्कियोप्टेरिक्स एक योजक कड़ी है?",
    option:["जल एवं भूमि","भूमि एवं पहाड़","भूमि एवं वायु","इनमें से कोई नहीं"],
    answer:"भूमि एवं वायु"
},
{
    question: "गुरुत्व के प्रभाव के विरुद्ध भूमि जो जल की मात्रा संचय करती है, उसे कहते हैं:",
    option:["भूमि की क्षमता","गुरुत्वाकर्षण बल","संचय जल","हाइग्रोस्कोपिक जल"],
    answer:"भूमि की क्षमता"
},
{
    question: "RNA का संश्लेषण होता है:",
    option:["DNA के दोनों वलय पर","DNA के sense strand पर","DNA के पूरक strand पर","cDNA पर"],
    answer:"DNA के पूरक strand पर"
},
{
    question: "निम्न में से कपास का बॉल वर्म प्रतिरोधी जीन संयोजन है:",
    option:["cry I Ac","cry II Ab","cry I Ab","cry I Ac और cry II Ab"],
    answer:"cry I Ac और cry II Ab"
},
{
    question: "HIV आक्रमण करता है:",
    option:["B-लिम्फोसाइट","एंटीबॉडीज","T-लिम्फोसाइट","एरिथ्रोसाइट्स"],
    answer:"T-लिम्फोसाइट"
},
{
    question: "घरों में हानिकारक विकिरण के मुख्य स्रोत क्या है?",
    option:["ट्यूबलाइट","रंगीन टी.वी.","चूल्हा","हीटर"],
    answer:"रंगीन टी.वी."
},
{
    question: "वायरस जनित रोग क्या है?",
    option:["मलेरिया","इन्फ्लुएंजा","डिप्थीरिया","सिफिलिस"],
    answer:"इन्फ्लुएंजा"
},
{
    question: "बारलॉग ने किसकी नई प्रजाति विकसित की?",
    option:["गेहूँ","चावल","गन्ना","आम"],
    answer:"गेहूँ"
},
{
    question: "भारत में मेथेन का प्रमुख स्रोत है:",
    option:["गन्ने के खेत","धान के खेत","गेहूँ के खेत","बागान"],
    answer:"धान के खेत"
},
{
    question: "ट्रांसजेनिक फसल में निम्न के लिए जीन होते हैं:",
    option:["नये प्रोटीन के संश्लेषण के लिए","एन्टीबायोटिक के प्रतिरोध के लिए","एन्टीबायोटिक्स के लिए एन्जाइम के निर्माण में","उपरोक्त सभी"],
    answer:"उपरोक्त सभी"
},
{
    question: "ओजोन परत वायुमंडल में कहाँ पाई जाती है?",
    option:["क्षोभमंडल","समतापमंडल","बाह्यमंडल","आयनमंडल"],
    answer:"समतापमंडल"
},
{
    question: "पृथ्वी पर जीवन की उत्पत्ति से संबंधित पुस्तक लिखी गई थी",
    option:["ओपेरिन द्वारा","हेल्डेन द्वारा","डार्विन द्वारा","इन सभी के द्वारा"],
    answer:"ओपेरिन द्वारा"
},
{
    question: "एड्स के लिए सबसे सही ड्रग है:",
    option:["Acyclovir","Didanosine","Zidovudine","Tetracycline"],
    answer:"Zidovudine"
},
{
    question: "वन संरक्षण के उपाय हैं:",
    option:["सामाजिक वनीकरण परियोजनाएँ","कृषि वनीकरण परियोजनाएँ","शहरी वनीकरण परियोजनाएँ","उपरोक्त सभी"],
    answer:"उपरोक्त सभी"
},
{
    question: "निम्नलिखित में कौन-सा tRNA का recognition है?",
    option:["एंटीकोडोन","लूप I","Loop IV","3-OH छोर"],
    answer:"एंटीकोडोन"
},
{
    question: "किसी O रक्तसमूह वाले शिशु के माता-पिता में कौन-सा रक्त समूह हो सकता है?",
    option:["B एवं B","A एवं B","O एवं O","AB एवं B"],
    answer:"O एवं O"
},
{
    question: "हार्डी-वेनबर्ग संतुलन में अदिशात्मक परिवर्तन हैं",
    option:["जीन प्रवाह","उत्परिवर्तन","आनुवंशिक अपवाहन (Genetic drift)","जीन रिकॉम्बिनेशन"],
    answer:"आनुवंशिक अपवाहन (Genetic drift)"
},
{
    question: "इनमें कौन रेस्ट्रिक्शन एंजाइम नहीं है?",
    option:["EcoRI","BamHI","HindIII","पेक्टिनेज"],
    answer:"पेक्टिनेज"
},
{
    question: "गतिशील सिलियायुक्त बीजाणु को कहते हैं:",
    option:["Aplanospores","कोनिडिया","जूस्पोर्स","ऊस्पोर्स"],
    answer:"जूस्पोर्स"
},
{
    question: "‘कतला’ मछली पाई जाती है।",
    option:["मृदुजल","कठोर जल","मृदुजल तथा कठोर जल दोनों","इनमें से कोई नहीं"],
    answer:"मृदुजल"
},
{
    question: "बीजचोल खाया जाता है",
    option:["शरीफा का","सेब का","नारंगी का","इनमें से सभी"],
    answer:"शरीफा का"
},
{
    question: "जीन चिकित्सा का पहले प्रयोग किस वर्ष किया गया था?",
    option:["1988","1989","1990","1992"],
    answer:"1990"
},
{
    question: "पैनीसिलिन एंटीबायोटिक उत्पन्न किया जाता है",
    option:["जीवाणु से","कवक से","शैवाल से","विषाणु से"],
    answer:"कवक से"
},
{
    question: "निषेचन रोकने की शल्य विधि को कहते हैं:",
    option:["Vasectomy","Tubectomy","MTP","सभी"],
    answer:"Vasectomy"
},
{
    question: "प्रोबायोटिक्स है:",
    option:["नये प्रकार का खाद्य-पदार्थ","सुरक्षित एंटीबायोटिक्स","जीवित माइक्रोबियल खाद्य पूरक","कैंसर उत्पन्न करने वाले माइक्रोब्स"],
    answer:"जीवित माइक्रोबियल खाद्य पूरक"
},
{
    question: "DNA अणु के न्यूक्लियोटाइडों का पूरक होता है:",
    option:["tRNA का नाइट्रोजनी बेस","mRNA का नाइट्रोजनी बेस","राइबोसोम का RNA","इनमें से कोई नहीं"],
    answer:"mRNA का नाइट्रोजनी बेस"
},
{
    question: "निम्नलिखित में कौन परिवर्तनशील है, परंतु खास प्रजाति के लिए स्थिर है?",
    option:["A+T=G+C","G+C=T+T","A+G=T+C","इनमें से कोई नहीं"],
    answer:"A+T=G+C"
},
{
    question: "रियो डे जेनेरो में वर्ष 1992 में संपन्न हुई पृथ्वी शिखर सम्मेलन के परिणामस्वरूप:",
    option:["लाल आँकड़े सूची का संकलन","जैव निचयों की स्थापना","जैव विविधता सम्मेलन","प्रकृति एवं प्राकृतिक"],
    answer:"जैव विविधता सम्मेलन"
},
{
    question: "DNA के पृथक्करण के दौरान जीवाणु में कौन-से एंजाइम का उपयोग किया जाता है?",
    option:["लाइसोजाइम","काइटिनेज","सेलुलेज","प्रोटीनेज"],
    answer:"लाइसोजाइम"
},
{
    question: "धतूरा के अगुणित किसके द्वारा प्राप्त होते हैं?",
    option:["भ्रूण संवर्धन","विभज्योतक संवर्धन","कैलस संवर्धन","परागकोष संवर्धन"],
    answer:"परागकोष संवर्धन"
},
{
    question: "बीज को लैंगिक जनन का उत्पाद कहा जाता है क्योंकि ये",
    option:["युग्मक के संयोजन से निर्मित होते हैं","नए पौधे को बनाते हैं","लंबी अवधि तक संग्रहित कर रखे जा सकते हैं","परागनली के संयोजन से बनते हैं"],
    answer:"युग्मक के संयोजन से निर्मित होते हैं"
},
{
    question: "दोहरा निषेचन में संयोजन होता है",
    option:["एक egg एवं दो शुक्राणु","शुक्राणु केन्द्रक एवं अंडाणु केन्द्रक के साथ ध्रुव केन्द्रक का","एक नर युग्मक egg के साथ तथा दूसरे नर युग्मक का synergid के साथ","एक नर युग्मक का egg के साथ तथा दूसरे नर युग्मक का द्वितीयक केन्द्रक के साथ"],
    answer:"एक नर युग्मक का egg के साथ तथा दूसरे नर युग्मक का द्वितीयक केन्द्रक के साथ"
},
{
    question: "प्रकृति में दो विभिन्न स्पीशीज के बीच अंतरजातीय अंतरजनन क्यों संभव नहीं हो सकता है?",
    option:["जैविक बाधाओं के चलते","पर्यावरणीय बाधाओं के चलते","दोनों प्रकार की बाधाओं के कारण","इनमें से कोई नहीं"],
    answer:"दोनों प्रकार की बाधाओं के कारण"
},
{
    question: "Genital warts एक विषाणु जनित रोग है, जो किससे होता है?",
    option:["क्लोमाइडिया ट्रैकोमेटिस द्वारा","ट्राइकोमोनास वैजाइनलिस द्वारा","ट्रेपीनेमा पैलीडम द्वारा","ह्यूमन पैपीलोमा वायरस द्वारा"],
    answer:"ह्यूमन पैपीलोमा वायरस द्वारा"
},
{
    question: "अण्डाणु में बाहर से अंदर की ओर स्तरों का निम्न में से कौन-सा क्रम होता है?",
    option:["जोना पैल्यूसिडा, पीतक कला और कोरोना रेडिऐटा","जोना पैल्यूसिडा, कोरोना रेडिऐटा और पीतक कला","कोरोना रेडिऐटा, जोना पैल्यूसिडा और पीतक कला","पीतक कला, जोना पैल्यूसिडा और कोरोना रेडिऐटा"],
    answer:"कोरोना रेडिऐटा, जोना पैल्यूसिडा और पीतक कला"
},
{
    question: "गाइनेकोमेस्टिया लक्षण है",
    option:["क्लाइनेफेल्टर्स सिंड्रोम का","टर्नर्स सिंड्रोम का","सार्स का","डाउन्स सिंड्रोम का"],
    answer:"क्लाइनेफेल्टर्स सिंड्रोम का"
},
{
    question: "जैविक शक्ति का मान निकाला जाता है:",
    option:["जन्म-दर से मृत्यु-दर घटाकर","जन्म-दर में मृत्यु-दर को जोड़कर","जन्म-दर एवं मृत्यु-दर के भागफल से","इनमें से कोई नहीं"],
    answer:"जन्म-दर से मृत्यु-दर घटाकर"
},
{
    question: "एक m-RNA में अमीनो अम्ल के कोड के लिए कितने न्यूक्लिओटाइड अनुक्रम होते हैं?",
    option:["एक","दो","तीन","चार"],
    answer:"तीन"
},
{
    question: "निम्नांकित में से किसमें 12 वर्ष में सिर्फ एक बार पुष्प खिलते हैं?",
    option:["सूर्यमुखी","पीपल","नीला कुरेंजी","नीम"],
    answer:"नीला कुरेंजी"
},
{
    question: "मृदा अपरदन को किस प्रकार रोका जा सकता है?",
    option:["मानव क्रियाकलापों को प्रतिबन्धित करके","जन्तुओं की प्रगति रोककर","वायु स्क्रीन का प्रयोग करके","श्रेष्ठ पादप आवरण से"],
    answer:"श्रेष्ठ पादप आवरण से"
},
{
    question: "“Morning after pills” से गर्भाधारण को रोका जा सकता है, यदि इसे ______ घंटे के अंदर लिया जाए।",
    option:["50","60","30","72"],
    answer:"72"
},
{
    question: "‘इकोसिस्टम’ शब्द को प्रस्तावित किया:",
    option:["ओडम ने","टेंसले ने","विटेकर ने","गोली ने"],
    answer:"टेंसले ने"
},
{
    question: "द्विनिषेचन किसमें पाया जाता है?",
    option:["आवृत्तबीजी","अनावृत्तबीजी","टेरिडोफाइट्स","ब्रायोफायट्स"],
    answer:"आवृत्तबीजी"
},
{
    question: "मेंडल अपने प्रयोगों में सफल हुए क्योंकि",
    option:["उसने मटर के पौधे को चुना","स्वतंत्र लक्षणों का अध्ययन किया गया","अत्यधिक लक्षणों को चुना गया","मटर का पौधा द्विलिंगी होता है"],
    answer:"उसने मटर के पौधे को चुना"
},
{
    question: "100 द्वितीयक अंडाणु कोशिका तथा 200 द्वितीयक शुक्राणु कोशिका से युग्मकजनन के समय कितने अंड एवं शुक्राणु बनेंगे?",
    option:["50 अंड, 100 शुक्राणु","100 अंड, 400 शुक्राणु","100 अंड, 100 शुक्राणु","200 अंड, 200 शुक्राणु"],
    answer:"100 अंड, 400 शुक्राणु"
},
{
    question: "एक DNA अणु में एडीनीन एवं थायमीन के मध्य उपस्थित हाइड्रोजन बंधों की संख्या है:",
    option:["2","3","4","8"],
    answer:"2"
},
{
    question: "निम्नलिखित न्यूक्लिक अम्ल आनुवंशिक पदार्थ और उत्प्रेरक दोनों का कार्य करता है:",
    option:["DNA","RNA","(A) और (B) दोनों","उपर्युक्त में कोई नहीं"],
    answer:"RNA"
},
{
    question: "निम्नांकित में कल्याण सोना किसकी किस्म है?",
    option:["धान","गेहूँ","मक्का","मटर"],
    answer:"गेहूँ"
},
{
    question: "वायरस के कोर में इनमें से क्या पाया जाता है?",
    option:["DNA","RNA","DNA या RNA में से कोई एक","इनमें से कोई नहीं"],
    answer:"DNA या RNA में से कोई एक"
},
{
    question: "निम्नलिखित में से कौन-सी जन्म नियंत्रण की प्राकृतिक विधि नहीं है?",
    option:["बाह्य स्खलन","आवधिक संयम","वासेक्टोमी","स्तनपान अनार्तव"],
    answer:"वासेक्टोमी"
},
{
    question: "स्टेनली मिलर का प्रयोग बताता है",
    option:["रसायनवाद","अजीवोत्पत्ति मत","जीवोत्पत्ति मत","पेनजेनेसिस"],
    answer:"रसायनवाद"
},
{
    question: "प्रोटीन संश्लेषण के लिए Initiation codon है:",
    option:["AUG","GGU","Met","AUG एवं GUG"],
    answer:"AUG"
},
{
    question: "पक्षी द्वारा परागण को कहते हैं",
    option:["Entomophily","Myrmecophily","Ornithophily","Chiropterophily"],
    answer:"Ornithophily"
},
{
    question: "कौन-सा तृतीय श्रेणी का कीटनाशक है?",
    option:["कीट रिपेलेंट्स","फेरोमोन्स","पैथोजेन्स","कीट हार्मोन एनालॉग"],
    answer:"कीट हार्मोन एनालॉग"
},
{
    question: "किसी पॉलीपेप्टाइड श्रृंखला में 100 अमीनो अम्ल हैं। इससे कितने प्रकार का प्रोटीन-निर्माण ट्रिप्लेट जेनेटिक कोड के तहत हो सकता है?",
    option:["20^100","100^20","100 × 20 × 3","100 × 3"],
    answer:"20^100"
},
{
    question: "निम्नलिखित में कौन-सा विकासवाद से युक्त है?",
    option:["विलुप्तता","विभिन्नता","प्रजनन","प्रतिस्पर्धा"],
    answer:"विभिन्नता"
},
{
    question: "द्विनिषेचन का परिणाम होता है",
    option:["बीजपत्र","बीजाण्डकाय","भ्रूणपोष","भ्रूण"],
    answer:"भ्रूणपोष"
},
{
    question: "सबसे अधिक जमीनी प्राथमिक उत्पादकता वाला पारितंत्र होता है",
    option:["तालाब","महासागर","मरुस्थल","जंगल"],
    answer:"जंगल"
},
{
    question: "बिना निषेचन के ही बीज पैदा करने की प्रक्रिया को क्या कहते हैं",
    option:["असंगजनन","परागण","त्रिसंलयन","अन्य"],
    answer:"असंगजनन"
},
{
    question: "मद चक्र (oestrus cycles) पाई जाती है",
    option:["गाय","भेड़","कुत्ता","इन सभी में"],
    answer:"इन सभी में"
},
{
    question: "निम्नलिखित में ताइचुंग-1 किसकी किस्म है?",
    option:["धान की","गेहूँ की","मक्का की","सेम की"],
    answer:"धान की"
},
{
    question: "ओजोन की मोटाई मापी जाती है:",
    option:["NTU","डॉबसन इकाई","पार्ट पर मिलियन","किलोमीटर"],
    answer:"डॉबसन इकाई"
},
{
    question: "जंक DNA किसको कहा जाता है?",
    option:["कोडिंग क्रम","नॉनकोडिंग क्रम","प्रोमोटर जीन","हिस्टोन प्रोटीन"],
    answer:"नॉनकोडिंग क्रम"
},
{
    question: "विभाजन जीन में, कोडिंग क्रम को कहते हैं:",
    option:["इंट्रोन","एक्सोन","सिस्ट्रान","ऑपेरॉन"],
    answer:"एक्सोन"
},
{
    question: "निम्न में से किस जंतु का संरक्षण असम के काजीरंगा सेंचुरी में किया जा रहा है",
    option:["भारतीय बाइसन","भारतीय शेर","भारतीय गेंडा","भारतीय हाथी"],
    answer:"भारतीय गेंडा"
},
{
    question: "निम्नांकित में कौन यौन-संचारित रोग है?",
    option:["मलेरिया","एड्स","डेंगू","इनमें से कोई नहीं"],
    answer:"एड्स"
},
{
    question: "बीज के उस अंकुरण को जिसमें बीजपत्र भूमि से ऊपर आ जाते हैं, कहते हैं",
    option:["अधोभूमिक","भूम्यूपरिक","सजीवप्रजता","इनमें से कोई नहीं"],
    answer:"भूम्यूपरिक"
},
{
    question: "कुछ जन्तुओं में होने वाली शीतनिष्क्रियता होती है:",
    option:["लयबद्ध","सामयिक","कदाचित","क्षणिक"],
    answer:"सामयिक"
},
{
    question: "एक बिन्दु उत्परिवर्तन है",
    option:["थैलेसीमिया","सिकिल सेल एनीमिया","डाउन सिंड्रोम","रतौंधी"],
    answer:"सिकिल सेल एनीमिया"
},
{
    question: "‘सहेली’ जो कि मादा गर्भनिरोधक गोली है, प्रयोग की जाती है:",
    option:["रोजाना","साप्ताहिक","तिमाही","मासिक"],
    answer:"साप्ताहिक"
},
{
    question: "पौधे जो चट्टानों पर उगते हैं, कहलाते हैं:",
    option:["ऑक्सेलोफाइट","लिथोफाइट","ऐरियोफाइट","हेलोफाइट"],
    answer:"लिथोफाइट"
},
{
    question: "ऐसे पदार्थ जिनके प्रति प्रतिरक्षा अनुक्रिया होती है, उन्हें कहते हैं:",
    option:["एलर्जन","टीका","एण्टीबॉडी","एण्टीजन"],
    answer:"एण्टीजन"
},
{
    question: "किसी दंपत्ति को दो पुत्र हैं। तीसरी संतान के पुत्री होने की संभावना है",
    option:["100%","50%","25%","12.5%"],
    answer:"50%"
},
{
    question: "एक साधारण खाद्य-श्रृंखला का सही क्रम है:",
    option:["घास → बकरी → मनुष्य","बकरी → घास → मनुष्य","मनुष्य → बकरी → घास","इनमें से कोई नहीं"],
    answer:"घास → बकरी → मनुष्य"
},
{
    question: "‘अभिसारी विकास’ प्रदर्शित होता है",
    option:["समजात अंगों द्वारा","समवृत्ति अंगों द्वारा","अवशेषी अंगों द्वारा","उपरोक्त सभी द्वारा"],
    answer:"समवृत्ति अंगों द्वारा"
},
{
    question: "किसमें परागकण का निर्माण होता है",
    option:["परागकोश","वर्तिकाग्र","तंतु","Pollen sac"],
    answer:"Pollen sac"
},
{
    question: "ग्राफियन पुटी की वृद्धि तथा परिपक्वन किसके द्वारा नियंत्रित होता है?",
    option:["FSH-LH","FSH-LTH","ACTH-LH","GH-ADH"],
    answer:"FSH-LH"
},
{
    question: "निम्न में से किसमें जल परागण होता है",
    option:["जलकुंभी","कमल","हाइड्रिला","(B) और (C) दोनों"],
    answer:"हाइड्रिला"
},
{
    question: "फ्लोराइड की सांद्रता वायुमंडल में बढ़ने से होता है:",
    option:["क्लोरोसिस","नेक्रोसिस","फ्लोरोसिस","इनमें से सभी"],
    answer:"फ्लोरोसिस"
},
{
    question: "विश्व की जलवायु को खतरा है:",
    option:["CO₂ की मात्रा बढ़ने से","O₂ की मात्रा बढ़ने से","ओजोन की मात्रा बढ़ने से","N₂ की मात्रा बढ़ने से"],
    answer:"CO₂ की मात्रा बढ़ने से"
},
{
    question: "स्टेम कोशिका किससे उत्पन्न होती है?",
    option:["योक सैक से","गर्भस्थ शिशु के यकृत से","अस्थिमज्जा से","सभी से"],
    answer:"सभी से"
},
{
    question: "क्लोरेला निम्न में से क्या है?",
    option:["जीवाणु","शैवाल","प्रोटोजोआ","एकल कोशिका प्रोटीन"],
    answer:"शैवाल"
},
{
    question: "बीडल एवं टॉटम का न्यूरोस्पोरा पर किया गया महत्वपूर्ण प्रयोग सिद्ध करता है कि:",
    option:["एक एंजाइम एक जीन को सुधारता है","एक एंजाइम एक जीन उत्पन्न करता है","एक जीन द्वारा अनेक जीन उत्पन्न होते हैं","इनमें से कोई नहीं"],
    answer:"एक एंजाइम एक जीन उत्पन्न करता है"
},
{
    question: "Bt क्या है?",
    option:["एक जीवविष प्रोटीन","एक प्रतिरोधक","पीड़कनाशक","उपरोक्त सभी"],
    answer:"एक जीवविष प्रोटीन"
},
{
    question: "प्रोकैरियोटिक आनुवंशिक तंत्र में निहित है:",
    option:["DNA + हिस्टोन्स","DNA + हिस्टोन रहित","DNA + नॉनहिस्टोन","DNA एवं हिस्टोन दोनों ही अनुपस्थित"],
    answer:"DNA + हिस्टोन रहित"
},
{
    question: "एन्टोमोफिलस पुष्पों में परागण का माध्यम होता है",
    option:["चींटी","कीट","पक्षी","हवा"],
    answer:"कीट"
},
{
    question: "निम्न में से कौन ग्रीनहाउस गैस नहीं है?",
    option:["SO₂","CH₄","CO₂","CFCs"],
    answer:"SO₂"
},
{
    question: "किसी पुष्पी पौधे में अधिकतम गुणसूत्र की संख्या 2n=265 है। पौधा लिटोरोसा में है, तो न्यूनतम संख्या है",
    option:["2n = 4","2n = 14","2n = 2","2n = 16"],
    answer:"2n = 4"
},
{
    question: "अलैंगिक जनन में कितने जीव भाग लेते हैं?",
    option:["एक","दो","तीन","एक भी नहीं"],
    answer:"एक"
},
{
    question: "पराग कणों में विशेषकर कौन-सा विटामिन होता है",
    option:["विटामिन B","विटामिन A","विटामिन D","विटामिन C"],
    answer:"विटामिन B"
},
{
    question: "न्यूक्लिक अम्ल एक प्रबल अम्ल है। इसकी अम्लता का कारण है:",
    option:["फॉस्फेट्स","शर्करा","नाइट्रोजन क्षार","हाइड्रोजन बंधन"],
    answer:"फॉस्फेट्स"
},
{
    question: "नारियल के endosperm का कौन-सा भाग liquid syncytium कहलाता है",
    option:["नारियल बीज का liquid endosperm","Endosperm TET","Endosperm का बाहरी स्तर","इनमें से सभी"],
    answer:"नारियल बीज का liquid endosperm"
},
{
    question: "विषाणु जो कैंसर उत्पन्न करते हैं, कहलाते हैं:",
    option:["अबुर्दीय विषाणु","जीवाणुभोजी","टी.एम.वी. (TMV)","कोई नहीं"],
    answer:"अबुर्दीय विषाणु"
},
{
    question: "प्रकाश रासायनिक धूम में उपस्थित शक्तिशाली तत्व जो आँखों में जलन पैदा करते हैं:",
    option:["नाइट्रिक ऑक्साइड","SO","CO₂","नाइट्रस ऑक्साइड"],
    answer:"नाइट्रस ऑक्साइड"
},
{
    question: "एफाइरा लार्वा ऑरेलिया में पाया जाता है। इसका निर्माण किस विधि से होता है?",
    option:["रिजेनरेशन","विखंडीकरण","टूटन","स्ट्रोबाइलेसन"],
    answer:"स्ट्रोबाइलेसन"
},
{
    question: "पार्थेनोजेनेसिस पाया जाता है:",
    option:["एक्सोलोटल लार्वा में","मिरासिडियम में","सर्केरिया में","स्पोरोसिस्ट एवं रेडिया लार्वा में"],
    answer:"स्पोरोसिस्ट एवं रेडिया लार्वा में"
},
{
    question: "एड्स किसके द्वारा फैलता है?",
    option:["रक्त के आदान-प्रदान","अपरा से आदान-प्रदान","लैंगिक संभोग","उपर्युक्त सभी"],
    answer:"उपर्युक्त सभी"
},
{
    question: "उभयलिंगी प्राणी है:",
    option:["मुर्गी","साँप","(A) और (B) दोनों","केंचुआ"],
    answer:"केंचुआ"
},
{
    question: "निम्नलिखित में कौन-सा थर्मोफिलिक बैक्टीरिया से निकर्षित ताप स्थिरी (Thermostable) एंजाइम है?",
    option:["RNA पॉलीमरेज","DNA polymerase","रिस्ट्रिक्शन एंडोन्यूक्लिऐज","DNA लिगेज"],
    answer:"DNA polymerase"
},
{
    question: "नारियल में तरल एवं गुद्देदार पदार्थ होता है",
    option:["भ्रूण","अन्तःभित्ती दाना","भ्रूणपोष","इनमें से कोई नहीं"],
    answer:"भ्रूणपोष"
},
{
    question: "किसी परिपक्व परागकण में कितने nuclei होते हैं",
    option:["1","2","3","4"],
    answer:"2"
},
{
    question: "आनुवंशिक कूट में कितने कूट होते हैं?",
    option:["4","165","32","64"],
    answer:"64"
},
{
    question: "प्रथम परजीवी गाय का नाम क्या था?",
    option:["रोजी","बबली","हीरा","मोती"],
    answer:"रोजी"
},
{
    question: "SO₂ प्रदूषण का सूचक है:",
    option:["शैवाल","लाइकेन","कवक","इनमें से सभी"],
    answer:"लाइकेन"
},
{
    question: "पर-परागण लाभदायक है, क्योंकि इसके परिणाम हैं",
    option:["नर संतति का जन्म लेना","कमजोर संतति","श्रेष्ठ संतति","बीज का निर्माण"],
    answer:"श्रेष्ठ संतति"
},
{
    question: "Follicles का फटना तथा ova का बाहर निकलना कहलाता है",
    option:["copulation","conjugation","ovulation","oviposition"],
    answer:"ovulation"
},
{
    question: "यदि परागण मधुमक्खी द्वारा सम्पन्न हो तो इसे कहते हैं",
    option:["Ornithophily","Myrmecophily","Entomophily","Chiropterophily"],
    answer:"Entomophily"
},
{
    question: "कानों पर बाल की बहुलता का जीन पाया जाता है",
    option:["X-क्रोमोसोम पर","Y-क्रोमोसोम पर","लिंग निर्धारणीय क्रोमोसोम पर","अलिंग क्रोमोसोम पर"],
    answer:"Y-क्रोमोसोम पर"
},
{
    question: "कोच की अवधारणा किसके लिए सही नहीं है?",
    option:["डिप्थीरिया","लेप्रोसी","टी.बी.","हैजा"],
    answer:"लेप्रोसी"
},
{
    question: "रक्त के कोलेस्ट्रॉल को कम करने के लिए स्टैटिन का प्रयोग किया जाता है, ये किससे उत्पन्न होती हैं?",
    option:["मोनोस्कस परप्यूरीयस","ट्राइकोडर्मा","स्ट्रेप्टोकोकस","इनमें से कोई नहीं"],
    answer:"मोनोस्कस परप्यूरीयस"
},
{
    question: "ओकाजाकी टुकड़ा सम्बन्धित है।",
    option:["ट्रांसवर्सन","ट्रांसलेशन","ऑटोमेशन दोनों","रेप्लीकेशन"],
    answer:"रेप्लीकेशन"
},
{
    question: "G-6-P डीहाइड्रोजीनेज की कमी किसके हीमोलाइसिस से संबंधित है?",
    option:["लिम्फोसाइट्स के","RBCs के","प्लेटलेट्स के","ल्यूकोसाइट्स के"],
    answer:"RBCs के"
},
{
    question: "एक पोषण स्तर से दूसरे में ऊर्जा प्रवाहित होती है",
    option:["5%","10%","15%","20%"],
    answer:"10%"
},
{
    question: "जीन अभियंत्रित फसलें कृषि में काफी फायदेमंद हैं, क्योंकि:",
    option:["इनकी पोषक क्षमता कम होती है","ये रासायनिक उर्वरक की पैदावार बढ़ाते हैं","ये अजैविक दबाव के प्रति ज्यादा सहनशील हैं","इनमें से सभी"],
    answer:"ये अजैविक दबाव के प्रति ज्यादा सहनशील हैं"
},
{
    question: "आनुवंशिक अभियांत्रिकी में इस्तेमाल पहला प्रतिबंधन एंजाइम का नाम क्या है?",
    option:["EcoRV","EcoRI","Hind-III","इनमें से कोई नहीं"],
    answer:"EcoRI"
},
{
    question: "जीवसंख्या के समस्त जीनों का योग कहलाता है",
    option:["जीनकोश","जीनप्रवाह","जीन बैंक","उपर्युक्त में कोई नहीं"],
    answer:"जीनकोश"
},
{
    question: "हँसियाकार रुधिराणु अरक्तता में अमीनो अम्ल संघटक होता है",
    option:["α श्रृंखला में वेलीन द्वारा ग्लूटमिक अम्ल","α श्रृंखला में ग्लूटेमिक अम्ल द्वारा वेलीन","β श्रृंखला में वेलीन द्वारा ग्लूटेमिक अम्ल","β श्रृंखला में ग्लूटेमिक अम्ल द्वारा वेलीन"],
    answer:"β श्रृंखला में वेलीन द्वारा ग्लूटेमिक अम्ल"
},
{
    question: "निषेचन क्या है",
    option:["अंडा तथा नर न्यूक्लियस का संयोजन","अंडा तथा सेकंडरी न्यूक्लियस का संयोजन","अंडा तथा सिनर्जिड का संयोजन","इनमें से कोई नहीं"],
    answer:"अंडा तथा नर न्यूक्लियस का संयोजन"
},
{
    question: "दूध में कौन-सा डाइसैकेराइड उपस्थित होता है?",
    option:["माल्टोज","ग्लैक्टोज","सुक्रोज","लैक्टोज"],
    answer:"लैक्टोज"
},
{
    question: "‘मुकुलन’ द्वारा जनन किसमें होता है?",
    option:["पेनिसिलियम","पारामिशियम","यीस्ट","इनमें से सभी में"],
    answer:"यीस्ट"
},
{
    question: "‘हे फीवर’ किससे होता है?",
    option:["विषाणु","विटामिन की कमी से","एलर्जी","कोई नहीं"],
    answer:"एलर्जी"
},
{
    question: "प्याज के युग्मक में गुणसूत्र की संख्या होती है:",
    option:["8","16","24","32"],
    answer:"16"
},
{
    question: "स्वतंत्रजीवी अवायुवीय नाइट्रोजन स्थिरीकारी जीवाणु है:",
    option:["राइजोबियम","स्ट्रेप्टोकोकस","एजोटोबैक्टर","क्लोस्ट्रीडियम"],
    answer:"क्लोस्ट्रीडियम"
},
{
    question: "पारिस्थितिक तंत्र में आहार-स्तर को कहा जाता है:",
    option:["उत्पादक स्तर","उपभोक्ता स्तर","शाकाहारी स्तर","पोषण स्तर"],
    answer:"पोषण स्तर"
},
{
    question: "सर्वोत्तम दुधारू नस्ल के पशु हैं।",
    option:["लाल सिंधी (Red Sindhi)","होल्सटिन-फ्रिजियन","साहिवाल","इनमें से कोई नहीं"],
    answer:"होल्सटिन-फ्रिजियन"
},
{
    question: "अंतर-संकरण से वृद्धि होती है।",
    option:["समजातता में","विषमजातता में","दोनों में","इनमें से कोई नहीं"],
    answer:"विषमजातता में"
},
{
    question: "कतला पाई जाती है।",
    option:["अलवणीय जल में","खारे जल में","अलवणीय तथा लवणीय दोनों प्रकार के जल में","किसी भी जल में"],
    answer:"अलवणीय जल में"
},
{
    question: "मोनोसोमी तथा ट्राइसोमी को निम्नवत् निरूपित किया जा सकता है।",
    option:["2n + 1, 2n + 3","2n – 1, 2n – 2","2n, 2n + 1","2n – 1, 2n + 1"],
    answer:"2n – 1, 2n + 1"
},
{
    question: "जन्मदर नियंत्रण की विधि कौन-सी है?",
    option:["GIFT","IVF-ET","IUCDs","ICSI"],
    answer:"IUCDs"
},
{
    question: "जल प्रदूषण का सामान्य सूचक जीव है:",
    option:["Lemna paucicostata","Eichhornia crassipes","Escherichia coli","Entamoeba histolytica"],
    answer:"Escherichia coli"
},
{
    question: "द्विगुणित है",
    option:["अंड","पराग","(A) और (B) दोनों","युग्मनज"],
    answer:"युग्मनज"
},
{
    question: "वीर्य संचित किया जाता है।",
    option:["तरल ऑक्सीजन में","तरल नाइट्रोजन में","तरल सोडियम में","इनमें से कोई नहीं"],
    answer:"तरल नाइट्रोजन में"
},
{
    question: "अगर जैवमंडल से कार्बन डाइऑक्साइड को हटा दिया जाए तो कौन-से जीव पर सर्वप्रथम बुरा असर पड़ेगा?",
    option:["प्राथमिक उत्पादक","उत्पादक","द्वितीयक उपभोक्ता","तृतीय उपभोक्ता"],
    answer:"प्राथमिक उत्पादक"
},
{
    question: "आनुवंशिक पदार्थ का उत्परिवर्तन से प्रभावित होने वाला छोटे-से-छोटा खंड है",
    option:["रीकॉन","सिस्ट्रॉन","म्यूटॉन","एक्सॉन"],
    answer:"म्यूटॉन"
},
{
    question: "ताजमहल किसके द्वारा नष्ट हो सकता है?",
    option:["यमुना नदी में बाढ़ से","संगमरमर के उच्च ताप पर अपघटन से","मथुरा के तेल शोधक कारखाने से निकली SO₂ से","उपरोक्त सभी से"],
    answer:"मथुरा के तेल शोधक कारखाने से निकली SO₂ से"
},
{
    question: "समीकरण dN/dt = rN किसे निरूपित करता है?",
    option:["जन्म दर","वृद्धि दर","मृत्यु दर","उपर्युक्त सभी"],
    answer:"वृद्धि दर"
},
{
    question: "क्लोन की पहचान करते हैं",
    option:["PCR से","जेल इलेक्ट्रोफोरेसिस से","ऑटोरेडियोग्राफी से","इनमें से सभी"],
    answer:"ऑटोरेडियोग्राफी से"
},
{
    question: "उर्ध्ववर्ती/शिखरांग (upright) पिरामिड वह पिरामिड है जो",
    option:["ऊर्जा पिरामिड जो सदैव खड़ी अवस्था में होते हैं","ऊर्जा पिरामिड जो सदैव उलटी अवस्था में अधोवर्ती रहती है","(A) और (B) दोनों","इनमें से कोई नहीं"],
    answer:"ऊर्जा पिरामिड जो सदैव खड़ी अवस्था में होते हैं"
},
{
    question: "लिंकेज (सहलग्नता) की खोज किसने की थी?",
    option:["मेंडल","मॉर्गन","पुनेट","मूलर"],
    answer:"मॉर्गन"
},
{
    question: "निम्नांकित में से कौन जैव-उर्वरक है?",
    option:["माइकोराइजा","किया","एजोबैक्टर","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "हिसारडेल (Hisardale) किसकी किस्म है?",
    option:["गाय की","भैंस की","भेड़ की","मछली की"],
    answer:"भेड़ की"
},
{
    question: "निम्नलिखित में कौन यौन संचारित रोग है?",
    option:["टायफायड","हैजा","मलेरिया","सिफिलिस"],
    answer:"सिफिलिस"
},
{
    question: "अंड प्रजक है",
    option:["मुर्गी","साँप","मगरमच्छ","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "Implantation से पहले भ्रूण को पोषण मिलता है",
    option:["Ovary से","अंडवाहिनी से","गर्भाशय के स्रावण से","अपने ही yolk से"],
    answer:"गर्भाशय के स्रावण से"
},
{
    question: "एक स्वस्थ महिला के पूरे जीवन काल में उत्पन्न कुल अंडों की संख्या होती है",
    option:["4000","400","40","365"],
    answer:"400"
},
{
    question: "इकोलॉजी शब्द किसने दिया है?",
    option:["ओडम","हैकल","हॉरवे","इनमें से कोई नहीं"],
    answer:"हैकल"
},
{
    question: "परखनली शिशुओं को उत्पन्न करने में",
    option:["निषेचन बाह्य होता है व भ्रूण का निर्माण अन्दर होता है","निषेचन अन्तः होता है व भ्रूण निर्माण बाह्य होता है","निषेचन व भ्रूण निर्माण दोनों ही अन्दर होते हैं","निषेचन व भ्रूण निर्माण दोनों बाह्य होते हैं"],
    answer:"निषेचन बाह्य होता है व भ्रूण का निर्माण अन्दर होता है"
},
{
    question: "मनुष्य में वह प्रतिरक्षा जो जन्म के समय से मौजूद रहती है, कहलाती है:",
    option:["सहज प्रतिरक्षा","उपार्जित प्रतिरक्षा","स्वप्रतिरक्षा","निष्क्रिय प्रतिरक्षा"],
    answer:"सहज प्रतिरक्षा"
},
{
    question: "एक पारिस्थितिक तंत्र में हरे पौधे हैं",
    option:["उत्पादक","उपभोक्ता","अपघटक","इनमें कोई नहीं"],
    answer:"उत्पादक"
},
{
    question: "एक्सोन्यूक्लिएज के संदर्भ में कौन-सा वाक्य गलत है?",
    option:["DNA के सिरे से न्यूक्लियोटाइड को अलग करते हैं।","यह DNA को भीतर विशिष्ट स्थलों पर काटते हैं।","ये न्यूक्लियोटाइड को अलग करने के अतिरिक्त भीतर विशिष्ट स्थलों पर काटते हैं।","ये न्यूक्लीएज एंजाइमों के एक बड़े वर्ग के सदस्य हैं।"],
    answer:"यह DNA को भीतर विशिष्ट स्थलों पर काटते हैं।"
},
{
    question: "Parturition के लिए संकेत (Signal) कहाँ से शुरू होता है?",
    option:["प्लासेंटा","प्लासेंटा तथा पूर्ण विकसित गर्भस्थ शिशु","माता के पिट्यूटरी से स्रावित oxytocin द्वारा","पूर्ण विकसित गर्भस्थ शिशु द्वारा"],
    answer:"प्लासेंटा तथा पूर्ण विकसित गर्भस्थ शिशु"
},
{
    question: "रेबीज का टीका किसने प्रचलित किया?",
    option:["जेनर","पाश्चर","डार्विन","लैमार्क"],
    answer:"पाश्चर"
},
{
    question: "सफेद चीता मध्यप्रदेश में कहाँ सुरक्षित है?",
    option:["रीवा","भोपाल","इंदौर","ग्वालियर"],
    answer:"रीवा"
},
{
    question: "जलीय समुदाय में प्राथमिक उपभोक्ता होते हैं:",
    option:["मांसाहारी","मृतभोजी","शाकाहारी","सर्वाहारी"],
    answer:"शाकाहारी"
},
{
    question: "एक विवाहित जोड़े की पहले से तीन पुत्रियाँ हैं। अब चौथी संतान की सोच रहे हैं। इस भावी संतान के पुत्र होने की संभावना कितने प्रतिशत होगी?",
    option:["100%","50%","25%","0%"],
    answer:"50%"
},
{
    question: "निम्नलिखित में कौन-सा जैव घटक है?",
    option:["मृदा","वाष्प","जल","सभी"],
    answer:"मृदा"
},
{
    question: "किसी द्विकुंडलित DNA के वलय में क्षार श्रृंखला के बीच की दूरी होती है?",
    option:["0.34 nm","34 nm","5 Å","10"],
    answer:"0.34 nm"
},
{
    question: "जीवाणु के अनुलेखन इकाई में संरचनात्मक जीन होता है:",
    option:["मोनोसिस्ट्रॉनीक","पॉलीसिस्ट्रॉनीक","नॉनसिस्ट्रॉनीक","उपर्युक्त में कोई नहीं"],
    answer:"पॉलीसिस्ट्रॉनीक"
},
{
    question: "इडली-डोसा के आटे में कौन-सा सूक्ष्मजीव प्रयुक्त होता है?",
    option:["यीस्ट","जीवाणु","विषाणु","इनमें से सभी"],
    answer:"यीस्ट"
},
{
    question: "गर्भधारण के बाद माता के मूत्र में कौन-सा हार्मोन होता है?",
    option:["LH","प्रोजेस्ट्रॉन","FSH","HCG"],
    answer:"HCG"
},
{
    question: "किसी Dihybrid cross के लिए Independent assortment के नियम के अनुसार क्या सही है?",
    option:["F2 वंशज में 4 genotypes होते हैं","F2 में 16 phenotypes होते हैं","दोनों Characters के लिए केवल एक individual homozygous recessive होता है","विभिन्न phenotypes की भविष्यवाणी संभव नहीं है"],
    answer:"दोनों Characters के लिए केवल एक individual homozygous recessive होता है"
},
{
    question: "DNA को देखने के लिए प्रयोग किया जाता है:",
    option:["इथीडियम ब्रोमाइड","एनीलीन ब्लू","सेफ्रेनीन","फास्ट ग्रीन"],
    answer:"इथीडियम ब्रोमाइड"
},
{
    question: "आयु संरचना का ज्यामितीय निरूपण किसकी विशिष्टता है?",
    option:["जैविक समुदाय का","समष्टि","भूदृश्य","पारितंत्र"],
    answer:"समष्टि"
},
{
    question: "निम्नलिखित में अनुलेखन और स्थानांतरण साथ-साथ संपन्न हो सकते हैं:",
    option:["जीवाणु","सुकेन्द्रकी","यीस्ट","उपर्युक्त में कोई नहीं"],
    answer:"जीवाणु"
},
{
    question: "माइक्रोस्फीयर्स नाम किसने दिया था?",
    option:["सिडनी फॉक्स","ओपेरिन","मिलर","यूरे"],
    answer:"सिडनी फॉक्स"
},
{
    question: "इनमें से कौन श्रृंखला प्रारंभन कोडॉन है?",
    option:["AUG","CCC","UAG","UAA"],
    answer:"AUG"
},
{
    question: "निम्नलिखित में कौन-सा रेशेदार प्रोटीन का उदाहरण है?",
    option:["इंसुलिन","हीमोग्लोबिन","फाइब्रोजन","ग्लूकोजन"],
    answer:"फाइब्रोजन"
},
{
    question: "निम्नलिखित में से किसमें युग्मक स्थानान्तरण के लिए जल की आवश्यकता नहीं होती?",
    option:["शैवाल","ब्रायोफाइट्स","टेरिडोफाइट्स","जिम्नोस्पर्म"],
    answer:"जिम्नोस्पर्म"
},
{
    question: "SCP प्राप्त किया जाता है।",
    option:["क्लोरेला","स्पाइरुलिना","स्केनेडेसमस","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "कोएसरवेट्स को प्रायोगिक रूप से किसके द्वारा उत्पन्न किया गया?",
    option:["ओपेरिन व सिडनी फॉक्स","फिशर व हक्सले","जेकब व मोनॉड","यूरे व मिलर"],
    answer:"ओपेरिन व सिडनी फॉक्स"
},
{
    question: "पिस्टिया में कायिका प्रवर्धन किसके द्वारा होता है?",
    option:["स्टॉलोन","ऑफसेट","रनर","सकर"],
    answer:"ऑफसेट"
},
{
    question: "प्रतिकृति के दौरान DNA पॉलीमरेज द्वारा बहुलकन की दिशा होती है।",
    option:["5′ से 3′","3′ से 5′","5′ से 5′","3′ से 3′"],
    answer:"5′ से 3′"
},
{
    question: "निम्नलिखित क्षार का दूसरा नाम 5-मिथिल यूरैसिल है:",
    option:["एडेनीन","गुआनीन","थायमीन","साइटोसीन"],
    answer:"थायमीन"
},
{
    question: "जलीय फर्न जो जैव-उर्वरक का बेहद अच्छा उदाहरण है:",
    option:["साल्विनिया","एजोला","मार्सिलिया","टेरिडियम"],
    answer:"एजोला"
},
{
    question: "विभिन्नताओं का परम स्रोत है",
    option:["समसूत्री","अर्धसूत्री","निषेचन","उत्परिवर्तन"],
    answer:"उत्परिवर्तन"
},
{
    question: "इनमें से किसके द्वारा डेंगू का विस्तार होता है?",
    option:["सी सी मक्खी","मच्छर","प्रदूषित वायु","इनमें से कोई नहीं"],
    answer:"मच्छर"
},
{
    question: "किसी पुष्पीय पौधे में एक Pollen mother cell से एक mature gametophyte का निर्माण होता है",
    option:["3 समसूत्री विभाजन द्वारा","1 अर्द्धसूत्री एवं 3 सूत्री विभाजन द्वारा","1 अर्द्धसूत्री एवं 2 समसूत्री विभाजन द्वारा","एकल अर्द्धसूत्री विभाजन द्वारा"],
    answer:"1 अर्द्धसूत्री एवं 2 समसूत्री विभाजन द्वारा"
},
{
    question: "निकट संबंधी के बीच अंतःप्रजनन द्वारा होता है:",
    option:["विभिन्नताओं में ह्रास","विभिन्नताओं में वृद्धि","वर्चस्व में ह्रास","इनमें से कोई नहीं"],
    answer:"विभिन्नताओं में ह्रास"
},
{
    question: "वायु परागण में होता है",
    option:["Salvia","Vallisneria","नारियल (Coconut)","बॉटल-ब्रुश (Bottle Brush)"],
    answer:"नारियल (Coconut)"
},
{
    question: "वन-पारितंत्र में शेर का पोषण स्तर है:",
    option:["T₃","T₄","T₂","T₁"],
    answer:"T₄"
},
{
    question: "हार्डी-वेनबर्ग को लागू किया जा सकता है, इनमें से किसकी अनुपस्थिति में?",
    option:["उत्परिवर्तन","प्राकृतिक चयन","पुनर्संयोजन","इन सभी की अनुपस्थिति में"],
    answer:"इन सभी की अनुपस्थिति में"
},
{
    question: "Sertoli cells का नियंत्रण पिट्यूटरी के किस हार्मोन द्वारा होता है?",
    option:["GH","प्रोलेक्टिन","LH","FSH"],
    answer:"FSH"
},
{
    question: "गोल्डेन राइस में किस विटामिन को स्थानांतरित किया गया है?",
    option:["विटामिन A","विटामिन B12","विटामिन C","विटामिन D"],
    answer:"विटामिन A"
},
{
    question: "धान के खेतों में सामान्य नाइट्रोजन स्थिरीकारक है:",
    option:["राइजोबियम","एजोस्पाइरिलम","ऑसिलेटोरिया","फ्रेंकिया"],
    answer:"एजोस्पाइरिलम"
},
{
    question: "अनुन्मील्य परागण वाले पौधों में निश्चित रूप से होता है",
    option:["स्व-परागण","पर-परागण","दोनों","इनमें से कोई नहीं"],
    answer:"स्व-परागण"
},
{
    question: "सुन्दरवन राष्ट्रीय उद्यान स्थित है",
    option:["राजस्थान","मध्यप्रदेश","पश्चिम बंगाल","उत्तरप्रदेश"],
    answer:"पश्चिम बंगाल"
},
{
    question: "निम्नलिखित में सही का चुनाव करें:",
    option:["स्पंज का जूस्पोर","पेनिसिलियम में जेम्यूलस","शैवाल में कोनिडिया","हाइड्रा की कलिका (bud)"],
    answer:"हाइड्रा की कलिका (bud)"
},
{
    question: "म्यूटाजेन कौन-सा है?",
    option:["एक्स-रे","रेडियोऐक्टिव किरण","सरसों गैस","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "लैक ओपेरॉन एवं ट्रिप्टोफान ओपेरॉन सही ढंग से जीन की क्रियाविधि दर्शाते हैं",
    option:["बैक्टिरिया में","कवक में","यूकैरिओट्स में","इनमें से कोई नहीं"],
    answer:"बैक्टिरिया में"
},
{
    question: "प्रतिबंधन एंडोन्यूक्लिएज का मुख्य उपयोग होता है:",
    option:["जीन लाइब्रेरी में","भौतिक प्रतिबंधन मानचित्र बनाने में","जीन क्लोनिंग में","इन सभी में"],
    answer:"इन सभी में"
},
{
    question: "परागकणों के लघु बीजाणु उत्पन्न होने में लघुबीजाणु मातृ कोशिका में",
    option:["एक अर्द्धसूत्री विभाजन","एक समसूत्री विभाजन","एक अर्द्धसूत्री एवं एक समसूत्री विभाजन","एक अर्द्धसूत्री एवं दो समसूत्री विभाजन"],
    answer:"एक अर्द्धसूत्री एवं एक समसूत्री विभाजन"
},
{
    question: "नर में Andropause किसके समतुल्य है?",
    option:["Androgen binding protein","Female menopause","प्रोस्टाग्लाडिन","एंड्रोजन"],
    answer:"Female menopause"
},
{
    question: "अण्डवाहिनी का अंतिम भाग कहलाता है",
    option:["इस्थमस","एम्पुला","फिम्ब्री","इनफन्डीबुलम"],
    answer:"इस्थमस"
},
{
    question: "PCR से जाँच होती है:",
    option:["HIV का","कैंसर का","क्षयरोग का","हैजा का"],
    answer:"HIV का"
},
{
    question: "प्रतिबंधन एण्डोन्यूक्लिएज काटता है:",
    option:["एक DNA रज्जु को विशिष्ट स्थल पर","DNA के दोनों रज्जुओं को","DNA के दोनों रज्जुओं को किसी भी स्थल पर","एकल रज्जुकी RNA को"],
    answer:"DNA के दोनों रज्जुओं को"
},
{
    question: "शांत घाटी (Silent Valley) राष्ट्रीय उद्यान स्थित है",
    option:["केरल में","तमिलनाडु में","छत्तीसगढ़ में","हैदराबाद में"],
    answer:"केरल में"
},
{
    question: "डार्विन ने किस जहाज पर भ्रमण किया?",
    option:["H.M.S. ईगल","H.M.S. बीगल","टारटोनिक","डी. मैट्रिका"],
    answer:"H.M.S. बीगल"
},
{
    question: "एक जीन जोड़ा दूसरे जीन जोड़े के प्रभाव को दबा देता है। इस घटना को कहते हैं",
    option:["एपिस्टैसिस","प्रभाविता","उत्परिवर्तन","इनमें से कोई नहीं"],
    answer:"एपिस्टैसिस"
},
{
    question: "अपघटक (Decomposer) होते हैं",
    option:["स्वपोषी","स्वतः विषमपोषी","आर्गेनोट्रॉफ्स","विषमपोषी"],
    answer:"विषमपोषी"
},
{
    question: "भारत में कितने जैवभौगोलिक क्षेत्र हैं?",
    option:["10","13","4","5"],
    answer:"10"
},
{
    question: "निम्न में से किसे कॉपर-टी रोकता है?",
    option:["निषेचन","अण्डोत्सर्ग","वीर्य पतन","आरोपण"],
    answer:"निषेचन"
},
{
    question: "जब संकटोत्पन्न पादपों तथा जंतुओं को उनके प्राकृतिक आवास से अलग एक विशेष स्थान पर उनकी देखभाल की जाती है, उसे कहते हैं",
    option:["स्वस्थाने","बाह्य स्थाने","क्रायोप्रिजर्वेशन","इनमें से कोई नहीं"],
    answer:"बाह्य स्थाने"
},
{
    question: "एक गुणसूत्र के दो नजदीकी जीनों के बीच होगा",
    option:["दोहरा क्रॉसिंग ओवर","कोई क्रॉसिंग ओवर नहीं","बहुत कम क्रॉसिंग ओवर","नियमित क्रॉसिंग ओवर"],
    answer:"बहुत कम क्रॉसिंग ओवर"
},
{
    question: "एकबीजपत्री में ग्राफ्टिंग बिरले ही सफल होता है क्योंकि:",
    option:["एकबीजपत्री में बंद वैस्कुलर बंडल होता है","एकबीजपत्री कैम्बियमविहीन होते हैं","समानान्तर venation होता है","एक से अधिक सही"],
    answer:"एकबीजपत्री कैम्बियमविहीन होते हैं"
},
{
    question: "RNA में निहित प्यूरिन हैं:",
    option:["गुआनीन एवं एडिनीन","यूरसिल एवं थायमीन","एडिनीन एवं साइटोसीन","यूरासिल एवं गुआनीन"],
    answer:"गुआनीन एवं एडिनीन"
},
{
    question: "Menstruation का तत्काल कारण किस हार्मोन की वापसी है?",
    option:["FSH","FSH-RH","Progesterone","Estrogen"],
    answer:"Progesterone"
},
{
    question: "ताजमहल की सुंदरता को नष्ट कर रहा है:",
    option:["ताप","यमुना नदी का प्रदूषित जल","वायु प्रदूषक","उपर्युक्त सभी"],
    answer:"वायु प्रदूषक"
},
{
    question: "DNA की दो पॉलिन्यूक्लिओटाइड श्रृंखलाएँ कैसी होती हैं?",
    option:["समांतर","असन्तत","प्रतिसमान्तर","अर्द्धसंरक्षी"],
    answer:"प्रतिसमान्तर"
},
{
    question: "बीजांड के बीजांडकाय में पाई जाने वाली रचना जो स्पोरोफाइट की अंतिम है, उसे क्या कहते हैं",
    option:["गुरुबीजाणु मातृकोशिका","लघुबीजाणु मातृकोशिका","सहायक कोशिका","इनमें से कोई नहीं"],
    answer:"गुरुबीजाणु मातृकोशिका"
},
{
    question: "जीवन की अतिरिक्त स्थलीय उत्पत्ति किसके द्वारा बताई गयी?",
    option:["कैटेस्ट्रॉफिज्म","जाति निर्माण","पैन्सपरमिया","स्वतः उत्पत्ति"],
    answer:"पैन्सपरमिया"
},
{
    question: "जब कोई जीन-जोड़ा दूसरे के प्रभाव को छिपा देता है, तो इसे कहते हैं",
    option:["उत्परिवर्तन","प्रभाविता","Epistasis","इनमें से कोई नहीं"],
    answer:"Epistasis"
},
{
    question: "इनमें द्विखण्डन किसमें पाया जाता है?",
    option:["जलकुम्भी","कमल","अमीबा","सर्प"],
    answer:"अमीबा"
},
{
    question: "Cryptorchidism की अवस्था में वृषण",
    option:["ऑपरेशन द्वारा बाहर निकाल दिया जाता है","भ्रूण में वृषण विकसित नहीं हो पाता है","शुक्राणु उत्पन्न होने से वृषण असमर्थ होता है","वृषण scrotum में जाने में असमर्थ होता है"],
    answer:"वृषण scrotum में जाने में असमर्थ होता है"
},
{
    question: "क्रॉसिंग ओवर किस अवस्था में होता है?",
    option:["लेप्टोटीन","सायटोकाइनेसिस","पैकीटीन","डायकाइनेसिस"],
    answer:"पैकीटीन"
},
{
    question: "निम्नलिखित में कौन-सा एंटीबॉडी एलर्जी शुरू करता है?",
    option:["IgM","IgE","IgD","IgA"],
    answer:"IgE"
},
{
    question: "छोटी समष्टि से एलील का आकस्मिक विलोपन है",
    option:["अनुकूलन","आनुवंशिक अपवाहन","जाति निर्माण कारक","चयनात्मक दाब"],
    answer:"आनुवंशिक अपवाहन"
},
{
    question: "किसी हाइब्रिड क्रॉस में संतति का जीनोटाइपिक अनुपात होता है",
    option:["9 : 3 : 3 : 1","1 : 1 : 1 : 1","1 : 2 : 1","1 : 7 : 1"],
    answer:"1 : 2 : 1"
},
{
    question: "वलयाकार माइटोकोंड्रिया (Nebenkern) का अक्षीय तंतु के चारों ओर Arrangement कहाँ होता है?",
    option:["Head","मध्यपीस","पूँछ का end piece","पूँछ का मुख्य पीस"],
    answer:"मध्यपीस"
},
{
    question: "गैमीट के निर्माण को कहते हैं:",
    option:["गैमीटोजेनेसिस","सायटोकायनेसिस","स्पोरोजेनेसिस","मियोसायट"],
    answer:"गैमीटोजेनेसिस"
},
{
    question: "संकरण की पहचान किसके द्वारा की जाती है?",
    option:["PCR","ऑटोरेडियोग्राफी","ELISA","इलेक्ट्रोफोरेसिस"],
    answer:"ऑटोरेडियोग्राफी"
},
{
    question: "एक ही स्थान पर उपस्थित रहने वाले जीन, जिनकी विभिन्न अभिव्यक्ति हो, कहलाते हैं:",
    option:["बहुअलील","बहुजीन","ओंकोजीन","सहप्रभाविता जीन"],
    answer:"बहुजीन"
},
{
    question: "ग्राम (+) और ग्राम (-) बैक्टीरिया में भिन्नता पाई जाती है उनके",
    option:["कोशिका भित्ति में","केन्द्रक में","मेसोसोम में","इनमें से कोई नहीं"],
    answer:"कोशिका भित्ति में"
},
{
    question: "सबसे बड़ा पारितंत्र है",
    option:["वन का पारितंत्र","समुद्री पारितंत्र","तालाब का पारितंत्र","घास स्थल का पारितंत्र"],
    answer:"समुद्री पारितंत्र"
},
{
    question: "मछली का मांस अन्य जानवरों के मांस से अच्छा है, क्योंकि इसमें प्रचुर मात्रा में पाया जाता है।",
    option:["प्रोटीन","जल","वसा","स्टार्च"],
    answer:"प्रोटीन"
},
{
    question: "दो Microsporangia युक्त Monothecous परागकोश किसमें पाया जाता है",
    option:["ब्रासिका","धनियाँ","लिग्यूम्स","हिबिस्कस"],
    answer:"हिबिस्कस"
},
{
    question: "सरदार सरोवर बांध इस नदी पर बना है",
    option:["झेलम पर","नर्मदा पर","ताप्ती पर","व्यास पर"],
    answer:"नर्मदा पर"
},
{
    question: "पारितंत्र शब्द किसने दिया?",
    option:["खुराना","एलेनबर्ग","A.G. टांसले","इनमें से कोई नहीं"],
    answer:"A.G. टांसले"
},
{
    question: "ओजोन दिवस कब मनाया जाता है?",
    option:["5 सितम्बर","16 सितम्बर","25 दिसम्बर","30 जनवरी"],
    answer:"16 सितम्बर"
},
{
    question: "इनमें से कौन-सी ग्रीनहाउस गैस है?",
    option:["मीथेन","कार्बन डाइऑक्साइड","क्लोरोफ्लोरोकार्बन","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "निम्नलिखित में जलीय घास कौन-सी है",
    option:["वैलिसनैरिया","हाइड्रिला","जोस्टेरा","इनमें से सभी"],
    answer:"जोस्टेरा"
},
{
    question: "Tapetum जो ovule में बदलाव हो, कहलाता है",
    option:["Amoeboid tapetum","Glandular tapetum","Integumentary tapetum","Flagellar tapetum"],
    answer:"Integumentary tapetum"
},
{
    question: "सापेक्षिक जैविक संतुलन के ह्रास का कारण है:",
    option:["निम्न तापमान","उच्च तापमान","विकिरण","प्रदूषण"],
    answer:"प्रदूषण"
},
{
    question: "ट्रांसक्रिप्शन की समाप्ति किसके द्वारा होती है?",
    option:["को-प्रोटीन के द्वारा","सिग्मा फैक्टर के द्वारा","रो-प्रोटीन द्वारा","ओमेगा फैक्टर के द्वारा"],
    answer:"रो-प्रोटीन द्वारा"
},
{
    question: "जब संतति की उत्पत्ति एकल जनक द्वारा होती है तब यह क्या कहलाता है?",
    option:["लैंगिक जनन","अलैंगिक जनन","(A) और (B) दोनों","आंतरिक निषेचन"],
    answer:"अलैंगिक जनन"
},
{
    question: "ओपेरॉन मॉडल किसने प्रस्तावित किया?",
    option:["नीरेनबर्ग ने","जैकब तथा मोनॉड ने","खुराना","मेथाई"],
    answer:"जैकब तथा मोनॉड ने"
},
{
    question: "सुंदरवन का संरक्षित जैवमंडल भारत के किस राज्य के अंतर्गत है?",
    option:["बिहार","उत्तर प्रदेश","असम","पश्चिम बंगाल"],
    answer:"पश्चिम बंगाल"
},
{
    question: "मिनीमाता रोग होता है:",
    option:["क्रोमियम द्वारा","कैडमियम के द्वारा","मिथाइल मरकरी द्वारा","रेडियोएक्टिव तत्व के द्वारा"],
    answer:"मिथाइल मरकरी द्वारा"
},
{
    question: "प्रतिबंधन एंजाइम Hind-III का स्रोत है:",
    option:["ई. कोलाई","बी. कोलाई","बैसीलस","हीमोफीलस इन्फ्लूएंजी"],
    answer:"हीमोफीलस इन्फ्लूएंजी"
},
{
    question: "न्यूमैटोफोर सामान्यतः पाए जाते हैं:",
    option:["मरुद्भिदों में","जलोड्भिदों में","मीसोफाइट्स में","लवणोद्भिदों में"],
    answer:"लवणोद्भिदों में"
},
{
    question: "बेकरी में प्रयोग होने वाला यीस्ट है:",
    option:["सैकरोमाइसीज सेरीवाइसी","सैकरोमाइसीज ऑक्टोस्पोरस","सैकरोमाइसीज क्यूकोराइस","राइजोसेकरोमायसीज"],
    answer:"सैकरोमाइसीज सेरीवाइसी"
},
{
    question: "महिलाओं में शल्यक्रिया द्वारा बंध्याकरण प्रक्रिया को कहते हैं:",
    option:["नलिका उच्छेदन","शुक्रवाहक उच्छेदन","प्रत्यारोपण","रोधक"],
    answer:"नलिका उच्छेदन"
},
{
    question: "Follicles का फटना तथा ova का बाहर निकलना कहलाता है",
    option:["मैथुन","संयुग्मन","अंडोभेदन","अंडीकरण"],
    answer:"अंडोभेदन"
},
{
    question: "लिंग जाँच की कौन-सी विधि का सबसे अधिक दुरुपयोग किया जाता है?",
    option:["Clotting test","अम्नियोसेंटेसिस","इरिथ्रोब्लास्टोसिस","एंजीओग्राम"],
    answer:"अम्नियोसेंटेसिस"
},
{
    question: "आनुवंशिक रूप से एक समान जीवों को ऊतक कल्चर के द्वारा विकसित किया जाता है, इसे कहते हैं:",
    option:["ग्राफ्टिंग","क्लोनिंग","प्लाज्मिड","संकरण"],
    answer:"क्लोनिंग"
},
{
    question: "भूमि की उर्वरा शक्ति को परिभाषित करने वाला जीव समूह है:",
    option:["माइक्रोब्स","जैविक खाद","यीस्ट","जैविक कीटाणुनाशक"],
    answer:"माइक्रोब्स"
},
{
    question: "क्रमिक विकास में योगदान है",
    option:["स्व-परागण का","पर-परागण का","कायिक प्रवर्धन का","संकरण का"],
    answer:"पर-परागण का"
},
{
    question: "किस जीन के साथ एंजाइम RNA पॉलिमरेज जुटा हुआ रहता है?",
    option:["नियंत्रक जीन","प्रोमोटर जीन","संरचनात्मक जीन","ऑपरेटर जीन"],
    answer:"प्रोमोटर जीन"
},
{
    question: "त्रिक UUU कोड किसके लिए होता है?",
    option:["ल्यूसीन","मेथिओनीन","फेनिलएलेनीन","ग्लाइसीन"],
    answer:"फेनिलएलेनीन"
},
{
    question: "Tunica albuginea किसका आवरण है?",
    option:["शिश्न","वृषण","अंडाशय","वृषण कोश"],
    answer:"वृषण"
},
{
    question: "Mirabilis पौधे के लाल (RR) एवं सफेद (rr) पुष्पों के संकरण से गुलाबी (Rr) पुष्प उत्पन्न होता है। गुलाबी पुष्प का संकरण सफेद पुष्प से कराया जाए तो संभावित फीनोटाइप अनुपात क्या होगा?",
    option:["लाल : गुलाबी : सफेद (1 : 2 : 1)","गुलाबी : सफेद (1 : 1)","लाल : गुलाबी (1 : 1)","लाल : सफेद (3 : 1)"],
    answer:"गुलाबी : सफेद (1 : 1)"
},
{
    question: "EcoRI एंजाइम का स्रोत क्या है?",
    option:["ई. कोलाई","टी.एम.वी.","प्रायॉन","इनमें से कोई नहीं"],
    answer:"ई. कोलाई"
},
{
    question: "जल वैद्युत का संचलन (इलेक्ट्रोफोरेसिस) का उपयोग करते हैं:",
    option:["DNA को पृथक करने के लिए","RNA को पृथक करने के लिए","प्रोटीन को पृथक करने के लिए","इनमें से सभी को पृथक करने के लिए"],
    answer:"इनमें से सभी को पृथक करने के लिए"
},
{
    question: "DNA के पाइरिमिडिन में पाया जाता है:",
    option:["थायमीन एवं साइटोसिन","एडिनीन एवं गुआनिन","साइटोसिन एवं यूरेसिल","थायमिन एवं यूरेसिल"],
    answer:"थायमीन एवं साइटोसिन"
},
{
    question: "निम्न में से कौन-से पॉलीपेप्टाइड मानव इंसुलिन में पाए जाते हैं?",
    option:["A और B","A और C","B और C","इनमें से कोई नहीं"],
    answer:"A और B"
},
{
    question: "मशहूर वैज्ञानिक मेंडल मुख्यतः जाने जाते हैं अपने",
    option:["मटर के पौधों के कार्य हेतु","आनुवंशिकी के नियमों हेतु","मटर के पौधों के कार्य एवं आनुवंशिकी के नियमों हेतु","इनमें से कोई नहीं"],
    answer:"मटर के पौधों के कार्य एवं आनुवंशिकी के नियमों हेतु"
},
{
    question: "कौन-सा पिरामिड हमेशा ऊपर की ओर होता है, उल्टा कभी नहीं होता है?",
    option:["संख्या का पिरामिड","जैवमात्रा का पिरामिड","ऊर्जा का पिरामिड","जलीय व्यवस्था का पिरामिड"],
    answer:"ऊर्जा का पिरामिड"
},
{
    question: "पॉलीप्लोइडी को प्रेरित करने के लिए किस रसायन का प्रयोग किया जाता है?",
    option:["साइटोकाइनिन","नाइट्रस अम्ल","कॉल्चीसीन","IAA"],
    answer:"कॉल्चीसीन"
},
{
    question: "किसी Dithecous परागकोश में होता है",
    option:["4 microsporangia","3 microsporangia","2 microsporangia","1 microsporangia"],
    answer:"4 microsporangia"
},
{
    question: "ELISA टेस्ट में प्रयुक्त एंजाइम (Reagent) को कहते हैं:",
    option:["एन्डोन्यूक्लियेज","पॉलीमिरेज","लाइगेज","पेरोक्सिडेज"],
    answer:"पेरोक्सिडेज"
},
{
    question: "प्रतिजैविकी प्रतिरोधी जीवाणु का प्रादुर्भाव इनमें से किसका उदाहरण है?",
    option:["अनुकूली विकिरण","ट्रांसडक्शन","किसी समुदाय में पूर्वस्थित विभिन्नता","अपसारी क्रम विकास"],
    answer:"किसी समुदाय में पूर्वस्थित विभिन्नता"
},
{
    question: "बीटी (Bt) विष के रवे कुछ जीवाणुओं द्वारा बनाए जाते हैं, लेकिन जीवाणु स्वयं को नहीं मारते हैं क्योंकि:",
    option:["विष निष्क्रिय होता है","जीवाणु विष के प्रति प्रतिरोधी है","विष अपरिपक्व है","विष जीवाणु की विशेष थैली में मिलता है"],
    answer:"विष निष्क्रिय होता है"
},
{
    question: "एक गर्भनिरोधक गोली अंडोत्सर्जन को किस प्रकार रोकती है?",
    option:["फैलोपियन ट्यूब को अवरुद्ध कर","FSH एवं LH को रोककर","FSH एवं LH प्रवण को बढ़ाकर","Released ovum को तुरंत बर्बाद कर"],
    answer:"FSH एवं LH को रोककर"
},
{
    question: "बायोलिस्टिक या जीन गन का उपयोग किसमें होता है?",
    option:["प्लाज्मिड को काटने के लिए","कटे DNA को जोड़ने के लिए","विजातीय DNA को परपोषी कोशिकाओं में प्रवेश कराने के लिए","DNA को शुद्ध करने के लिए"],
    answer:"विजातीय DNA को परपोषी कोशिकाओं में प्रवेश कराने के लिए"
},
{
    question: "प्रतिरक्षी किसके द्वारा बनती है?",
    option:["फाइब्रोब्लास्ट","प्लाज्मा कोशिकाओं","हिस्टियोसाइट्स","मास्ट कोशिकाओं"],
    answer:"प्लाज्मा कोशिकाओं"
},
{
    question: "डी.एन.ए. के कटे भागों को जोड़ने हेतु इनमें से किसका प्रयोग किया जाता है?",
    option:["ट्रांसक्रिप्टेज","लाइगेज","राइबोन्यूक्लिएज","इनमें से कोई नहीं"],
    answer:"लाइगेज"
},
{
    question: "निम्नलिखित में कौन-सा यौन-संलग्न रोग है?",
    option:["रतौंधी","ग्लूकोमा","हीमोफिलिया","सभी"],
    answer:"हीमोफिलिया"
},
{
    question: "निम्नलिखित में कौन-सा प्राथमिक जनन अंग है?",
    option:["scrotum","penis","वृषण","प्रोस्टेट"],
    answer:"वृषण"
},
{
    question: "यदि किसी झील में DDT पाई जाती है तो सर्वाधिक सांद्रता पाई जाएगी:",
    option:["पाद प्लवकों में","जंतु प्लवकों में","मछली भक्षक चिड़ियों में","मछलियों में"],
    answer:"मछली भक्षक चिड़ियों में"
},
{
    question: "डार्विन की फिंच एक अच्छा उदाहरण है",
    option:["औद्योगिक मेलानिज्म का","संयोजी कड़ी का","अनुकूली विकिरण का","अभिसारी जैव-विकास का"],
    answer:"अनुकूली विकिरण का"
},
{
    question: "अगर सामान्य पुरुष की शादी हीमोफिलिया के वाहक स्त्री से हो तो उत्पन्न नर संतानों की क्या स्थिति होगी?",
    option:["सभी हीमोफिलिया से ग्रस्त","50% सामान्य, 50% रोगग्रस्त","सभी सामान्य","सभी रोग के वाहक"],
    answer:"50% सामान्य, 50% रोगग्रस्त"
},
{
    question: "एक खाद्य-श्रृंखला में निम्नलिखित में सर्वाधिक संख्या किसकी होती है?",
    option:["उत्पादक","प्राथमिक उपभोक्ता","द्वितीयक उपभोक्ता","अपघटक"],
    answer:"उत्पादक"
},
{
    question: "रेड डाटा बुक में सम्मिलित है",
    option:["विलुप्त हो रहे पौधों की सूची","दुर्लभ पौधों की सूची","आपत्तिग्रस्त प्राणियों की सूची","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "पौधों में आनुवंशिकीय अभियांत्रिकी के लिए किसका बहुतायत में प्रयोग होता है?",
    option:["एग्रोबैक्टीरियम ट्यूमेफेशियन्स","जेन्थोमोनॉस सिट्राई","बैसिलस कॉग्यूलेन्स","क्लॉस्ट्रीडियम सेप्टीकम"],
    answer:"एग्रोबैक्टीरियम ट्यूमेफेशियन्स"
},
{
    question: "पुष्प के मादा जनन अंग को कहते हैं",
    option:["जायांग","पुमंग","परागकोश","पुंकेसर"],
    answer:"जायांग"
},
{
    question: "जीवाणु की कोशिकाभित्ति को तोड़कर उसके DNA एवं अन्य वृहद् जैव अणुओं को मुक्त करने हेतु इनमें से कौन-सा एंजाइम प्रयुक्त होता है?",
    option:["लाइसोजाइम","सेलुलेज","काइटिनेज","कोलैजिनेज"],
    answer:"लाइसोजाइम"
},
{
    question: "आस्ट्रेलिया के शिशुधानी प्राणियों के अनुकूली विकिरण इनमें से किसका उदाहरण है?",
    option:["अपसारी क्रम विकास","अभिसारी क्रम विकास","साल्टेशन","इनमें से कोई नहीं"],
    answer:"अपसारी क्रम विकास"
},
{
    question: "बार्थोलिन की ग्रंथि होती है",
    option:["वास डिफेन्स के किनारों पर","योनि के किनारों पर","पक्षियों की पूँछ पर","उभयचरों के सिर पर"],
    answer:"योनि के किनारों पर"
},
{
    question: "इनमें कौन विदेशी स्पीशीज नहीं है?",
    option:["लेंटाना कमारा","मैंगीफेरा इंडिका","आइकॉर्निया क्रेसिपिस","पार्थेनियम हिस्टेरोफोरसो"],
    answer:"मैंगीफेरा इंडिका"
},
{
    question: "परागकण होता है",
    option:["अगुणित","द्विगुणित","त्रिगुणित","चतुर्गुणित"],
    answer:"अगुणित"
},
{
    question: "मीनामाटा रोग विकसित होता है:",
    option:["पेय जल में आर्सेनिक संचित होने से","पेय जल में फ्लोराइड जमा होने से","पारे से प्रदूषित मछलियों के सेवन से","जल में तेल के फैल जाने से"],
    answer:"पारे से प्रदूषित मछलियों के सेवन से"
},
{
    question: "ईख (sugarcane) में ग्राफ्टिंग नहीं हो सकता है, क्योंकि",
    option:["vascular bundles बिखरे होते हैं","फ्लोएम जाइलम के अंदर की ओर होते हैं","ईख के पौधे कोमल (delicate) होते हैं","यह चोट को सहने में असमर्थ होता है"],
    answer:"vascular bundles बिखरे होते हैं"
},
{
    question: "अनुन्मील्य परागित फूल होते हैं",
    option:["कीट परागित","चमगादड़ परागित","स्वपरागित","जल परागित"],
    answer:"स्वपरागित"
},
{
    question: "________ में पत्तियों के खण्डों द्वारा कायिक प्रजनन होता है?",
    option:["एगेव एवं केलेंचोय","बायोफिलम एवं केलेंचोय","ऐसपेरेगस एवं ब्रायोफिलम","क्राईसेंथियम एवं एगेव"],
    answer:"बायोफिलम एवं केलेंचोय"
},
{
    question: "आनुवंशिक पूरक जो Nullisomic जीव में होगा",
    option:["2n - 1","2n - 2","2n + 1","2n + 2"],
    answer:"2n - 2"
},
{
    question: "वायुमंडल के निचले भाग से शिखर तक वायु स्तम्भ (कॉलम) में ओजोन की मोटाई किस इकाई में मापी जाती है?",
    option:["डॉबसन इकाई","अरब इकाई","पास्कल इकाई","इनमें से कोई नहीं"],
    answer:"डॉबसन इकाई"
},
{
    question: "एक अर्द्धसूत्री कोशिका विभाजन से कितने नर युग्मक बनते हैं",
    option:["4","1","2","8"],
    answer:"4"
},
{
    question: "रिस्ट्रिक्शन एंजाइम निम्नांकित में से कौन है?",
    option:["लाइगेज","एक्सोन्यूक्लिएज","एंडोन्यूक्लिएज","एक्सोन्यूक्लिएज तथा एंडोन्यूक्लिएज दोनों"],
    answer:"एक्सोन्यूक्लिएज तथा एंडोन्यूक्लिएज दोनों"
},
{
    question: "प्रोस्टेट कैंसर के लिए प्रयुक्त प्रमुख एन्जाइम क्लीनिकल जाँच कौन-सा है?",
    option:["एमाइलेज","क्षारीय फास्फेटेज","γ-GT","अम्लीय फास्फेटेज"],
    answer:"अम्लीय फास्फेटेज"
},
{
    question: "यदि किसी पुष्प के परागकोश एवं वर्तिकान एक साथ परिपक्व हो जाएँ तो इसे कहते हैं",
    option:["Allogamy","Dichogamy","Homogamy","Syngamy"],
    answer:"Homogamy"
},
{
    question: "अल्कोहल से ‘विनेगार’ का निर्माण किसके द्वारा होता है?",
    option:["बैसिलस सबटिलिस","क्लोस्ट्रिडियम","एसिटोबैक्टर एसिटि","एजोटोबैक्टर"],
    answer:"एसिटोबैक्टर एसिटि"
},
{
    question: "अपमार्जक संरूपण तथा धुलाई में कपड़ों से तेल के धब्बे हटाने के लिए किस सूक्ष्मजीवी का प्रयोग किया जाता है?",
    option:["सैकेरोमाइसीज सेरेबायसी","स्ट्रेप्टोकोकस","कैंडीडा लाइपोलिटिका","लाइपेज"],
    answer:"कैंडीडा लाइपोलिटिका"
},
{
    question: "RNA के लिए कौन सही है?",
    option:["A=U","G=C","A+C","AEG"],
    answer:"A=U"
},
{
    question: "निम्नलिखित में से किसे स्तनधारियों का स्वर्णकाल कहते हैं?",
    option:["मेसोजोइक एरा","सीनोजोइक एरा","पेलियोजोइक एरा","कोई नहीं"],
    answer:"सीनोजोइक एरा"
},
{
    question: "निम्नलिखित में से कौन उच्च जीवों में जीन क्लोनिंग हेतु एक वाहक के रूप में प्रयोग होता है?",
    option:["बैकुलो विषाणु","सालमोनेला टायफीम्यूरियम","राइजोपस नाइग्रीकैन्स","रिट्रोविषाणु"],
    answer:"रिट्रोविषाणु"
},
{
    question: "ऊर्जा का पिरामिड होता है, हमेशा:",
    option:["सीधा","उल्टा","तिरछा","इनमें से सभी"],
    answer:"सीधा"
},
{
    question: "Bt टॉक्सिन के बारे में सच क्या है?",
    option:["इसके बैसीलस के अन्दर एंटीटॉक्सिन होता है","निष्क्रिय प्रोटोटॉक्सिन कीट की आँत में सक्रिय हो जाता है","Bt प्रोटीन टॉक्सिन बैसीलस में सक्रिय रहता है","सक्रिय टॉक्सिन पीड़क के अण्डाशय में जाकर प्रजनन में बाधा डालता है"],
    answer:"निष्क्रिय प्रोटोटॉक्सिन कीट की आँत में सक्रिय हो जाता है"
},
{
    question: "पराग थैले किनमें पाए जाते हैं",
    option:["परागकोश","पुष्पासन","अंडाशय","दलपुंज"],
    answer:"परागकोश"
},
{
    question: "स्वस्थाने संरक्षण (In situ conservation) का उदाहरण है",
    option:["जंतु उद्यान","वानस्पतिक उद्यान","जीव सफारी पार्क","इनमें से सभी"],
    answer:"जीव सफारी पार्क"
},
{
    question: "सायनोबैक्टीरिया का प्रयोग जैव-उर्वरक के रूप में किया जाता है:",
    option:["गेहूँ","मक्का","धान","गन्ना"],
    answer:"धान"
},
{
    question: "परागकण का बाह्यचोल बना होता है",
    option:["पेक्टोसेलुलोज","लिग्नोसेलुलोज","स्पोरोपॉलेनिन","पराग किट"],
    answer:"स्पोरोपॉलेनिन"
},
{
    question: "निम्नांकित में से कौन यौन संचारित रोग है?",
    option:["गोनोरिया","मलेरिया","हैजा","इनमें से कोई नहीं"],
    answer:"गोनोरिया"
},
{
    question: "मिलर के प्रयोग में उपयोग में लाया गया था",
    option:["H₂O, HCN, H₂ एवं CH₄","CH₄, NH₃, N₂ एवं H₂O","CH₄, HCN, N₂ एवं H₂","CH₄, H₂O, N₂ एवं H₂"],
    answer:"CH₄, NH₃, N₂ एवं H₂O"
},
{
    question: "यौन संचारित रोग है:",
    option:["खसरा","टी.बी.","गोनोरिया","टायफाइड"],
    answer:"गोनोरिया"
},
{
    question: "विशुद्ध लाल पुष्प तथा विशुद्ध सफेद पुष्प वाले पौधों में संकरण कराने से पहली संतति में सभी गुलाबी पुष्प वाले पौधे मिले। यह एक प्रकार का",
    option:["अपूर्ण प्रभाविता","पूर्ण प्रभाविता","संकर","इनमें से कोई नहीं"],
    answer:"अपूर्ण प्रभाविता"
},
{
    question: "निम्नलिखित में कौन-सा आण्विक नाइट्रोजन पोषक के रूप में उपयोग होता है?",
    option:["मिथेनोमोनास","म्यूकर","राइजोबियम","स्पाइरोगाइरा"],
    answer:"राइजोबियम"
},
{
    question: "बच्चे का रक्त समूह O तथा पिता का B रक्त समूह हो, तो पिता का जीनोटाइप होगा",
    option:["IᴮIᴮ","Iᴮi","IᴬIᴮ","ii"],
    answer:"Iᴮi"
},
{
    question: "उच्च कुल के पौधों की जड़ों एवं कवक के बीच बनाए जाने वाले सहजीवी संबंध को कहते हैं:",
    option:["जैव विविधता","लाइकेन","नोड्यूल","माइकोराइजा"],
    answer:"माइकोराइजा"
},
{
    question: "यूटोफिकेशन प्रायः देखा जाता है:",
    option:["स्वच्छ जलीय झीलों में","महासागरों में","पहाड़ों में","मरुस्थलों में"],
    answer:"स्वच्छ जलीय झीलों में"
},
{
    question: "निम्न में से कौन विदेशी प्रजाति है?",
    option:["कतला","रोहू","नील पर्चा","हित्पोकैम्पस"],
    answer:"नील पर्चा"
},
{
    question: "1928 में एक वैज्ञानिक ने प्रथम प्रभावी प्रतिजैविक पदार्थ की खोज की। वैज्ञानिक व प्रतिजैविक पदार्थ हैं:",
    option:["फ्लेमिंग-स्ट्रेप्टोमायसीन","फ्लेमिंग-पेनिसिलीन","वाक्समैन-पेनिसिलीन","वाक्समैन-स्ट्रेप्टोमायसीन"],
    answer:"फ्लेमिंग-पेनिसिलीन"
},
{
    question: "मेंडल का द्वितीय नियम है",
    option:["पृथक्करण का नियम","प्रभाविता का नियम","बहुजीवी वंशागति का नियम","स्वतंत्र अपव्यूहन का नियम"],
    answer:"स्वतंत्र अपव्यूहन का नियम"
},
{
    question: "सर्वप्रथम निर्मित पारजीवी गाय का नाम इनमें से कौन था?",
    option:["डेजी","मेजी","डॉली","रोजी"],
    answer:"रोजी"
},
{
    question: "परागकोश संबंधित है",
    option:["परागकण निर्माण से","परागकण विकास से","पुष्पकलिका के खुलने से","वर्तिकाग्र द्वारा परागकण के ग्रहण से"],
    answer:"पुष्पकलिका के खुलने से"
},
{
    question: "निम्नलिखित में कौन-सा पौधा द्विलिंगी है?",
    option:["पपीता","खजूर","नारियल","इनमें से कोई दो"],
    answer:"नारियल"
},
{
    question: "घरेलू अपवाहित जल (सीवेज) के जलाशयों, नदियों, झीलों में मिलने से इनमें से किसमें वृद्धि होती है?",
    option:["B.O.D.","C.O.D.","(A) एवं (B) दोनों","इनमें से कोई नहीं"],
    answer:"(A) एवं (B) दोनों"
},
{
    question: "जलाशयों में सुपोषण के लिए सबसे प्रभावशाली हैं:",
    option:["अकार्बनिक फॉस्फेट","कार्बनिक पदार्थ","शैवाल","जीवाणु"],
    answer:"अकार्बनिक फॉस्फेट"
},
{
    question: "निम्नलिखित में कौन-सी बायोगैस है?",
    option:["CO₂","CH₄","N₂","NO"],
    answer:"CH₄"
},
{
    question: "पशुओं के अधिक चरने के कारण से होता है:",
    option:["वन्य जंतुओं का नाश","वनस्पति का नाश","पौधों, जंतुओं तथा मृदा का नाश","वनों का नाश"],
    answer:"पौधों, जंतुओं तथा मृदा का नाश"
},
{
    question: "जीन का Segregation किस दौरान होता है?",
    option:["मेटाफेज","एनाफेज","प्रोफेज","भ्रूण निर्माण"],
    answer:"एनाफेज"
},
{
    question: "सिफलिस के लिए सबसे उपयुक्त जाँच है:",
    option:["ELISA","PCR","VDRL","DNA हाइब्रीडाइजेशन"],
    answer:"VDRL"
},
{
    question: "एण्टीहिस्टामिन एवं स्टेरॉयड के प्रयोग से शीघ्रता से आराम मिलता है:",
    option:["एलर्जी से","नॉसिया से","कफ से","सिरदर्द से"],
    answer:"एलर्जी से"
},
{
    question: "पोलियो को चिकित्सीय भाषा में क्या कहते हैं?",
    option:["शैशव लकवा","जलांतका","जबड़े का लकवा","इनमें से सभी"],
    answer:"शैशव लकवा"
},
{
    question: "एडीनोसीन डिएमीनेज की कमी को किस प्रकार दूर किया जा सकता है?",
    option:["जीन थेरेपी द्वारा","एंटीबायोटिक्स बनाकर","मानव-वृद्धि हॉर्मोन द्वारा","इंटरफेरॉन का उत्पादन कर"],
    answer:"जीन थेरेपी द्वारा"
},
{
    question: "मेंडल की अवधारणा को मेंडल के नियम में किसने रूपांतरित किया?",
    option:["कोरेन्स","शेरमैक","ह्यूगो डि व्रीज","मॉर्गन"],
    answer:"कोरेन्स"
},
{
    question: "विडाल परीक्षण किस बीमारी के लिए किया जाता है?",
    option:["मलेरिया","टाइफाइड","डेंगू","इनमें से कोई नहीं"],
    answer:"टाइफाइड"
},
{
    question: "एक स्व-निषेचित त्रिसंकर पौधा उत्पन्न करेगा",
    option:["4 भिन्न युग्मक व 16 भिन्न युग्मनज","8 भिन्न युग्मक व 16 भिन्न युग्मनज","8 भिन्न युग्मक व 32 भिन्न युग्मनज","8 भिन्न युग्मक व 64 भिन्न युग्मनज"],
    answer:"8 भिन्न युग्मक व 64 भिन्न युग्मनज"
},
{
    question: "एक्रोसोम निम्नांकित में से किसका संभाग है?",
    option:["गॉल्जीकाय","मानव शुक्राणु का शीर्ष","मानव शुक्राणु का मध्य भाग","इनमें से कोई नहीं"],
    answer:"मानव शुक्राणु का शीर्ष"
},
{
    question: "निम्नांकित में से कौन नाइट्रोजन चयापचय करता है?",
    option:["राइजोबियम","स्यूडोमोनास","एजोबैक्टर","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "गोल्डेन राइस में पाया जाता है।",
    option:["विटामिन-A","विटामिन-B","विटामिन-C,D","चावल से एक पेट्रोल-सरीखा ईंधन बनाने में"],
    answer:"विटामिन-A"
},
{
    question: "किस फल का बीजचोल खाया जाता है?",
    option:["शरीफा","लीची","जायफल","इनमें से सभी को"],
    answer:"इनमें से सभी को"
},
{
    question: "टिड्डा में लिंग निर्धारण होता है",
    option:["XY प्रकार","XO प्रकार","ZW प्रकार","उपर्युक्त में कोई नहीं"],
    answer:"XO प्रकार"
},
{
    question: "AaBbCc के टेस्ट क्रॉस द्वारा कितने फीनोटाइप उत्पन्न होते हैं?",
    option:["16","12","8","4"],
    answer:"8"
},
{
    question: "ट्रिपल एंटीजेन टीका का उपयोग नहीं होता है:",
    option:["डिप्थीरिया के लिए","पर्टुसिस के लिए","टायफाइड के लिए","टेटनस के लिए"],
    answer:"टायफाइड के लिए"
},
{
    question: "ओकाजाकी फ्रेग्मेंट्स कब बनता है?",
    option:["प्रतिलेखन","स्थानांतरण","द्विगुणन","पारक्रमण"],
    answer:"द्विगुणन"
},
{
    question: "मधुमेह रोगियों द्वारा उपयोग में लाया जाने वाला इंसुलिन किसके अग्नाशय से निकाला जाता है?",
    option:["सूअर","बकरी","मुर्गा","भैंस"],
    answer:"सूअर"
},
{
    question: "कौन जैव उर्वरक है?",
    option:["माइकोराइजा","नाइट्रोजन स्थिरीकारक जीवाणु","नाइट्रोजन स्थिरीकारक सायनोबैक्टीरिया","उपर्युक्त सभी"],
    answer:"उपर्युक्त सभी"
},
{
    question: "मानव युग्मकों में गुणसूत्रों की कितनी संख्या होती है?",
    option:["21","23","44","46"],
    answer:"23"
},
{
    question: "निम्नलिखित में कौन-सा जैव तकनीक से संबंधित है?",
    option:["प्लास्टिड्स","प्लाज्मिड्स","उत्परिवर्तन","हाइब्रिड"],
    answer:"प्लाज्मिड्स"
},
{
    question: "निम्न में से कौन-सा रासायनिक पदार्थ ओजोन की परत पर असर डालता है?",
    option:["क्लोरोफ्लोरोकार्बन","क्लोरीन","हेक्साफ्लोरोकार्बन","मॉलिक्यूलर कार्बन"],
    answer:"क्लोरोफ्लोरोकार्बन"
},
{
    question: "प्रोटोप्लास्ट कल्चर का फ्यूजोजेन क्या है?",
    option:["तरल नाइट्रोजन","PEG","लैक्टिक अम्ल","इनमें से सभी"],
    answer:"PEG"
},
{
    question: "मेंडल के प्रयोगों में विपरीत लक्षणों की जोड़ी को क्या कहते हैं?",
    option:["जीन","फीनोटाइप","जीनोटाइप","एलील"],
    answer:"एलील"
},
{
    question: "इनमें से किनका स्वर उच्च पिच (स्वरमान) का होता है",
    option:["पुरुष","स्त्री","किन्नर (हिजड़ा/छक्का)","इनमें से कोई नहीं"],
    answer:"स्त्री"
},
{
    question: "किस फल का बीजचोल खाया जाता है",
    option:["जायफल","लीची","शरीफा","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "भ्रूणकोष में निम्नांकित में कौन-सा नहीं होता है",
    option:["अंड समुच्चय","दो ध्रुवीय केन्द्रक","गुरुबीजाणुजनन कोशिका","एंटीपोडल्स"],
    answer:"गुरुबीजाणुजनन कोशिका"
},
{
    question: "कलिका रोपण उदाहरण है:",
    option:["कायिक जनन का","ऊतक संवर्धन का","लैंगिक जनन का","प्रकीर्णन का"],
    answer:"कायिक जनन का"
},
{
    question: "विकसित शुक्राणु को पोषण किससे मिलता है?",
    option:["अंतर्कोशिकीय कोशिका","स्पर्मेटोगोनियम","शुक्राणु कोशिका","सर्टोली कोशिका"],
    answer:"सर्टोली कोशिका"
},
{
    question: "ट्रिटिकेल मनुष्य द्वारा निर्मित प्रथम धान्य फसल है। यह गेहूँ का किसके साथ संकरण करके तैयार की गई है?",
    option:["राई","बाजरा","गन्ना","जौ"],
    answer:"राई"
},
{
    question: "निम्नांकित में से कौन प्राकृतिक पारितंत्र का उदाहरण है?",
    option:["वन","नदी","तालाब","सभी"],
    answer:"सभी"
},
{
    question: "मानव रुधिर AB वर्ग में",
    option:["एंटीबॉडी उपस्थित होते हैं","एंटीबॉडी अनुपस्थित होते हैं","एंटीबॉडी A उपस्थित होते हैं","एंटीबॉडी B उपस्थित होते हैं"],
    answer:"एंटीबॉडी अनुपस्थित होते हैं"
},
{
    question: "DNA के नॉनकोडिंग क्रम को कहते हैं:",
    option:["विखंडित जीन","इंट्रोन","एक्सोन","इनमें से कोई नहीं"],
    answer:"इंट्रोन"
},
{
    question: "रोध कूट की संख्या होती है।",
    option:["एक","दो","तीन","चार"],
    answer:"तीन"
},
{
    question: "निम्नलिखित में कौन-सा सही क्रम है?",
    option:["युग्मकजनन – संयुग्मन – भ्रूण जनन – युग्मजा","संयुग्मन – युग्मकजनन – युग्मज – भ्रूण जनन","युग्मकजनन – संयुग्मन – युग्मज – भ्रूण जनन","युग्मज – भ्रूण जनन – संयुग्मन – युग्मकजनन"],
    answer:"युग्मकजनन – संयुग्मन – युग्मज – भ्रूण जनन"
},
{
    question: "इनमें से विलुप्त हो गए हैं:",
    option:["डोडो","लाल पांडा","स्टीलर्स सी काऊ","डोडो और स्टीलर्स सी काऊ"],
    answer:"डोडो और स्टीलर्स सी काऊ"
},
{
    question: "पुष्प के नर जनन-अंग को कहते हैं",
    option:["जायांग","पुमंग","कोरोला","अन्य"],
    answer:"पुमंग"
},
{
    question: "किसी आवृत्तबीजी के भ्रूणपोष कोशिका में 24 गुणसूत्र होते हैं। इसके युग्मक में गुणसूत्र की संख्या होगी",
    option:["8","16","24","48"],
    answer:"8"
},
{
    question: "परागकण का कोशिकाद्रव्य किसमें धनी होता है",
    option:["वसा एवं स्टार्च","प्रोटीन","स्टार्च एवं Flavonoids","DNA"],
    answer:"वसा एवं स्टार्च"
},
{
    question: "कई लक्षणों को प्रभावित करने वाला जीन कहलाता है",
    option:["एडीटिव","प्लियोट्रॉपिक","एपिस्टेटिक","सप्लीमेंटरी"],
    answer:"प्लियोट्रॉपिक"
},
{
    question: "निम्नलिखित में से कौन-सा पारिस्थितिक पिरामिड निर्माण में भाग नहीं लेता?",
    option:["शुष्क भार","व्यष्टियों की संख्या","ऊर्जा प्रवाह की दर","ताजा भार"],
    answer:"ताजा भार"
},
{
    question: "मादा में Clitoris किसके समजात है?",
    option:["नर के Penis के समजात","नर के शिश्न के समरूप","Vestigeal organ","प्रोस्टेट के समजात"],
    answer:"नर के Penis के समजात"
},
{
    question: "किसी परागकण का बाहरी स्तर निम्नलिखित में से किस प्रतिरोधी पदार्थ से बना होता है",
    option:["टैनिन","पेक्टोसेलुलोज","स्पोरोपोलेनिन","लिगनिन"],
    answer:"स्पोरोपोलेनिन"
},
{
    question: "इनमें से कौन जीवाणु जनित रोग है?",
    option:["कुष्ठ रोग","क्षय रोग","हैजा","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "जनन-पृथकता आवश्यक है:",
    option:["जीवों के अस्तित्व के लिए","विभिन्न जातियों में सुस्पष्टता बनाए रखने के लिए","गणीज की अनुकूलता के लिए","मृत्यु-दर की वृद्धि के लिए"],
    answer:"विभिन्न जातियों में सुस्पष्टता बनाए रखने के लिए"
},
{
    question: "अनुकूलन के आधार पर भिन्न जीवों के बीच समानता कहलाती है",
    option:["समानांतर विकास","अपसारी विकास","अभिसारी विकास","क्रमिक विकास"],
    answer:"अभिसारी विकास"
},
{
    question: "राइबोटाइड बना होता है:",
    option:["राइबोज + फॉस्फेट + यूरेसिल","डीऑक्सीराइबोज + यूरेसिल + फॉस्फेट","थाइमीन + राइबोज + फॉस्फेट","डीऑक्सी राइबोज + फॉस्फेट + एडेनीन"],
    answer:"राइबोज + फॉस्फेट + यूरेसिल"
},
{
    question: "दात्र कोशिका अरक्तता होती है",
    option:["दैहिक सहलग्न प्रभावी लक्षण के कारण","हीमोग्लोबिन की β-ग्लोबिन शृंखला में ग्लूटैमिक अम्ल के स्थान पर वेलीन आने के कारण","DNA के किसी भी एक क्षारक युग्म में परिवर्तन के कारण","केन्द्रकयुक्त लंबी हँसियाकार कोशिकाओं द्वारा"],
    answer:"हीमोग्लोबिन की β-ग्लोबिन शृंखला में ग्लूटैमिक अम्ल के स्थान पर वेलीन आने के कारण"
},
{
    question: "निम्नलिखित में से कौन-सा एक लक्षण बहुजीनीय वंशागति का उदाहरण है?",
    option:["Mirabilis jalapa में फूल का रंग","नर मधुमक्खी का उत्पादन","उद्यान मटर में फली की आकृति","मानवों में त्वचा का रंग"],
    answer:"मानवों में त्वचा का रंग"
},
{
    question: "एक बालक का रुधिर वर्ग O है तथा उसके पिता का रुधिर वर्ग B है तो उसके पिता का जीन प्रारूप इनमें से कौन होगा?",
    option:["IᴼIᴼ","IᴮIᴼ","IᴮIᴮ","IᴬIᴬ"],
    answer:"IᴮIᴼ"
},
{
    question: "अंडाशय से निकलने पर मानव अंडे में निहित होते हैं",
    option:["एक Y-गुणसूत्र","दो X-गुणसूत्र","एक X-गुणसूत्र","XY-गुणसूत्र"],
    answer:"एक X-गुणसूत्र"
},
{
    question: "प्राइमर्स का उपयोग किया जाता है:",
    option:["PCR","क्लोनिंग","DNA संसाधन","इनमें से कोई नहीं"],
    answer:"PCR"
},
{
    question: "जब एक परागकोश अपरिपक्व होता है तब घने सुसंबद्ध सजातीय कोशिकाओं का समूह होता है, जिसे कहते हैं",
    option:["बीजाणुजनन ऊतक","लघुबीजाणु चतुष्टय","लघुबीजाणुजनन","परागकण"],
    answer:"बीजाणुजनन ऊतक"
},
{
    question: "इनमें कौन बहुरूपता को दर्शाता है?",
    option:["स्पाइरोगाइरा","खजूर","मधुमक्खी","पपीता"],
    answer:"मधुमक्खी"
},
{
    question: "मानव मादा के भ्रूण में किस प्रकार का Cleavage होता है?",
    option:["Holoblastic एवं समान","Meroblastic","Holoblastic","Diploblastic"],
    answer:"Holoblastic एवं समान"
},
{
    question: "किसी जीनोटाइप AaBBCcDD द्वारा कितने प्रकार के युग्मक बन सकते हैं?",
    option:["4","3","16","64"],
    answer:"4"
},
{
    question: "मानव युग्मक में गुणसूत्र की संख्या है:",
    option:["21","23","44","46"],
    answer:"23"
},
{
    question: "आनुवंशिक पूरक जो Nullisomic जीव में होगा",
    option:["2n - 1","2n - 2","2n + 1","2n + 2"],
    answer:"2n - 2"
},
{
    question: "निम्नलिखित में किसमें सर्वाधिक जैवमात्रा होती है?",
    option:["शीतोष्ण वन","ट्रॉपिकल वर्षा वन","अल्पाइन वन","टायगा"],
    answer:"ट्रॉपिकल वर्षा वन"
},
{
    question: "निम्नांकित में से कौन विषाणु जनित रोग है?",
    option:["हैजा","मलेरिया","पोलियो","इनमें से सभी"],
    answer:"पोलियो"
},
{
    question: "मक्के में पुष्ट हाइब्रिड कैसे प्राप्त किया जाता है?",
    option:["प्रेरित उत्परिवर्तन","दो हाइब्रिड लाइनों को क्रॉस करवाकर","बीजों का फैलाव DNA के साथ","ज्यादा उत्पादक पौधों से बीज प्राप्त करके"],
    answer:"दो हाइब्रिड लाइनों को क्रॉस करवाकर"
},
{
    question: "किससे विकसित शुक्राणु को पोषण मिलता है?",
    option:["Interstitial cells","spermatogonia","spermatocytes","Sertoli cell"],
    answer:"Sertoli cell"
},
{
    question: "स्ट्रोबायलेंथस कुंथीयाना (नीलाकुरंजी) 12 वर्ष में एक बार पुष्पीकरण से गुजरता है। यह किस पहाड़ी क्षेत्र में पाया जाता है",
    option:["केरल एवं कर्नाटक","ओड़िशा","आंध्र प्रदेश","मध्य प्रदेश"],
    answer:"केरल एवं कर्नाटक"
},
{
    question: "ऑपेरॉन मॉडल प्रस्तावित किया था:",
    option:["वाट्सन तथा क्रिक ने","निरेनबर्ग ने","जैकब तथा मोनाड ने","इनमें से कोई नहीं"],
    answer:"जैकब तथा मोनाड ने"
},
{
    question: "परागकण किसका प्रतिनिधित्व करता है",
    option:["नर युग्मकोद्भिद्","मादा युग्मकोद्भिद्","दोनों (A) एवं (B)","इनमें से कोई नहीं"],
    answer:"नर युग्मकोद्भिद्"
},
{
    question: "विश्व पर्यावरण दिवस मनाया जाता है:",
    option:["6 दिसम्बर को","5 जून को","6 जनवरी को","इनमें से कोई नहीं"],
    answer:"5 जून को"
},
{
    question: "न्यूक्लिक अम्ल पॉलिमर हैं:",
    option:["न्यूक्लियोटाइड का","न्यूक्लियोसाइड का","अमीनो अम्ल का","न्यूक्लियोप्रोटीन का"],
    answer:"न्यूक्लियोटाइड का"
},
{
    question: "पौधे में क्लोनिंग हेतु किस संवाहक का उपयोग होता है?",
    option:["pBR 322","Ti प्लाजमिड","pBR 322 और Ti प्लाजमिड दोनों","इनमें से कोई नहीं"],
    answer:"pBR 322 और Ti प्लाजमिड दोनों"
},
{
    question: "एंजाइम लाइगेज का प्रयोग किया जाता है:",
    option:["DNA को खंडित करने के लिए","खंडित DNA को जोड़ने के लिए","DNA को शोधित करने के लिए","जीव-प्रतिकारक की उत्पादन क्षमता बढ़ाने के लिए"],
    answer:"खंडित DNA को जोड़ने के लिए"
},
{
    question: "कीट प्रतिरोधी पराजीनी कपास का निर्माण किसके DNA टुकड़े को प्रविष्ट कराकर किया गया है?",
    option:["एक कीट के","एक जीवाणु के","कपास के जंगली सम्बन्धी के","एक विषाणु के"],
    answer:"एक जीवाणु के"
},
{
    question: "इनमें से कौन अण्डज है?",
    option:["एकिडना","कँगारू","गाय","इनमें से कोई नहीं"],
    answer:"एकिडना"
},
{
    question: "निम्नलिखित में कौन समापन कोडोन है?",
    option:["AUG","CCC","UAG","GGG"],
    answer:"UAG"
},
{
    question: "अंडाशय के नजदीक का फैलोपियन ट्यूब का भाग है",
    option:["इस्थमस","इन्फन्डीबुलम","ग्रीवा","Ampulla"],
    answer:"इन्फन्डीबुलम"
},
{
    question: "प्रतिबंधन एंजाइम की खोज से किसे काटना संभव हो सका?",
    option:["DNA","RNA","प्रोटीन","इनमें से सभी"],
    answer:"DNA"
},
{
    question: "लेमार्कवाद का सम्बन्ध है",
    option:["उपयोग एवं अनुपयोग","उपार्जित लक्षणों की वंशागति","(A) एवं (B) दोनों","इनमें से कोई नहीं"],
    answer:"(A) एवं (B) दोनों"
},
{
    question: "endometrium किसका आवरण बनाता है?",
    option:["Bladder","योनि","गर्भाशय","अंडवाहिनी"],
    answer:"गर्भाशय"
},
{
    question: "निम्नलिखित में कौन कैंसर से संबंधित है?",
    option:["लिपोमा","ल्यूकेमिया","लिम्फोमा","इनमें सभी"],
    answer:"इनमें सभी"
},
{
    question: "यदि माता का रक्त समूह O तथा शिशु का भी रक्त समूह O हो तो पिता का रक्त समूह क्या हो सकता है?",
    option:["O","A","B","AB"],
    answer:"O"
},
{
    question: "बन्ध्याकरण (sterilization) की एक विधि है",
    option:["IUDCB","मध्यच्छद","शुक्रवाहिकोच्छेदन","लूप"],
    answer:"शुक्रवाहिकोच्छेदन"
},
{
    question: "अगुणित गुणसूत्र किसमें पाया जाता है?",
    option:["जाइगोट","युग्मक","भ्रूण","बीज"],
    answer:"युग्मक"
},
{
    question: "फोटोकेमिकल स्मॉग में हमेशा उपस्थित रहता है:",
    option:["O₃","H₂S","CO","क्लोरीन"],
    answer:"O₃"
},
{
    question: "स्तनियों में ‘बार बॉडी’ प्रदर्शित करती है",
    option:["स्त्री की कोशिकाओं में उपस्थित सम्पूर्ण हेटेरोक्रोमैटिन","स्त्री की कायिक कोशिकाओं में दो X-गुणसूत्रों में से एक निष्क्रिय X-गुणसूत्र","स्त्री तथा पुरुष की कोशिकाओं में उपस्थित सम्पूर्ण हेटेरोक्रोमैटिन","पुरुष की कायिक कोशिकाओं में उपस्थित Y-गुणसूत्र"],
    answer:"स्त्री की कायिक कोशिकाओं में दो X-गुणसूत्रों में से एक निष्क्रिय X-गुणसूत्र"
},
{
    question: "मानव रुधिर वर्ग कौन-कौन से हैं?",
    option:["A, B, C तथा O","B, C, D तथा O","A, B, AB तथा O","उपर्युक्त सभी"],
    answer:"A, B, AB तथा O"
},
{
    question: "आदि वातावरण में निम्नलिखित में से किसका अभाव था?",
    option:["नाइट्रोजन","अमोनिया","ऑक्सीजन","मिथेन"],
    answer:"ऑक्सीजन"
},
{
    question: "लंबे व बौने मटर के पौधे में मोनोहाइब्रिड अनुपात 3 : 1 है तो इनका जीनोटाइप क्या होगा?",
    option:["TT × Tt","Tt × Tt","TT × tt","Tt × tt"],
    answer:"Tt × Tt"
},
{
    question: "मक्का में प्रोटीनयुक्त endosperm को कहते हैं",
    option:["Apophysis","Scutellum","Coleoptile","अल्यूरोन भित्ति"],
    answer:"अल्यूरोन भित्ति"
},
{
    question: "‘पूसा स्वर्णिमा’ सरसों की किस्म किस रोग की प्रतिरोधक किस्म है?",
    option:["चिली मोजेक वायरस","बैक्टीरियल वायरस","श्वेत गेरिक","कुचित अंगमारी"],
    answer:"श्वेत गेरिक"
},
{
    question: "Human female के भ्रूण में किस प्रकार का Cleavage होता है?",
    option:["Holoblastic एवं समान","Meroblastic","Holoblastic एवं असमान","Diploblastic"],
    answer:"Holoblastic एवं समान"
},
{
    question: "पौधे का ऐसा कौन-सा भाग है जिसमें एक के अंदर दूसरी पीढ़ी होती है",
    option:["अंकुरित परागकण","बीज","अनिषेचित बीजाण्ड","भ्रूण"],
    answer:"बीज"
},
{
    question: "निम्नलिखित में कौन-सा रोग प्रोटोजोआ परजीवी द्वारा संचारित होता है?",
    option:["अमीबायसिस","मलेरिया","कालाजार","सभी"],
    answer:"सभी"
},
{
    question: "इनमें कौन-सा कथन सही नहीं है?",
    option:["Ori वह अनुक्रम है जहाँ से प्रतिकृति की शुरुआत होती है।","पश्चविषाणु सामान्य कोशिकाओं को कैंसर कोशिकाओं में रूपांतरित कर देते हैं।","पौधों में विजातीय DNA को प्रवेश कराने के लिए जीनगन का प्रयोग नहीं किया जाता है।","DNA को विशिष्ट स्थलों पर काटने के लिए प्रतिबंधन एंजाइम का प्रयोग किया जाता है।"],
    answer:"पौधों में विजातीय DNA को प्रवेश कराने के लिए जीनगन का प्रयोग नहीं किया जाता है।"
},
{
    question: "मानव प्रोटीन अल्फा-1 एंटीट्रिप्सीन का उपयोग कौन-सी बीमारी के निदान में किया जाता है?",
    option:["एड्स","कैंसर","इम्फायसेमा","उपरोक्त सभी"],
    answer:"इम्फायसेमा"
},
{
    question: "क्रॉसिंग ओवर इनमें से किस अवस्था में होता है?",
    option:["पैकीटीन","डिप्लोटीन","डायाकाइनेसिस","इनमें से कोई नहीं"],
    answer:"पैकीटीन"
},
{
    question: "प्रथम मानव जनसंख्या विस्फोट का कारण हुआ:",
    option:["कृषि","औद्योगिकीकरण","अल्पायु विवाह","सभ्यता में परिवर्तन"],
    answer:"कृषि"
},
{
    question: "निम्नलिखित में कौन प्रारंभिक कोडोन है?",
    option:["AUG","UAG","UAA","UUA"],
    answer:"AUG"
},
{
    question: "जब F1 पौधा लम्बेपन के लिए विषमयुग्मजी को स्वपरागित कराया गया, F2 पीढ़ी में दोनों लंबे एवं बौने पौधे उत्पन्न हुए। यह किस सिद्धांत को सिद्ध करता है?",
    option:["प्रभाविता","ब्लेन्डेड वंशागति","पृथक्करण का नियम","स्वतंत्र अपव्यूहन का नियम"],
    answer:"पृथक्करण का नियम"
},
{
    question: "समूह की एण्टीबॉडीज से एलर्जिक क्रिया प्रारंभ होती है:",
    option:["IgG","IgE","IgM","IgA"],
    answer:"IgE"
},
{
    question: "अंडाशय से अंडा निकलने की प्रक्रिया को क्या कहते हैं?",
    option:["अंडजनन","अंडोत्सर्ग","रजोचक्र","शुक्राणुजनन"],
    answer:"अंडोत्सर्ग"
},
{
    question: "अण्ड उपकरण में होती है",
    option:["अंड पुंज","अंड व ध्रुवीय केन्द्रक","अंड व प्रतिव्यासांत कोशिकाएँ","अंड व सहायक कोशिकाएँ"],
    answer:"अंड व सहायक कोशिकाएँ"
},
{
    question: "किसी एकल संकर में जीनोटाइप का अनुपात होगा",
    option:["3 : 1","1 : 1","1 : 2 : 1","2 : 1"],
    answer:"1 : 2 : 1"
},
{
    question: "निम्नलिखित में कौन-सा क्षार RNA में मौजूद नहीं होता है?",
    option:["थाइमीन","यूरासिल","एडिनीन","गुआनीन"],
    answer:"थाइमीन"
},
{
    question: "एंटीकोडोन किससे संबंधित है?",
    option:["t-RNA","m-RNA","r-RNA","genetic RNA"],
    answer:"t-RNA"
},
{
    question: "निम्न में से कौन विषाणु जनित रोग है?",
    option:["फ्लू","पोलियो","एड्स","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "मानव त्वचा का रंग किससे नियंत्रित होता है?",
    option:["एकल एलील","द्विक एलील","कम से कम तीन पृथक जीन","चार एलील"],
    answer:"कम से कम तीन पृथक जीन"
},
{
    question: "किसी आबादी का स्वरूप निर्भर करता है:",
    option:["वितरण पर","घनत्व पर","जातीय रचना पर","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "काजीरंगा राष्ट्रीय पार्क है:",
    option:["केरल","कर्नाटक","बंगाल","असोम"],
    answer:"असोम"
},
{
    question: "इनमें से किसमें एरिल (aril) नहीं पाया जाता है",
    option:["शरीफा","लीची","आम","मिरिस्टिका"],
    answer:"आम"
},
{
    question: "मानव में त्वचा के रंगों की वंशागति उदाहरण है:",
    option:["एक जीन की वंशागति","दो जीन की वंशागति","अधिक जीन की वंशागति","इनमें से सभी"],
    answer:"अधिक जीन की वंशागति"
},
{
    question: "निम्नलिखित में से कौन-सा जीवाणु नाइट्रोजन स्थिरीकरण करने में समर्थ है?",
    option:["ई. कोलाई","राइजोबियम","एग्रोबैक्टिरियम","इनमें से कोई नहीं"],
    answer:"राइजोबियम"
},
{
    question: "अनुलेखन के समय DNA का वह स्थल जिस पर RNA पॉलिमरेज जुड़ता है, कहलाता है:",
    option:["ग्रांही","प्रमोटर","इन्हेंसर","नियामक"],
    answer:"प्रमोटर"
},
{
    question: "मेंडल ने एक शुद्ध बैंगनी फूल वाले मटर के पौधे को सफेद फूल वाले पौधे से क्रॉस करवाया तो पहली पीढ़ी में कैसे पौधे मिले?",
    option:["सभी बैंगनी फूल वाले पौधे","सभी सफेद फूल वाले पौधे","50% बैंगनी एवं 50% सफेद फूल वाले पौधे","75% बैंगनी एवं 25% सफेद फूल वाले पौधे"],
    answer:"सभी बैंगनी फूल वाले पौधे"
},
{
    question: "कौन-सा पौधा मैंग्रोव क्षेत्र में पाया जाता है?",
    option:["राइजोफोरा","बबूल","चीड़","टेक्टोना"],
    answer:"राइजोफोरा"
},
{
    question: "किसी Monohybrid cross के Phenotypes का F2 वंशज में अनुपात है",
    option:["3 : 1","1 : 2 : 1","9 : 3 : 3 : 1","2 : 1"],
    answer:"3 : 1"
},
{
    question: "बैसिलस थुरिन्जिएंसिस द्वारा स्रावित विष प्रोटीन इनमें से कौन है?",
    option:["ट्यूबुलीन","इंसुलिन","क्राई प्रोटीन","इनमें से सभी"],
    answer:"क्राई प्रोटीन"
},
{
    question: "अनावरोधित प्रजनन क्षमता है:",
    option:["जन्म दर","वहन क्षमता","जैव विविधता","जनन क्षमता"],
    answer:"जनन क्षमता"
},
{
    question: "पृथ्वी सम्मेलन किस वर्ष आयोजित हुआ था?",
    option:["1972 में","1992 में","1952 में","इनमें से सभी"],
    answer:"1992 में"
},
{
    question: "जीवाणु और विषाणु द्वारा मनुष्य में होने वाले रोग का पता करने के लिए उपयुक्त ELISA विधि किस सिद्धांत पर आधारित है?",
    option:["प्रतिजन-प्रतिरक्षी क्रिया","प्रतिजन-प्रतिजन क्रिया","प्रतिरक्षी-प्रतिरक्षी क्रिया","इनमें से कोई नहीं"],
    answer:"प्रतिजन-प्रतिरक्षी क्रिया"
},
{
    question: "निम्न में से किसके द्वारा कीटनाशी पाइरेथ्रम बनाया जाता है?",
    option:["साइमोपोगोन","टेफ्रोसिया","क्राइसेन्थीमम","विटीवेरिया"],
    answer:"क्राइसेन्थीमम"
},
{
    question: "पौधों में नीमैटोडों से होने वाले रोगों को जैविकीय नियंत्रण निम्नलिखित में किसके द्वारा कारगर सिद्ध हुआ?",
    option:["पाइसोलिथस टिक्टोरियस","स्यूडोमोनास सेपैसिया","ग्लाइओक्लैडियम वाइरस","पीसिलोमाइसीज लिलैसिनस"],
    answer:"पीसिलोमाइसीज लिलैसिनस"
},
{
    question: "Egg apparatus बना होता है",
    option:["Egg cell","Synergids","Antipodals","दोनों (A) तथा (B)"],
    answer:"दोनों (A) तथा (B)"
},
{
    question: "एक छोटी मछली सार्क के आधार पर चिपकी रहती है और इससे भोजन प्राप्त करती है। यह सम्बन्ध कहलाता है:",
    option:["प्रतिजीविता","सहभोजिता","परभक्षण","परजीविता"],
    answer:"सहभोजिता"
},
{
    question: "निम्नलिखित में से कौन-सा एन्जाइम उच्च तापमान पर भी सक्रिय होता है?",
    option:["सेल्यूलेज","टैक पॉलिमरेज","लाइसोजाइम","पेक्टेनेज"],
    answer:"टैक पॉलिमरेज"
},
{
    question: "घासस्थलीय पारिस्थितिक तंत्र में ग्रासहॉपर है",
    option:["उत्पादक","प्राथमिक उपभोक्ता","द्वितीयक उपभोक्ता","तृतीयक उपभोक्ता"],
    answer:"प्राथमिक उपभोक्ता"
},
{
    question: "एकल कोशीय प्रोटीन (SCP) किससे प्राप्त किया जाता है?",
    option:["एककोशीय सूक्ष्मजीवों से","बहुकोशीय सूक्ष्मजीवों से","जीवाणु द्वारा","एककोशीय तथा बहुकोशीय सूक्ष्मजीवों दोनों से"],
    answer:"एककोशीय तथा बहुकोशीय सूक्ष्मजीवों दोनों से"
},
{
    question: "‘क्रिसमस रोग’ का दूसरा नाम है",
    option:["डाउन सिंड्रोम","निद्रा रोग","हीमोफीलिया B","हिपेटाइटिस B"],
    answer:"हीमोफीलिया B"
},
{
    question: "निषेचन के बाद ovule विकसित होकर बीज बनता है, जबकि carpel से क्या विकसित होता है?",
    option:["पेरीस्पर्म","पेरिकार्प","टेस्टा","इनमें से कोई नहीं"],
    answer:"पेरिकार्प"
},
{
    question: "“पारिस्थितिक तंत्र” शब्द के उपयोग का श्रेय दिया जाता है:",
    option:["गार्डनर को","ओडम को","टॉनसली को","वार्मिंग को"],
    answer:"टॉनसली को"
},
{
    question: "कौन-सा RNA थोड़े समय के लिए होता है?",
    option:["mRNA","tRNA","rRNA","snRNA"],
    answer:"mRNA"
},
{
    question: "निम्नांकित में से कौन सत्य फल है?",
    option:["सेब","नाशपाती","काजूला","नारियल"],
    answer:"नारियल"
},
{
    question: "निम्नलिखित में कौन-सी यांत्रिक तकनीक गर्भधारण रोकने के लिए ग्रीवा के ऊपर लगाई जाती है?",
    option:["डायफ्राम","कंडोम","लूप","कॉपर-टी"],
    answer:"डायफ्राम"
},
{
    question: "निम्नांकित में कौन मिथ्या फल है?",
    option:["सेब","आम","केला","इनमें से कोई नहीं"],
    answer:"सेब"
},
{
    question: "SO₂ का प्रदूषण नष्ट करता है:",
    option:["लाइकेन","कवक","शैवाल","मछली"],
    answer:"लाइकेन"
},
{
    question: "निम्न में कौन-सा लम्बवत् द्विविभाजन (Longitudinal binary fission) करता है?",
    option:["यूग्लिना","प्लाजमोडियम","प्लेनेरिया","पेरामिशियम"],
    answer:"यूग्लिना"
},
{
    question: "सोयाबीन की फसल में वृद्धि के लिए जैव उर्वरक के रूप में प्रयोग होने वाला जीव है:",
    option:["एजोस्पाइरिलम","राइजोबियम","नॉस्टॉक","एजोटोबैक्टर"],
    answer:"राइजोबियम"
},
{
    question: "युग्मक में गुणसूत्र का सेट होता है:",
    option:["2n","3n","4n","n"],
    answer:"n"
},
{
    question: "स्तनपायी जीवों में नर हार्मोन की उत्पत्ति कहाँ होती है?",
    option:["लीवर में","अण्डकोष में","किडनी में","फेफड़ा में"],
    answer:"अण्डकोष में"
},
{
    question: "निम्नलिखित में कौन-सी खोज महज एक संयोगवश घटना है?",
    option:["पेनिसिलिन","इन्सुलिन","क्लोरोफेनिकोल","DNA"],
    answer:"पेनिसिलिन"
},
{
    question: "अल्कोहल उद्योग में उत्पन्न बैक्टीरिया का नया स्ट्रेन कौन-सा है?",
    option:["ई. कोलाई","सैक्रोमायसीज","बैसीलस सबटायलिस","स्यूडोमोनास पुटीडा"],
    answer:"बैसीलस सबटायलिस"
},
{
    question: "भ्रूण विज्ञान के जनक कौन हैं?",
    option:["Hippocrates","Pander","अरस्तू","Spemann"],
    answer:"अरस्तू"
},
{
    question: "मानव नर में शुक्राणु भंडारण किस जनन अंग में होता है?",
    option:["शिश्न","शुक्रवाहिका","एपिडिमिस","वृषण"],
    answer:"एपिडिमिस"
},
{
    question: "ऑन्कोजीन इनमें से किसके लिए उत्तरदायी है?",
    option:["कैंसर","एड्स","क्षय-रोग","पोलियो"],
    answer:"कैंसर"
},
{
    question: "कार्बन मोनोऑक्साइड से मनुष्य की मौत हो जाती है क्योंकि यह नष्ट कर देता है",
    option:["हीमोग्लोबिन","फाइटोक्रोम","साइटोक्रोम","(A) और (B) दोनों"],
    answer:"हीमोग्लोबिन"
},
{
    question: "अम्ल वर्षा में SO₂ सल्फ्यूरिक अम्ल का भाग होता है:",
    option:["100%","70%","50%","30%"],
    answer:"70%"
},
{
    question: "निम्न में से किस DNA अणु में प्यूरिन है?",
    option:["A तथा C","C तथा T","A तथा G","इनमें से कोई नहीं"],
    answer:"A तथा G"
},
{
    question: "निम्नलिखित में कौन सही फल है",
    option:["नारियल","सेब","नाशपाती","काजू"],
    answer:"नारियल"
},
{
    question: "यदि परागकण का स्थानान्तरण वायु द्वारा होता है तो इसे कहते हैं",
    option:["Anemophily","Entomophily","Ornithophily","Myrmecophily"],
    answer:"Anemophily"
},
{
    question: "निम्नलिखित में कौन अंडज नहीं है?",
    option:["सर्प","मुर्गी","घड़ियाल","मानव"],
    answer:"मानव"
},
{
    question: "पृथ्वी के निकट वायुमण्डल का क्षेत्र कहलाता है:",
    option:["स्ट्रेटोस्फीयर","मीसोस्फीयर","ट्रोपोस्फीयर","थर्मोस्फीयर"],
    answer:"ट्रोपोस्फीयर"
},
{
    question: "मानव अंड लगभग योकरहित होता है, इसे कहते हैं",
    option:["Microlecithal","Alecithal","Macrolecithal","Mesolecithal"],
    answer:"Alecithal"
},
{
    question: "परागकण का उसी पौधे के दूसरे पुष्प के वर्तिकान पर जमा होने को कहते हैं",
    option:["Dichogamy","Geitonogamy","Xenogamy","Hydrogamy"],
    answer:"Geitonogamy"
},
{
    question: "Ti प्लाज्मिड पाया जाता है:",
    option:["एग्रोबैक्टीरियम ट्यूमीफेसिएंस में","इस्चिरिचिया कोलाई में","बैक्टीरियोफेज में","इनमें से किसी में नहीं"],
    answer:"एग्रोबैक्टीरियम ट्यूमीफेसिएंस में"
},
{
    question: "डेंगू बुखार किसके कारण होता है?",
    option:["जीवाणु","विषाणु","प्रोटोजोआ","कृमि"],
    answer:"विषाणु"
},
{
    question: "सोमाक्लोनल विभिन्नता किससे प्राप्त हो सकती है?",
    option:["कॉल्चीसीन के प्रयोग से","संकरण से","गामा किरणों के विकिरण से","ऊतक संवर्धन से"],
    answer:"ऊतक संवर्धन से"
},
{
    question: "DNA रिपेयरिंग होती है:",
    option:["DNA पॉलीमरेज I द्वारा","DNA पॉलीमरेज II द्वारा","दोनों (A) और (B)","लाइगेज द्वारा"],
    answer:"DNA पॉलीमरेज I द्वारा"
},
{
    question: "Y-गुणसूत्र पर स्थित जीन्स हैं",
    option:["उत्परिवर्ती जीन्स","ऑटोसोमल जीन्स","होलैन्ड्रिक जीन्स","लिंग सहलग्न जीन"],
    answer:"होलैन्ड्रिक जीन्स"
},
{
    question: "निम्नलिखित में कौन-सा प्रभावशाली गुण है?",
    option:["वर्णांधता","रतौंधी","Rht","एल्बिनिज्म"],
    answer:"Rht"
},
{
    question: "द्विसंकर क्रॉस का फीनोटिपिक अनुपात क्या है?",
    option:["1 : 2 : 1","3 : 1","9 : 3 : 3 : 1","इनमें से कोई नहीं"],
    answer:"9 : 3 : 3 : 1"
},
{
    question: "वुचेरेरिया बैंक्रोफ्टी आदमी में फाइलेरिया रोग पैदा करता है। यह किस समूह का है?",
    option:["प्रोटोजोआ","विषाणु","जीवाणु","हेलमिन्थ"],
    answer:"हेलमिन्थ"
},
{
    question: "एग्रोबैक्टीरियम ट्यूमीफेसीयन्स में पाया जाता है:",
    option:["A-प्लाज्मिड","Ti-प्लाज्मिड","C-प्लाज्मिड","G-प्लाज्मिड"],
    answer:"Ti-प्लाज्मिड"
},
{
    question: "समताप मंडल में पराबैंगनी विकिरणों को निम्नलिखित के द्वारा अवशोषित किया जाता है:",
    option:["ऑक्सीजन","ओजोन","SO₂","ऑर्गन"],
    answer:"ओजोन"
},
{
    question: "भारतीय ग्रामीण क्षेत्र में बायोडीजल के स्रोत के रूप में किसका उपयोग किया जा रहा है?",
    option:["यूफॉर्बिया","चुकन्दर","गन्ना","पोंगामिया"],
    answer:"पोंगामिया"
},
{
    question: "कैंसर किस कारण से होता है?",
    option:["जीवाणु द्वारा","ऑन्कोजीन्स के द्वारा","(A) और (B) दोनों","इनमें से कोई नहीं"],
    answer:"ऑन्कोजीन्स के द्वारा"
},
{
    question: "निम्नलिखित वैज्ञानिकों ने ई. कोलाई में लैक प्रचालेक की स्पष्ट जानकारी दी:",
    option:["जैकब एवं मोनॉड","वाटसन एवं क्रिक","बीडल एवं टैटम","इनमें से कोई नहीं"],
    answer:"जैकब एवं मोनॉड"
},
{
    question: "जैव तकनीक में प्रयुक्त 'आण्विक कैंची' है:",
    option:["DNA पॉलीमरेज","DNA लाइगेज","रिस्ट्रिक्शन एंडोन्यूक्लिऐज","हेलिकेज"],
    answer:"रिस्ट्रिक्शन एंडोन्यूक्लिऐज"
},
{
    question: "यदि एक नदी सीवेज से दूषित हो जाए तो मछलियाँ मर जाएँगी, क्योंकि",
    option:["O₂ की जल में कमी हो जाती है","जल की दुर्गंध के कारण","सीवेज में मौजूद रोगाणुओं के कारण","ठोस पदार्थों के क्लेष्म में फँसने के कारण"],
    answer:"O₂ की जल में कमी हो जाती है"
},
{
    question: "आलू में कायिक संचरण किसके द्वारा होता है?",
    option:["पत्तियाँ","स्तंभ","जड़","बीज"],
    answer:"स्तंभ"
},
{
    question: "परागकण किसकी विशेषता है",
    option:["ब्रायोफायट्स एवं आवृत्तबीजी","टेरिडोफायट्स एवं आवृत्तबीजी","आवृत्तबीजी एवं अनावृत्तबीजी","आवृत्तबीजी एवं कवक"],
    answer:"आवृत्तबीजी एवं अनावृत्तबीजी"
},
{
    question: "DNA पुनर्योगज तकनीक में Restriction endonuclease वृहत् पैमाने पर उपयोग किया जाता है। ये प्राप्त होते हैं:",
    option:["बैक्टीरियोफेज से","जीवाणु कोशिका से","प्लाज्मिड्स से","सभी प्रोकैरियोटिक कोशिकाओं से"],
    answer:"जीवाणु कोशिका से"
},
{
    question: "यदि एक नदी सीवेज से दूषित हो जाए तो मछलियाँ मर जाएँगी:",
    option:["बुरी दुर्गंध से","O₂ की कमी से","सीवेज में उपस्थित रोगाणुओं से","ठोस पदार्थों के गिलों में फँसने पर"],
    answer:"O₂ की कमी से"
},
{
    question: "गर्भाधान अवधि है",
    option:["जन्म एवं Puberty के बीच का","भ्रूण निर्माण एवं गर्भाधारण के बीच का","निषेचन एवं शिशु जन्म के बीच का","निषेचन एवं गर्भधारण के बीच का"],
    answer:"निषेचन एवं शिशु जन्म के बीच का"
},
{
    question: "ओजोन स्तर पाया जाता है:",
    option:["ट्रोपोस्फियर में","एक्सोस्फियर में","मीजोस्फियर में","स्ट्रैटोस्फियर में"],
    answer:"स्ट्रैटोस्फियर में"
},
{
    question: "प्रतिबंधन एंडोन्यूक्लिएज DNA के किस विशिष्ट न्यूक्लियोटाइड अनुक्रमों को पहचानता है?",
    option:["पैलिन्ड्रोमिक","एंजाइम","प्लाज्मिड","इनमें से सभी"],
    answer:"पैलिन्ड्रोमिक"
},
{
    question: "पारिस्थितिक तंत्र के दो घटक होते हैं:",
    option:["पौधे एवं प्राणी","जैविक एवं अजैविक","ऑक्सीजन और कार्बन","उपरोक्त में से कोई नहीं"],
    answer:"जैविक एवं अजैविक"
},
{
    question: "जैव डकैती निम्न में किससे संबंधित है?",
    option:["पारम्परिक ज्ञान","जैव अणु तथा जैव संसाधन एवं जैव संसाधनों से जीन को निकालना","जैव संसाधन","उपरोक्त सभी"],
    answer:"उपरोक्त सभी"
},
{
    question: "वर्णांधता में रोगी नहीं पहचान पाता है",
    option:["लाल तथा पीला रंग","लाल तथा हरा रंग","नीला तथा हरा रंग","इनमें से कोई नहीं"],
    answer:"लाल तथा हरा रंग"
},
{
    question: "निरन्तर क्रियात्मक जीन है:",
    option:["जीन बैटरी","लक्सरी जीन्स","माइल्ड जीन्स","हाउस कीपिंग जीन्स"],
    answer:"हाउस कीपिंग जीन्स"
},
{
    question: "दात्र कोशिका अरक्तता में बीटा ग्लोबिन श्रृंखला में ग्लूटैमिक अम्ल का किस अमीनो अम्ल से प्रतिस्थापन होता है?",
    option:["ग्लाइसीन","वैलीन","एस्पार्टिक अम्ल","उपर्युक्त में कोई नहीं"],
    answer:"वैलीन"
},
{
    question: "एक ही फल के भीतर परागकोशों से परागकणों का वर्तिकान में पहुँचना क्या कहलाता है?",
    option:["स्वपरागण","अंडोत्सर्ग","परपरागण","निषेचन"],
    answer:"स्वपरागण"
},
{
    question: "जीन का Segregation होता है",
    option:["भ्रूण निर्माण में","एनाफेज प्रथम में","एनाफेज द्वितीय में","मेटाफेज द्वितीय में"],
    answer:"एनाफेज प्रथम में"
},
{
    question: "सबसे प्रचलित जीवाणु उर्वरक है:",
    option:["नाइट्रोसोमोनास","नाइट्रोबैक्टर","नाइट्रोसोकोकस","राइजोबियम"],
    answer:"राइजोबियम"
},
{
    question: "प्राइमरी स्पर्मेटोसाइट से बनने वाले शुक्राणुओं की संख्या होती है",
    option:["8","4","3","1"],
    answer:"4"
},
{
    question: "मेंडल के नियमों को मान्यता दिलाई",
    option:["कोरेन्स","शेरमैक","डी व्रीज","इन सभी ने"],
    answer:"इन सभी ने"
},
{
    question: "स्त्री में किस हार्मोन की प्रतिक्रिया के कारण द्वितीयक लैंगिक लक्षण विकसित होते हैं?",
    option:["रिलेक्सिन","प्रोजेस्ट्रॉन","इस्ट्रोजेन","गोनेडोट्रोपिन"],
    answer:"इस्ट्रोजेन"
},
{
    question: "लैक ऑपेरॉन का घटक नहीं है:",
    option:["प्राइमर जीन","प्रोमोटर जीन","संरचनात्मक जीन","नियामक जीन"],
    answer:"प्राइमर जीन"
},
{
    question: "निम्नलिखित में से कौन-सा पादप उभयलिंगाश्रयी होता है?",
    option:["मारकेन्शिया","पाइनस","साइकस","पपीता"],
    answer:"पाइनस"
},
{
    question: "भ्रूण की 16 कोशिकीय अवस्था कहलाती है",
    option:["मोरुला","ब्लास्टोमियर","ब्लास्टुला","गैस्टुला"],
    answer:"मोरुला"
},
{
    question: "निम्नलिखित ने अंगुलीछापी तकनीक को सर्वप्रथम विकसित किया:",
    option:["एलेक जेफरीज","आर्थर कॉर्नबर्ग","जेम्स वाटसन","उपर्युक्त में कोई नहीं"],
    answer:"एलेक जेफरीज"
},
{
    question: "क्योटो प्रोटोकॉल सम्बन्धित है:",
    option:["ओजोन क्षय","हरित गृह प्रभाव","जल प्रदूषण","वन्य जीवन का संरक्षण"],
    answer:"हरित गृह प्रभाव"
},
{
    question: "निम्न में से कौन DNA संश्लेषण हेतु RNA का टेम्प्लेट के रूप में प्रयोग करता है?",
    option:["रिवर्स ट्रांसक्रिप्टेज","DNA-डिपेन्डेन्ट RNA पॉलीमरेज","DNA पॉलीमरेज","RNA पॉलीमरेज"],
    answer:"रिवर्स ट्रांसक्रिप्टेज"
},
{
    question: "यदि किसी परागकोश में 4-sporogenous कोशिकाएँ हों, तो परागकण की संख्या होगी",
    option:["4","8","16","12"],
    answer:"16"
},
{
    question: "B-DNA के एक पूर्ण घुमाव में कितने बेस पेयर्स होते हैं?",
    option:["10","12","20","15"],
    answer:"10"
},
{
    question: "Egg के Cortex में मौजूद Cortical granules में पाया जाता है, मुख्यतः",
    option:["लिपिड","प्रोटीन","ग्लाइकोजन","म्यूकोपौलिसैकेराइड्स"],
    answer:"लिपिड"
},
{
    question: "परागकण पीले वर्ण के होते हैं क्योंकि इसमें मौजूद होते हैं",
    option:["Flavonoids एवं Carotenoids","सल्फर","क्रोमोप्लास्ट","Etiolin"],
    answer:"Flavonoids एवं Carotenoids"
},
{
    question: "ऑटोमोबाइल निर्वातक में उपस्थित सर्वाधिक हानिकारक कणकीय पदार्थ है:",
    option:["मरकरी","लेड","कैडमियम","आर्सेनिक"],
    answer:"लेड"
},
{
    question: "युग्मक के संचयन को कहते हैं:",
    option:["परागण","सिनगेमी","पार्थेनोजेनेसिस","स्पोरोजेनेसिस"],
    answer:"सिनगेमी"
},
{
    question: "MMC में 24 गुणसूत्र हैं। इसके endosperm में गुणसूत्रों की संख्या होगी",
    option:["12","24","36","48"],
    answer:"36"
},
{
    question: "निम्न में से किस पादप में बीज तो बनता है लेकिन पुष्प नहीं",
    option:["मक्का","पुदीना","पीपल","चीड़"],
    answer:"चीड़"
},
{
    question: "मूल रोम किसमें नहीं होती?",
    option:["जलोद्भिद्","लवणोद्भिद","स्थलोद्भिद","हेलिओफाइट"],
    answer:"जलोद्भिद्"
},
{
    question: "सामान्यतः Capsella में भ्रूणपोष होता है",
    option:["अगुणित","द्विगुणित","त्रिगुणित","बहुगुणित"],
    answer:"त्रिगुणित"
},
{
    question: "किसी B-DNA के एक वलय (spiral) में न्यूक्लियोटाइड की संख्या होती है:",
    option:["5","10","20","25"],
    answer:"10"
},
{
    question: "इनमें से किस क्रिया से DDT की सांद्रता अगले पोषी स्तर में बढ़ती है?",
    option:["जल-प्रस्फुटन","जैव आवर्धन","सुपोषण","ओजोन प्रदूषण"],
    answer:"जैव आवर्धन"
},
{
    question: "स्टार्च से इथेनॉल का औद्योगिक उत्पादन किस खास प्रजाति द्वारा होता है?",
    option:["पेनिसिलिन","एजोटोबैक्टर","सैकेरोमायसिज","लैक्टोबैसिलस"],
    answer:"सैकेरोमायसिज"
},
{
    question: "निम्नलिखित में कौन आनुवंशिक पदार्थ कहलाता है?",
    option:["DNA","प्रोटीन","वसा","इनमें सभी"],
    answer:"DNA"
},
{
    question: "प्रोटीन संश्लेषण की क्रिया संपन्न होती है:",
    option:["माइटोकॉण्ड्रिया","लवक","राइबोसोम","सेंट्रोसोम"],
    answer:"राइबोसोम"
},
{
    question: "पुरुषों से क्या सम्बन्धित है?",
    option:["मुँह से खायी जाने वाली गोलियाँ","डिम्बवाहिकाच्छेदन","शुक्रवाहिकोच्छेदन","उपर्युक्त में से कोई नहीं"],
    answer:"शुक्रवाहिकोच्छेदन"
},
{
    question: "डोडो है",
    option:["विलुप्त प्राणी","संकटग्रस्त प्राणी","आपत्तिग्रस्त प्राणी","इनमें से कोई नहीं"],
    answer:"विलुप्त प्राणी"
},
{
    question: "GAATTC किस प्रतिबन्धन एंडोन्यूक्लिएज का अभिज्ञान स्थान है?",
    option:["HindIII","EcoRI","BamI","HindII"],
    answer:"EcoRI"
},
{
    question: "मलेरिया परजीवी का रोगवाहक इनमें से कौन है?",
    option:["मादा क्यूलेक्स","मादा एनोफिलीज","मादा बालू मक्खी","इनमें से सभी"],
    answer:"मादा एनोफिलीज"
},
{
    question: "मीनामाटा रोग उत्पन्न होता है:",
    option:["वायुमंडल में आर्सेनिक से","पीने के पानी में फ्लोराइड होने से","पीने के पानी में पारायुक्त प्रदूषक से","जल में तेल के फैल जाने से"],
    answer:"पीने के पानी में पारायुक्त प्रदूषक से"
},
{
    question: "माता द्वारा दिए गए युग्मक और पिता द्वारा दिए गए युग्मक के संलयन से क्या बनता है?",
    option:["युग्मक","युग्मनज","संतति","क्लोम"],
    answer:"युग्मनज"
},
{
    question: "निम्न में से आभासी फल कौन-सा है",
    option:["स्ट्रॉबेरी","अखरोट","सेब","उपरोक्त तीनों"],
    answer:"उपरोक्त तीनों"
},
{
    question: "राइबोसोम के बड़े गुच्छ को कहते हैं:",
    option:["मेगासोम","माइक्रोसोम","पॉलीराइबोसोम","ओलिगोसोम"],
    answer:"पॉलीराइबोसोम"
},
{
    question: "DNA द्विगुणन में किस एंजाइम की मुख्य भूमिका रहती है?",
    option:["लाइगेज","RNA पॉलिमरेज","DNA पॉलिमरेज","रिवर्स ट्रांसक्रिप्टेज"],
    answer:"DNA पॉलिमरेज"
},
{
    question: "Ecosystem के लिए निर्देशी बल है।",
    option:["उत्पादक","जैवमात्रा","उत्पादक में निहित कार्बोहाइड्रेट","सौर ऊर्जा"],
    answer:"सौर ऊर्जा"
},
{
    question: "दस प्रतिशत ऊर्जा-हास का नियम किसने बनाया?",
    option:["लिंडेमैन","लिपमेन","न्यूबर्ग","बर्जिलियस"],
    answer:"लिंडेमैन"
},
{
    question: "भ्रूणकोष की सेन्ट्रल कोशिका है",
    option:["प्रारंभिक केन्द्रक","द्वितीयक केन्द्रक","सहायक कोशिका","(A) और (B) दोनों"],
    answer:"द्वितीयक केन्द्रक"
},
{
    question: "स्पीशीज प्लांटेरम पुस्तक किसने लिखी?",
    option:["जॉन रे","कैरोलस लिनियस","थियोफ्रेस्टस","इनमें से कोई नहीं"],
    answer:"कैरोलस लिनियस"
},
{
    question: "मनुष्य में हिम अन्धता का मुख्य कारण इनमें से कौन-सा है?",
    option:["UV-B किरण का अवशोषण","इन्फ्रा विकिरण का अवशोषण","कॉस्मिक विकिरण का अवशोषण","स्वच्छ मंडल का हिम अपरदन"],
    answer:"UV-B किरण का अवशोषण"
},
{
    question: "सिरका उद्योग में किस सूक्ष्मजीव का उपयोग होता है?",
    option:["क्लोस्ट्रीडियम का","एसीटोबैक्टर का","ट्राइकोडर्मा का","स्ट्रेप्टोकोकस का"],
    answer:"एसीटोबैक्टर का"
},
{
    question: "संक्रमित पेयजल से फैलने वाला रोग इनमें से कौन है?",
    option:["मियादी बुखार या टाइफाइड","मलेरिया","फाइलेरिया","काला ज्वर"],
    answer:"मियादी बुखार या टाइफाइड"
},
{
    question: "गोबर गैस का एक प्रमुख घटक है:",
    option:["ब्यूटेन","अमोनिया","मिथेन","इथेन"],
    answer:"मिथेन"
},
{
    question: "जलीय पौधों में कटी-फटी पत्तियाँ होती हैं:",
    option:["सतही क्षेत्रफल कम करने के लिए","सतही क्षेत्रफल बढ़ाने के लिए","जलधाराओं का प्रभाव कम करने के लिए","रन्ध्रों की संख्या बढ़ाने के लिए"],
    answer:"जलधाराओं का प्रभाव कम करने के लिए"
},
{
    question: "पौधे की प्रत्येक कोशिका के अंदर एक नए पौधे को जन्म देने की क्षमता होती है। कोशिकाओं के इस आनुवंशिक गुण को क्या कहते हैं?",
    option:["सोमा क्लोनल वैरिएशन","जीन क्लोनिंग","सेल्यूलर टोटीपोटेंसी","इनमें से सभी"],
    answer:"सेल्यूलर टोटीपोटेंसी"
},
{
    question: "निम्न में परजीवी जंतु कौन-सा है?",
    option:["मछली","खरगोश","सूअर","उपरोक्त सभी"],
    answer:"उपरोक्त सभी"
},
{
    question: "RNA अंतरक्षेप क्या है?",
    option:["पीड़कनाशी","कोशिकीय सुरक्षा की विधि","प्रोटीन","इनमें से कोई नहीं"],
    answer:"कोशिकीय सुरक्षा की विधि"
},
{
    question: "द्विसंकर क्रॉस में अनुलक्षणी (फेनोटाइपिक) अनुपात होता है",
    option:["3 : 1","1 : 2 : 1","9 : 7","9 : 3 : 3 : 1"],
    answer:"9 : 3 : 3 : 1"
},
{
    question: "ट्रिप्टोफैन ऑपेरॉन किस प्रकार के तंत्र को दर्शाता है?",
    option:["प्रेरणीय","दमनकारी","A एवं B दोनों","इनमें कोई नहीं"],
    answer:"दमनकारी"
},
{
    question: "कौन-सा एंजाइम उच्च तापक्रम पर भी सक्रिय रहता है?",
    option:["सेलूलेज","पेक्टिनेज","टैक पॉलिमरेज","लाइसोसाइम"],
    answer:"टैक पॉलिमरेज"
},
{
    question: "आनुवंशिकी अभियांत्रिकी में प्रयुक्त सबसे सामान्य जीवाणु है:",
    option:["इश्चीरीशिया (Escherichia)","क्लॉसट्रीडियम","साल्मोनेला","बेसिलस"],
    answer:"इश्चीरीशिया (Escherichia)"
},
{
    question: "कैलस एवं सस्पेंशन कल्चर में कौन-सा ऑक्सिन प्रयोग किया जाता है?",
    option:["NAA","IBA","2,4-D","एब्सिसिक अम्ल"],
    answer:"2,4-D"
},
{
    question: "पराग तथा बीजाणु के अध्ययन को क्या कहते हैं",
    option:["पेलीनोलॉजी","मारफोलॉजी","फाइकोलॉजी","साइटोलॉजी"],
    answer:"पेलीनोलॉजी"
},
{
    question: "इनमें से कौन एकलिंगी नहीं है?",
    option:["तिलचट्टा","कुत्ता","गाय","केंचुआ"],
    answer:"केंचुआ"
},
{
    question: "जीन उत्परिवर्तन में, एडीनीन ग्वानिन द्वारा प्रतिस्थापित होता है, यह है:",
    option:["फ्रेम-शिफ्ट उत्परिवर्तन","ट्रान्सक्रिप्शन","ट्रांजिशन","ट्रांसवर्जन"],
    answer:"ट्रांजिशन"
},
{
    question: "पानी द्वारा पर-परागण को कहते हैं",
    option:["वायु-परागण","जल-परागण","कीट-परागण","इन सभी में"],
    answer:"जल-परागण"
},
{
    question: "स्ट्रेप्टोमाइसिन उत्पादित की जाती है:",
    option:["स्ट्रेप्टोमाइसिन स्कोलियस द्वारा","स्ट्रेप्टोमाइसिस फ्रेडी द्वारा","स्ट्रेप्टोमाइसिस वेनेजुएलो द्वारा","स्ट्रेप्टोमाइसिस ग्रीसियस द्वारा"],
    answer:"स्ट्रेप्टोमाइसिस ग्रीसियस द्वारा"
},
{
    question: "निम्न में से कौन एकलिंगी है?",
    option:["सरसों","उड़हुल","पपीता","इनमें से कोई नहीं"],
    answer:"पपीता"
},
{
    question: "मेंडल के सिद्धांत को दोहराने वाले वैज्ञानिक कौन थे?",
    option:["डार्विन, वैलेस एवं ह्यूगो डि वीज","डार्विन, कोरेन्स एवं शेरमैक","ह्यूगो डि वीज, कोरेन्स एवं शेरमैक","मॉर्गन, ह्यूगो डि व्रीज एवं कोरेन्स"],
    answer:"ह्यूगो डि वीज, कोरेन्स एवं शेरमैक"
},
{
    question: "एक पुष्पी पादप में मादा जनन अंग इकाई को कहते हैं",
    option:["स्त्रीकेसर","पुंकेसर","परागकोष","अन्य"],
    answer:"स्त्रीकेसर"
},
{
    question: "मिथेमोग्लोबिन के निर्माण में हीमोग्लोबिन की प्रतिक्रिया किससे होती है?",
    option:["नाइट्रेट","CO","CO₂","नाइट्रस ऑक्साइड"],
    answer:"नाइट्रेट"
},
{
    question: "वह जीव या पौधा जिसके शरीर में नर तथा मादा दोनों प्रकार के जनन पाए जाते हैं, कहलाता है:",
    option:["स्पोर","संयुग्मन","उभयलिंगी","एकलिंगी"],
    answer:"उभयलिंगी"
},
{
    question: "Bt विष है:",
    option:["अंतःकोशिकीय लिपिड्स","अंतःकोशिकीय क्रिस्टलीय प्रोटीन","बाह्य कोशिकीय क्रिस्टलीय प्रोटीन","लिपिड्स"],
    answer:"बाह्य कोशिकीय क्रिस्टलीय प्रोटीन"
},
{
    question: "लीची का खाया जाने वाला भाग कहलाता है?",
    option:["टेग्मेन","भ्रूणपोष","अध्यावरण","बीजचोल"],
    answer:"बीजचोल"
},
{
    question: "मेंडल द्वारा दिया गया युग्मकों की शुद्धता का नियम आधारित है",
    option:["परीक्षण संकरण","प्रतीप संकरण","एकसंकर संकरण","द्विसंकर संकरण"],
    answer:"एकसंकर संकरण"
},
{
    question: "नियंत्रण (Regulatory) जीन को क्या कहा जाता है?",
    option:["निरोधक जीन","रिप्रेसर","ऑपरेटर जीन","प्रोमोटर जीन"],
    answer:"निरोधक जीन"
},
{
    question: "परागकण का बाह्य चोल किससे बनता है",
    option:["सेलुलोज","पेक्टिन","स्पोरोपोलेनिन","टेपिटम"],
    answer:"स्पोरोपोलेनिन"
},
{
    question: "अंतःगर्भाशय तकनीक की औसत असफलता की दर है:",
    option:["23%","20%","1%","4%"],
    answer:"4%"
},
{
    question: "उष्ण कटिबंधीय सघन वनों का कारण है",
    option:["कम वर्षा एवं कम तापमान","अधिक वर्षा और कम तापमान","कम वर्षा एवं अधिक तापमान","अधिक वर्षा और अधिक तापमान"],
    answer:"अधिक वर्षा और अधिक तापमान"
},
{
    question: "G. J. Mendel था",
    option:["ब्रिटिश पादरी","आस्ट्रेलियन पादरी","आस्ट्रियन पादरी","जर्मन वैज्ञानिक"],
    answer:"आस्ट्रियन पादरी"
},
{
    question: "द्विसंकर क्रॉस में फीनोटाइपिक अनुपात होता है",
    option:["3 : 1","1 : 2 : 1","9 : 7","9 : 3 : 3 : 1"],
    answer:"9 : 3 : 3 : 1"
},
{
    question: "राइबोसोम का वृहत समूह कहलाता है:",
    option:["मेगासोम","माइक्रोसोम","अलीगोसोम","पॉलीराइबोसोम"],
    answer:"पॉलीराइबोसोम"
},
{
    question: "100 परागकण बनने के लिए कितने सूत्री विभाजन की आवश्यकता होगी",
    option:["100","50","25","20"],
    answer:"25"
},
{
    question: "भारतवर्ष में पर्यावरण सुरक्षा अधिनियम किस वर्ष पास हुआ था?",
    option:["1976","1986","1966","1996"],
    answer:"1986"
},
{
    question: "जिनकी संख्या बहुत कम हो गई है और विलुप्त होने के कगार पर हैं उन्हें कहते हैं:",
    option:["भेज जातियाँ","दुर्लभ जातियाँ","संकटमयी","क्षति-आशंकित"],
    answer:"संकटमयी"
},
{
    question: "जैविक रूपांतरित जीव हो सकते हैं",
    option:["रोगाणु प्रतिरोधक","सूखा प्रतिरोधक","रोगाणु एवं सूखा दोनों प्रतिरोधक","इनमें से कोई नहीं"],
    answer:"रोगाणु एवं सूखा दोनों प्रतिरोधक"
},
{
    question: "आधुनिक भ्रूणविज्ञान के जनक हैं",
    option:["श्लीडेन एवं श्वान","हर्टविग","अरस्तू","वान बेयर"],
    answer:"वान बेयर"
},
{
    question: "मटर में अप्रभावी गुण है",
    option:["झुर्रीदार बीज","लंबा तना","गोल बीज","रंगीन बीजावरण"],
    answer:"झुर्रीदार बीज"
},
{
    question: "कौन-सा 'थियामिन' विटामिन है?",
    option:["B₁","B₂","B₆","B₁₂"],
    answer:"B₁"
},
{
    question: "मनुष्य में ABO रक्त समूह किसका उदाहरण है?",
    option:["Polygenic inheritance","Multifactor inheritance","Pleiotropic gene","Multiple alleles"],
    answer:"Multiple alleles"
},
{
    question: "पौधों की जड़ों से ट्यूमर पैदा करता है:",
    option:["E. coli","एग्रोबैक्टीरियम ट्यूमीफेसिएन्स","थर्मस एक्वेटिक्स","इनमें से कोई नहीं"],
    answer:"एग्रोबैक्टीरियम ट्यूमीफेसिएन्स"
},
{
    question: "मुर्दे को दफन करने एवं धर्म के प्रमाण सर्वप्रथम किस जीवाश्म से मिलते हैं?",
    option:["निएण्डरथल","क्रो-मैग्नॉन","होमो इरेक्टस","होमो हैबिलिस"],
    answer:"निएण्डरथल"
},
{
    question: "घरेलू मक्खी के Meiocytes में गुणसूत्र की संख्या होती है:",
    option:["8","12","34","21"],
    answer:"12"
},
{
    question: "मेंडल का Law of Segregation किस F2 अनुपात पर आधारित है?",
    option:["1 : 2","9 : 3 : 3 : 1","1 : 2 : 1","3 : 1"],
    answer:"1 : 2 : 1"
},
{
    question: "निम्नलिखित में कौन-सा ट्रांसजेनिक पौधा नहीं है?",
    option:["सोयाबीन","मक्का","गोल्डेन राइस","खीरा"],
    answer:"खीरा"
},
{
    question: "हीमोफीलिया महिलाओं की अपेक्षा पुरुषों में सामान्य रूप से पाया जाता है क्योंकि",
    option:["यह रोग X-सहलग्न प्रभावी उत्परिवर्तन के कारण होता है","लड़कियों की संख्या का बड़ा भाग बाल्यावस्था में मर जाता है","यह रोग X-सहलग्न अप्रभावी उत्परिवर्तन द्वारा होता है","यह रोग Y-सहलग्न अप्रभावी उत्परिवर्तन द्वारा होता है"],
    answer:"यह रोग X-सहलग्न अप्रभावी उत्परिवर्तन द्वारा होता है"
},
{
    question: "किसी Incomplete Dominance की F2 संतति में",
    option:["फीनोटाइप का अनुपात 3 : 1 है","जीनोटाइप का अनुपात 3 : 1 है","दोनों ही","फीनोटाइप अनुपात जीनोटाइप अनुपात के अनुरूप होता है"],
    answer:"फीनोटाइप अनुपात जीनोटाइप अनुपात के अनुरूप होता है"
},
{
    question: "लॉजिस्टिक/एक्सपोनेन्शियल वृद्धि के लिए सूत्र है:",
    option:["dt/dN","dN/rN = dt","rN/dN = dt","dN/dt = rN"],
    answer:"dN/dt = rN"
},
{
    question: "किसी AABBCC genotype वाले जीव से कितने तरह के gametes की संभावना बनती है?",
    option:["एक","दो","चार","आठ"],
    answer:"एक"
},
{
    question: "इनमें से प्रोटोजोआ परजीवी द्वारा संचरित रोग कौन-सा है?",
    option:["अमीबायसिस","मलेरिया","काला ज्वर","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "अनुप्रवाह संसाधन में शामिल है:",
    option:["पृथक्करण","शोधन","दोनों (A) और (B)","उत्पादन"],
    answer:"दोनों (A) और (B)"
},
{
    question: "बिन्दु उत्परिवर्तन में होता है",
    option:["सन्निवेशन","एक क्षार युग्म में परिवर्तन","द्विगुणन","विलोपन"],
    answer:"एक क्षार युग्म में परिवर्तन"
},
{
    question: "कौन सहायक जनन ग्रंथि है?",
    option:["शुक्राशय ग्रंथि","प्रोस्टेट ग्रंथि","कॉपर ग्रंथि","सभी"],
    answer:"सभी"
},
{
    question: "मादा में कौन-सी ग्रंथि प्रोस्टेट के समजात होती है?",
    option:["Perineal gland","दुग्धग्रंथि","पारायुरिथ्रल ग्रंथि","काउपर ग्रंथि"],
    answer:"पारायुरिथ्रल ग्रंथि"
},
{
    question: "किसी न्यूक्लियोसाइड के पेंटोज शर्करा के किस कार्बन के साथ नाइट्रोजन क्षार जुड़ा होता है?",
    option:["1","2","3","5"],
    answer:"1"
},
{
    question: "HIV निम्न में किस कोशिका पर आक्रमण करता है?",
    option:["B-कोशिका","T-कोशिका","एपिथीलियल कोशिका","T हेल्पर कोशिका"],
    answer:"T हेल्पर कोशिका"
},
{
    question: "ट्रॉपिकल वनों में कुछ जातियों की विलुप्ति का मुख्य कारण है।",
    option:["डिफोरेस्टैशन","एफोरेस्टेशन","पॉल्यूशन","सोइल इरोसिन"],
    answer:"डिफोरेस्टैशन"
},
{
    question: "ग्रीवा (Cervix) किसमें पाया जाता है?",
    option:["वृक्क","फैलोपियन ट्यूब","गर्भाशय के body एवं योनि के बीच में","epididymis में"],
    answer:"गर्भाशय के body एवं योनि के बीच में"
},
{
    question: "Gonorrhoea क्या है?",
    option:["बैक्टीरियल रोग","यौन रोग","S.T.D.","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "इनमें से कौन-सा रक्त समूह सार्वभौमिक रक्तदाता है?",
    option:["B","A","AB","O"],
    answer:"O"
},
{
    question: "Acrosome विहीन शुक्राणु के लिए क्या नहीं हो सकता है?",
    option:["यह भोजन नहीं ले सकता","प्रचलन नहीं कर सकता","Seminal vesicle में छेद नहीं कर सकता","अंडाणु में छेद नहीं कर सकता है"],
    answer:"अंडाणु में छेद नहीं कर सकता है"
},
{
    question: "जिरोन्टोलोजी में किसका अध्ययन होता है?",
    option:["पक्षी","अस्थि","Ageing","पृथ्वी"],
    answer:"Ageing"
},
{
    question: "निम्नलिखित में कौन-सी यांत्रिक तकनीक गर्भधारण रोकने के लिए तथा IUCD के लिए है?",
    option:["कॉपर-टी","सम्मिश्रित गोली","फोम","Abortant गोली"],
    answer:"कॉपर-टी"
},
{
    question: "निम्नलिखित में कौन-सा तत्व पृथ्वी के आदिकालीन वातावरण में आणविक स्थिति में उपस्थित नहीं था?",
    option:["कार्बन","ऑक्सीजन","हाइड्रोजन","नाइट्रोजन"],
    answer:"ऑक्सीजन"
},
{
    question: "जैव-विकास के सिद्धांत का मुख्य संबंध है",
    option:["स्वतः उत्पादन से","विशिष्ट सृष्टिवाद से","धीरे-धीरे होने वाले परिवर्तनों से","वातावरण की स्थिति से"],
    answer:"धीरे-धीरे होने वाले परिवर्तनों से"
},
{
    question: "प्राकृतिक अनिषेकजनन (Parthenogenesis) पाया जाता है",
    option:["मक्खी","मधुमक्खी में","मच्छर में","इनमें सभी में"],
    answer:"मधुमक्खी में"
},
{
    question: "मक्का में 10 जोड़ा गुणसूत्र है। इसमें कितने लिंकेज समूह होंगे",
    option:["20","40","10","5"],
    answer:"10"
},
{
    question: "योक का वितरण यदि समान रूप से हो तो ऐसे अंडे होते हैं",
    option:["Isolecithal","Mesolecithal","Macrolecithal","Centrolecithal"],
    answer:"Isolecithal"
},
{
    question: "गिर राष्ट्रीय उद्यान विख्यात है",
    option:["हिरण के लिए","सिंह के लिए","चीता के लिए","पक्षी के लिए"],
    answer:"सिंह के लिए"
},
{
    question: "निम्नलिखित में कौन ग्रीनहाउस गैस है?",
    option:["कार्बन डाइऑक्साइड","मीथेन","CFC","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "किसके अध्ययन को ऑन्कोलॉजी कहते हैं?",
    option:["कॉलेरा","कुष्ठ","ट्यूमर","मलेरिया"],
    answer:"ट्यूमर"
},
{
    question: "ऑस्ट्रेलियन एंटीजन जाँच द्वारा किस बीमारी का पता लगाया जाता है?",
    option:["AIDS","हिपेटाइटिस-B","Genital warts","Chancroid"],
    answer:"हिपेटाइटिस-B"
},
{
    question: "परागण तभी होता है जब कोई परागकण",
    option:["अपना sperm nuclei विमुक्त करता है","वर्तिकाग्र पर आता है","परिपक्व होता है तथा इसमें 3 nuclei होते हैं","अपनी sperm nuclei विमुक्त करे तथा अंडा एवं ध्रुव केन्द्रक के साथ निषेचन करे"],
    answer:"वर्तिकाग्र पर आता है"
},
{
    question: "विषाणु-मुक्त पौधे किसके द्वारा प्राप्त हो सकते हैं?",
    option:["भ्रूण विकास","विभज्योतक संवर्धन","प्रोटोप्लास्ट संवर्धन","परागकोष संवर्धन"],
    answer:"विभज्योतक संवर्धन"
},
{
    question: "मृदा में उपस्थित राइजोबियम जीवाणु अप्रत्यक्ष रूप से पौधों की आबादी में किस प्रकार वृद्धि करते हैं?",
    option:["नाइट्रोजन-स्थिरीकरण एवं मृदा की उर्वरता में वृद्धि कर","कवकमूल द्वारा","प्रतिजीविता द्वारा","इनमें से कोई नहीं"],
    answer:"नाइट्रोजन-स्थिरीकरण एवं मृदा की उर्वरता में वृद्धि कर"
},
{
    question: "एन्थेसिस की परिघटना संबंधित है:",
    option:["परागकण निर्माण","वर्तिकान पर परागकण का पहुँचना","परागकोश का विकास","पुष्प कलिका का खुलना"],
    answer:"पुष्प कलिका का खुलना"
},
{
    question: "मेंडल ने किस पौधे का चयन किया?",
    option:["चना","पाइनस","टमाटर","गार्डेन मटर"],
    answer:"गार्डेन मटर"
},
{
    question: "किस प्रकार के जनन करने वाले प्राणियों में अधिक विभिन्नताएँ देखने को मिलती हैं?",
    option:["लैंगिक जनन","अलैंगिक जनन","युग्मकजनन","कायिक जनन"],
    answer:"लैंगिक जनन"
},
{
    question: "पौधों में लैंगिक प्रजनन को सर्वप्रथम किसने दर्शाया",
    option:["Kolreuter","Camerarius","Van Benden","Nawaschin"],
    answer:"Camerarius"
},
{
    question: "कायिक जनन निम्न में से किस प्रकार होता है?",
    option:["जड़","स्तंभ","पत्ती","तीनों द्वारा"],
    answer:"तीनों द्वारा"
},
{
    question: "निम्नलिखित में कौन वन पारिस्थितिक तंत्र का एक उत्पादक है?",
    option:["वैलिसनेरिया","स्पाइरोगाइरा","टेक्टोना","निम्फिया"],
    answer:"टेक्टोना"
},
{
    question: "भ्रूणपोष की उत्पत्ति किससे होती है",
    option:["परागनलिका से","लघुबीजाणु से","लघुबीजाणुधानी से","गुरुबीजाणु से"],
    answer:"गुरुबीजाणु से"
},
{
    question: "लाइकेन किसका समूहन है?",
    option:["शैवाल तथा शैवाल","शैवाल तथा कवक","शैवाल तथा उच्च वर्गीय पौधों की जड़ें","कवक तथा कवक"],
    answer:"शैवाल तथा कवक"
},
{
    question: "आण्विक तकनीक जिसमें किसी भी इच्छित जीन की अनेकों प्रति इन-विट्रो संश्लेषित की जा सकती हैं, कहलाती है:",
    option:["ELISA","PCR","जेल इलेक्ट्रोफोरेसिस","फ्लो साइटोमेट्री"],
    answer:"PCR"
},
{
    question: "पुष्पीय पौधों में लैंगिक जनन की खोज की थी",
    option:["कामेरारियस","नावाश्चिन","स्ट्रासवर्गर","माहेश्वरी"],
    answer:"कामेरारियस"
},
{
    question: "निम्नलिखित में कौन-सा परागकण के वर्तिकाग्र पर शुरू में परागण में मदद करता है",
    option:["P","Ca++","Mo","Cl−"],
    answer:"Ca++"
},
{
    question: "निम्न में से कौन द्विगुणित संरचना है?",
    option:["अण्डाणु","शुक्राणु","युग्मनज","इनमें से सभी"],
    answer:"युग्मनज"
},
{
    question: "किसी स्रावण में फ़्रक्टोज, कैल्शियम एवं enzymes सबसे अधिक पाया जाता है किसमें?",
    option:["नर सहायक ग्रंथि","यकृत","अग्न्याशय","लार ग्रंथि"],
    answer:"नर सहायक ग्रंथि"
},
{
    question: "समसूत्री विभाजन होता है।",
    option:["कायिक कोशिका में","जनन कोशिका में","(A) एवं (B) दोनों में","इनमें से कोई नहीं"],
    answer:"(A) एवं (B) दोनों में"
},
{
    question: "किसी gamete में कुल जीन के haploid set को कहते हैं",
    option:["जीनोटाइप","फीनोटाइप","जीनोम","लिंकेज समूह"],
    answer:"जीनोम"
},
{
    question: "द्विगुणित है",
    option:["अंडा","पराग","(A) और (B) दोनों","युग्मनज"],
    answer:"युग्मनज"
},
{
    question: "स्पाइरुलिना किसका प्रचुर स्रोत है?",
    option:["प्रोटीन","विटामिन","खनिज","उपर्युक्त सभी"],
    answer:"प्रोटीन"
},
{
    question: "ट्रांसजेनिक बासमती चावल की उन्नत किस्म कैसी होती है?",
    option:["उसे रासायनिक उर्वरकों तथा वृद्धि की आवश्यकता नहीं होती है","उच्च उत्पादन तथा विटामिन-A से प्रचुर होती है","सभी कीट-पीड़कों तथा धान के रोगों के प्रति पूर्णतया प्रतिरोधक होती है","उच्च उत्पादन करती है किन्तु इसमें कोई अभिलाक्षणिक सुगंध नहीं होती है"],
    answer:"उच्च उत्पादन तथा विटामिन-A से प्रचुर होती है"
},
{
    question: "एक ही locus पर उपस्थित किसी जीन के विभिन्न रूपों को क्या कहते हैं?",
    option:["मल्टीपल एलील","पॉलीजीन्स","ओन्कोजीन्स","सहप्रभावी"],
    answer:"मल्टीपल एलील"
},
{
    question: "एक सही अनुक्रम में DNA खण्ड जुड़ते हैं:",
    option:["DNA लाइगेज द्वारा","RNA पॉलीमरेज द्वारा","हेलिकेज द्वारा","DNA TÍCIATO GRI"],
    answer:"DNA लाइगेज द्वारा"
},
{
    question: "निम्नांकित में से कौन विलुप्त स्पीशीज है?",
    option:["एक्सोरा","निपेन्थिस","टीकोमा","इनमें से कोई नहीं"],
    answer:"इनमें से कोई नहीं"
},
{
    question: "फेरोमोन जाल में क्या होता है?",
    option:["नर फेरोमोन","मादा फेरोमोन","(A) एवं (B) दोनों","इनमें से कोई नहीं"],
    answer:"मादा फेरोमोन"
},
{
    question: "हवा के द्वारा परागित होने वाले फूलों को कहते हैं",
    option:["कीट परागिता","वायु परागित","हवा परागित","इनमें से कोई नहीं"],
    answer:"वायु परागित"
},
{
    question: "पारितंत्र शब्द का नामकरण किया:",
    option:["मौरगन","ए. जी. टांसले","लामार्क","इनमें से कोई नहीं"],
    answer:"ए. जी. टांसले"
},
{
    question: "स्त्रीकेसर का भाग निम्न में से कौन-सा है",
    option:["वर्तिकाग्र","वर्त्तिका","अंडाशय","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "मेंडल ने प्रतिपादित किया",
    option:["सहलग्नता का नियम","आनुवंशिकता का नियम","थर्मोडायनामिक्स का नियम","इनमें से कोई नहीं"],
    answer:"आनुवंशिकता का नियम"
},
{
    question: "इनमें कौन गाय की प्रजाति नहीं है?",
    option:["जर्सी","करन स्विस","करन फ्राइस","सूर्ती"],
    answer:"सूर्ती"
},
{
    question: "एकलिंगता की स्थिति को उल्लिखित करने के लिए किस शब्द का प्रयोग होता है?",
    option:["समयुग्मकी","उभयलिंगाश्रयी","एकलिंगाश्रयी","विषम युग्मक"],
    answer:"एकलिंगाश्रयी"
},
{
    question: "इनमें से कौन यौन-संबद्ध गुण है?",
    option:["वर्णांधता","रतौंधी","पूर्ण अन्धता","इनमें से कोई नहीं"],
    answer:"वर्णांधता"
},
{
    question: "निषेचन के बाद बीज का आवरण किससे बनता है",
    option:["Embryo sac","Integuments","Ovule","Chalazal region"],
    answer:"Integuments"
},
{
    question: "परिवर्धनशील भ्रूण द्वारा भ्रूणपोष का उपभोग किसके बीज में होता है",
    option:["नारियल","अरंड","मटर","मक्का"],
    answer:"मटर"
},
{
    question: "कैंसर किस कारण से होता है?",
    option:["जीवाणु द्वारा","ऑन्कोजीन्स के द्वारा","A और B दोनों","इनमें से कोई नहीं"],
    answer:"ऑन्कोजीन्स के द्वारा"
},
{
    question: "कुछ पुष्पों के परागकोष एवं वर्तिकान के बीच कुछ प्राकृतिक रोध होते हैं जिनके कारण परागण मुश्किल से होता है या होता ही नहीं, उन्हें क्या कहते हैं",
    option:["स्वयंबंध्यता","हेटेरोस्टाइली","हरकोगैमी","गेइगैमी"],
    answer:"हरकोगैमी"
},
{
    question: "कौन-सा diploid है",
    option:["परागकण","Egg","Megaspore","MMC"],
    answer:"MMC"
},
{
    question: "क्लोरेला निम्न में से क्या है?",
    option:["जीवाणु","शैवाल","प्रोटोजोआ","एकल कोशिका प्रोटीन"],
    answer:"शैवाल"
},
{
    question: "निम्नलिखित में कौन Mendelian Law of Independent Assortment का अपवाद है?",
    option:["क्रॉसिंग ओवर","अपूर्ण वर्चस्व","Segregation","सहलग्नता"],
    answer:"सहलग्नता"
},
{
    question: "स्पाइरुलिना है:",
    option:["जैव उर्वरक","जैव पीड़कनाशी","खाने योग्य कवक","सिंगल सेल प्रोटीन"],
    answer:"सिंगल सेल प्रोटीन"
},
{
    question: "जाने-माने पारितंत्र पारिस्थितिकी हैं",
    option:["पी. माहेश्वरी","ई. पी. ओडम","एम. एस. स्वामीनाथन","बीरबल साहनी"],
    answer:"ई. पी. ओडम"
},
{
    question: "पॉम्फ्रेट (Pomfret) है।",
    option:["समुद्री मछली","झींगा की एक प्रजाति","अंतःस्थली मछली","मृदुजलीय मछली"],
    answer:"समुद्री मछली"
},
{
    question: "परागकण में मौजूद ऑक्सिन (Auxin) किसकी वृद्धि में मदद करता है",
    option:["परागनली एवं अंडाशय","सिर्फ परागनली","सिर्फ अंडाशय","नर युग्मक"],
    answer:"परागनली एवं अंडाशय"
},
{
    question: "अलैंगिक जनन में जीवधारियों की उत्पत्ति कितने जनकों के भाग लेने से होती है?",
    option:["एक","दो","तीन","चार"],
    answer:"एक"
},
{
    question: "वैसे जीवाणुओं के समूह, जो फफूंदी के तंतुओं से जुड़कर जाल जैसी संरचना बनाते हैं, कहलाते हैं",
    option:["फ्लॉक्स","मिथेनोजेन","प्लाज्मिनोजेन","इनमें से कोई नहीं"],
    answer:"फ्लॉक्स"
},
{
    question: "एसीटाबुलेरिया निम्न में से क्या है?",
    option:["एकल कोशिका प्रोटीन","शैवाल","प्रोटोजोआ","जीवाणु"],
    answer:"शैवाल"
},
{
    question: "निम्नलिखित में कौन मुर्गियों की बीमारी नहीं है?",
    option:["रानीखेत","हैजा","स्मट","बर्ड फ्लू"],
    answer:"स्मट"
},
{
    question: "किसी सामान्य द्विबीजपत्री भ्रूणकोश में केन्द्रक का Arrangement होता है",
    option:["3 + 3 + 2","2 + 3 + 3","3 + 2 + 3","2 + 4 + 2"],
    answer:"3 + 2 + 3"
},
{
    question: "कौन-सा Terminal (stop) कोडोन है?",
    option:["UAG (अंबर)","UAA (ओकर)","UGA (ओपल)","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "पहचानिए इनमें से कौन-सा अधूरे पारितंत्र का उदाहरण है?",
    option:["घास का मैदान","गुफा","नदी","दलदली क्षेत्र"],
    answer:"गुफा"
},
{
    question: "Micropyle किसमें पाया जाता है",
    option:["Ovule","Seed","अनुपलब्ध/अस्पष्ट विकल्प","अनुपलब्ध/अस्पष्ट विकल्प"],
    answer:"Ovule"
},
{
    question: "लाल त्वचा वाले मवेशी को जब सफेद रंग वाले से क्रॉस करवाया गया तो F1 पीढ़ी में मवेशियों का रंग चितकबरा या रोन हो गया। यह किसको प्रदर्शित करता है?",
    option:["सहप्रभविता","पूर्ण प्रभाविता","अपूर्ण प्रभाविता","सहलग्नता"],
    answer:"सहप्रभविता"
},
{
    question: "ओपेरॉन मॉडल क्या प्रदर्शित करता है?",
    option:["जीन का सिंथेसिस","जीन का एक्सप्रेशन","जीन का रेगुलेशन","जीन का फंक्शन"],
    answer:"जीन का रेगुलेशन"
},
{
    question: "सबसे प्रारंभिक जीव थे",
    option:["रसायन स्वपोषी","रसायन विषमपोषी","प्रकाश स्वपोषी","स्वतः उत्पन्न होने वाले"],
    answer:"रसायन विषमपोषी"
},
{
    question: "परागकोश एक चार-कोशीय संरचना होती है जिसमें चारों कोनों पर क्या समाहित होती है",
    option:["लघुबीजाणुधानी","परागपुटी","टेपीटम","जीवद्रव्य"],
    answer:"लघुबीजाणुधानी"
},
{
    question: "इनमें से कौन कृमि जनित संक्रामक रोग नहीं है?",
    option:["एस्केरियासिस","फाइलेरिया","हेपेटाइटिस","एंकाइलोस्टोमियासिस"],
    answer:"हेपेटाइटिस"
},
{
    question: "रोगी के शरीर में रोगाणुओं को नष्ट करने वाली औषधियाँ हैं:",
    option:["प्रतिजैविकी","टीका","ओपिओइड्स","इनमें से सभी"],
    answer:"प्रतिजैविकी"
},
{
    question: "एक खाद्य-श्रृंखला किससे आरंभ होती है?",
    option:["नाइट्रोजन स्थिरीकरण करने वाले जीवों से","प्रकाशसंश्लेषण करने वाले से","श्वसन से","विघटनकर्ता से"],
    answer:"प्रकाशसंश्लेषण करने वाले से"
},
{
    question: "निम्न में से कौन एकल कोशिका प्रोटीन है?",
    option:["स्पाइरुलिना","क्लोरेला","सिनेडेस्मस","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "मेंडल ने लक्षणों की वंशागति पर कार्य कब प्रकाशित कराया?",
    option:["1870","1900","1865","1845"],
    answer:"1865"
},
{
    question: "प्रभावी लक्षण प्रारूप किसका परिणाम होता है?",
    option:["परीक्षार्थ संकरण द्वारा","द्विसंकर संकरण द्वारा","वंशावली विश्लेषण द्वारा","प्रतीप संकरण द्वारा"],
    answer:"परीक्षार्थ संकरण द्वारा"
},
{
    question: "निम्नलिखित में मासिक चक्र अवधि के लिए कौन-सा सही कथन है?",
    option:["अंड का सर्जन : 5वें दिन","endometrium का पुनर्निर्माण : 5-10वें दिन","endometrium द्वारा पोषक का निर्माण Implantation के लिए : 11-18वें दिन","प्रोजेस्ट्रॉन स्तर में वृद्धि : 1-15वें दिन"],
    answer:"endometrium का पुनर्निर्माण : 5-10वें दिन"
},
{
    question: "गैमीट निर्माण को कहते हैं",
    option:["गैमीटोजेसिस","साइटोकायनेसिस","स्पोरोजेनेसिस","मियोसायट"],
    answer:"गैमीटोजेसिस"
},
{
    question: "एगारोज जेल प्राप्त किया जाता है:",
    option:["समुद्री घास से","मक्का से","हाइड्रिला से","फर्न से"],
    answer:"समुद्री घास से"
},
{
    question: "Embryo sac में प्रवेश करते समय परागनलिका में होते हैं",
    option:["दो नर युग्मक","दो नर केन्द्रक","चार नए युग्मक","तीन नर युग्मक"],
    answer:"दो नर युग्मक"
},
{
    question: "निम्नलिखित में से कौन-सा नर पुष्प का भाग है",
    option:["जायांग","पुमंग","स्त्रीकेसर","अंडाशय"],
    answer:"पुमंग"
},
{
    question: "आपतित सौर विकिरण में प्रकाशसंश्लेषणात्मक सक्रिय विकिरण (PAR) का प्रतिशत कितना होता है?",
    option:["100%","50%","1-5%","2-10%"],
    answer:"50%"
},
{
    question: "प्रोटीन संश्लेषण में दो अमीनो अम्लों के बीच किस प्रकार का बंध बनता है?",
    option:["पेप्टाइड","हाइड्रोजन","न्यूक्लियोटाइड","न्यूक्लियोसाइड"],
    answer:"पेप्टाइड"
},
{
    question: "DNA अणु प्रतिसमानांतरण है, क्योंकि:",
    option:["H-bond","फॉस्फो-डाइस्टर बंधन","डायसल्फाइड बंधन","इनमें से कोई नहीं"],
    answer:"H-bond"
},
{
    question: "एक झील में द्वितीय पोषण स्तर होता है:",
    option:["पादपप्लवक","प्राणिप्लवक","नितलक","मछलियाँ"],
    answer:"प्राणिप्लवक"
},
{
    question: "रक्त समूह A में होता है",
    option:["प्रतिजन A, प्रतिरक्षी B","प्रतिजन B, प्रतिरक्षी A","प्रतिजन A, प्रतिरक्षी B","प्रतिजन A, प्रतिरक्षी अनुपस्थित"],
    answer:"प्रतिजन A, प्रतिरक्षी B"
},
{
    question: "मानव के अर्द्धसूत्रीभाजन कोशिका (Meiocyte) में गुणसूत्र की संख्या होती है:",
    option:["40","42","44","46"],
    answer:"46"
},
{
    question: "निम्नलिखित में कौन-सा द्वितीयक प्रदूषक है?",
    option:["SO₂","CO₂","PAN","एरोसोल"],
    answer:"PAN"
},
{
    question: "किन कारणों से आबादी सदा परिवर्तनशील होती है?",
    option:["भौतिक","जैविक","(A) और (B) दोनों","इनमें से कोई नहीं"],
    answer:"(A) और (B) दोनों"
},
{
    question: "पेनिसिलियम नामक कवक में अलैंगिक जनन मुख्य रूप से किस संरचना के द्वारा होता है?",
    option:["मुकुलन","विखंडन","कोनिडिया","जेम्यूलस"],
    answer:"कोनिडिया"
},
{
    question: "लैक्टिक एसिड जीवाणु उचित ताप पर दूध को दही में परिवर्तित करता है तथा किस विटामिन की मात्रा बढ़ाकर इसकी पोषकता में वृद्धि करता है?",
    option:["A","B","C","D"],
    answer:"B"
},
{
    question: "जीव-प्रतिकारक या बायोरिएक्टर के संदर्भ में कौन-सा वाक्य गलत है?",
    option:["प्रत्येक जीव-प्रतिकारक में एक प्रक्षोभक तंत्र होता है।","विलोडन टैंक जीव-प्रतिकारक सामान्यतया बेलनाकार होते हैं।","वांछित उत्पाद पाने के लिए जीव-प्रतिकारक ऑक्सीजन उपलब्ध नहीं करता है।","प्रत्येक जीव-प्रतिकारक में तापक्रम तथा pH-नियंत्रण तंत्र होते हैं।"],
    answer:"वांछित उत्पाद पाने के लिए जीव-प्रतिकारक ऑक्सीजन उपलब्ध नहीं करता है।"
},
{
    question: "DNA अणु में साइटोसिन 18% है। एडिनिन का प्रतिशत है:",
    option:["64","36","82","32"],
    answer:"32"
},
{
    question: "पवित्र उपवन पाए जाते हैं",
    option:["पश्चिमी घाट","अरावली की पहाड़ियाँ","खासी और जयंतिया पहाड़ी, मेघालय","उपर्युक्त सभी में"],
    answer:"उपर्युक्त सभी में"
},
{
    question: "ओजोन परत में छिद्र के लिए कौन-सा देश सर्वाधिक उत्तरदायी है?",
    option:["USA","जर्मनी","रूस","जापान"],
    answer:"USA"
},
{
    question: "एक झील-पारितंत्र होता है",
    option:["कृत्रिम","अजीवीय","प्राकृतिक","जलविज्ञा"],
    answer:"प्राकृतिक"
},
{
    question: "निम्नलिखित में संवेदनमंदक पदार्थ है?",
    option:["तंबाकू","दारू या अल्कोहल","हशीश या हेरोइन","भांग या ओपियम"],
    answer:"तंबाकू"
},
{
    question: "हम लोगों में वर्मिफॉर्म अपेंडिक्स कैसा अंग है?",
    option:["आवश्यक अंग","अवशेषी अंग","असमजात अंग","इनमें से कोई नहीं"],
    answer:"अवशेषी अंग"
},
{
    question: "रूट कैप (मूल टोपी) इनमें उपस्थित होता है:",
    option:["जीरोफाइट","मीजोफाइट","हाइड्रोफाइट","हैलोफाइट"],
    answer:"जीरोफाइट"
},
{
    question: "DNA खण्ड निम्न द्वारा जोड़ा जाता है:",
    option:["लाइगेज","पॉलीमरेज","हेलिकेज","जायरेज"],
    answer:"लाइगेज"
},
{
    question: "घड़ियाल एवं मे फ्लाई (May fly) का जीवनकाल होता है क्रमशः",
    option:["15 वर्ष, 1 सप्ताह","30 वर्ष, 1 सप्ताह","45 वर्ष, 1 महीना","60 वर्ष, 1 दिन"],
    answer:"60 वर्ष, 1 दिन"
},
{
    question: "दोहरा निषेचन किसकी विशेषता है",
    option:["द्विबीजपत्री एवं एकबीजपत्री सभी आवृत्तबीजी का","सभी अनावृतबीजी का","फेनेरोगेम्स का","Spermatophytes का"],
    answer:"द्विबीजपत्री एवं एकबीजपत्री सभी आवृत्तबीजी का"
},
{
    question: "जंपिंग जीन कहलाता है:",
    option:["खंडित जीन","ट्रांसपोसोन","साइलेन्ट जीन","इनमें से सभी"],
    answer:"ट्रांसपोसोन"
},
{
    question: "सर्वाधिक कपाल क्षमता होती है",
    option:["निएण्डरथल मानव की","क्रो-मैग्नॉन मानव की","आधुनिक मानव की","जावा मानव की"],
    answer:"निएण्डरथल मानव की"
},
{
    question: "स्तनधारी अंड में Cleavage होता है",
    option:["Meroblastic","Holoblastic","Unequal","Spiral"],
    answer:"Holoblastic"
},
{
    question: "गर्भाशय में कॉपर-टी के एक प्रभावी एवं अंतःगर्भाशयी युक्ति होने का मुख्य कारण है",
    option:["शुक्राणुओं की निषेचन क्षमता में कमी","गर्भाशय में कॉपर आयन मोचित होने के कारण शुक्राणुओं की भक्षकाणु क्रिया में वृद्धि","शुक्राणुओं की गतिशीलता में कमी","इनमें से कोई नहीं"],
    answer:"शुक्राणुओं की गतिशीलता में कमी"
},
{
    question: "इनमें से कौन जनसंख्या नियंत्रण का प्राकृतिक उपाय है।",
    option:["शिकार","परजीविता","(A) एवं (B) दोनों","इनमें से कोई नहीं"],
    answer:"(A) एवं (B) दोनों"
},
{
    question: "परागकण हरा नहीं होता है क्योंकि",
    option:["इसमें हरित लवक नहीं होते हैं","प्लास्टिड्स का ह्रास हो जाता है","Plastids का बदलाव क्रोमोप्लास्ट्स में हो जाता है","Vectors द्वारा आकर्षण के कारण"],
    answer:"इसमें हरित लवक नहीं होते हैं"
},
{
    question: "निम्नांकित में से किस पौधे की प्रजातियों में बीज का उत्पादन असंगजनन द्वारा होता है?",
    option:["एस्ट्रेर्सिया एवं घास","साइट्रस एवं आम","सरसों","इनमें से कोई नहीं"],
    answer:"एस्ट्रेर्सिया एवं घास"
},
{
    question: "इनमें से कौन सार्वभौमिक रक्तदाता समूह है?",
    option:["A","B","AB","O"],
    answer:"O"
},
{
    question: "आबादी के अध्ययन में किन कारकों का ध्यान जरूरी है?",
    option:["सदस्यों की संख्या तथा प्रकार","निश्चित क्षेत्र या प्रकार","निश्चित समय","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "कोशिका-संवाहित रोग प्रतिरोधी किसके कारण होता है?",
    option:["बी-लिम्फोसाइट्स","टी-लिम्फोसाइट्स","(A) और (B) दोनों","प्लाज्मा कोशिका"],
    answer:"टी-लिम्फोसाइट्स"
},
{
    question: "क्राई IAb जीन एक प्रोटीन उत्पादित करता है जो रोकथाम करता है:",
    option:["कॉर्न बोरर","कपास बॉल कृमि","नीमैटोड को","जीवाणु"],
    answer:"कॉर्न बोरर"
},
{
    question: "इनमें कौन रेस्ट्रिक्शन एंजाइम नहीं है?",
    option:["EcoRI","BamHI","HindIII","Pectinase"],
    answer:"Pectinase"
},
{
    question: "एण्टीबायोटिक शब्द के प्रणेता हैं:",
    option:["फ्लेमिंग","जेनर","वाक्समैन","इनमें से कोई नहीं"],
    answer:"वाक्समैन"
},
{
    question: "हमारे जैविक स्रोतों के मुख्य घटक हैं:",
    option:["कीट","पक्षी","निमैटोड्स","वनीय जीवन"],
    answer:"वनीय जीवन"
},
{
    question: "मिलर-यूरे प्रयोग द्वारा प्रमुख रूप से कौन-से अमीनो अम्ल तैयार किए गए थे?",
    option:["प्रोलीन","प्रोलीन एवं सेरीन","एलानीन एवं ग्लाइसीन","सेरीन एवं ट्रिप्टोफेन"],
    answer:"एलानीन एवं ग्लाइसीन"
},
{
    question: "AB रक्त समूह में 2 जीन होते हैं जो होते हैं",
    option:["Co-dominant","Co-recessive","Incomplete dominant","Dominant-recessive"],
    answer:"Co-dominant"
},
{
    question: "स्तनधारी के शुक्राणु के मध्य भाग में क्या पाया जाता है",
    option:["केन्द्रक","रसधानी","माइटोकॉन्ड्रिया","सेंट्रीओल"],
    answer:"माइटोकॉन्ड्रिया"
},
{
    question: "एक ही पुष्प के मादा जननांग का परागकोश से पहले परिपक्व होने की अवस्था को कहते हैं",
    option:["Protogyny","Protandry","Heterogamy","Autogamy"],
    answer:"Protogyny"
},
{
    question: "Estrogen का स्रवण किसमें होता है?",
    option:["कॉपर्स ल्यूटियम","Membrane granulosa","Ovary germinal epithelium","पिट्यूटरी ग्रंथि"],
    answer:"Membrane granulosa"
},
{
    question: "स्तनधारियों में वृषण वृषणकोषों में उतरते हैं",
    option:["शुक्राणुजनन के लिए","निषेचन के लिए","जनन अंगों के विकास के लिए","विसरल अंगों के विकास के लिए"],
    answer:"शुक्राणुजनन के लिए"
},
{
    question: "वंशानुगत दोष एडिनोसिन डिएमिनेज (ADA) की कमी का स्थायी उपचार किया जाता है:",
    option:["एन्जाइम प्रतिस्थापन चिकित्सा द्वारा","आनुवंशिक अभियांत्रिकी द्वारा लसीकाणु में सक्रिय ADA जीन एवं cDNA का प्रवेश कराकर","एडिनोसिन डिएमिनेज का सक्रियक देना","अस्थि-मज्जा की कोशिकाओं को आरंभिक भ्रूणीय अवस्था में प्रवेश कराकर"],
    answer:"आनुवंशिक अभियांत्रिकी द्वारा लसीकाणु में सक्रिय ADA जीन एवं cDNA का प्रवेश कराकर"
},
{
    question: "डी०एन०ए० के वे भाग जो प्रोटीन संश्लेषण हेतु कोडिंग में भाग नहीं लेते उन्हें कहते हैं",
    option:["इंट्रॉन्स","एक्सॉन्स","ट्रांसपोजोन्स","इनमें से कोई नहीं"],
    answer:"इंट्रॉन्स"
},
{
    question: "निम्नलिखित में कौन-सा गेहूँ की उन्नत किस्म है?",
    option:["सोनालिका","पूसा","रतन","पद्मा"],
    answer:"सोनालिका"
},
{
    question: "कुत्ते (Dog) का संभावित जीवन काल होता है।",
    option:["20 वर्ष","15 वर्ष","10 वर्ष","5 वर्ष"],
    answer:"15 वर्ष"
},
{
    question: "किस अवस्था में शब्द Dioecious का उपयोग होता है?",
    option:["द्विलिंगी","एकलिंगी","उभयलिंगी","गाइनेंड्रोमार्फ"],
    answer:"एकलिंगी"
},
{
    question: "ऊँचाई में प्रति 1000 मीटर की वृद्धि पर तापमान कितना गिरता है?",
    option:["6.5°C","2.5°C","7.5°C","3.5°C"],
    answer:"6.5°C"
},
{
    question: "पुदीन (Mint) कायिक प्रवर्धन करता है:",
    option:["अन्तर्भूस्तरी (sucker)","उपरिभूस्तरी (runner)","भूस्तरी (offset)","प्रकन्द (rhizome)"],
    answer:"अन्तर्भूस्तरी (sucker)"
},
{
    question: "आवृत्तबीजी पादप में बीज के निर्माण के समय द्वितीयक केन्द्रक परिवर्तित हो जाता है",
    option:["भ्रूण में","भ्रूणपोष में","बीजपत्र में","बीजचोल में"],
    answer:"भ्रूणपोष में"
},
{
    question: "किस स्थिति में F2 पीढ़ी में समलक्षणी और समजीनी अनुपात समान होता है?",
    option:["द्विसंकर क्रॉस","अनुपूरक जीन","अपूर्ण प्रभाविता","निरोधात्मक जीन"],
    answer:"अपूर्ण प्रभाविता"
},
{
    question: "पानी में उगने वाला अजोला किस स्वतंत्र नाइट्रोजन फिक्सिंग साइनोबैक्टीरियम के साथ सिम्बायोटिक सम्मिलन में होता है?",
    option:["क्लोरेला","नास्टॉक","ऐनाबिएना","टॉलिपोथ्रिक्स"],
    answer:"ऐनाबिएना"
},
{
    question: "प्रतिरक्षा-तंत्र को पूर्णरूप से दमन करने के लिए कौन-सी कोशिकाएँ हैं?",
    option:["किलर कोशिकाएँ","सहायक T-कोशिकाएँ","निरोधी T-कोशिकाएँ","मेमोरी कोशिकाएँ"],
    answer:"निरोधी T-कोशिकाएँ"
},
{
    question: "शुक्राणु अण्डे के घेरे को घोलने के लिए एक एन्जाइम युक्त पदार्थ उत्पन्न करता है। यह कहलाता है",
    option:["हाइलूरोनिक अम्ल","हाइलूरोनिडेज","एंड्रोगेमोन","डाएस्टेज"],
    answer:"हाइलूरोनिडेज"
},
{
    question: "ऐगारोज निम्नलिखित में किससे निकाला जाता है?",
    option:["समुद्री घास","मक्का","साइकस","हाइड्रिला"],
    answer:"समुद्री घास"
},
{
    question: "युग्मक बनने की क्रिया को क्या कहते हैं",
    option:["अंडजनन","युग्मकजनन","कायिक विभाजन","इनमें से कोई नहीं"],
    answer:"युग्मकजनन"
},
{
    question: "यदि किसी पुष्प के परागकोश एवं वर्तिकाग्र विभिन्न समय में परिपक्व होते हों, तो इसे कहते हैं",
    option:["Dicliny","Dichogamy","Herkogamy","Cleistogamy"],
    answer:"Dichogamy"
},
{
    question: "एक्रोसोम इनमें से किसका संभाग है?",
    option:["मानव शुक्राणु के सिर का","मानव शुक्राणु के मध्य भाग का","प्रारंभिक डिम्बाणुजनकोशिका का","ब्लास्टोसिस्ट का"],
    answer:"मानव शुक्राणु के सिर का"
},
{
    question: "इनमें से कौन सा पारिस्थितिक पिरामिड हमेशा सीधा होता है।",
    option:["मात्रा (Mass) का","संख्या का","ऊर्जा का","इनमें से कोई नहीं"],
    answer:"ऊर्जा का"
},
{
    question: "पेनिसिलियम में प्रजनन होता है:",
    option:["कलिका","विखंडन","जेम्यूल्स","कोनिडिया"],
    answer:"कोनिडिया"
},
{
    question: "कौन-सी एक परिघटना जैव विकास में प्राकृतिक चयन की डार्विन की धारणा को सहयोग देती है?",
    option:["पारजीनी जंतुओं का विकास","क्लोनिंग द्वारा डॉली भेड़ का उत्पादन","कीटों में कीटनाशक प्रतिरोधकता उत्पन्न होना","अंग स्थानांतरण के लिए स्टेम कोशिका से अंग विकास"],
    answer:"कीटों में कीटनाशक प्रतिरोधकता उत्पन्न होना"
},
{
    question: "आहार श्रृंखला में 10% ऊर्जा स्थानांतरण का नियम किसने दिया?",
    option:["स्टेनले","लिंडेमैन","वीजमैन","टेनस्ले"],
    answer:"लिंडेमैन"
},
{
    question: "एड्स में कौन-सी कोशिकाएँ सर्वाधिक प्रभावित होती हैं?",
    option:["B-सेल्स","T-सेल्स","मोनोसाइट्स","न्यूट्रोफिल्स"],
    answer:"T-सेल्स"
},
{
    question: "टी-लिम्फोसाइट उत्पन्न होता है:",
    option:["पेट से","थाइमस से","यकृत से","अस्थि मज्जा से"],
    answer:"अस्थि मज्जा से"
},
{
    question: "जनसंख्या का अध्ययन कहलाता है:",
    option:["केलोग्राफी","मनो जीवविज्ञान","बायोग्राफी","डेमोग्राफी"],
    answer:"डेमोग्राफी"
},
{
    question: "कौन-से देश में जैव-विविधता अधिक है?",
    option:["ब्राजील","दक्षिणी अफ्रीका","रूस","भारत"],
    answer:"ब्राजील"
},
{
    question: "हँसियाकार रक्तक्षीणता है",
    option:["ऑटोसोमल आनुवंशिक रोग","एलोसोमिक आनुवंशिक रोग","एपिस्टेटिक प्रभाव","पोषण विकृति"],
    answer:"ऑटोसोमल आनुवंशिक रोग"
},
{
    question: "निम्न में से कौन विषाणु जनित रोग है?",
    option:["फ्लू","पोलियो","एड्स","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "जीन चिकित्सा का प्रथम बार प्रयोग कब किया गया था?",
    option:["1990 में","2000 में","1890 में","1999 में"],
    answer:"1990 में"
},
{
    question: "विष प्रोटीन का नाम बताइए जो बैसिलस थूरीनजियेंसिस द्वारा बनाया जाता है।",
    option:["ट्यूबलीन","इंसुलिन","क्राई प्रोटीन","उपर्युक्त सभी"],
    answer:"क्राई प्रोटीन"
},
{
    question: "इनमें से कौन क्लायोटोरिस का समजात अंग है",
    option:["योनि","लिंग","(A) एवं (B) दोनों ही","इनमें से कोई नहीं"],
    answer:"लिंग"
},
{
    question: "AaBB तथा aaBB genotype वाले parents के बीच क्रॉस का परिणाम होगा",
    option:["सभी AaBB","1AaBB : 3aaBB","1AaBB : 1aaBB","3AaBB : 1aaBB"],
    answer:"1AaBB : 1aaBB"
},
{
    question: "निम्नलिखित में कौन-सा क्रॉस 3 : 1 के अनुपात को दर्शाता है?",
    option:["AaBb × AaBb","aabb × AABb","Aabb × Aabb","AaBb × aabb"],
    answer:"Aabb × Aabb"
},
{
    question: "Spermatid से शुक्राणु बनने के अंतिम क्षण होता है",
    option:["एक्रोसोम का निर्माण","Microtubules का निर्माण","पूँछ निर्माण","कोशिकाद्रव्य का ह्रास"],
    answer:"कोशिकाद्रव्य का ह्रास"
},
{
    question: "किसी आवृत्तबीजी का Female gametophyte क्या दर्शाता है",
    option:["Egg","Carpel","Pollen grain","Oospore"],
    answer:"Egg"
},
{
    question: "मासिक चक्र पाया जाता है",
    option:["मनुष्य की मादा में","स्तनपायी मादा में","प्रीमेेट की मादा में","इनमें से कोई नहीं"],
    answer:"प्रीमेेट की मादा में"
},
{
    question: "जैविक खाद का मुख्य स्रोत है:",
    option:["हरा शैवाल","यीस्ट","जीवाणु","लाल शैवाल"],
    answer:"हरा शैवाल"
},
{
    question: "हीमोफीलिया किस तरह की बीमारी है?",
    option:["वंशागत रोग","अप्रभावी लक्षण","X-गुणसूत्र सहलग्न रोग","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "किसी परिवार की अनेक पीढ़ियों के लक्षणों का विश्लेषण कहलाता है?",
    option:["वंशावली विश्लेषण","मेंडल विश्लेषण","पनेट विश्लेषण","इनमें से कोई नहीं"],
    answer:"वंशावली विश्लेषण"
},
{
    question: "वीर्य को किसमें हिमीकृत किया जाता है?",
    option:["तरल नाइट्रोजन में","रेफ्रिजरेटर में","बर्फ में","इनमें से सभी"],
    answer:"तरल नाइट्रोजन में"
},
{
    question: "उच्च न्यूक्लियोटाइड में शर्करा है:",
    option:["राइबोज","डिऑक्सीराइबोज","हेक्सोज","कोई पेंटोज"],
    answer:"कोई पेंटोज"
},
{
    question: "ऐगारोज का प्रयोग किया जाता है:",
    option:["इलेक्ट्रोफोरेसिस में","जीन क्लोनिंग में","DNA को देखने के लिए","प्लाज्मिड को काटने के लिए"],
    answer:"इलेक्ट्रोफोरेसिस में"
},
{
    question: "एक साइब्रिड, हाइब्रिड होता है जिसमें पाए जाते हैं।",
    option:["दो विभिन्न पौधों के कोशिका द्रव्य","दो विभिन्न पौधों के जीनोम तथा कोशिका द्रव्य","दो विभिन्न पौधों के कोशिका द्रव्य तथा एक पौधे का जीनोम","दो विभिन्न पौधों के जीनोम"],
    answer:"दो विभिन्न पौधों के कोशिका द्रव्य तथा एक पौधे का जीनोम"
},
{
    question: "इनमें से प्रत्यूर्जता उत्पन्न करने वाली बीमारी कौन है?",
    option:["त्वचा कैंसर","हे ज्वर","इंटेरिक ज्वर","गलगंड"],
    answer:"हे ज्वर"
},
{
    question: "क्लाइनफेल्टर सिंड्रोम का गुणसूत्र घटक है",
    option:["2A + XX","2A + XXY","2A + Y","2A - XY"],
    answer:"2A + XXY"
},
{
    question: "प्रोटीन संश्लेषण के अमीनो अम्ल को सक्रिय करने में किसकी आवश्यकता होती है:",
    option:["AMP","ADP","GTP","ATP"],
    answer:"ATP"
},
{
    question: "सल्फर का सबसे बड़ा संग्राहक है",
    option:["वायुमण्डल","चट्टानें","महासागर","झील"],
    answer:"चट्टानें"
},
{
    question: "केन्द्रकीय भ्रूणपोष में प्राथमिक भ्रूणपोष केन्द्रक के विभाजन के बाद",
    option:["कोशिकाभित्ति का निर्माण होता है","कोशिकाभित्ति का निर्माण नहीं होता है","एक बड़ी तथा एक छोटी कोशिका बनती है","इनमें से कोई नहीं"],
    answer:"कोशिकाभित्ति का निर्माण नहीं होता है"
},
{
    question: "वायु परागित पुष्प सामान्यतः होते हैं",
    option:["आकर्षक","छोटे","रंगहीन","(B) एवं (C) दोनों"],
    answer:"(B) एवं (C) दोनों"
},
{
    question: "हंसियाकार कोशिका अरक्तता प्रदर्शित करती है",
    option:["एपीस्टेसिस","सहप्रभाविता","प्लियोट्रॉपी","अपूर्ण प्रभाविता"],
    answer:"प्लियोट्रॉपी"
},
{
    question: "शीतोष्ण प्रक्षेत्र का प्रमुख अनाज है।",
    option:["धान","गेहूँ","मक्का","जौ"],
    answer:"गेहूँ"
},
{
    question: "प्राइमर्स का उपयोग किया जाता है",
    option:["PCR में","क्लोनिंग में","DNA संसाधन में","इनमें से कोई नहीं"],
    answer:"PCR में"
},
{
    question: "वन्य जीवन संरक्षित है",
    option:["स्वस्थाने","बाह्य स्थले","(A) और (B) दोनों","शिकारियों द्वारा चयनात्मक शिकार करना"],
    answer:"(A) और (B) दोनों"
},
{
    question: "मेंडल ने प्रस्तावित किया था",
    option:["सहलग्नता के नियम","10% ऊर्जा के नियम","आनुवंशिकता के नियम","इनमें से कोई नहीं"],
    answer:"आनुवंशिकता के नियम"
},
{
    question: "सिट्रिक अम्ल का उत्पादन होता है",
    option:["ऐस्परजिलस कवक से","जीवाणु से","यीस्ट से","विषाणु से"],
    answer:"ऐस्परजिलस कवक से"
},
{
    question: "सुकेन्द्रकियों में t-RNA, 5S-rRNA एवं snRNA के अनुलेखन में इनमें से कौन अन्तर्ग्रस्त है?",
    option:["RNA पॉलीमरेज I","RNA पॉलीमरेज II","RNA पॉलीमरेज III","इनमें से सभी"],
    answer:"RNA पॉलीमरेज III"
},
{
    question: "डोसा तथा इडली के ढीले-ढाले आटे की फूली हुई उभरी शक्ल किस कारण से होती है?",
    option:["O₂","CO₂","H₂","N₂"],
    answer:"CO₂"
},
{
    question: "नरयुग्मक तथा मादा युग्मक के संयोजन से क्या बनता है?",
    option:["अंडाणु","शुक्राणु","वीर्य","युग्मज"],
    answer:"युग्मज"
},
{
    question: "जीन क्लोनिंग के समय जीन टैक्सी किसे कहा जाता है?",
    option:["वैक्सीन","प्लाज्मिड","जीवाणु","प्रोटोजोअन"],
    answer:"प्लाज्मिड"
},
{
    question: "हार्मोन जो मासिक-चक्र से संबंधित न हो",
    option:["LH","FSH","इस्ट्राडियोल","TSH"],
    answer:"TSH"
},
{
    question: "किसी पुष्प के अंडाशय होते हैं:",
    option:["अगुणित","द्विगुणित","त्रिगुणित","चतुर्गुणित"],
    answer:"द्विगुणित"
},
{
    question: "विभिन्नता का अंतिम स्रोत है:",
    option:["प्राकृतिक वरण","लैंगिक प्रजनन","उत्परिवर्तन","हार्मोनल क्रियाविधि"],
    answer:"उत्परिवर्तन"
},
{
    question: "अधिकांश कृषि पादप हैं।",
    option:["ऑटोपॉलीप्लोइड्स","एलोपॉलीप्लोइड्स","ऐन्यूप्लोइड्स","हेप्लोइड्स"],
    answer:"एलोपॉलीप्लोइड्स"
},
{
    question: "निम्न में से कौन उभयलिंगाश्रयी पादप नहीं है?",
    option:["पपीता","सरसों","मक्का","उड़हुल"],
    answer:"पपीता"
},
{
    question: "जनसंख्या-विस्फोट का परिणाम है:",
    option:["आय में ह्रास","भूमि का ह्रास","खनिज का ह्रास","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "DNA श्रृंखला वृद्धि में ओकाजाकी खण्ड:",
    option:["द्वारा अनुलेखन होता है","3′ से 5′ दिशा में बहुलकता दर्शाते हैं तथा द्विशाखा बनाते हैं","DNA प्रतिकृति की अर्द्धसंरक्षी प्रकृति को दर्शाते हैं","5′ से 3′ दिशा में बहुलकता दर्शाते हैं तथा 3′ से 5′ DNA प्रतिकृति समझाते हैं"],
    answer:"5′ से 3′ दिशा में बहुलकता दर्शाते हैं तथा 3′ से 5′ DNA प्रतिकृति समझाते हैं"
},
{
    question: "निम्न में से कौन जीवाणु से होने वाली बीमारी नहीं है?",
    option:["टाइफाइड","कुष्ठ","डिफ्थीरिया","इन्फ्लुएंजा"],
    answer:"इन्फ्लुएंजा"
},
{
    question: "कैलस संवर्धन में जड़ का बनना किसके द्वारा प्रेरित होता है?",
    option:["जिबरेलिन","साइटोकाइनिन","ऑक्सिन","एथिलीन"],
    answer:"ऑक्सिन"
},
{
    question: "मुख्य वायु प्रदूषक है:",
    option:["CO","CO₂","N₂","गंधक"],
    answer:"CO"
},
{
    question: "किसी जीव में अगुणित गुणसूत्र की संख्या 10 है, इसकी Tetrasomic संख्या होगी",
    option:["40","14","22","44"],
    answer:"22"
},
{
    question: "स्थलीय जीवधारियों का जनसंख्या घनत्व किस पद में मापा जाता है?",
    option:["जीवधारी/मीटर","जीवधारी/मीटर²","जीवधारी/मीटर³","जीवधारी/मीटर²"],
    answer:"जीवधारी/मीटर²"
},
{
    question: "पारिस्थितिक विविधता में कौन सम्मिलित है?",
    option:["अल्फा विविधता","बीटा विविधता","गामा विविधता","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "F2 वंशज के Monohybrid genotypic अनुपात 1 : 2 : 1 दर्शाता है",
    option:["Segregation","Independent assortment","Dominance","Incomplete dominance"],
    answer:"Segregation"
},
{
    question: "Hysterectomy का तात्पर्य सर्जरी द्वारा विस्थापना है",
    option:["योनि का","अंडवाहिनी का","गर्भाशय का","अंडाशय का"],
    answer:"गर्भाशय का"
},
{
    question: "DNA खंड जो समान अग्र तथा पश्च के Code को पढ़ता है, कहलाता है:",
    option:["Palindromic DNA","Plasmic DNA","पूरक DNA","प्रतिलिपि DNA"],
    answer:"Palindromic DNA"
},
{
    question: "हरे पौधे उत्पादक होते हैं जो",
    option:["प्रकाश ऊर्जा को रासायनिक ऊर्जा में बदल देते हैं।","रासायनिक ऊर्जा को प्रकाश ऊर्जा में बदल देते हैं।","(A) तथा (B) दोनों सही हैं","इनमें से कोई नहीं"],
    answer:"प्रकाश ऊर्जा को रासायनिक ऊर्जा में बदल देते हैं।"
},
{
    question: "बिना निषेचन के फल निर्माण को क्या कहते हैं?",
    option:["अपयुग्मन","असंगजनन","अनिषेकजनन","इनमें से सभी"],
    answer:"अनिषेकजनन"
},
{
    question: "जीनोटाइप का पता ‘टेस्ट क्रॉस’ द्वारा किया जाता है। यह किसके बीच का क्रॉस है?",
    option:["F1 हाइब्रिड तथा प्रभावी जनक के बीच","F1 हाइब्रिड तथा recessive जनक के बीच","दो F1 हाइब्रिड के बीच","दो F2 हाइब्रिड के बीच"],
    answer:"F1 हाइब्रिड तथा recessive जनक के बीच"
},
{
    question: "उच्च पैदावार एवं रोग प्रतिरोधी ‘सोनालिका’ एवं ‘कल्याण सोना’ किसकी किस्में हैं?",
    option:["धान","गेहूँ","मक्का","कपास"],
    answer:"गेहूँ"
},
{
    question: "मिट्टी को उपजाऊ बनाने में सहायक है?",
    option:["कीटनाशक","जैविक खाद","यीस्ट","इनमें से कोई नहीं"],
    answer:"जैविक खाद"
},
{
    question: "मॉर्फिन तथा अफीम किससे प्राप्त किया जाता है?",
    option:["कजानस काजन","कैनाबिस सेटाइवा","पापावर सोमनीफरम","राउल्फिया सपैटिना"],
    answer:"पापावर सोमनीफरम"
},
{
    question: "मॉण्ट्रियल प्रोटोकॉल का लक्ष्य है:",
    option:["ओजोन क्षतिकारी पदार्थों में कमी लाना","जैवविविधता का संरक्षण","जल प्रदूषण का नियंत्रण","कार्बन डाइऑक्साइड निष्कासन में कमी"],
    answer:"ओजोन क्षतिकारी पदार्थों में कमी लाना"
},
{
    question: "किसी Telolecithal egg में yolk पाया जाता है",
    option:["दोनों सिर पर","एक सिरे पर","मध्य में","पूरे egg के कोशिकाद्रव्य में"],
    answer:"एक सिरे पर"
},
{
    question: "मलेरिया के उपचार हेतु किस पौधे से दवा तैयार की गई है?",
    option:["मामीन","कुनैन","टैक्सोल","तुलसी"],
    answer:"कुनैन"
},
{
    question: "मानव में रुधिर O वर्ग में",
    option:["एंटीजन अनुपस्थित होते हैं","एंटीबॉडी अनुपस्थित होते हैं","एंटीजन उपस्थित रहते हैं","एंटीबॉडी A उपस्थित रहते हैं"],
    answer:"एंटीजन अनुपस्थित होते हैं"
},
{
    question: "रेप्लिकेसण इनमें से किससे संबंधित है –",
    option:["डी एन ए","आर एन ए","दोनों से","इनमें से कोई नहीं"],
    answer:"डी एन ए"
},
{
    question: "शाकाहारी कीटों को खाने वाला मेढक होता है:",
    option:["प्राथमिक उपभोक्ता","द्वितीयक उपभोक्ता","तृतीयक उपभोक्ता","शीर्ष मांसाहारी"],
    answer:"द्वितीयक उपभोक्ता"
},
{
    question: "जीन क्लोनिंग में प्रयुक्त 'gene taxi' किसे कहते हैं?",
    option:["वैक्सीन","प्लाज्मिड","बैक्टीरियम","प्रोटोजोआ"],
    answer:"प्लाज्मिड"
},
{
    question: "दात्र कोशिका अरक्तता प्रदर्शित करती है",
    option:["एपिस्टैसिस","सहप्रभाविता","प्लीओट्रॉपी","अपूर्ण प्रभाविता"],
    answer:"प्लीओट्रॉपी"
},
{
    question: "विश्व एड्स दिवस होता है:",
    option:["1 मई","20 दिसम्बर","1 जून","1 दिसम्बर"],
    answer:"1 दिसम्बर"
},
{
    question: "इनमें किसमें केवल एक बार अपने जीवनकाल में पुष्प खिलते हैं?",
    option:["बाँस","आम","लीची","जामुन"],
    answer:"बाँस"
},
{
    question: "किसमें जीन जोड़ा में नहीं होता है?",
    option:["युग्मनज","कायिक कोशिका","भ्रूणपोषीय कोशिका","युग्मक"],
    answer:"युग्मक"
},
{
    question: "वृषण में हार्मोन स्रावित कोशिका है",
    option:["spermatogonia","spermatocyte","sustentacular cell","Leydig cells"],
    answer:"Leydig cells"
},
{
    question: "निम्नलिखित में से किसमें Cleistogamy होता है",
    option:["धतूरा","पिटूनिया","कोमेलिना","ग्लेडिओलस"],
    answer:"कोमेलिना"
},
{
    question: "दूध से दही बनने में किस जीवाणु का उपयोग होता है?",
    option:["स्ट्रेप्टोकोक्कस","लैक्टोबैसिलस","एनाबेना","इनमें से कोई नहीं"],
    answer:"लैक्टोबैसिलस"
},
{
    question: "वाट्सन-क्रिक प्रारूप के DNA मॉडल में वृहद् groove किसका site है?",
    option:["हिस्टोन प्रोटीन का बंधन","अम्लीय प्रोटीन का बंधन","RNA अणु का बंधन","ग्लाइकोप्रोटीन का बंधन"],
    answer:"हिस्टोन प्रोटीन का बंधन"
},
{
    question: "निम्नलिखित में कौन द्विलिंगी नहीं है?",
    option:["फीताकृमि","कुत्ता","जोंक","स्पंज"],
    answer:"कुत्ता"
},
{
    question: "PCR से जाँच होती है:",
    option:["HIV का","कैंसर का","क्षय रोग का","हैजा का"],
    answer:"HIV का"
},
{
    question: "दोहरा निषेचन में भाग लेने वाले नर केन्द्रकों की संख्या होती है",
    option:["2","3","4","5"],
    answer:"2"
},
{
    question: "जलीय पारितंत्र में ऊर्जा का पिरामिड कैसा होता है?",
    option:["हमेशा सीधा","हमेशा उल्टा","घंटीनुमा","इनमें से कोई नहीं"],
    answer:"हमेशा सीधा"
},
{
    question: "तीन वैज्ञानिकों ने मेंडल के परिणामों की पुनः खोज की, जिसमें कौन शामिल नहीं है?",
    option:["वाल्टर सटन","डी व्रीज","कॉरेन्स","वॉन शेरमॉक"],
    answer:"वाल्टर सटन"
},
{
    question: "कर्नाटक में बाँदीपुर स्थल प्रसिद्ध है",
    option:["हाथियों के लिए","हंगुल के लिए","चीतों के लिए","मोर के लिए"],
    answer:"हाथियों के लिए"
},
{
    question: "ओपरॉन का कौन-सा जीन रिप्रेशन प्रोटीन बनाता है?",
    option:["ओपरेटर","प्रोमोटर","रेगुलेटर","संरचनात्मक"],
    answer:"रेगुलेटर"
},
{
    question: "Seminal vesicle के स्रावण द्वारा Fructose की उपस्थिति Forensic जाँच में प्रदर्शित करता है?",
    option:["सिफिलिस","AIDS","बलात्कार","Hepatitis"],
    answer:"बलात्कार"
},
{
    question: "DNA अवक्षेपित निम्नलिखित में से किसके मिलाने से होता है?",
    option:["शीतित एथेनॉल","शीतित मिथेनॉल","गर्म एथेनॉल","एल्डिहाइड"],
    answer:"शीतित एथेनॉल"
},
{
    question: "DNA अणु में साइटोसीन हमेशा किससे जुड़ा रहता है?",
    option:["थायमीन","युरासिल","गुआनीन","सायटोसीन"],
    answer:"गुआनीन"
},
{
    question: "'फ्लेवर सेवर' इनमें से क्या है?",
    option:["पीड़कनाशी","चूजों की प्रजाति","पारजीवी टमाटर","कीटनाशी प्रोटीन"],
    answer:"पारजीवी टमाटर"
},
{
    question: "LSD प्राप्त होती है:",
    option:["कवक से","लाइकेन से","शैवाल से","जीवाणु से"],
    answer:"कवक से"
},
{
    question: "कृषि जैव प्रौद्योगिकी में प्रयुक्त प्रमुख तकनीक है:",
    option:["ऊतक संवर्धन","रूपान्तरण","पादप प्रजनन","DNA प्रतिलिपिकरण"],
    answer:"ऊतक संवर्धन"
},
{
    question: "निम्नलिखित में से कौन-सा मरुद्भिदी है?",
    option:["कैपेरिस","कमल","चाइना रोज","आलू"],
    answer:"कैपेरिस"
},
{
    question: "औद्योगिक मेलानिज्म की घटना दर्शाती है",
    option:["जननिक पृथक्करण","आनुवंशिक पृथक्करण","प्राकृतिक वरण","भौगोलिक वितरण"],
    answer:"प्राकृतिक वरण"
},
{
    question: "B-DNA के एक पूर्ण घुमाव में नाइट्रोजीनस बेस के कितने पेयर्स होते हैं?",
    option:["5","10","15","20"],
    answer:"10"
},
{
    question: "किसी आवृत्तबीजी (Angiosperms) में कितने युग्मक परागनलिका में होते हैं?",
    option:["एक","दो","तीन","अनेक"],
    answer:"दो"
},
{
    question: "सहोपकारिता किसके बीच होती है?",
    option:["तितली व फूल","इश्चेरिचिया कोलाई व मनुष्य","जूक्लोरेला व हाइड्रा","हर्मिट क्रेब व समुद्री ऐनीमोन"],
    answer:"जूक्लोरेला व हाइड्रा"
},
{
    question: "स्वपरागण को निम्न में से कौन-सा पादप रोकता है",
    option:["एरंड","मक्का","A एवं B दोनों","इनमें से कोई नहीं"],
    answer:"एरंड"
},
{
    question: "गोल्डेन राइस में कौन-कौन सा पदार्थ अधिक मात्रा में पाया जाता है?",
    option:["थायमिन","फोलिक एसिड","बीटा-कैरोटीन","राइबोफ्लेविन"],
    answer:"बीटा-कैरोटीन"
},
{
    question: "किसके द्वारा किसी आवृत्तबीजी में tetrad के चारों microspores ढके रहते हैं",
    option:["सेलुलोज","Sporopollenin","Pactose","Stamen"],
    answer:"Sporopollenin"
},
{
    question: "साइकस में परागण होता है:",
    option:["तीन कोशिकीय अवस्था में","चार कोशिकीय अवस्था में","दो कोशिकीय अवस्था में","एक कोशिकीय अवस्था में"],
    answer:"तीन कोशिकीय अवस्था में"
},
{
    question: "फाइलेरिया/हाथीपाँव रोग का रोगाणु है:",
    option:["वुचेरेरिया","एस्केरिस","टीनिया","इनमें से कोई नहीं"],
    answer:"वुचेरेरिया"
},
{
    question: "निम्न में कौन-सा रोग हीमोग्लोबिन त्रुटि के कारण होता है?",
    option:["डाउन सिंड्रोम","फिनाइलकीटोन्यूरिया","क्लाइनेफेल्टर सिंड्रोम","सिकल सेल एनीमिया"],
    answer:"सिकल सेल एनीमिया"
},
{
    question: "इनमें किसे ‘बंगाल का आतंक’ कहा गया है?",
    option:["अगेव","जलकुम्भी","केला","ब्रायोफिलम"],
    answer:"जलकुम्भी"
},
{
    question: "नई प्रजातियों के जनन में पुष्प कलिकाओं से पुंकेसर का निकलना कहलाता है",
    option:["बैगिंग","इमैस्कुलेशन","टैगिंग","एन्थेसिस"],
    answer:"इमैस्कुलेशन"
},
{
    question: "ब्लू बेबी सिन्ड्रोम होता है:",
    option:["TDS की अधिकता से","DO की अधिकता से","क्लोराइड की अधिकता से","मेटहीमोग्लोबिन से"],
    answer:"मेटहीमोग्लोबिन से"
},
{
    question: "ऊर्जा का पिरामिड होता है:",
    option:["सदैव उल्टा","सदैव सीधा","(A) तथा (B) दोनों","इनमें से कोई नहीं"],
    answer:"सदैव सीधा"
},
{
    question: "निम्नलिखित में कौन-से समरूप अंग (Analogous organs) के उदाहरण हैं?",
    option:["कस्कटा के शल्क","एपेंडिक्स","कीट एवं कबूतर के पंख","पक्षी का पंख तथा कीट का मुखांग"],
    answer:"कीट एवं कबूतर के पंख"
},
{
    question: "ऐगारोज का प्रयोग किया जाता है:",
    option:["इलेक्ट्रोफोरेसिस में","जीन क्लोनिंग में","DNA को देखने के लिए","प्लाज्मिड को काटने के लिए"],
    answer:"इलेक्ट्रोफोरेसिस में"
},
{
    question: "जीरोफाइट्स में होते हैं:",
    option:["सिकुड़े रंध्र छिद्र","गहरी जड़","मोटी क्यूटिकल","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "इनमें से कौन स्वप्रतिरक्षा रोग का उदाहरण है?",
    option:["दमा","रूमेटॉयड अर्थराइटिस","कैंसर","इनमें से कोई नहीं"],
    answer:"रूमेटॉयड अर्थराइटिस"
},
{
    question: "कायज्मा किस अवस्था में बनता है",
    option:["समसूत्री कोशिका विभाजन","एमाइटोसिस कोशिका विभाजन","अर्द्धसूत्री कोशिका विभाजन","इनमें से कोई नहीं"],
    answer:"अर्द्धसूत्री कोशिका विभाजन"
},
{
    question: "एकिडना क्या है?",
    option:["अवशोषी जीव","योजक कड़ी","विलुप्त कड़ी","इनमें से कोई नहीं"],
    answer:"योजक कड़ी"
},
{
    question: "पारिस्थितिक तंत्र में आहार स्तर को कहा जाता है:",
    option:["पोषण रीति","उपभोक्ता स्तर","उत्पादक स्तर","शाकाहारी स्तर"],
    answer:"उपभोक्ता स्तर"
},
{
    question: "निम्न में से किसमें गमन अत्यधिक घट जाता है?",
    option:["ऐजोस्परमिया","बहुशुक्राणुता","अल्पशुक्राणुता","वीर्य में शुक्राणुओं की स्वतः गतिशीलता का घट जाना (एस्थेनोस्परमिया)"],
    answer:"वीर्य में शुक्राणुओं की स्वतः गतिशीलता का घट जाना (एस्थेनोस्परमिया)"
},
{
    question: "किसमें कृत्रिम बीज का निर्माण किया जाता है?",
    option:["कायिक भ्रूण","बहुभ्रूण","(A) और (B) दोनों","इनमें से कोई नहीं"],
    answer:"कायिक भ्रूण"
},
{
    question: "मादा gametophyte दर्शाता है",
    option:["Ovule","Embryo sac","Megaspore mother cell","Megasporephyll"],
    answer:"Embryo sac"
},
{
    question: "असामान्य वन्ध्य नर, शरीर पर कम बाल, कम विकसित जननांग के लक्षण किससे संबंधित हैं?",
    option:["XXX गुणसूत्र वाले नर से","XY गुणसूत्र वाले नर से","XXY गुणसूत्र वाले नर से","उपर्युक्त में से कोई नहीं"],
    answer:"XXY गुणसूत्र वाले नर से"
},
{
    question: "सबसे अधिक तथा सबसे कम जीन वाले मानव गुणसूत्र कौन-से हैं?",
    option:["गुणसूत्र 21 एवं Y","गुणसूत्र 1 एवं X","गुणसूत्र 1 एवं Y","गुणसूत्र X एवं Y"],
    answer:"गुणसूत्र 1 एवं Y"
},
{
    question: "एक नर Grasshopper में sex complement की संख्या होती है",
    option:["XY","XX","XO","YO"],
    answer:"XO"
},
{
    question: "मनुष्य के भोजन के प्रमुख दाने हैं।",
    option:["फली","धान","बाजरा","तेल बीज"],
    answer:"धान"
},
{
    question: "वह जंतु जो अपने शरीर के एक तिहाई भार के बराबर जल की कमी सहन कर सकता है",
    option:["नेक्टयूरस","ऊँट","छिपकली","काइटोन"],
    answer:"ऊँट"
},
{
    question: "जीन विनिमय किस अवस्था में होता है?",
    option:["जाइगोटीन","पैकीटीन","डिप्लोटीन","लिप्टोटीन"],
    answer:"पैकीटीन"
},
{
    question: "यदि महाबीजाणु मातृकोश में 10 गुणसूत्र हों तो एलियूरोन परत में कितने गुणसूत्र होंगे?",
    option:["10","15","20","25"],
    answer:"15"
},
{
    question: "Y-सहलग्नता समूह की संख्या उस कोशिका के लिए क्या होगी जिसमें 2n = 14?",
    option:["5","10","7","14"],
    answer:"7"
},
{
    question: "जैविक शक्ति का मान निकाला जाता है:",
    option:["जन्मदर – मृत्युदर","जन्मदर + मृत्युदर","जन्मदर ÷ मृत्युदर","इनमें से कोई नहीं"],
    answer:"जन्मदर – मृत्युदर"
},
{
    question: "AIDS का कारक क्या है?",
    option:["ट्राइकोमोनास","HIV","हिपेटाइटिस E","बैसिलस एन्थ्रेसिस"],
    answer:"HIV"
},
{
    question: "Pollen kit रासायनिक रूप से बना होता है",
    option:["प्रोटीन से","लिपिड एवं Carotenoids से","कार्बोहाइड्रेट्स एवं Carotenoids से","Sporopollenin से"],
    answer:"लिपिड एवं Carotenoids से"
},
{
    question: "‘लाल आँकड़ों की पुस्तक’ प्रकाशित की है",
    option:["IUCN","NEERI","NWAI","CITES"],
    answer:"IUCN"
},
{
    question: "एडेनीन की जगह पर साइटोसिन के आने को कहते हैं",
    option:["ट्रांसक्रिप्सन","ट्रांजिसन","ट्रांसवर्सन","इनमें से कोई नहीं"],
    answer:"ट्रांसवर्सन"
},
{
    question: "संपूर्ण Linkage को सबसे पहले किसमें दर्शाया गया?",
    option:["मक्का","मादा मनुष्य में","मादा ड्रोसोफिला में","नर ड्रोसोफिला में"],
    answer:"नर ड्रोसोफिला में"
},
{
    question: "विशिष्ट जीनों को परपोषी पौधों में किसके उपयोग द्वारा प्रवेश कराया गया है?",
    option:["एग्रोबैक्टिरियम संवाहक","कवक","यीस्ट","खरपतवार"],
    answer:"एग्रोबैक्टिरियम संवाहक"
},
{
    question: "एक ही नस्ल के पशुओं के बीच प्रजनन को कहते हैं।",
    option:["अंतःप्रजनन","बहिःप्रजनन","बहिःसंकरण","संकरण"],
    answer:"अंतःप्रजनन"
},
{
    question: "कौन-सा द्विलिंगी जानवर है?",
    option:["केंचुआ, हाइड्रा तथा जोंक","तिलचट्टा, ऐसकेरिस तथा हाइड्रा","केंचुआ, ऐसकेरिस तथा जोंक","ऐस्केरिस, तिलचट्टा तथा हाइड्रा"],
    answer:"केंचुआ, हाइड्रा तथा जोंक"
},
{
    question: "EcoRI प्रतिबंधन एंजाइम निम्नलिखित में से किस अनुक्रम को पहचानता है?",
    option:["GAATTC","GGCC","AGGCCT","TCCGGA"],
    answer:"GAATTC"
},
{
    question: "वन अवस्था इनमें से किस पारिस्थितिक अवस्था का द्योतक है?",
    option:["चरम अवस्था","पर्वतीय अवस्था","शाकीय अवस्था","इनमें से कोई नहीं"],
    answer:"चरम अवस्था"
},
{
    question: "दलहनी पौधों के जड़ पिंड में कौन-सा जीवाणु पाया जाता है?",
    option:["राइजोबियम","एजोटोबैक्टर","स्टेफाइलोकोक्कस","लैक्टोबैसिलस"],
    answer:"राइजोबियम"
},
{
    question: "हेरोइन किस पादप परिवार से प्राप्त किया जाता है?",
    option:["लिगुमिनोसी","पैपावेरेसी","लिलियेसी","सोलेनेसी"],
    answer:"पैपावेरेसी"
},
{
    question: "पर-परागण से प्राप्त संतति दर्शाता है",
    option:["उच्च श्रेणी की variability तथा विकासवाद में महत्त्वपूर्ण भूमिका","नपुंसकता","recessive गुण","समजात एवं phenotypic समरूपता"],
    answer:"उच्च श्रेणी की variability तथा विकासवाद में महत्त्वपूर्ण भूमिका"
},
{
    question: "यदि मेंडल मटर में आठवें गुण पर विचार करता तो निम्नलिखित में कौन-सा नियम असफल हो जाता?",
    option:["Law of Segregation","Law of Purity of Gametes","Law of Independent Assortment","Law of Dominance"],
    answer:"Law of Independent Assortment"
},
{
    question: "चिपको आंदोलन किसकी सुरक्षा के लिए शुरू किया गया था?",
    option:["वन","घासभूमि","नमभूमि","पशुचारा"],
    answer:"वन"
},
{
    question: "गेमा (Gemma) द्वारा प्रजनन होता है:",
    option:["उच्च श्रेणी के पौधों में","निम्न श्रेणी के जन्तुओं में","कुछ ब्रायोफाइटा में","स्तनियों में"],
    answer:"कुछ ब्रायोफाइटा में"
},
{
    question: "फसलों के वृद्धि नियंत्रक निम्न में से कौन हैं?",
    option:["ऑक्सिन","जिबरेलिन","साइटोकाइनिन","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "उत्तम प्रकार का पिरामिड जो सदैव सत्य होता है",
    option:["ऊर्जा का पिरामिड","जैवभार का पिरामिड","संख्या का पिरामिड","दोनों (A) तथा (B)"],
    answer:"ऊर्जा का पिरामिड"
},
{
    question: "अपरद खाद्य शृंखला की शुरुआत होती है",
    option:["जीवाणु से","विषाणु से","शैवाल से","प्रोटोजोआ से"],
    answer:"जीवाणु से"
},
{
    question: "निम्नांकित में से कौन जंतुओं में जीन क्लोनिंग हेतु संवाहक है?",
    option:["रेट्रोवायरस","साइनोबैक्टीरिया","ई. कोलाई","इनमें से सभी"],
    answer:"रेट्रोवायरस"
},
{
    question: "एंडोमेट्रियम किसके प्रभाव से मोटाई में वृद्धि करता है?",
    option:["ऑक्सीटोसिन","एस्ट्रोजेन","LH","रिलेक्सिन"],
    answer:"एस्ट्रोजेन"
},
{
    question: "इनमें से किसका पुष्पासन खाया जाता है",
    option:["शरीफा","सेब","नारंगी","लीची"],
    answer:"सेब"
},
{
    question: "निम्न में से कौन-सी घटना जैव-विकास में डार्विन के सिद्धांत का समर्थन करती है?",
    option:["ट्रांसजेनिक जंतुओं का विकास","क्लोनिंग द्वारा ‘डॉली’ नामक भेड़ का उत्पादन","पीड़कनाशी प्रतिरोधी कीटों की प्रचुरता","स्टेम कोशिकाओं से अंग प्रत्यर्पण हेतु अंगों का विकास"],
    answer:"पीड़कनाशी प्रतिरोधी कीटों की प्रचुरता"
},
{
    question: "DNA की श्रृंखला में F-bond किस अवयव के बीच होता है?",
    option:["शुगर तथा क्षार","फॉस्फेट तथा क्षार","पूरक क्षार","फॉस्फेट तथा शुगर"],
    answer:"पूरक क्षार"
},
{
    question: "Sporogenesis कहते हैं",
    option:["बीजाणु के विकास एवं निर्माण को","Mitospores के उत्पादन को","Meiospores के उत्पादन को","युग्मज एवं भ्रूण के निर्माण को"],
    answer:"बीजाणु के विकास एवं निर्माण को"
},
{
    question: "Bt cotton किससे प्रतिरोधी है?",
    option:["कीट","खरपतवारनाशी","लवण","सूखा"],
    answer:"कीट"
},
{
    question: "निम्नांकित में से कौन जन्मदर नियंत्रण की शल्य विधि है?",
    option:["वैसेक्टॉमी","ट्यूबेक्टॉमी","(A) तथा (B) दोनों","इनमें से कोई नहीं"],
    answer:"(A) तथा (B) दोनों"
},
{
    question: "इनमें कौन तालाबीय पारिस्थितिकी तंत्र में एक से अधिक पोषण स्तर पर कार्य करता है?",
    option:["मेंढक","फाइटोप्लैंक्टन","मछली","जूप्लैंक्टन"],
    answer:"मछली"
},
{
    question: "यीस्ट निम्नलिखित में से किसका प्रमुख स्रोत है?",
    option:["विटामिन C","राइबोफ्लेविन","शर्करा","प्रोटीन"],
    answer:"राइबोफ्लेविन"
},
{
    question: "नर में क्या नहीं होता है?",
    option:["Bulbourethral gland","Bertholin’s gland","Prostate","Cowper’s gland"],
    answer:"Bertholin’s gland"
},
{
    question: "अंड समुच्चय बना होता है",
    option:["अंड कोशिका","सहायक कोशिका","दोनों (A) और (B)","प्रतिव्यासांत कोशिकाएँ"],
    answer:"दोनों (A) और (B)"
},
{
    question: "आर्थोट्रोपस बीजाण्ड में बीजाण्डद्वार तथा निभाग होते हैं",
    option:["बीजाण्डवृन्त से तिरछे","बीजाण्डवृन्त से 90° पर","बीजाण्डवृन्त से सीधी रेखा में","बीजाण्डवृन्त के समानान्तर"],
    answer:"बीजाण्डवृन्त से सीधी रेखा में"
},
{
    question: "निम्न में से कौन कीटभक्षी पौधा है?",
    option:["ड्रॉसेरा","नेपेन्थीस","(A) एवं (B) दोनों","हाइड्रिला"],
    answer:"(A) एवं (B) दोनों"
},
{
    question: "प्रदूषण की वृद्धि का कारण है:",
    option:["Research","जनसंख्या विस्फोट","उद्योग एवं यातायात","वर्षा जल"],
    answer:"उद्योग एवं यातायात"
},
{
    question: "प्राकृतिक पीड़कनाशी AZD-Reaction प्राप्त होता है।",
    option:["तम्बाकू से","नीम से","कवक से","शैवाल से"],
    answer:"नीम से"
},
{
    question: "द्रव (तरल पदार्थ) को 70-80 डिग्री सेल्सियस पर गर्म कर एकाएक तेजी से ठंडा करने की प्रक्रिया को कहते हैं।",
    option:["मितचुराइजेशन","पाश्चराइजेशन","लिक्विफिकेशन","इनमें से कोई नहीं"],
    answer:"पाश्चराइजेशन"
},
{
    question: "इनमें से सर्वाधिक हानिकारक कौन-सी गैस है?",
    option:["कार्बन मोनोऑक्साइड","सल्फर डाइऑक्साइड","नाइट्रस ऑक्साइड","इनमें से कोई नहीं"],
    answer:"कार्बन मोनोऑक्साइड"
},
{
    question: "सबसे बड़ा ओजोन छिद्र किसके ऊपर है?",
    option:["अंटार्कटिका","यूरोप","अफ्रीका","भारत"],
    answer:"अंटार्कटिका"
},
{
    question: "गोल्डेन धान में कौन-सा विटामिन पाया जाता है?",
    option:["A","B","C","D"],
    answer:"A"
},
{
    question: "जैव विविधता कानून भारत में कब पास हुआ था?",
    option:["1992","1996","2000","2002"],
    answer:"2002"
},
{
    question: "एंडोस्पर्म द्वारा किसे पोषण दिया जाता है",
    option:["बीज","फल","एंडोस्पर्म","भ्रूण"],
    answer:"भ्रूण"
},
{
    question: "इनमें से कौन-सा नाइट्रोजिनस बेस DNA में नहीं होता है?",
    option:["थाइमिन","युरासिल","गुआनिन","साइटोसिन"],
    answer:"युरासिल"
},
{
    question: "ऊतक संवर्धन द्वारा बड़ी संख्या में पौधे उत्पन्न करने की विधि कहलाती है।",
    option:["सूक्ष्म प्रजनन","भ्रूण प्रवर्धन","सूक्ष्म प्रवर्धन","भ्रूणपोष प्रवर्धन"],
    answer:"सूक्ष्म प्रवर्धन"
},
{
    question: "मुकुलन द्वारा जनन किसमें होता है?",
    option:["यीस्ट","पारामिशियम","पेनिसिलियम","इनमें से सभी"],
    answer:"यीस्ट"
},
{
    question: "निम्नलिखित समूहों में कौन संवेदनात्मक/स्वापक (Narcotic) पदार्थ हैं?",
    option:["मॉर्फिन, कोकीन और चाय","हेरोइन, कोकीन और तंबाकू","ब्राउन शुगर, हशीश और कॉफी","कोकीन, हेरोइन और हशीश"],
    answer:"कोकीन, हेरोइन और हशीश"
},
{
    question: "एक सामान्य स्त्री जिसके पिता वर्णांध हैं, की शादी एक सामान्य पुरुष से होती है। उसके पुत्र कितने प्रतिशत वर्णांध होंगे?",
    option:["75%","50%","सभी सामान्य","सभी वर्णांध"],
    answer:"50%"
},
{
    question: "मलेरिया परजीवी के संक्रमण की मुख्य अवस्था क्या है?",
    option:["द्राकाज्वाइट","स्पोरोज्वाइट","मेरोज्वाइट","क्रिप्टोज्वाइट"],
    answer:"स्पोरोज्वाइट"
},
{
    question: "ऐसे जीवाणु का नाम बताइए जिसे संवाहक के रूप में पौधों में जीन का प्रवेश कराने के लिए प्रयोग किया जाता है।",
    option:["एजोटोबैक्टर","एग्रोबैक्टिरियम ट्यूमेफेसीयन्स","बैसिलस थूरीनजियेंसिस","ई. कोलाई"],
    answer:"एग्रोबैक्टिरियम ट्यूमेफेसीयन्स"
},
{
    question: "25 प्राथमिक शुक्राणु कोशिका तथा 25 प्राथमिक अंडाणु कोशिका से कितने शुक्राणु तथा अंडाणु बन सकते हैं?",
    option:["100 शुक्राणु तथा 100 अंडाणु","100 शुक्राणु तथा 50 अंडाणु","100 शुक्राणु तथा 25 अंडाणु","50 शुक्राणु तथा 25 अंडाणु"],
    answer:"100 शुक्राणु तथा 25 अंडाणु"
},
{
    question: "डिप्थीरिया, टिटनेस, कुकरखाँसी आदि के लिए कौन-सा टीका लगवाना चाहिए?",
    option:["BCG","DTP-Hib","हिपेटाइटिस-B","इनमें से कोई नहीं"],
    answer:"DTP-Hib"
},
{
    question: "बिन्दु उत्परिवर्तन में एडीनिन ग्वानिन द्वारा प्रतिस्थापित होता है",
    option:["इन्वर्शन में","फ्रेम शिफ्ट उत्परिवर्तन में","ट्रांसवर्सन में","ट्रांजिशन में"],
    answer:"ट्रांजिशन में"
},
{
    question: "मानव स्त्रियों में अण्डे का निर्माण होता है",
    option:["गर्भाशय में","फैलोपियन नली में","ओवेरियन फॉलिकल में","इनमें से कोई नहीं"],
    answer:"ओवेरियन फॉलिकल में"
},
{
    question: "लैक प्रचालेक में निम्नलिखित जीन के द्वारा बीटा-गैलेक्टोसिडेज का संश्लेषण होता है:",
    option:["जीन ए","जीन वाई","जीन जेड","उपर्युक्त में कोई नहीं"],
    answer:"जीन जेड"
},
{
    question: "किस पारितंत्र की सकल प्राथमिक उत्पादकता सर्वाधिक है?",
    option:["घास स्थल","मैंग्रोव","कोरल रीफ","वर्षा वन"],
    answer:"कोरल रीफ"
},
{
    question: "निम्नलिखित में एक को छोड़कर सभी mesoderm निर्मित होते हैं",
    option:["मांसपेशीय तंत्र","तंत्रिका तंत्र","परिवहन तंत्र","जननांग"],
    answer:"तंत्रिका तंत्र"
},
{
    question: "यदि ovule मुड़ा हुआ हो तथा भ्रूणकोष घोड़े के नाल के समान हो तो इसे कहते हैं",
    option:["Anatropous","Circinotropous","Amphitropous","Orthotropous"],
    answer:"Amphitropous"
},
{
    question: "आवृत्तबीजी में निषेचन होता है",
    option:["Nucellus में","भ्रूणकोश में","अंडाशय में","Ovule में"],
    answer:"भ्रूणकोश में"
},
{
    question: "अखबार के कागज में कौन-सा विषैला पदार्थ होता है?",
    option:["Cd","Pb","Mg","Hg"],
    answer:"Pb"
},
{
    question: "F1 हाइब्रिड तथा recessive parent (Tt × tt) के बीच का अनुपात है",
    option:["1 : 1","2 : 1","3 : 1","4 : 1"],
    answer:"1 : 1"
},
{
    question: "अफीम व हेरोइन किससे प्राप्त होते हैं?",
    option:["थिआ","पेपावर","कैनाबिस","थियोब्रोमा"],
    answer:"पेपावर"
},
{
    question: "अंड-प्रजक निम्नांकित में कौन है?",
    option:["सर्प","मगरमच्छ","मुर्गी","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "ABO रक्त समूह का निर्धारण होता है",
    option:["3 recessive alleles द्वारा","3 codominant alleles द्वारा","2 codominant तथा 1 recessive allele द्वारा","2 recessive तथा 1 dominant allele द्वारा"],
    answer:"2 codominant तथा 1 recessive allele द्वारा"
},
{
    question: "झील पारिस्थितिक तंत्र में, जैव भार का पिरामिड होता है:",
    option:["सीधा","उलटा","कभी उलटा, कभी सीधा","कोई नहीं"],
    answer:"उलटा"
},
{
    question: "पौधों में कीटनाशी प्रतिरोधक जीन होता है:",
    option:["Bt","Ct","Mt","इनमें से सभी"],
    answer:"Bt"
},
{
    question: "एक सफल परजीवी वह है जो",
    option:["तेजी से वृद्धि करता है","तेजी से प्रजनन करता है","लम्बे समय तक आतिथ्य से चिपका रहता है","अपने आतिथ्य से न्यूनतम माँग करता है"],
    answer:"अपने आतिथ्य से न्यूनतम माँग करता है"
},
{
    question: "किसी परिवार में 5 पुत्रियाँ हैं। छठी संतान होने पर पुत्र की संभावना बनती है",
    option:["2 में 1","5 में 1","3 में 1","6 में 1"],
    answer:"2 में 1"
},
{
    question: "निम्न में से कौन वन संरक्षण कार्य के विरोध में हैं?",
    option:["लकड़ी काटने में बचाव","प्रकाश की प्राप्ति","आग लगने पर नियंत्रण","जंगली जंतु से सुरक्षा"],
    answer:"प्रकाश की प्राप्ति"
},
{
    question: "जीवाणु एवं कवक होते हैं:",
    option:["सफाईकर्ता","प्राथमिक उपभोक्ता","द्वितीयक उपभोक्ता","अपघटक"],
    answer:"अपघटक"
},
{
    question: "एक जाति या इसकी एक समष्टि में कुल आनुवंशिक विविधता को क्या कहते हैं?",
    option:["बीटा विविधता","जीना","गामा विविधता","जीनकोश"],
    answer:"जीनकोश"
},
{
    question: "निम्नलिखित में से कौन RNA के लिए उपर्युक्त नहीं है?",
    option:["एडिनीन","गुआनीन","थायमीन","साइटोसिन"],
    answer:"थायमीन"
},
{
    question: "सिरका (vinegar) का उत्पादन मोलासेज से किस सूक्ष्मजीवी द्वारा होता है?",
    option:["राइजोपस","स्ट्रेप्टोकोकस एसिटोबैक्टर","एसीटोबैक्टर","माइकोराइज"],
    answer:"एसीटोबैक्टर"
},
{
    question: "मानव में किस तरह का प्लासेंटा पाया जाता है?",
    option:["Chorionic","हीमोकोरियल","Metadiscoidal","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "वैसे वर्षा-जल को अम्ल-जल कहते हैं जिसका pH किससे कम होता है?",
    option:["7","6.5","6","5.6"],
    answer:"5.6"
},
{
    question: "संतान एवं recessive parent के बीच क्रॉस को कहते हैं",
    option:["एकल संकर","Back cross","Test cross","Reciprocal cross"],
    answer:"Test cross"
},
{
    question: "निम्नलिखित में कौन-सा न्यूक्लियोटाइड है?",
    option:["यूरिडिलिक अम्ल","थायमीन","साइटोसिन","ग्लूटामिक अम्ल"],
    answer:"यूरिडिलिक अम्ल"
},
{
    question: "जैव विकास की कौन-सी परिभाषा उचित है?",
    option:["किसी जाति का उन्नतिशील इतिहास","जाति का विभिन्नताओं सहित इतिहास","जाति का भ्रूणीय इतिहास","जाति का वर्णन"],
    answer:"किसी जाति का उन्नतिशील इतिहास"
},
{
    question: "कौन-सा न्यूक्लिक अम्ल के बहुलक हैं?",
    option:["प्रोटीन","न्यूक्लियोसाइड","न्यूक्लियोटाइड","भारी धातुओं के नाभिक"],
    answer:"न्यूक्लियोटाइड"
},
{
    question: "किसी आहार-अंखला में ऊर्जा स्थानान्तरण के 10 प्रतिशत नियम को किसने दिया?",
    option:["स्टानले","लिंडरमैन","विजमैन","ट्रांसले"],
    answer:"लिंडरमैन"
},
{
    question: "Fertilizin एक ग्लाइकोप्रोटीन है, जो पाया जाता है",
    option:["अंड झिल्ली की सतह पर","शुक्राणु पर","गर्भाशय की दीवाल पर","शुक्राशय की दीवाल पर"],
    answer:"अंड झिल्ली की सतह पर"
},
{
    question: "‘फिलोसोफिक जूलोजिक’ पुस्तक किसने लिखी?",
    option:["लामार्क","मेंडल","डार्विन","ह्यूगो डी व्रीज"],
    answer:"लामार्क"
},
{
    question: "जन्म के बाद माता से प्रथम दुग्ध स्रावण को Colostrum कहते हैं। इसमें निहित है",
    option:["IgA","IgD","IgE","IgG"],
    answer:"IgA"
},
{
    question: "निम्नलिखित में से किसमें बिना निषेचन द्वारा प्रजनन की क्षमता होती है?",
    option:["मकड़ा","गाय","मधुमक्खी","केंचुआ"],
    answer:"मधुमक्खी"
},
{
    question: "उच्च मृत्यु दर के कारण जनसंख्या में तीव्र ह्रास कहलाता है:",
    option:["जनसंख्या घनत्व","जनसंख्या अवनमन","जनसंख्या विस्फोट","उपरोक्त सभी"],
    answer:"जनसंख्या अवनमन"
},
{
    question: "क्षेत्रीय विविधता को कहते हैं:",
    option:["अल्फा विविधता","बीटा-विविधता","गामा-विविधता","जैविक विविधता"],
    answer:"गामा-विविधता"
},
{
    question: "जीन किससे बना होता है?",
    option:["लिपोप्रोटीन","न्यूक्लियोसाइड्स","पॉलिन्यूक्लियोटाइड्स","हिस्टोन्स"],
    answer:"पॉलिन्यूक्लियोटाइड्स"
},
{
    question: "प्रत्येक पादप कोशिका से पूर्ण पौधा बन सकता है। इस गुण को कहते हैं:",
    option:["क्लोनिंग","सोमाक्लोनल","टोटीपोटेन्सी","इनमें से कोई नहीं"],
    answer:"टोटीपोटेन्सी"
},
{
    question: "कृत्रिम तरीके से उन्नत नस्ल के वीर्य एकत्रित करना कहलाता है।",
    option:["प्रतिरोपण","वीर्य-संचयन","निषेचन","वीर्य-परिरक्षण"],
    answer:"वीर्य-संचयन"
},
{
    question: "किसी पौधे की जाति में प्रतिमुख कोशा में 8 क्रोमोसोम हों तो उसके एलियूरोन स्तर में कितने क्रोमोसोम होंगे?",
    option:["16","24","32","8"],
    answer:"24"
},
{
    question: "मनुष्यों में XO प्रकार की गुणसूत्रीय असामान्यता के कारण कौन-सा सिंड्रोम उत्पन्न होता है?",
    option:["टर्नर सिंड्रोम","डाउन सिंड्रोम","डार्विन्स सिंड्रोम","क्लाइनफेल्टर सिंड्रोम"],
    answer:"टर्नर सिंड्रोम"
},
{
    question: "प्लेसेन्टा के द्वारा",
    option:["भ्रूण माँ के नाभिरज्जु से जुड़ा होता है","भ्रूण को माँ का रक्त प्रदान किया जाता है","भ्रूण माँ के रक्त से पोषण प्राप्त करता है","भ्रूण झिल्लियों द्वारा घिरा होता है"],
    answer:"भ्रूण माँ के रक्त से पोषण प्राप्त करता है"
},
{
    question: "जीवों का अनुकूलन होता है",
    option:["निर्वाचन","कायांतरण","वंशागत लक्षण","उपार्जित लक्षण"],
    answer:"वंशागत लक्षण"
},
{
    question: "इनमें से पूरे जीवन में एक ही बार पुष्पित होते हैं",
    option:["बाँस","आम","ताड़","इनमें से कोई नहीं"],
    answer:"बाँस"
},
{
    question: "तंबाकू का मुख्य अवयव है:",
    option:["कोकीन","मार्फिन","निकोटीन","थायमीन"],
    answer:"निकोटीन"
},
{
    question: "किसमें परागकोश में अर्द्धसूत्री विभाजन होता है",
    option:["Endothecium कोशिका में","परागकण में","Tapetal कोशिका में","स्पोर मातृ कोशिका में"],
    answer:"स्पोर मातृ कोशिका में"
},
{
    question: "किसी हाइब्रिड तथा दोनों में से किसी एक Parent के बीच का क्रॉस कहलाता है",
    option:["टेस्ट क्रॉस","रेसिप्रोकल क्रॉस","एकल क्रॉस","बैक क्रॉस"],
    answer:"बैक क्रॉस"
},
{
    question: "विडाल परीक्षण द्वारा किसका पता चलता है?",
    option:["एड्स","मलेरिया","तपेदिक","टाइफाइड"],
    answer:"टाइफाइड"
},
{
    question: "F1 पीढ़ी के संकर पौधे को जब समयुग्मजी अप्रभावी जनक से क्रॉस कराया जाता है तो इसे क्या कहते हैं?",
    option:["बैक क्रॉस","टेस्ट क्रॉस","एकसंकर क्रॉस","द्विसंकर क्रॉस"],
    answer:"टेस्ट क्रॉस"
},
{
    question: "सामान्यतः एक परिपक्व निषेचित बीजाण्ड में n, 2n तथा 3n स्थिति मिलती है, क्रमशः",
    option:["भ्रूणपोष, बीजाण्डकाय तथा अंड में","अंड, एंटीपोडल तथा भ्रूणपोष में","अध्यावरण, सिनरजिड तथा अंड में","अंड, बीजाण्डकाय तथा भ्रूणपोष में"],
    answer:"अंड, बीजाण्डकाय तथा भ्रूणपोष में"
},
{
    question: "सहोपकारिता का उदाहरण है:",
    option:["रिक्सीया","सीलेजीनेला","लाइकेन","स्पाइरोगाइरा"],
    answer:"लाइकेन"
},
{
    question: "अगुणित कोशिका के संयोजन की प्रक्रिया होती है",
    option:["कोशिका चक्र","अर्द्धसूत्री विभाजन","सूत्री विभाजन","सिनगैमी"],
    answer:"सिनगैमी"
},
{
    question: "निम्न में से कौन कीटभक्षी पौधा है",
    option:["ड्रोसेरा","नेपेन्थीस","A और B दोनों","हाइड्रिला"],
    answer:"A और B दोनों"
},
{
    question: "इनमें कौन-सा रसायन आबादी के जीवों के बीच संचार स्थापित करने में मदद करता है?",
    option:["टायलिन","एंजाइम","फेरोमोन","इनमें से कोई नहीं"],
    answer:"फेरोमोन"
},
{
    question: "अर्जित गुणों के वंशागति का सिद्धांत दिया था",
    option:["हिकेल","डार्विन","डी व्रीज","लामार्क"],
    answer:"लामार्क"
},
{
    question: "बीजाण्ड के वृन्त को कहते हैं",
    option:["फ्यूनिकल","केरन्कल","न्यूसेलस","पेडीसिल"],
    answer:"फ्यूनिकल"
},
{
    question: "सूर्य की रोशनी से पराबैंगनी विकिरण की प्रक्रिया में उत्पादित होती है:",
    option:["CO","SO₂","O₃","फ्लोराइड"],
    answer:"O₃"
},
{
    question: "यदि नर आकारिकी में मादा से भिन्न हो, तो इसे कहते हैं:",
    option:["हेटेरोगैमी","होमोगैमी","लैंगिक द्विरूपता","हरमाफ्रोडाइटिज्म"],
    answer:"लैंगिक द्विरूपता"
},
{
    question: "कीटों द्वारा परागण को कहते हैं",
    option:["Ornithophily","Entomophily","Hydrophily","Chiropterophily"],
    answer:"Entomophily"
},
{
    question: "रेड डाटा बुक में सम्मिलित हैं:",
    option:["विलुप्त हो रहे पौधों की सूची","दुर्लभ पौधों की सूची","आपत्तिग्रस्त प्राणियों की सूची","इनमें सभी"],
    answer:"इनमें सभी"
},
{
    question: "ट्राइसोमी (2n + 1) के कारण होने वाला सिंड्रोम क्या कहलाता है?",
    option:["फीलाडेल्फिया","डाउन सिंड्रोम","एल्बिनिज्म","इनमें से कोई नहीं"],
    answer:"डाउन सिंड्रोम"
},
{
    question: "विश्व में कुल कितने जैव-विविधता हॉट-स्पॉट हैं?",
    option:["5","15","9","34"],
    answer:"34"
},
{
    question: "स्तनधारियों में निषेचन कहाँ होता है?",
    option:["अंडाशय","वासिय भाग","गर्भाशय","फैलोपियन नली"],
    answer:"फैलोपियन नली"
},
{
    question: "संतानोत्पत्ति-नियंत्रण के क्या उपाय हैं?",
    option:["हार्मोनल विधियाँ","प्राकृतिक विधियाँ","यांत्रिक विधियाँ","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "एडिनाइलिक अम्ल कौन-सा है?",
    option:["एडिनीन + राइबोज + फॉस्फेट","डिऑक्सीराइबोज + फॉस्फेट","एडिनोसीन + शर्करा","एडिनीन + शर्करा"],
    answer:"एडिनीन + राइबोज + फॉस्फेट"
},
{
    question: "तालाब पारितंत्र में संख्या का पिरामिड होता है",
    option:["ऊपर की ओर","अनियमित","उल्टा","तर्कुरूप"],
    answer:"ऊपर की ओर"
},
{
    question: "किसी genetic code के 64 codon में कितने codons द्वारा 20 प्रकार के अमीनो अम्ल का संश्लेषण होता है?",
    option:["61","64","20","59"],
    answer:"61"
},
{
    question: "एक लंबे पौधे का स्वपरागण करने पर लंबे तथा बौने दोनों तरह के पौधे प्राप्त होते हैं। प्रथम संतति के लिए कौन-सी संभावना हो सकती है?",
    option:["लंबा","बौना","बराबर की संभावनाएँ","असक्षम डेटा"],
    answer:"लंबा"
},
{
    question: "इंसुलिन उत्पादन और शरीर में इसकी क्रिया, डायबिटीज के स्तर के लिए उत्तरदायी है। यह यौगिक निम्नलिखित में से किस वर्ग से संबंधित है?",
    option:["सह-एंजाइम","एंटीबायोटिक","एंजाइम","हार्मोन"],
    answer:"हार्मोन"
},
{
    question: "आवृत्तबीजी में भ्रूणपोष होता है",
    option:["एकगुणित","द्विगुणित","त्रिगुणित","चतुर्गुणित"],
    answer:"त्रिगुणित"
},
{
    question: "निम्नलिखित में से मेंडल ने किसे प्रतिपादित नहीं किया?",
    option:["प्रभुता","अपूर्ण प्रभुता","विस्थापन","स्वतंत्र अपव्यूहन"],
    answer:"अपूर्ण प्रभुता"
},
{
    question: "'डॉली' नामक भेड़ एक क्लोन थी। इसके लिए प्रयुक्त दैहिक कोशिका किसकी थी?",
    option:["उदर की","त्वचा की","जीभ की","कर्ण उभार की"],
    answer:"उदर की"
},
{
    question: "कोई भी प्राणी एक अपवाद को छोड़कर अमर नहीं है। वह अपवाद है:",
    option:["एककोशीय जीव","हरित पादप","स्पोर","सायनोबैक्टिरिया"],
    answer:"एककोशीय जीव"
},
{
    question: "एक न्यूक्लिक अम्ल अणु की आधारभूत इकाई को कहते हैं:",
    option:["न्यूक्लियोसाइड","न्यूक्लियोटाइड","नाइट्रोजिनस क्षार","पेंटोज शर्करा"],
    answer:"न्यूक्लियोटाइड"
},
{
    question: "मानव मादा में अंडे का निषेचन कहाँ होता है?",
    option:["अंडाशय में","गर्भाशय में","योनिमार्ग में","फैलोपियन नलिका में"],
    answer:"फैलोपियन नलिका में"
},
{
    question: "किसी Pure tall pea के पौधे को Pure बौने पौधे के साथ क्रॉस कराया गया। F1 वंशज के सारे पौधे tall प्राप्त हुए। इसका कारण है",
    option:["Dominance","F2 वंशज में बौनापन के गुण का गायब होना","घटकों का segregation","सामंजस्य/समन्वय"],
    answer:"Dominance"
},
{
    question: "कवक को किस एंजाइम से संसाधित किया जाता है?",
    option:["काइटिनेज","लाइसोसाइम","सेलुलेज","गैलेक्टेज"],
    answer:"काइटिनेज"
},
{
    question: "किसी अनावृत्तबीजी में endosperm (भ्रूणपोष) है:",
    option:["अगुणित","द्विगुणित","त्रिगुणित","चतुर्गुणित"],
    answer:"अगुणित"
},
{
    question: "अनुवादन या स्थानान्तरण में बनता है:",
    option:["RNA से प्रोटीन","DNA से DNA","DNA पर RNA","RNA से DNA"],
    answer:"RNA से प्रोटीन"
},
{
    question: "अंतरजातीय प्रतियोगिता के चलते एक ही जाति के जीव एक-दूसरे से दूर होते जाते हैं। इस क्रिया को कहते हैं:",
    option:["पृथकीकरण","समूहीकरण","समरूप वितरण","एकत्रीकरण"],
    answer:"पृथकीकरण"
},
{
    question: "ब्रह्मांडवाद के अनुसार पृथ्वी पर जीव अन्य ग्रहों से किस रूप में आया?",
    option:["युग्मक","बीजाणु","विषाणु","बीज"],
    answer:"बीजाणु"
},
{
    question: "पृथक्करण के सिद्धांत को और क्या कहते हैं?",
    option:["प्रभाविता का नियम","स्वतंत्र अपव्यूहन का नियम","युग्मकों की शुद्धता का नियम","इनमें से कोई नहीं"],
    answer:"युग्मकों की शुद्धता का नियम"
},
{
    question: "शब्द homothallic एवं Monoecious का प्रयोग किसके लिए किया जाता है?",
    option:["द्विलिंगी अवस्था के लिए","एकलिंगी अवस्था के लिए","स्टामिनेट पुष्प के लिए","पिस्टीलेट पुष्प के लिए"],
    answer:"द्विलिंगी अवस्था के लिए"
},
{
    question: "निम्नलिखित में कौन-सा क्रॉस फीनोटाइपिक रूप से समान संतति उत्पन्न करता है?",
    option:["Dd × Dd","Dd × dd","DD × Dd","WW × Ww"],
    answer:"WW × Ww"
},
{
    question: "मेंडल का एकल क्रॉस अनुपात है",
    option:["1 : 2","3 : 1","9 : 3 : 3 : 1","9 : 7"],
    answer:"3 : 1"
},
{
    question: "निम्नलिखित में कौन-सा विषमयुग्मजी है?",
    option:["Rrtt","TTrr","TtRr","TTRR"],
    answer:"TtRr"
},
{
    question: "किसकी अनुपस्थिति में निषेचन नहीं हो सकता है?",
    option:["सोडियम","पोटाशियम","कैल्सियम","लौह"],
    answer:"कैल्सियम"
},
{
    question: "तालाब के किनारे इर्द-गिर्द छिछले पानी के क्षेत्र को कहते हैं:",
    option:["लिटोरल जोन","लिमनेटिक जोन","प्रोफंडल जोन","बेनथिक जोन"],
    answer:"लिटोरल जोन"
},
{
    question: "द्वितीय उत्पादक है:",
    option:["शाकाहारी","उत्पादक","माँसाहारी","इनमें से कोई नहीं"],
    answer:"इनमें से कोई नहीं"
},
{
    question: "प्रकन्द का एक उदाहरण है:",
    option:["लहसुन","नींबू","अदरक","प्याज"],
    answer:"अदरक"
},
{
    question: "प्रथम ट्रांसजेनिक फसल है:",
    option:["रूई","मटर","तम्बाकू","फ्लैक्स"],
    answer:"तम्बाकू"
},
{
    question: "निम्नलिखित में किसकी प्रजाति संख्या सर्वाधिक है?",
    option:["पक्षी","आवृतबीजी","कवक","कीट"],
    answer:"कीट"
},
{
    question: "दो शुद्ध Individuals से उत्पन्न हुई संतति जो एक सेट गुणों में भिन्न होती है, कहलाती है",
    option:["मोनोहाइब्रिड","उत्परिवर्तक","पॉलीप्लाइड","विभिन्नक"],
    answer:"मोनोहाइब्रिड"
},
{
    question: "निम्नलिखित में कोई एक पुरुष में पाया जाता है",
    option:["गर्भाशय","भग","लेबिया मेजोरा","कॉपर ग्रंथि"],
    answer:"कॉपर ग्रंथि"
},
{
    question: "पर-परागण स्व-परागण से अच्छा होता है क्योंकि इसमें",
    option:["बेहतर नवीन व्यष्टियाँ उत्पन्न होती हैं","नई प्रजातियाँ बनती हैं","यह अनिषेकजनन प्रेरित करता है","यह आर्थिक दृष्टि से लाभदायक है"],
    answer:"बेहतर नवीन व्यष्टियाँ उत्पन्न होती हैं"
},
{
    question: "वीर्य को किसमें हिमीकृत किया जाता है?",
    option:["जल में","सामान्य रेफ्रिजरेटर में","तरल नाइट्रोजन में","कोई नहीं"],
    answer:"तरल नाइट्रोजन में"
},
{
    question: "मादा में निषेचित अंडे का प्रतिस्थापन गर्भाशय में कब होता है?",
    option:["निषेचन के दो महीने के बाद","निषेचन के एक महीने के बाद ही","निषेचन के तीन सप्ताह बाद","निषेचन के सात दिन बाद"],
    answer:"निषेचन के सात दिन बाद"
},
{
    question: "मधुमक्खी पालन के लिए मधुमक्खी की किस किस्म को सबसे अधिक पालतू बनाया जाता है?",
    option:["एपिस इंडिका","एपिस मेलिफेरा","एपिस डॉर्सेटा","एपिस फ्लोरिया"],
    answer:"एपिस मेलिफेरा"
},
{
    question: "कोर, बफर तथा मेनिपुलेशन क्षेत्र किसमें पाए जाते हैं?",
    option:["राष्ट्रीय पार्क","जैव सुरक्षित क्षेत्र","शरणस्थली","बाघ संरक्षण"],
    answer:"जैव सुरक्षित क्षेत्र"
},
{
    question: "मादा में मुखीय गर्भनिरोधक किसे रोकती है?",
    option:["अण्डोत्सर्ग","निषेचन","रोपण","योनि में शुक्राणु का प्रवेश"],
    answer:"अण्डोत्सर्ग"
},
{
    question: "मेंडल द्वारा अध्ययन किए गए मटर के कुल characters की संख्या है",
    option:["5","7","6","4"],
    answer:"7"
},
{
    question: "ट्रांसफर RNA में पाए जाने वाले तीन क्षारकों का क्रम जो संदेशवाहक RNA कोडोन से बँधता है, कहलाता है:",
    option:["त्रिक","नॉन-सेन्स कोडोन","एण्टीकोडोन","समापन कोडोन"],
    answer:"एण्टीकोडोन"
},
{
    question: "Stamen का fertile भाग है",
    option:["परागकोश","परागतंतु","संयोजीतंतु","Ovule"],
    answer:"परागकोश"
},
{
    question: "दही एवं पनीर (योगर्ट एवं चीज) उत्पाद हैं",
    option:["किण्वन के","पाश्चराइजेशन के","निर्जलीकरण के","इनमें से कोई नहीं"],
    answer:"किण्वन के"
},
{
    question: "इनमें से कौन समापन कूटक (टर्मिनेटिंग कोडोन) है।",
    option:["UAA","UCC","AUG","GUG"],
    answer:"UAA"
},
{
    question: "परागण में Lever mechanism किसमें पाया जाता है",
    option:["Antirrhinum","फाइकस","गेहूँ","साल्विया"],
    answer:"साल्विया"
},
{
    question: "प्राणियों में यौवनावस्था के बाद आता है:",
    option:["कायिक अवस्था","प्रजनन अवस्था","प्रौढ़ावस्था","वृद्धावस्था"],
    answer:"प्रजनन अवस्था"
},
{
    question: "DNA फिंगर प्रिंटिंग निम्न में से क्या है?",
    option:["DNA टाइपिंग","DNA प्रोफाइलिंग","(A) और (B) दोनों","इनमें से कोई नहीं"],
    answer:"(A) और (B) दोनों"
},
{
    question: "लाइकेन सूचक है:",
    option:["CO₂ प्रदूषण का","SO₂ प्रदूषण का","CO प्रदूषण का","जल प्रदूषण का"],
    answer:"SO₂ प्रदूषण का"
},
{
    question: "इनमें कौन सबसे ज्यादा ऊर्जा प्राप्त करता है?",
    option:["उत्पादक","प्राथमिक उपभोक्ता","द्वितीयक उपभोक्ता","अपघटनकर्ता"],
    answer:"उत्पादक"
},
{
    question: "पारिस्थितिक तंत्र में नियंत्रण करने वाला कारक होता है:",
    option:["मृदा नमी","भोजन","शिकार करना","ताप"],
    answer:"शिकार करना"
},
{
    question: "संख्या के आधार पर एक फलवाले वृक्ष का पिरामिड कैसा होता है?",
    option:["सीधा","तिरछा","उल्टा","इनमें से कोई नहीं"],
    answer:"उल्टा"
},
{
    question: "वाहितमल के द्वितीयक उपचार में मुख्यतः किसकी जरूरत होती है?",
    option:["यीस्ट","विषाणु","कवक","जीवाणु"],
    answer:"जीवाणु"
},
{
    question: "न्यूक्लियोसोम में उपस्थित होता है:",
    option:["हिस्टोन अणु","न्यूक्लियोटाइड","न्यूक्लियोप्लाजमिन","न्यूक्लियर फोर कॉम्प्लेक्स"],
    answer:"हिस्टोन अणु"
},
{
    question: "लेंस एवं रेटिना कशेरूकी का किससे बनता है?",
    option:["ectoderm से","endoderm से","ectoderm एवं endoderm दोनों से","Mesoderm से"],
    answer:"ectoderm से"
},
{
    question: "हाइब्रिड एवं Parent के बीच का क्रॉस कहलाता है",
    option:["मोनोहाइब्रिड क्रॉस","Back cross","Test cross","Reciprocal cross"],
    answer:"Back cross"
},
{
    question: "अल्जाइमर रोग मनुष्य में निम्न में से किसकी कमी से सम्बन्धित है?",
    option:["डोपामाइन","ग्लूटेमिक अम्ल","एसीटाइलकोलिन","गामा एमीनो ब्यूटरिक अम्ल"],
    answer:"एसीटाइलकोलिन"
},
{
    question: "अगर जैवमंडल से CO₂ को हटा लिया जाए तो कौन-से जीव पर सर्वप्रथम बुरा प्रभाव पड़ेगा?",
    option:["प्राथमिक उत्पादक","प्राथमिक उपभोक्ता","द्वितीयक उपभोक्ता","तृतीयक उपभोक्ता"],
    answer:"प्राथमिक उत्पादक"
},
{
    question: "21वें गुणसूत्र के ट्राइसोमी से कौन-सी आनुवंशिक बीमारी होती है?",
    option:["क्लाइनफेल्टर सिंड्रोम","टर्नर सिंड्रोम","दात्र कोशिका अरक्तता","डाउन सिंड्रोम"],
    answer:"डाउन सिंड्रोम"
},
{
    question: "प्रत्येक मासिक चक्र (Menstrual cycle) के दौरान अण्डोत्सर्जन होता है",
    option:["दो अण्डाणु का","एक अण्डाणु का","दो से अधिक अण्डाणुओं का","अण्डाणुओं का उत्सर्जन नहीं होता है"],
    answer:"एक अण्डाणु का"
},
{
    question: "विश्व की सबसे अच्छी दुधारू गाय की नस्ल है।",
    option:["चित्तागोंग","देवनी","होल्स्टीन-फ्रीसियन","सिंधी"],
    answer:"होल्स्टीन-फ्रीसियन"
},
{
    question: "मानव के निम्नलिखित गुणसूत्र में जीन की संख्या सर्वाधिक होती है:",
    option:["गुणसूत्र 1","गुणसूत्र X","गुणसूत्र Y","गुणसूत्र 22"],
    answer:"गुणसूत्र 1"
},
{
    question: "पारिस्थितिक तंत्र की आहार श्रृंखला में ऊर्जा का प्रवाह होता है",
    option:["एकदिशीय","द्विदिशीय","बहुदिशीय","इनमें कोई नहीं"],
    answer:"एकदिशीय"
},
{
    question: "खुराना को नोबेल पुरस्कार क्यों मिला था?",
    option:["DNA की खोज","RNA की खोज","जीन के रासायनिक संश्लेषण हेतु","DNA पॉलीमरेज की खोज"],
    answer:"जीन के रासायनिक संश्लेषण हेतु"
},
{
    question: "पाचनतंत्र, यकृत एवं श्वासनली किससे बनता है?",
    option:["आर्केटेरॉन","ब्लास्टोसील","endoderm से","ectoderm से"],
    answer:"endoderm से"
},
{
    question: "किसके भ्रूण में परजीवी की तरह पोषण होता है?",
    option:["पक्षी में","उभयचर में","सरिसृप में","स्तनधारी में"],
    answer:"स्तनधारी में"
},
{
    question: "कुछ पुष्पों के परागकोष एवं वर्तिकान के बीच प्राकृतिक रोध होते हैं जिनके कारण परागण मुश्किल से होता है या होता ही नहीं, उन्हें क्या कहते हैं",
    option:["स्वयंबंध्यता","हेटेरोस्टाइली","हरकोगैमी","गेइगैमी"],
    answer:"हरकोगैमी"
},
{
    question: "एन्ट्रम किसकी गुहा है?",
    option:["अण्डाशय","ग्रेफियन पुटिका","ब्लास्टुला","गैस्ट्रुला"],
    answer:"ग्रेफियन पुटिका"
},
{
    question: "किसी tropical प्रदेश में जैव विविधता में गिरावट का मुख्य कारण है:",
    option:["शहरीकरण","प्रदूषण","वनोन्मूलन","मृदा-क्षरण"],
    answer:"वनोन्मूलन"
},
{
    question: "हाइड्रिला में रंध्र कहाँ पाए जाते हैं",
    option:["पत्तियों पर","तने पर भी","दोनों (A) तथा (B)","इनमें से कोई नहीं"],
    answer:"इनमें से कोई नहीं"
},
{
    question: "एक मटर पौधे में 400 बीज निर्माण में कितने अर्द्धसूत्री विभाजन आवश्यक हैं",
    option:["400","500","600","800"],
    answer:"500"
},
{
    question: "यदि परागण एक ही पौधे के दो पुष्पों के बीच हो तो इसे कहते हैं",
    option:["जिनोगेमी","जीटोनोगेमी","पोरोगेमी","इन्टोमोफिली"],
    answer:"जीटोनोगेमी"
},
{
    question: "रिस्ट्रिक्शन एंजाइम का उपयोग किसको काटने के लिए किया जाता है?",
    option:["एकल-रज्जुकी RNA","द्विरज्जुकी DNA","एकल-रज्जुकी DNA","द्विरज्जुकी RNA"],
    answer:"द्विरज्जुकी DNA"
},
{
    question: "वैज्ञानिक एस. एल. मिलर ने कार्बनिक अणुओं के गठन के लिए अपने प्रयोग में जलवाष्प, मिथेन और अमोनिया के साथ निम्नलिखित गैस का उपयोग किया",
    option:["ऑक्सीजन","हाइड्रोजन","नाइट्रोजन","कोई नहीं"],
    answer:"हाइड्रोजन"
},
{
    question: "इनमें से कौन पहला कृत्रिम रूप से बना जैविक पदार्थ है?",
    option:["इन्सुलिन","कार्मीनी","थायरॉक्सिन","इनमें से कोई नहीं"],
    answer:"इन्सुलिन"
},
{
    question: "निम्न में से कौन आहार श्रृंखला सही है?",
    option:["घास, गेहूँ और आम","घास, बकरी और शेर","बकरी, गाय और घास","घास, मछली और बकरी"],
    answer:"घास, बकरी और शेर"
},
{
    question: "जैव विविधता का तप्त स्थल कौन-सा है?",
    option:["अरावली","पूर्वी घाट","पश्चिमी घाट","भारतीय गंगा के मैदान"],
    answer:"पश्चिमी घाट"
},
{
    question: "कुछ नीले-हरे शैवाल जैव उर्वरक के रूप में प्रयुक्त होते हैं क्योंकि ये कर सकते हैं:",
    option:["नाइट्रोजन स्थिरीकरण","म्यूसीलेज स्रावण","प्रकाश संश्लेषण","प्रत्येक स्थान पर वृद्धि"],
    answer:"नाइट्रोजन स्थिरीकरण"
},
{
    question: "निम्नलिखित में कौन-सी एक गैस ग्रीनहाउस गैस नहीं है?",
    option:["CO₂","CH₄","N₂","CFCs"],
    answer:"N₂"
},
{
    question: "लिम्फोसाइट के ऊपर क्या रहता है?",
    option:["IgG","IgM","IgD","IgE"],
    answer:"IgD"
},
{
    question: "मनुष्य की प्राथमिक शुक्राणु कोशिकाओं (प्राइमरी स्पर्मोसाइट्स) में ऑटोसोम की संख्या होती है",
    option:["44","46","23","40"],
    answer:"44"
},
{
    question: "साइटोसीन एवं गुआनोसीन के बीच हाइड्रोजन बंधन की संख्या होती है:",
    option:["2","3","4","1"],
    answer:"3"
},
{
    question: "बिना निषेचन के फल बनाने की प्रक्रिया को कहते हैं",
    option:["पौलिकार्पिक","पार्थेनोकार्पिक","पोमोकार्पिक","इनमें से कोई नहीं"],
    answer:"पार्थेनोकार्पिक"
},
{
    question: "रोध कूट की संख्या कितनी है:",
    option:["एक","दो","तीन","चार"],
    answer:"तीन"
},
{
    question: "मेहसाना किसकी प्रजाति है?",
    option:["गाय की","भैंस की","भेड़ की","बकरी की"],
    answer:"भैंस की"
},
{
    question: "AIDS का कारक HIV वायरस सर्वप्रथम किस कोशिका को नष्ट करता है?",
    option:["हेल्पर T-लिम्फोसाइट को","B-लिम्फोसाइट को","ल्यूकोसाइट्स","थ्रोम्बोसाइट"],
    answer:"हेल्पर T-लिम्फोसाइट को"
},
{
    question: "PCR का उपयोग करते हैं।",
    option:["किसी खास DNA के प्रवर्धन के लिए","प्रोटीन के प्रवर्धन के लिए","प्रोटीन की संख्या घटाने के लिए","A और B दोनों"],
    answer:"किसी खास DNA के प्रवर्धन के लिए"
},
{
    question: "एक्रोसोम का निर्माण किससे होता है?",
    option:["centriole","गॉल्जीकाय","माइटोकोन्ड्रिया","केन्द्रक"],
    answer:"गॉल्जीकाय"
},
{
    question: "किसी परागकण में (जैसे Cyperus) Ploidy की संख्या है",
    option:["5n","3n","n","2n"],
    answer:"n"
},
{
    question: "कीटभक्षी पौधे कीटों को खाते हैं:",
    option:["माँस के लिए","ऑक्सीजन के लिए","खनिजों के लिए","नाइट्रोजन के लिए"],
    answer:"नाइट्रोजन के लिए"
},
{
    question: "किसी गार्डेन मटर में Recessive trait है",
    option:["लंबा तना","रंगीन पुष्प","झुर्रीदार बीज","फूला हुआ Pod"],
    answer:"झुर्रीदार बीज"
},
{
    question: "हीमोफीलिया रोग है",
    option:["अलिंग क्रोमोसोम-सहलग्न अप्रभावी लक्षण","X-क्रोमोसोम-सहलग्न अप्रभावी लक्षण","अलिंग क्रोमोसोम-सहलग्न प्रभावी लक्षण","X-क्रोमोसोम-सहलग्न प्रभावी लक्षण"],
    answer:"X-क्रोमोसोम-सहलग्न अप्रभावी लक्षण"
},
{
    question: "अत्यधिक अल्कोहल लेने से शरीर का कौन-सा अंग सबसे अधिक प्रभावित होता है?",
    option:["फेफड़ा","यकृत","आमाशय","स्लीन"],
    answer:"यकृत"
},
{
    question: "एलीफैन्टियासिस का कारक है:",
    option:["एस्केरिस","टीनिया","वुचेरेरिया","एंटअमीबा"],
    answer:"वुचेरेरिया"
},
{
    question: "इनमें से कौन-सी बीमारी प्रत्यूर्जक द्वारा उत्पन्न होती है?",
    option:["त्वचा कैंसर","हे ज्वर","इंटेरिक ज्वर","गलगंड"],
    answer:"हे ज्वर"
},
{
    question: "निम्नलिखित में कौन-सा यौन संक्रमित रोग है?",
    option:["टायफाइड","टिटनस","लेप्रोसी","हिपेटाइटिस-B"],
    answer:"हिपेटाइटिस-B"
},
{
    question: "निम्नलिखित में कौन-सा न्यूक्लियोटाइड है?",
    option:["एडिनाइलिक एवं गुआनाइलिक अम्ल","साइटिडिलिक एवं युरिडायलिक अम्ल","युरिडायलिक एवं थायमिडायलिक अम्ल","सभी"],
    answer:"सभी"
},
{
    question: "एक पादप स्पीशीज में उसकी सहायक-कोशिकाओं में 8 गुणसूत्र होते हैं। उसकी ऐल्यूरोन परत की कोशिकाओं में गुणसूत्रों की संख्या क्या होगी",
    option:["16","24","32","8"],
    answer:"24"
},
{
    question: "इनमें से किसमें कृत्रिम वीर्यसेचन द्वारा गर्भाधान नहीं कराया जा सकता है?",
    option:["घोड़े में","ऊँटों में","मछलियों में","बकरी में"],
    answer:"मछलियों में"
},
{
    question: "किसी जीव का किसी द्वि-अप्रभावी से संगम कराके विषमयुग्मी या समयुग्मी अभिलक्षण का निर्धारण करना कहलाता है",
    option:["व्युत्क्रम संकरण","परीक्षार्थ संकरण","द्विसंकर","प्रतीप संकरण"],
    answer:"परीक्षार्थ संकरण"
},
{
    question: "मादा पुष्प का निम्नलिखित में से कौन-सा भाग है",
    option:["जायांग","पुमंग","पुंकेसर","परागकण"],
    answer:"जायांग"
},
{
    question: "जनसंख्या नियंत्रण के लिए हार्मोनल गर्भनिरोधक गोली प्रयुक्त है:",
    option:["माला-D","माला-N","सहेली","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "विखंडन (cleavage) समसूत्री विभाजन से अलग होता है किस मायने में?",
    option:["यह शरीर की सभी कोशिकाओं में होता है","यह zygote में होता है","इससे identical पुत्री कोशिका बनता है","यह सिर्फ अकेशरूकी में होता है"],
    answer:"यह zygote में होता है"
},
{
    question: "मनुष्य (पुरुष) में गुणसूत्र की संख्या है",
    option:["44 + XX","44 + XY","46 + XY","46 + XX"],
    answer:"44 + XY"
},
{
    question: "ट्रांसजेनिक जंतुओं के रूप में सर्वाधिक संख्या में पाया जाने वाला जीव है।",
    option:["चूहे","गाय","सूअर","मछली"],
    answer:"चूहे"
},
{
    question: "ऑस्ट्रेलियाई शिशुधानी, तस्मानियाई भेड़िया तथा एक अपरा स्तनी भेड़िया दर्शाते हैं",
    option:["समानांतर विकास","अपसारी विकास","अभिसारी विकास","क्रमिक विकास"],
    answer:"अभिसारी विकास"
},
{
    question: "शाख (scion) को वृन्त (stock) पर लगाया जाता है। इस प्रकार graft किये वृक्ष के फल किस पर निर्भर करेंगे?",
    option:["शाख (scion)","वृन्त (stock)","(A), (B) दोनों","उपरोक्त में से कोई नहीं"],
    answer:"शाख (scion)"
},
{
    question: "ऐगारोज किससे प्राप्त किया जाता है?",
    option:["समुद्री घास","मक्का","साइकस","हाइड्रिला"],
    answer:"समुद्री घास"
},
{
    question: "आलू एवं टमाटर के कायिक संकरण से बनने वाले पौधे का क्या नाम है?",
    option:["टमालू","पोमैटो","टोमापोटेटो","प्रोमेटो"],
    answer:"पोमैटो"
},
{
    question: "यौन संचारित रोग निम्नांकित में से कौन है?",
    option:["एड्स","सिफिलिस","गोनोरिया","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "पोलिमरेज श्रृंखला अभिक्रिया तकनीक का उपयोग किया जाता है:",
    option:["DNA की पहचान के लिए","DNA के Repair के लिए","DNA amplification के लिए","DNA के खंडन के लिए"],
    answer:"DNA amplification के लिए"
},
{
    question: "प्रतिलेखन है:",
    option:["DNA का बनना","संदेशवाहक RNA का बनना","प्रोटीन का बनना","अमीनो अम्ल का बनना"],
    answer:"संदेशवाहक RNA का बनना"
},
{
    question: "एक प्लाजमिड",
    option:["खुद से अपने जैसा बना सकता है","लाइपेज से संबंधित है","क्रोमोसोम से सम्बन्धित है","इनमें से कोई नहीं"],
    answer:"खुद से अपने जैसा बना सकता है"
},
{
    question: "‘फेड-बैच’ किण्वन में शर्करा का निरन्तर प्रयोग किया जाता है:",
    option:["प्रतिजैविक प्राप्त करने के लिए","एन्जाइम को शुद्ध करने के लिए","मलवाह के विघटन के लिए","मिथेन उत्पन्न करने के लिए"],
    answer:"एन्जाइम को शुद्ध करने के लिए"
},
{
    question: "जैव प्रौद्योगिकी के उद्देश्यों की पूर्ति में किसका योगदान है?",
    option:["पुनर्योगज DNA तकनीक","आनुवंशिकी अभियांत्रिकी","सूक्ष्मजीवविज्ञान","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "कैंसर के इलाज के लिए निम्नलिखित में कौन-सा प्रचलित नहीं है?",
    option:["कीमोथेरैपी","रेडियोथेरैपी","सर्जरी","फिजियोथेरैपी"],
    answer:"फिजियोथेरैपी"
},
{
    question: "लैक ऑपेरॉन में कितने संरचनात्मक जीन पाए जाते हैं?",
    option:["तीन","पाँच","एक","इनमें से कोई नहीं"],
    answer:"तीन"
},
{
    question: "इनमें कौन PCR से जुड़ा है?",
    option:["निष्क्रियकरण","तापानुशीलन","विस्तार","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "कौन-सा परीक्षण द्वारा पैदा होने से पहले बच्चे में आनुवंशिकी व कार्यिकी दोष का अध्ययन किया जा सकता है?",
    option:["एम्नीओसेन्टसिस","इरिथ्रोब्लास्टोसिस","एन्जियोग्राम","क्लोटिंग परीक्षण"],
    answer:"एम्नीओसेन्टसिस"
},
{
    question: "मधुमक्खी में श्रमिक मक्खियाँ होती हैं।",
    option:["प्रजननयुक्त नर","बांध्य नर","प्रजननयुक्त मादा","बांध्य मादा"],
    answer:"बांध्य मादा"
},
{
    question: "सर्वप्रथम क्लीनिकल जीन चिकित्सा का उपयोग किसके लिए किया गया था?",
    option:["एडिनोसिन डीएमिनेज की कमी","चिकेन पॉक्स","डायबिटीज मेलिटस","रूमेटॉयड अर्थराइटिस"],
    answer:"एडिनोसिन डीएमिनेज की कमी"
},
{
    question: "पारिस्थितिक तंत्र का महत्त्व किसमें निहित है?",
    option:["ऊर्जा के प्रवाह में","पदार्थों के अनुचक्रण में","उपरोक्त दोनों में","उपरोक्त में से कोई नहीं"],
    answer:"उपरोक्त दोनों में"
},
{
    question: "हाइब्रिड के जीनोटाइप का सामान्य टेस्ट कौन-सा है?",
    option:["F1 संतति का लैंगिक व्यवहार","F1 संतति का अप्रभावी जनक से क्रॉस","एक F2 जनक का नरयुग्मक से क्रॉस","एक F2 जनक का मादा युग्मक से क्रॉस"],
    answer:"F1 संतति का अप्रभावी जनक से क्रॉस"
},
{
    question: "DNA के डबल हेलिक्स मॉडल में प्रत्येक समाक्षार दूसरे से कितनी दूरी पर होता है?",
    option:["34 nm","3.4 nm","2 nm","0.34 nm"],
    answer:"0.34 nm"
},
{
    question: "नाइट्रोजन-स्थिरीकरण के योग्य जीवाणु है:",
    option:["एजोटोबैक्टर","क्लोस्ट्रिडियम","एसिटोबैक्टर एसिटि","राइजोबियम"],
    answer:"क्लोस्ट्रिडियम"
},
{
    question: "अधिक लवण सान्द्रता वाली क्षारीय मृदा में उगने वाले पौधे होते हैं:",
    option:["मरुद्भिदी","लवणोद्भिदी","शैलोद्भिदी","जलोड्भिदी"],
    answer:"लवणोद्भिदी"
},
{
    question: "अण्डोत्सर्ग व कॉर्पस ल्यूटियम के विकास के लिए उत्तरदायी हार्मोन है",
    option:["FSH","LH","LTH","ICSH"],
    answer:"LH"
},
{
    question: "निम्नलिखित में अंतररापित जीन व्यवस्था उपस्थित नहीं होती है:",
    option:["जीवाणु","पौधे","जन्तु","उपर्युक्त में कोई नहीं"],
    answer:"जीवाणु"
},
{
    question: "जीन अभियंत्रित मानव इंसुलिन किससे बनता है?",
    option:["जीवाणु","फफूंद","पादप","यीस्ट"],
    answer:"जीवाणु"
},
{
    question: "ट्रांसजेनिक पौधे उत्पन्न करने के लिए ट्यूमर प्रेरित प्लाज्मिड प्राप्त किये जाते हैं:",
    option:["एशरिकिआ कोलाई द्वारा","बैसिलस थूरिएंजिएंसिस द्वारा","स्टेफाइलोकोकस ऑरियस द्वारा","एग्रोबैक्टीरियम ट्यूमीफेशिएन्स द्वारा"],
    answer:"एग्रोबैक्टीरियम ट्यूमीफेशिएन्स द्वारा"
},
{
    question: "भारत में परिवार नियोजन कार्यक्रम कब आरंभ हुआ?",
    option:["1951 में","1960 में","1970 में","1980 में"],
    answer:"1951 में"
},
{
    question: "जब किसी उत्परिवर्तन से प्यूरिन के स्थान पर पिरिमिडीन प्रतिस्थापित हो जाए तो इसे कहते हैं",
    option:["ट्रांजिशन","ट्रांसवर्सन","ट्रान्सलोकेशन","इनवर्सन"],
    answer:"ट्रांसवर्सन"
},
{
    question: "मिथेन का प्रमुख स्रोत है:",
    option:["ईख रोपण","धान खेत","फल की बागवानी","गेहूँ खेत"],
    answer:"धान खेत"
},
{
    question: "आबादी का प्रसरण किन पर निर्भर करता है?",
    option:["आगमन पर","बहिर्गमन पर","स्थानान्तरण पर","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "जंक DNA किसको कहा जाता है?",
    option:["कोडिंग क्रम","नॉनकोडिंग क्रम","प्रोमोटर जीन","हिस्टोन प्रोटीन"],
    answer:"नॉनकोडिंग क्रम"
},
{
    question: "क्लाइनेफेल्टर्स सिंड्रोम में लिंग गुणसूत्र संघटक होते हैं",
    option:["22A + XXY","22A + XO","22A + XY","22A + XX"],
    answer:"22A + XXY"
},
{
    question: "अंड प्रजनक है",
    option:["मुर्गी","साँप","मगरमच्छ","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "AA Bb cc से कितने प्रकार के युग्मकों (gametes) का निर्माण होगा?",
    option:["दो","चार","छः","नौ"],
    answer:"दो"
},
{
    question: "न्यूक्लिक अम्ल में कौन-सा पदार्थ मौजूद नहीं होता है?",
    option:["साइटोसीन","एडिनीन","थाइमीन","गुआनीडिन"],
    answer:"गुआनीडिन"
},
{
    question: "झील में द्वितीय पोषण-स्तर होता है:",
    option:["पादपप्लवक","प्राणिप्लवक","पादपप्लवक तथा प्राणिप्लवक दोनों","इनमें से कोई नहीं"],
    answer:"प्राणिप्लवक"
},
{
    question: "Sertoli कोशिका पायी जाती है",
    option:["अंडाशय में तथा प्रोजेस्ट्रोन का स्रावण होता है","एड्रीनल कॉर्टेक्स में तथा एड्रेनेलीन हार्मोन का स्रावण होता है","शुक्राणुनलिका में तथा germ cells को पोषण देता है","अग्न्याशय में तथा कोलेसिस्टोकाइनिन का स्रावण होता है"],
    answer:"शुक्राणुनलिका में तथा germ cells को पोषण देता है"
},
{
    question: "मनुष्य में शुक्रनलिका (vas deferens) किससे निकलता है?",
    option:["cauda epididymis","caput epididymis","corpora cavernosa","glomus majoritetet"],
    answer:"cauda epididymis"
},
{
    question: "किसी आनुवंशिक रोग को किस चिकित्सा पद्धति से दुरुस्त किया जा सकता है?",
    option:["एलोपैथी","शल्य पद्धति","जीन चिकित्सा","अन्य विधि"],
    answer:"जीन चिकित्सा"
},
{
    question: "आनुवंशिकी अभियांत्रिकी को क्या कहा जाता है?",
    option:["पुनर्योगज DNA तकनीक","ऊतक संवर्धन","क्लोनिंग संवाहक","अनुप्रवाह संसाधन"],
    answer:"पुनर्योगज DNA तकनीक"
},
{
    question: "गहरी निद्रा को प्रेरित करने वाली औषधि है:",
    option:["स्टीमुलेंट","हैलुसिनोजेन","सेडेटिव","ओपिएट नार्कोटिक"],
    answer:"सेडेटिव"
},
{
    question: "जेट प्लेन निकास में मुख्य प्रदूषक हैं:",
    option:["फ्लुरोकार्बन","SO₂","मिथेन","बेन्जीन"],
    answer:"फ्लुरोकार्बन"
},
{
    question: "एक पुष्पी पादप में नर जनन अंग इकाई को कहते हैं",
    option:["पुंकेसर","स्त्रीकेसर","परागकोष","परागकण"],
    answer:"पुंकेसर"
},
{
    question: "उत्परिवर्तन सामान्यतः कराया जाता है:",
    option:["अल्ट्रा-वायोलेट किरण","गामा किरण","अल्फा किरण","बीटा किरण"],
    answer:"गामा किरण"
},
{
    question: "मृदा की पोषण गुणवत्ता कौन बढ़ाता है?",
    option:["रासायनिक खाद","गोबर खाद","जैव-उर्वरक","दोनों (B) तथा (C)"],
    answer:"दोनों (B) तथा (C)"
},
{
    question: "सूक्ष्म प्रजनन में कराया जाता है:",
    option:["अलैंगिक प्रजनन","समान आनुवंशिक गुणों वाले पौधों का उत्पादन","लैंगिक प्रजनन","(A) और (B) दोनों"],
    answer:"(A) और (B) दोनों"
},
{
    question: "नेत्र लेंस बनता है",
    option:["एक्टोडर्म से","मिसोडर्म से","एण्डोडर्म से","एक्टोडर्म एवं मिसोडर्म से"],
    answer:"एक्टोडर्म से"
},
{
    question: "स्टेरॉयड्स निर्माण में प्रयुक्त फफूंदी कौन-सा है?",
    option:["एस्पर्जिलस ओरायजा","टोरूलोप्सिस युटिलिस","राइजोपस स्टोलोनिफर","न्यूरोस्पोरा क्रैसा"],
    answer:"राइजोपस स्टोलोनिफर"
},
{
    question: "किसी पारिस्थितिक तंत्र में जैविक अवयव है",
    option:["उत्पादक","उपभोक्ता","विघटनकर्ता","उपरोक्त सभी"],
    answer:"उपरोक्त सभी"
},
{
    question: "कौन-सा क्षार RNA में उपस्थित रहता है, पर DNA में नहीं?",
    option:["यूरासिल","गुआनीन","साइटोसीन","थाइमीन"],
    answer:"यूरासिल"
},
{
    question: "किसमें आंतरिक निषेचन होता है?",
    option:["मछली","उभयचर","शैवाल","आवृत्तबीजी"],
    answer:"आवृत्तबीजी"
},
{
    question: "ट्रांसक्रिप्शन के लिए एंजाइम जरूरी है:",
    option:["DNA पॉलिमरेज","RNA पॉलिमरेज","इंडोन्यूक्लिएज","इनमें से सभी"],
    answer:"RNA पॉलिमरेज"
},
{
    question: "मनुष्य में सबसे ज्यादा होने वाला कैंसर है?",
    option:["मिलेनोमा","लिम्फोमा","सार्कोमा","कार्सिनोमा"],
    answer:"कार्सिनोमा"
},
{
    question: "DNA फिंगरप्रिंटिंग का क्या कार्य है?",
    option:["संतान के सही माता-पिता की पहचान करना","फॉरेंसिक विज्ञान द्वारा प्रयोगशाला में अपराधियों की पहचान करना","संदिग्ध माता-पिता की जानकारी प्राप्त करना","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "निम्नलिखित में कौन-सी स्वच्छजलीय भोजन योग्य मछली है?",
    option:["हार्पोडॉन","सिरिना मृगाला","एंगुइला","हिल्सा"],
    answer:"सिरिना मृगाला"
},
{
    question: "हाइपेन्थेडियम पुष्पक्रम पाया जाता है",
    option:["पीपल","तुलसी","सागौन","मदार"],
    answer:"पीपल"
},
{
    question: "रेट्रोवायरस सामान्य जंत कोशिकाओं को किन कोशिकाओं में रूपांतरित कर देता है?",
    option:["लीवर कोशिका","मृत कोशिका","कैंसर कोशिका","इनमें से कोई नहीं"],
    answer:"कैंसर कोशिका"
},
{
    question: "असतत् विभिन्नता (Discontinuous variation) का प्रमुख कारण है",
    option:["क्रॉसिंग ओवर","उत्परिवर्तन","क्रोमोसोम का segregation","Independent assortment"],
    answer:"उत्परिवर्तन"
},
{
    question: "इनमें से कौन प्रोटोजोआ-जनित रोग है?",
    option:["हैजा","क्षयरोग","मलेरिया","एड्स"],
    answer:"मलेरिया"
},
{
    question: "पोरोगैमी में परागनलिका किससे होकर भ्रूणपोष तक पहुँचती है",
    option:["चैलाजा","इंटेगुमेंट","माइक्रोपाइल","सभी को भेदती हुई"],
    answer:"माइक्रोपाइल"
},
{
    question: "आवृत्तबीजियों में सबसे सामान्य प्रकार बीजाण्ड है",
    option:["एम्फीट्रोपास","एट्रोपास","एनाट्रोपस","सर्सिनोट्रोपस"],
    answer:"एनाट्रोपस"
},
{
    question: "एक प्रबल mutagen है",
    option:["ठंड","गर्मी","पानी","X-किरणें"],
    answer:"X-किरणें"
},
{
    question: "मुर्राह, सूर्ती और मेहसाना किसकी प्रजातियाँ हैं?",
    option:["गाय की","भैंस की","बकरी की","भेड़ की"],
    answer:"भैंस की"
},
{
    question: "यदि कोई पुष्प चमकीले रंग का हो तथा Nectar स्रावित करता हो तो यह संभवतः",
    option:["वायु द्वारा परागित होता है","कीट द्वारा परागित होता है","एक कीटभक्षी पौधा होता है","नपुंसक पुष्प होगा"],
    answer:"कीट द्वारा परागित होता है"
},
{
    question: "अधिकतर प्रविशिष्ट (species) किस क्षेत्र से विलोपित हुई है?",
    option:["Islands","Mainland","समुद्र","स्वच्छ जलीय निकाय"],
    answer:"Islands"
},
{
    question: "किसके कारण RNA भिन्न होता है DNA से?",
    option:["शर्करा एवं प्यूरिन","शर्करा एवं पायरिमिडिन","प्यूरिन एवं फॉस्फेट","शर्करा एवं फॉस्फेट"],
    answer:"शर्करा एवं पायरिमिडिन"
},
{
    question: "भारतवर्ष में हॉट स्पॉट्स पाए जाते हैं:",
    option:["केवल पूर्वी हिमालय में","केवल पश्चिमी घाट में","पूर्वी हिमालय तथा पश्चिमी घाट में","राजस्थान के रेगिस्तान में"],
    answer:"पूर्वी हिमालय तथा पश्चिमी घाट में"
},
{
    question: "बढ़े हुए त्वचा कैंसर एवं उच्च उत्परिवर्तन दर का कारण है:",
    option:["अम्ल वर्षा","ओजोन क्षरण","CO₂ प्रदूषण","CO प्रदूषण"],
    answer:"ओजोन क्षरण"
},
{
    question: "स्वतः जनन का सिद्धांत, जिसमें जीवन की उत्पत्ति क्षयमान पदार्थों से मानी गई थी, को जीवाणुओं के संदर्भ में किसने खारिज किया?",
    option:["फ्रांसिस्को रेडी","चार्ल्स डार्विन","लुई पाश्चर","उपर्युक्त में कोई नहीं"],
    answer:"लुई पाश्चर"
},
{
    question: "किसी प्रोकैरियोट्स में DNA एवं RNA का अनुपात 1:2 है। यूकैरियोट्स में यह अनुपात क्या होता है?",
    option:["1:1","2:1","1:2","स्थिर नहीं"],
    answer:"1:1"
},
{
    question: "चाय की पत्तियों पर जीवाणुओं की क्रिया से विशेष सुगंध को उत्पन्न किया जाना कहलाता है:",
    option:["टैनिंग","क्यूरिंग","किण्वन","राइपेनिंग"],
    answer:"क्यूरिंग"
},
{
    question: "अंडे के कोशिकाद्रव्य में क्या नहीं होता है?",
    option:["राइबोसोम","माइटोकोन्ड्रिया","गॉल्जीकाय","सेंट्रोसोम"],
    answer:"सेंट्रोसोम"
},
{
    question: "ओकाजाकी खंड का निर्माण किस दौरान होता है?",
    option:["ट्रांसक्रिप्शन","ट्रांसलेशन","रिप्लिकेशन","ट्रांसडक्शन"],
    answer:"रिप्लिकेशन"
},
{
    question: "इंसुलिन की आण्विक रचना की खोज किसने की थी?",
    option:["कोरेनबर्ग","स्वीमानाथन","रिजार्डसन","सैंगर"],
    answer:"सैंगर"
},
{
    question: "निम्नलिखित में कौन-सा समजात अंग है?",
    option:["बोगेनविलिया का काँटा एवं पत्ती","कीट एवं पक्षी का पंख","डॉल्फिन के फ्लिपर्स एवं शार्क के पेक्टोरल फिन्स","मधुमक्खी एवं बिच्छू का डंक"],
    answer:"बोगेनविलिया का काँटा एवं पत्ती"
},
{
    question: "BamHI प्रतिबंधन एंजाइम किससे प्राप्त किया जाता है?",
    option:["हीमोफिलस इन्फ्लूएंजी","E. coli","बैसिलस एमालोलिक्विफेसिएंस","इनमें से कोई नहीं"],
    answer:"बैसिलस एमालोलिक्विफेसिएंस"
},
{
    question: "निम्नलिखित में कौन-सी हार्मोन रिलीजिंग IUCD है?",
    option:["लिप्स लूप","मल्टीलोड 375","CuT","LNG-20"],
    answer:"LNG-20"
},
{
    question: "एक परिवार जिसमें पाँच बेटियाँ हैं, को छठी संतान होने वाली है। बेटा होने की संभावना कितनी है?",
    option:["0%","25%","50%","100%"],
    answer:"50%"
},
{
    question: "मेंडल ने कितने लक्षणों का अध्ययन किया?",
    option:["पाँच","चार","सात","तीन"],
    answer:"सात"
},
{
    question: "निम्नलिखित RNA पॉलीमरेज सुकेन्द्रकी में दूत RNA का अनुलेखन करता है:",
    option:["पॉलीमरेज-I","पॉलीमरेज-II","पॉलीमरेज-III","उपर्युक्त में कोई नहीं"],
    answer:"पॉलीमरेज-II"
},
{
    question: "टैक DNA पॉलिमरेज एंजाइम प्राप्त किया जाता है:",
    option:["थर्मस एक्वेटिकस से","E. coli से","एग्रोबैक्टीरियम ट्यूमीफेसिएंस से","इनमें किसी से नहीं"],
    answer:"थर्मस एक्वेटिकस से"
},
{
    question: "खाद्य श्रृंखला के दौरान अधिकतम ऊर्जा संचित होती है।",
    option:["उत्पादक में","अपघटक में","शाकाहारी में","माँसाहारी में"],
    answer:"उत्पादक में"
},
{
    question: "PCR विधि आवश्यक है:",
    option:["DNA संश्लेषण में","प्रोटीन संश्लेषण में","एमिनो अम्ल के संश्लेषण में","DNA संवर्धन में"],
    answer:"DNA संवर्धन में"
},
{
    question: "ऊर्जा का पिरामिड सर्वदा होता है:",
    option:["उलटा","सीधा","उलटा तथा सीधा दोनों","वन-पारितंत्र में उलटा"],
    answer:"सीधा"
},
{
    question: "भारत में प्रोजेक्ट टाइगर प्रारंभ किया गया",
    option:["1973","1981","1985","1986"],
    answer:"1973"
},
{
    question: "स्वस्थाने संरक्षण का उदाहरण है:",
    option:["वानस्पतिक उद्यान","जंतु उद्यान","जीव सफारी","इनमें से सभी"],
    answer:"जीव सफारी"
},
{
    question: "अधिकतम वृद्धि दर पाया जाता है इसमें:",
    option:["सेनेसेंट फेज","लैग फेज","एक्सपोनेन्शियल फेज","स्टेशनरी फेज"],
    answer:"एक्सपोनेन्शियल फेज"
},
{
    question: "वृक्षरहित जीवोम को कहते हैं",
    option:["टुंड्रा","मरुस्थल","घास का मैदान","उपर्युक्त सभी"],
    answer:"उपर्युक्त सभी"
},
{
    question: "‘रेड डाटा बुक’ सूची बनाने के लिए उत्तरदायी संगठन है।",
    option:["IUCN","CITES","WWF","IBWL"],
    answer:"IUCN"
},
{
    question: "Dihybrid Test cross का अनुपात कौन-सा है?",
    option:["1 : 1 : 1 : 1","1 : 1","9 : 3 : 3 : 1","15 : 1"],
    answer:"1 : 1 : 1 : 1"
},
{
    question: "कवकमूल एक उदाहरण होता है:",
    option:["सिम्बायोटिक बन्धुत्व","बाह्य परजीवी","अंतः परजीवी","अपघटक"],
    answer:"सिम्बायोटिक बन्धुत्व"
},
{
    question: "अंडे के गैस्टुला अवस्था में endoderm कोशिका को यदि हटा दिया जाय तो नये जीव में क्या नहीं बनेगा?",
    option:["आँख","हृदय","आँख एवं मस्तिष्क","आंतरिक अंग"],
    answer:"आंतरिक अंग"
},
{
    question: "तोता की सबसे अधिक उम्र क्या है?",
    option:["90 वर्ष","25 वर्ष","500 वर्ष","140 वर्ष"],
    answer:"140 वर्ष"
},
{
    question: "इनमें से कौन बैक्टीरिया-जनित रोग है?",
    option:["सिफलिस","हर्पिस","पैपिलोमा","इनमें सभी"],
    answer:"सिफलिस"
},
{
    question: "प्यूरीन की जगह पिरिमिडीन अथवा पिरिमिडीन की जगह प्यूरीन के प्रतिस्थापन को कहते हैं",
    option:["ट्रांजिशन","ट्रांसवर्सन","ट्रांसलोकेशन","ट्रांसफॉरमेशन"],
    answer:"ट्रांसवर्सन"
},
{
    question: "गर्भनिरोधक गोली में निहित प्रोजेस्ट्रॉन से क्या तात्पर्य है?",
    option:["अंडोत्सर्जन को रोकना","निषेचन को रोकना","युग्मज के Implantation को रोकना","Cleavage को रोकना"],
    answer:"अंडोत्सर्जन को रोकना"
},
{
    question: "विकासशील परागकण को पोषण किससे मिलता है",
    option:["टेपीटम","Endothecium","मध्य स्तर","SMC"],
    answer:"टेपीटम"
},
{
    question: "प्रतिबंधन एंडोन्यूक्लियेज DNA के एक विशिष्ट अनुक्रम को पहचानते हैं:",
    option:["पैलिनड्रोमिक न्यूक्लियोटाइड अणुओं","B.N.T.R.","मिनी सेटेलाइट","इनमें से सभी"],
    answer:"पैलिनड्रोमिक न्यूक्लियोटाइड अणुओं"
},
{
    question: "PCR का उपयोग होता है:",
    option:["DNA के किसी खास भाग के प्रवर्धन के लिए","एंजाइम के प्रवर्धन के लिए","प्रोटीन के प्रवर्धन के लिए","इनमें से सभी"],
    answer:"DNA के किसी खास भाग के प्रवर्धन के लिए"
},
{
    question: "बायोगैस में होते हैं:",
    option:["CO₂","H₂S","CH₄","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "घास के मैदान की संख्या का पिरामिड होता है।",
    option:["अपराइट","इन्वर्टेड","(A) और (B) दोनों","इनमें से कोई नहीं"],
    answer:"अपराइट"
},
{
    question: "पारिस्थितिक तंत्र का संबंध किसके द्वारा दर्शाया जा सकता है?",
    option:["संख्या का पिरामिड","जीवभार का पिरामिड","ऊर्जा का पिरामिड","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "निम्नलिखित में से कौन जंतु उभयलिंगी नहीं है?",
    option:["फीताकृमि","केंचुआ","घरेलू मक्खी","जोंक"],
    answer:"घरेलू मक्खी"
},
{
    question: "सोमाक्लोनी विविधताएँ:",
    option:["उत्परिवर्तन कारकों द्वारा उत्पन्न होती हैं","गामा किरणों द्वारा उत्पन्न होती हैं","ऊतक संवर्धन में निर्मित होती हैं","लैंगिक जनन के समय उत्पन्न होती हैं"],
    answer:"ऊतक संवर्धन में निर्मित होती हैं"
},
{
    question: "स्तरीकरण (Stratification) पाया जाता है",
    option:["मरुस्थल में","उष्ण कटिबंधीय वन में","पर्णपाती वन में","टुण्ड्रा में"],
    answer:"उष्ण कटिबंधीय वन में"
},
{
    question: "5 जून को मनाया जाता है:",
    option:["विश्व पर्यावरण दिवस","विश्व वन दिवस","विश्व रेडक्रॉस दिवस","विश्व बाल दिवस"],
    answer:"विश्व पर्यावरण दिवस"
},
{
    question: "दो सूक्ष्मजीव जो आनुवंशिक अभियांत्रिकी में अत्यधिक महत्वपूर्ण होते हैं:",
    option:["इश्चेरिचिया कोलाई तथा एग्रोबैक्टीरियम ट्यूमीफेसिएन्स","विब्रियो कोलेरी तथा पुच्छीय जीवाणुभोजी","डिप्लोकोकस प्रजाति तथा स्यूडोमोनास प्रजाति","क्राउन गॉल जीवाणु तथा सीनोरेन्डीटिस एलीगेन्स"],
    answer:"इश्चेरिचिया कोलाई तथा एग्रोबैक्टीरियम ट्यूमीफेसिएन्स"
},
{
    question: "निम्नलिखित में से किस प्राणी में ओवो-विविपेरिटी होता है?",
    option:["मुर्गी","प्लेटीपस","रैटल सर्प","इकिडना"],
    answer:"रैटल सर्प"
},
{
    question: "समयुग्मकी पायी जाती है:",
    option:["शैवाल","आवृत्तबीजी","अनावृत्तबीजी","इनमें से सभी"],
    answer:"शैवाल"
},
{
    question: "आनुवंशिकता के प्रभाव को लिंग पर देखने के लिए कौन-सी विधि प्रदान की गई?",
    option:["टेस्ट क्रॉस","आउट क्रॉस","रेसिप्रोकल क्रॉस","सिब क्रॉस"],
    answer:"रेसिप्रोकल क्रॉस"
},
{
    question: "किसी DNA में codon AAA है। इसके anticodon क्या होंगे?",
    option:["UUU","AAA","TTT","AUG"],
    answer:"UUU"
},
{
    question: "पौधों में अलैंगिक जनन निम्न में से किस विधि द्वारा हो सकता है?",
    option:["मुकुलन","विखंडन","विभाजन","सभी"],
    answer:"सभी"
},
{
    question: "यौन संचारित रोग है:",
    option:["खसरा","टी.बी.","गोनोरिया","टायफाइड"],
    answer:"गोनोरिया"
},
{
    question: "सबसे कम पोरस मृदा है:",
    option:["क्ले मृदा","लोम मृदा","रेतीली मृदा","ऐल्युवियल मृदा"],
    answer:"क्ले मृदा"
},
{
    question: "रक्त समूह की जाँच में प्रयुक्त एंटीसीरम में पाया जाता है",
    option:["एंटीबॉडी","एंटीजन","ल्यूकोसाइट्स","इनमें से कोई नहीं"],
    answer:"एंटीबॉडी"
},
{
    question: "मेसोजोइक युग है",
    option:["मत्स्यों का","उभयचरों का","सरीसृपों का","ट्राइलोबाइट्स का"],
    answer:"सरीसृपों का"
},
{
    question: "इनमें से कौन एक स्वप्रतिरक्षा का उदाहरण है?",
    option:["दमा","रूमेटॉयड अर्थराइटिस","कैंसर","इनमें से कोई नहीं"],
    answer:"रूमेटॉयड अर्थराइटिस"
},
{
    question: "टीकाकरण एक व्यक्ति को रोग से बचाता है, क्योंकि वह:",
    option:["पाचन को अच्छा करने में सहायता करता है","RBC संख्या को बढ़ाता है","प्रतिरक्षी पदार्थ उत्पन्न करता है","शरीर के ऊष्मा-तंत्र को सही रखता है"],
    answer:"प्रतिरक्षी पदार्थ उत्पन्न करता है"
},
{
    question: "प्लाज्मिड के संदर्भ में सत्य है:",
    option:["विषाणुओं में पाए जाते हैं","जीन स्थानान्तरण में बहुत प्रयोग होते हैं","जैविक क्रियाओं के लिए जीन धारण करते हैं","केन्द्रीयकीय गुणसूत्रों के भाग हैं"],
    answer:"जीन स्थानान्तरण में बहुत प्रयोग होते हैं"
},
{
    question: "किसमें तिर्यक द्विखंडन पाया जाता है?",
    option:["मोनोसिस्टिस","प्लाज्मोडियम","प्लैनेरिया","सिराटियम"],
    answer:"सिराटियम"
},
{
    question: "निम्नलिखित में से कौन-सी मुर्गियों की एक विषाणु रोग है?",
    option:["साल्मोनेलोसिस","कोराइजा","न्यूकैसल रोग","पाश्चुरेलोसिस"],
    answer:"न्यूकैसल रोग"
},
{
    question: "किसी भी खाद्य-श्रृंखला में हरा-पौधा प्रथम कड़ी है क्योंकि:",
    option:["उनका वितरण विस्तृत होता है","वे मृदा में दृढ़ता से लगे होते हैं","केवल इन्हीं में वातावरण की CO₂ को सूर्य प्रकाश की उपस्थिति में स्थिर करने की क्षमता होती है","उपरोक्त सभी में"],
    answer:"केवल इन्हीं में वातावरण की CO₂ को सूर्य प्रकाश की उपस्थिति में स्थिर करने की क्षमता होती है"
},
{
    question: "विभिन्न अल्कोहलिक पेय का निर्माण किस क्रिया से किया जाता है?",
    option:["छानन से","निस्पंदन से","किण्वन से","प्लवन से"],
    answer:"किण्वन से"
},
{
    question: "किसमें endosperm कड़ा तथा cellulosic हो जाता है",
    option:["आम","नारियल","Phytelephas (आइवरी पाम)","रेंडी"],
    answer:"Phytelephas (आइवरी पाम)"
},
{
    question: "DNA से संदेशवाहक RNA बनने की क्रिया को कहते हैं?",
    option:["प्रतिकरण/द्विगुणन","वाष्पोत्सर्जन","प्रतिलेखन","रूपांतरण"],
    answer:"प्रतिलेखन"
},
{
    question: "निम्नलिखित में कौन निषेचन के लिए आवश्यक है",
    option:["Corolla","Ovule","Calyx","फल"],
    answer:"Ovule"
},
{
    question: "निम्नलिखित में विषम/बेमेल को चुनें",
    option:["Archaesporium","Oogonium","Ovule","Antheridium"],
    answer:"Ovule"
},
{
    question: "डॉबसन इकाई मापक है:",
    option:["ध्वनि","हवा","पानी","ओजोन स्तर की मोटाई"],
    answer:"ओजोन स्तर की मोटाई"
},
{
    question: "गन्ना-अनुसंधान संस्थान कहाँ अवस्थित है?",
    option:["मुंबई में","कोयम्बटूर में","गौहाटी में","पटना में"],
    answer:"कोयम्बटूर में"
},
{
    question: "एक भ्रूणपुटी में दो प्रकार के संलयन, युग्मनज संलयन तथा त्रिसंलयन स्थान लेते हैं। इस परिघटना को क्या कहते हैं",
    option:["त्रिसंलयन","दोहरा निषेचन","भ्रूणपोष","इनमें से कोई नहीं"],
    answer:"दोहरा निषेचन"
},
{
    question: "आकारिकी तथा आनुवंशिकी रूप से समान जीवों को कहते हैं:",
    option:["क्लोन","सोमाक्लोन","कॉस्मिड्स","साइब्रिड्स"],
    answer:"क्लोन"
},
{
    question: "भारत में प्रथम जनगणना कब हुई?",
    option:["1851 में","1872 में","1921 में","1951 में"],
    answer:"1872 में"
},
{
    question: "निम्नलिखित RNA अनुकूलक अणु का कार्य करता है:",
    option:["दूत RNA","अंतरण RNA","राइबोसोमल RNA","उपर्युक्त में कोई नहीं"],
    answer:"अंतरण RNA"
},
{
    question: "DNA RNA से अलग होता है:",
    option:["नाइट्रोजनी समाक्षार व शर्कराओं द्वारा","नाइट्रोजनी समाक्षार व फॉस्फेट समूहों द्वारा","शर्कराओं में C परमाणुओं की संख्या द्वारा","शर्करा व फॉस्फेट समूहों द्वारा"],
    answer:"नाइट्रोजनी समाक्षार व शर्कराओं द्वारा"
},
{
    question: "वह प्रक्रिया जिसके अंतर्गत जीव संतान उत्पन्न करके अपनी प्रजाति को निरंतर बनाए रखता है, कहलाती है:",
    option:["जनन","लैंगिक जनन","अलैंगिक जनन","युग्मकजनन"],
    answer:"जनन"
},
{
    question: "लघुबीजाणुधानी की सबसे आंतरिक परत कौन-सी है",
    option:["एपिडर्मिस","एंडोथेसियम","टेपीटम","मध्य परत"],
    answer:"टेपीटम"
},
{
    question: "ऊतक संवर्धन में कायिक कोशिका से विकसित भ्रूण कहलाते हैं।",
    option:["एम्ब्रॉयड","क्लोन","कैलस","प्रोपेग्यूल्स"],
    answer:"एम्ब्रॉयड"
},
{
    question: "किसी DNA में:",
    option:["थायमिन जोड़ा बनाता है गुआनिन से","एडिनीन जोड़ा बनाता है थायमिन से","एडिनोसीन जोड़ा बनाता है थायमिडिन से","गुआनिन जोड़ा बनाता है साइटोसिन से"],
    answer:"एडिनीन जोड़ा बनाता है थायमिन से"
},
{
    question: "DNA को विशिष्ट स्थलों पर जोड़ने वाले एंजाइम को क्या कहते हैं?",
    option:["लाइसोसाइम एंजाइम","प्रतिबंधन एंजाइम","DNA लाइगेज","इनमें से कोई नहीं"],
    answer:"DNA लाइगेज"
},
{
    question: "ट्यूबरकुलोसिस के लिए कौन-सा टीका प्रयुक्त किया जाता है?",
    option:["BCG","DPT","TT","उपरोक्त सभी"],
    answer:"BCG"
},
{
    question: "F1 हाइब्रिड एवं प्रभावी Parent के बीच का क्रॉस कहलाता है",
    option:["टेस्ट क्रॉस","आउट क्रॉस","बैक क्रॉस","रिवर्स क्रॉस"],
    answer:"आउट क्रॉस"
},
{
    question: "प्रयोगशाला में DNA को देखने के लिए क्या प्रयुक्त होता है?",
    option:["कारमीन","एनीलीन ब्लू","इथीडियम ब्रोमाइड","इनमें से सभी"],
    answer:"इथीडियम ब्रोमाइड"
},
{
    question: "निम्नांकित में कौन-सी बीमारी मुर्गियों में होती है?",
    option:["स्मट","हैजा","(A) और (B) दोनों","रानीखेत"],
    answer:"रानीखेत"
},
{
    question: "एकिडना है",
    option:["योजक कड़ी","अवशेषी अंग","विलुप्त कड़ी","इनमें से कोई नहीं"],
    answer:"योजक कड़ी"
},
{
    question: "इनमें से किसमें आंतरिक निषेचन नहीं होता है?",
    option:["पक्षी","मेढ़क","स्तनपायी","इनमें से कोई नहीं"],
    answer:"मेढ़क"
},
{
    question: "प्रोटोप्लास्ट कल्चर का फ्यूजोजेन क्या है?",
    option:["तरल नाइट्रोजन","PEG","लैक्टिक अम्ल","इनमें से सभी"],
    answer:"PEG"
},
{
    question: "माँट्रियल प्रोटोकॉल, जिसमें ओजोन परत को मानव क्रियाकलापों से सुरक्षित बचाए रखने के लिए उचित कार्यवाही करने को कहा गया है, किस वर्ष में पारित किया गया था?",
    option:["1986","1987","1988","1985"],
    answer:"1987"
},
{
    question: "पौधों में अर्धसूत्री विभाजन किसमें होता है?",
    option:["मूल छोर","परागकण","तना के छोर","परागकोष"],
    answer:"परागकोष"
},
{
    question: "F2 वंशज के Monohybrid genotypic अनुपात 1 : 2 : 1 दर्शाता है",
    option:["Segregation","Independent assortment","Dominance","Incomplete dominance"],
    answer:"Segregation"
},
{
    question: "भारत का राष्ट्रीय पक्षी है",
    option:["पैवो क्रिस्टेसस","फ्लेमिंगो","कोलम्बा लीविया","सिटैकुला"],
    answer:"पैवो क्रिस्टेसस"
},
{
    question: "प्लियोट्रॉपिक जीन में रहता है",
    option:["एकल जीनोटाइप","बहुल जीनोटाइप","बहुल फीनोटाइप","एकल फीनोटाइप"],
    answer:"बहुल फीनोटाइप"
},
{
    question: "जेम्यूल्स बनते हैं",
    option:["हाइड्रा में","स्पंज में","यीस्ट में","इनमें से सभी में"],
    answer:"स्पंज में"
},
{
    question: "वृषण थैली किससे संबंधित है?",
    option:["अंडाशय","यकृत","वृषण","वृक्क"],
    answer:"वृषण"
},
{
    question: "DNA की द्वितीय वलयीकरण संरचना किस कारण से होती है?",
    option:["इलेक्ट्रोस्टेटिक आकर्षण","वांडर वाल बल","हाइड्रोजन बंध के कारण","इनमें से कोई नहीं"],
    answer:"हाइड्रोजन बंध के कारण"
},
{
    question: "एकल संकरण वैसा संकरण है, जिसमें",
    option:["सिर्फ एक ही पौधे प्रयोग के लिए इस्तेमाल हो","एक जोड़ा contrasting characters को रखा जाता है","संकर को समजात के साथ क्रॉस कराया जाता है","दो जोड़ा contrasting characters लिया जाता है"],
    answer:"एक जोड़ा contrasting characters को रखा जाता है"
},
{
    question: "अपघटक होते हैं:",
    option:["एनिमेलिया","प्रोटिस्टा एवं एनिमेलिया","कवक व पादप","जीवाणु व कवक"],
    answer:"जीवाणु व कवक"
},
{
    question: "शोला वन पाए जाते हैं",
    option:["उड़ीसा के पूर्वी तट में","उत्तर-पूर्वी हिमालय में","पश्चिमी घाट (केरल) में","दक्षिण के पठार में"],
    answer:"पश्चिमी घाट (केरल) में"
},
{
    question: "एक सामान्य दृष्टि वाली महिला, जिसके पिता वर्णान्ध हैं, की शादी एक सामान्य दृष्टि वाले पुरुष से होती है। उसके पुत्र एवं पुत्रियों में वर्णान्धता की संभावना क्या होगी?",
    option:["25% वर्णान्ध पुत्र एवं सभी सामान्य दृष्टि वाली पुत्रियाँ","50% वर्णान्ध पुत्र एवं 50% सामान्य दृष्टि वाली पुत्रियाँ","50% वर्णान्ध पुत्र एवं 50% वर्णान्ध पुत्रियाँ","सभी पुत्र सामान्य दृष्टि वाले एवं वर्णान्ध पुत्रियाँ"],
    answer:"50% वर्णान्ध पुत्र एवं 50% सामान्य दृष्टि वाली पुत्रियाँ"
},
{
    question: "मेलानिन रंगद्रव्य की अनुपस्थिति में दशा उत्पन्न होती है",
    option:["वर्णांधता","रंजकहीनता","फिनाइलकीटोनूरिया","एल्केप्टोनूरिया"],
    answer:"रंजकहीनता"
},
{
    question: "रिकॉम्बीनेन्ट DNA तकनीक में प्लाज्मिड वैक्टर का विखण्डन किसके द्वारा होना आवश्यक है?",
    option:["गर्म क्षारीय घोल द्वारा","रूपांतरित DNA लाइगेज द्वारा","चार पृथक एंजाइम द्वारा","वही एंजाइम जिसके द्वारा दाता जीन को खण्डित किया गया है"],
    answer:"वही एंजाइम जिसके द्वारा दाता जीन को खण्डित किया गया है"
},
{
    question: "अनुन्मील्य पुष्प निश्चित रूप से होते हैं",
    option:["स्वपरागित","परपरागित","स्वपरागित एवं परपरागित दोनों","इनमें से कोई नहीं"],
    answer:"स्वपरागित"
},
{
    question: "किसी बांझ पादप हाइब्रिड को किसके द्वारा Fertile बनाया जा सकता है?",
    option:["कॉल्चीसिन के प्रयोग से","पॉलीप्लॉइडी","गैनोसन युक्ति द्वारा","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "पुष्प अंग किसका रूपांतरित भाग है",
    option:["पत्तियों का","शाखाओं का","Sporangia","अग्र meristems"],
    answer:"पत्तियों का"
},
{
    question: "Nucellus या Integument से अतिरिक्त भ्रूण के निर्माण को कहते हैं",
    option:["Polyspermy","अनिषेकजनन","पार्थेनोकार्प","पोलिइम्ब्रायोनी"],
    answer:"पोलिइम्ब्रायोनी"
},
{
    question: "तम्बाकू के सेवन से शरीर में कौन-सा उपापचयी परिवर्तन शीघ्र परिलक्षित होता है?",
    option:["अधिवृक्क ग्रंथि के उद्दीपन से कैटेकोलेमीन का रक्त में स्राव","व्यक्ति के रक्तचाप तथा हृदय स्पन्दन की दर में एकाएक वृद्धि","इनमें से दोनों (A) एवं (B)","इनमें से कोई नहीं"],
    answer:"इनमें से दोनों (A) एवं (B)"
},
{
    question: "इनमें कौन-सा प्राकृतिक वायु प्रदूषक है?",
    option:["ज्वालामुखी से निकली गैसें","परागकण","धूलकण","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "एक संदेशवाहक RNA में कितने न्यूक्लियोटाइड का क्रम अमीनो अम्ल के लिए एक कोडोन बनता है?",
    option:["एक","दो","तीन","चार"],
    answer:"तीन"
},
{
    question: "मानव वीर्य (semen) का pH है",
    option:["4.5 – 5.5","6.5 – 6.8","7.3 – 7.5","8.2 – 8.5"],
    answer:"7.3 – 7.5"
},
{
    question: "भारतीय आवृत्तबीज भ्रूण विज्ञान के जनक हैं",
    option:["बी.एम. जोहरी","बी.जी.एल. स्वामी","आर.एन. कपिल","पी. माहेश्वरी"],
    answer:"पी. माहेश्वरी"
},
{
    question: "अंतरिक्ष जीवमंडल की अवधारणा किसने विकसित की?",
    option:["DST","UGC","CRIS","MAB"],
    answer:"MAB"
},
{
    question: "AIDS का कारक है:",
    option:["बैक्टीरिया","प्रोटोजोआ","HIV वायरस","ट्राइकोमोनास"],
    answer:"HIV वायरस"
},
{
    question: "हिस्टामिन संबंधित है:",
    option:["उदासीन","B-लिम्फोसाइट","एंटीबॉडी","एलर्जी"],
    answer:"एलर्जी"
},
{
    question: "Corpus Spongiosum पेशी किसमें पाया जाता है?",
    option:["वृषण","शिश्न","अंडाशय","वृक्क"],
    answer:"शिश्न"
},
{
    question: "मेंडल ने प्रस्तावित किया",
    option:["अर्जित गुणों की वंशागति","आनुवंशिकी के नियम","सहलग्नता के नियम","ऊर्जा का नियम"],
    answer:"आनुवंशिकी के नियम"
},
{
    question: "ई. कोलाई क्लोनिंग संवाहक pBR 322 में प्रतिबंधन स्थल श्रृंखला मौजूद है:",
    option:["EcoRI","HindIII","BamHI","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "लैक ऑपेरॉन में लैक्टोस क्या कार्य करता है?",
    option:["नियंत्रक","प्रेरक","अवरोधक","इनमें हर प्रकार"],
    answer:"प्रेरक"
},
{
    question: "वाहित मल से जल का प्रदूषण किसकी पुटियों से प्रदर्शित होता है?",
    option:["एश्केरिचिया","एंटअमीबा","स्यूडोमोनास","लीश्मानिया"],
    answer:"एंटअमीबा"
},
{
    question: "दो नाइट्रोजन क्षार के हाइड्रोजन बंधन के बीच की दूरी (जैसे A-T, G-C) होती है:",
    option:["समान","असमान","परिवर्तनशील","इनमें से कोई नहीं"],
    answer:"समान"
},
{
    question: "वह प्रक्रिया जिसके द्वारा नर युग्मक एवं मादा युग्मक बनते हैं, कहलाती है:",
    option:["निषेचन","भ्रूणजनन","युग्मकजनन","आकारजनन"],
    answer:"युग्मकजनन"
},
{
    question: "विश्व में पाए जाने वाले जैव विविधता हॉट स्पॉट की संख्या इनमें से कौन-सी है?",
    option:["25","9","34","इनमें से कोई नहीं"],
    answer:"34"
},
{
    question: "बहुभ्रूणता सबसे ज्यादा किसमें होती है",
    option:["जिम्नोस्पर्म","टेरिडोफाइट","आवृत्तबीजी","ब्रायोफाइट"],
    answer:"जिम्नोस्पर्म"
},
{
    question: "युग्मन एवं विकर्षण के सिद्धांत को किसने प्रतिपादित किया?",
    option:["मॉर्गन","बेटेसन एवं पनेट","ह्यूगो डि व्रीज","मेंडल"],
    answer:"बेटेसन एवं पनेट"
},
{
    question: "DNA से प्रत्यक्ष रूप में संश्लेषण नहीं किया जा सकता:",
    option:["m-RNA","t-RNA","r-RNA","प्रोटीन"],
    answer:"प्रोटीन"
},
{
    question: "Filiform उपकरण किसकी विशेषता है",
    option:["Synergids","अंडाणु","परागकोश भित्ति","Antipodal cells"],
    answer:"Synergids"
},
{
    question: "यदि पिता का रक्त समूह O तथा माता का AB हो तो बच्चे में किस रक्त समूह की संभावना हो सकती है?",
    option:["O","AB","O या AB","A या B"],
    answer:"A या B"
},
{
    question: "गुद्देदार (मांसल) तने का होना अनुकूलन है।",
    option:["मरुस्थलीय पौधों का","जलीय पौधों का","उपर्युक्त (A) एवं (B) दोनों का","इनमें से कोई नहीं"],
    answer:"मरुस्थलीय पौधों का"
},
{
    question: "इनमें से पश्चविषाणु (Retrovirus) कौन है?",
    option:["ह्यूमन इम्यूनो डिफिसिएन्सी वायरस","हेपेटाइटिस वायरस","माइकोवायरस इन्फ्लुएंजा","इनमें से कोई नहीं"],
    answer:"ह्यूमन इम्यूनो डिफिसिएन्सी वायरस"
},
{
    question: "पूरे भौगोलिक क्षेत्र में विविधता का वास-स्थल है:",
    option:["गामा विविधता","बीटा विविधता","ओमेगा विविधता","डेल्टा विविधता"],
    answer:"गामा विविधता"
},
{
    question: "सोमाक्लोन प्राप्त होते हैं।",
    option:["ऊतक संवर्धन द्वारा","पादप प्रजनन द्वारा","विकिरणन द्वारा","जीनी अभियांत्रिकी द्वारा"],
    answer:"ऊतक संवर्धन द्वारा"
},
{
    question: "न्यूक्लियोसाइड है:",
    option:["नाइट्रोजन क्षारक + शर्करा","नाइट्रोजनी क्षारक + शर्करा + फॉस्फेट","शर्करा + फॉस्फेट","नाइट्रोजनी क्षारक + फॉस्फेट"],
    answer:"नाइट्रोजन क्षारक + शर्करा"
},
{
    question: "एथानॉल का बड़े पैमाने पर उत्पादन के लिए किसका प्रयोग किया जाता है?",
    option:["यीस्ट","जीवाणु","कवक","विषाणु"],
    answer:"यीस्ट"
},
{
    question: "किसी आवृत्तबीजी (एकबीजपत्री) के नर gametophyte होते हैं",
    option:["Microsporangium","Nucellus","Microspore","Stamen"],
    answer:"Microspore"
},
{
    question: "किसी शुगर रोगी व्यक्ति में इंसुलिन को सीधे तौर पर मुख द्वारा नहीं दिया जाता है, क्योंकि यह एक:",
    option:["C-peptide","डायसल्फाइड","पॉलीपेप्टाइड","इनमें से कोई नहीं"],
    answer:"पॉलीपेप्टाइड"
},
{
    question: "विभिन्न प्रकार के युग्मक जो एक पौधे के genotype AaBbCc से प्राप्त होते हैं, उनकी संख्या होती है",
    option:["2","8","4","16"],
    answer:"8"
},
{
    question: "मानव का उद्गम स्थल माना जाता है",
    option:["एशिया","अफ्रीका","यूरोप","अमेरिका"],
    answer:"अफ्रीका"
},
{
    question: "‘जैविक विविधता’ शब्द का सर्वप्रथम प्रयोग कब किया गया?",
    option:["1980","1970","1985","1975"],
    answer:"1985"
},
{
    question: "निम्न में कौन जन्म नियंत्रण में प्रयुक्त यांत्रिकीय अवरोधक है?",
    option:["कॉपर T","मध्यच्छद","डेलकॉन चादर","लूप"],
    answer:"मध्यच्छद"
},
{
    question: "सी.आर. किस रोग की पहचान के लिए इस्तेमाल किया जाता है?",
    option:["टाइफायड","कैंसर","टी.बी.","इनमें से सभी"],
    answer:"कैंसर"
},
{
    question: "वन काटने का कारण:",
    option:["मानव जनसंख्या में वृद्धि","निर्माण कार्य","कृषि योग्य भूमि की बढ़ती हुई माँग","उपरोक्त सभी"],
    answer:"उपरोक्त सभी"
},
{
    question: "शीतोष्ण सदाबहार वन कहाँ मिलते हैं?",
    option:["हिमालय","पश्चिमी घाट","अरावली","असम"],
    answer:"पश्चिमी घाट"
},
{
    question: "DNA का निर्माण किससे होता है?",
    option:["रिवर्स ट्रांसक्रिप्टेज","क्लोन DNA","वृत्ताकार DNA","पुनर्योगज DNA"],
    answer:"रिवर्स ट्रांसक्रिप्टेज"
},
{
    question: "आनुवंशिक कूट में कितने कूट होते हैं?",
    option:["8","16","32","64"],
    answer:"64"
},
{
    question: "इनमें से किस रोग हेतु एलिसा (ELISA) जाँच करना चाहिए?",
    option:["मलेरिया","मियादी बुखार (टायफाइड)","एच.आई.वी./एड्स","इनमें से कोई नहीं"],
    answer:"एच.आई.वी./एड्स"
},
{
    question: "संकटापन्न जातियों के संरक्षण के लिए बाह्यस्थान संरक्षण की एक विधि है",
    option:["राष्ट्रीय उद्यान","निम्नताप परिरक्षण","पशु बिहार","सुरक्षित जैवमंडल"],
    answer:"निम्नताप परिरक्षण"
},
{
    question: "जैव गैस उत्पादन में प्रयुक्त जीवाणु का समूह है:",
    option:["यूबैक्टीरिया","आर्गेनोट्राफ","मेथेनोट्राफ","मेथेनोजेन"],
    answer:"मेथेनोजेन"
},
{
    question: "यदि DNA के किसी पृथक किए गए स्ट्रेन को 82-92°C ताप पर रखा जाए तो:",
    option:["यह RNA में परिवर्तित हो जाता है","यह दो खंडों में टूट जाता है","यह अनेक खण्डों में टूट जाता है","यह खुल जाता है और दोनों रज्जुक पृथक् हो जाते हैं"],
    answer:"यह खुल जाता है और दोनों रज्जुक पृथक् हो जाते हैं"
},
{
    question: "सोमाक्लोनल विभिन्नताएँ हैं:",
    option:["ऊतक संवर्धन द्वारा उत्पन्न विभिन्नताएँ","लैंगिक प्रजनन द्वारा उत्पन्न विभिन्नताएँ","म्यूटाजेन द्वारा कारित विभिन्नताएँ","गामा किरण द्वारा कारित विभिन्नताएँ"],
    answer:"ऊतक संवर्धन द्वारा उत्पन्न विभिन्नताएँ"
},
{
    question: "पनीर में विशेष प्रकार की सुगंध किससे आती है?",
    option:["यीस्ट से","कवक से","जीवाणु से","विषाणु से"],
    answer:"जीवाणु से"
},
{
    question: "न्यूमेटोफोर्स यहाँ उपस्थित होता है:",
    option:["जीरोफाइट","हाइग्रोफाइट","मीजोफाइट","हैलोफाइट"],
    answer:"हैलोफाइट"
},
{
    question: "सूक्ष्म प्रजनन में कराया जाता है:",
    option:["अलैंगिक प्रजनन","समान आनुवंशिक गुणों वाले पौधे","लैंगिक प्रजनन","(A) और (B) दोनों"],
    answer:"(A) और (B) दोनों"
},
{
    question: "बीजाणुओं द्वारा जनन करने वाले पौधे जैसे मॉस, फर्न सामान्यतः किस समूह में रखे जाते हैं?",
    option:["स्पोरोफाइट्स","थैलोफाइट्स","क्रिप्टोगेम्स","बायोफाइट्स"],
    answer:"क्रिप्टोगेम्स"
},
{
    question: "गर्भावस्था के किस महीने में गर्भस्थ शिशु गतिशील होता है तथा सिर पर बाल उग आते हैं?",
    option:["चौथा महीना","पाँचवाँ महीना","छठा महीना","तीसरा महीना"],
    answer:"पाँचवाँ महीना"
},
{
    question: "वन हमारे लिए महत्त्वपूर्ण हैं क्योंकि वे हमें प्रदान करते हैं:",
    option:["भोजन","चारा","तंतु","उपरोक्त सभी"],
    answer:"उपरोक्त सभी"
},
{
    question: "इन्सिनेरेटर का प्रयोग किस प्रकार के अवशिष्ट निस्तारण हेतु करना चाहिए?",
    option:["तापीय विद्युत केन्द्र","कृषि संबंधित","मानव मल एवं अन्य अवशिष्ट","अस्पताल"],
    answer:"अस्पताल"
},
{
    question: "जनन स्वास्थ्य के लिए क्या सावधानी की जरूरत है?",
    option:["यौन संचारित रोग से बचाव","गर्भपात","गर्भवती की समुचित देखभाल","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "फ्लावर-सावर किसका ट्रांसजेनिक प्रकार है?",
    option:["गेहूँ","टमाटर","धान","रूई"],
    answer:"टमाटर"
},
{
    question: "इनमें से कौन जन्मदर नियंत्रण की शैल्य विधि है",
    option:["ट्युबेकटौमी","वैसेकटौमी","(A) एवं (B) दोनों ही","इनमें से कोई नहीं"],
    answer:"(A) एवं (B) दोनों ही"
},
{
    question: "ब्राउन शुगर रासायनिक रूप से क्या है?",
    option:["डाइएसिटिल मॉर्फीन हाइड्रोक्लोराइड","थियोफाइलीन","लोराजिपम","मेथीड्रिन"],
    answer:"डाइएसिटिल मॉर्फीन हाइड्रोक्लोराइड"
},
{
    question: "Indeterminate cleavage किसमें पाया जाता है?",
    option:["केंचुआ","कशेरूकी","निरीज","जोंक"],
    answer:"कशेरूकी"
},
{
    question: "एक स्वनिषेचित त्रिगुणित पादप बनाता है।",
    option:["4 भिन्न युग्मक तथा 16 भिन्न युग्मनज","8 भिन्न युग्मक तथा 16 भिन्न युग्मनज","8 भिन्न युग्मक तथा 32 भिन्न युग्मनज","8 भिन्न युग्मक तथा 64 भिन्न युग्मनज"],
    answer:"8 भिन्न युग्मक तथा 64 भिन्न युग्मनज"
},
{
    question: "न्यूक्लिक अम्ल के नाइट्रोजीनस बेस के बीच कौन-सा बंधन रहता है?",
    option:["पेप्टाइड बंधन","इस्टर बंधन","(A) और (B) दोनों","हाइड्रोजन बंधन"],
    answer:"हाइड्रोजन बंधन"
},
{
    question: "भू-मंडल के सबसे बड़ा जैव विविधता वाला क्षेत्र है:",
    option:["पूर्वी हिमालय","भारत का पश्चिमी घाट","अमेजन का वर्षावन","पश्चिमी हिमालय"],
    answer:"अमेजन का वर्षावन"
},
{
    question: "खच्चर की उत्पत्ति में किनके मध्य संकरण होता है?",
    option:["नर गदहा तथा मादा घोड़ा","नर घोड़ा तथा मादा गदहा","साँढ़ तथा गदही","इनमें से कोई नहीं"],
    answer:"नर घोड़ा तथा मादा गदहा"
},
{
    question: "मिलर-यूरे द्वारा लिए गए गैसीय मिश्रण का अनुपात है",
    option:["2:1:2","1:2:1","1:1:2","2:1:1"],
    answer:"2:1:2"
},
{
    question: "त्रिसंचयन है",
    option:["एक नर युग्मक का दो ध्रुव केन्द्रकों के साथ embryo sac में संलयन","एक नर युग्मक का तीन केन्द्रकों के साथ embryo sac में संलयन","एक नर युग्मक का दो synergids के साथ संलयन","एक embryo sac में तीन संलयन"],
    answer:"एक नर युग्मक का दो ध्रुव केन्द्रकों के साथ embryo sac में संलयन"
},
{
    question: "ELISA का प्रयोग किन बीमारियों का पता लगाने के लिए किया जाता है?",
    option:["हीपैटाइटिस","AIDS","थायरॉइड डिसऑर्डर","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "ओजोन परत ढकी रहती है:",
    option:["मध्य मंडल में","बाह्य मंडल में","समताप मंडल में","इनमें से सभी"],
    answer:"समताप मंडल में"
},
{
    question: "वाहित मलजल के शुद्धिकरण में क्रियाशील होते हैं:",
    option:["जंतु जीवक","मछलियाँ","जीवाणु","इनमें से सभी"],
    answer:"जीवाणु"
},
{
    question: "Scutellum किसका भाग है",
    option:["Grass cotyledon","Dicot cotyledon","Maize endosperm","Pericarp"],
    answer:"Grass cotyledon"
},
{
    question: "डार्विन किसके कार्य से अत्यधिक प्रभावित हुए?",
    option:["मॉल्थस","वैलेस","स्पेंसर","लामार्क"],
    answer:"मॉल्थस"
},
{
    question: "कैंडीडियोसिस का कारण है:",
    option:["Pubic Lice","योनि यीस्ट","पिन वॉर्म","Giant amoeba"],
    answer:"योनि यीस्ट"
},
{
    question: "मनुष्य में सबसे अधिक होने वाला कैंसर है?",
    option:["मेलानोमा","लिम्फोमा","सार्कोमा","कार्सिनोमा"],
    answer:"कार्सिनोमा"
},
{
    question: "योनि द्वार प्रायः एक पतली झिल्ली से ढंका होता है जिसे कहते हैं",
    option:["क्लाइटोरिस","मेजोरा","इस्थमस","हायमन"],
    answer:"हायमन"
},
{
    question: "निम्न में से कौन-सा जैव पीड़कनाशी है?",
    option:["बीटी कपास","बीटी मक्का","बीटी धान","उपरोक्त सभी"],
    answer:"उपरोक्त सभी"
},
{
    question: "जाति की जैविक अवधारणा मुख्यतः आधारित है:",
    option:["जननिक विलगन पर","केवल आकारिकी लक्षणों पर","केवल प्रजनन की विधि पर","आकारिकीय एवं प्रजनन की विधियों पर"],
    answer:"जननिक विलगन पर"
},
{
    question: "एकगुणित कोशिका जो समसूत्री विभाजन द्वारा embryo sac बनाती है, कहलाती है",
    option:["Megaspore mother cell","Microspore mother cell","Functional megaspore","Non-functional megaspore"],
    answer:"Functional megaspore"
},
{
    question: "चार्ल्स डार्विन द्वारा प्रयुक्त जहाज का नाम था",
    option:["H.M.S. ईगल","H.M.S. बीगल","H.M.S. रीगल","H.M.S. टाइटेनिक"],
    answer:"H.M.S. बीगल"
},
{
    question: "कान्हा नेशनल पार्क प्रसिद्ध है",
    option:["पक्षियों के लिए","गैंडों के लिए","बाघ के लिए","मगरमच्छों के लिए"],
    answer:"बाघ के लिए"
},
{
    question: "स्तनधारी के भ्रूण में, नाभि में रक्त प्रवाह होता है",
    option:["50% Maternal एवं 50% Foetal","100% Foetal","100% Maternal","75% Maternal एवं 25% Foetal"],
    answer:"100% Foetal"
},
{
    question: "हिस्टामिन संबंधित है:",
    option:["उदासीनता","B-लिम्फोसाइट से","एंटीबॉडी से","एलर्जी से"],
    answer:"एलर्जी से"
},
{
    question: "यदि दो युग्मक देखने में समान लगें, तो कहते हैं:",
    option:["आइसोगैमिट्स","हैटेरोगैमिट्स","Anisogametes","Exogamy"],
    answer:"आइसोगैमिट्स"
},
{
    question: "इन्फ्लुएंजा इनमें से किसके द्वारा होता है?",
    option:["इन्फो वायरस","मिक्सो वायरस","हर्पिस वायरस","इनमें से कोई नहीं"],
    answer:"मिक्सो वायरस"
},
{
    question: "किसी छोटे भाग/टुकड़े के संपूर्ण शरीर के निर्माण को कहते हैं:",
    option:["Morphallaxis","Epimorphosis","Morphogenesis","Metabolism"],
    answer:"Morphallaxis"
},
{
    question: "ओजोन के विघटन में कौन-सा तत्व उत्प्रेरक के रूप में कार्य करता है?",
    option:["क्लोरीन","फ्लोरीन","ऑक्सीजन","पोटैशियम"],
    answer:"क्लोरीन"
},
{
    question: "कणकीय पदार्थ में उपस्थित होता है:",
    option:["ठोस कण","तरल कण","दोनों (A) तथा (B)","सिर्फ गैसें"],
    answer:"दोनों (A) तथा (B)"
},
{
    question: "पौधों में कोशिकाद्रव्यी नर-बंध्यता हेतु जीन स्थित होते हैं",
    option:["माइटोकॉण्ड्रियल जीनोम में","साइटोसॉल में","हरितलवक जीनोम में","केन्द्रकीय जीनोम में"],
    answer:"माइटोकॉण्ड्रियल जीनोम में"
},
{
    question: "शरीर के किस हिस्से में शुक्राणुनाशक द्वारा शुक्राणु को मारा जाता है?",
    option:["योनि","ग्रीवा","फैलोपियन ट्यूब","(A) एवं (B) दोनों"],
    answer:"(A) एवं (B) दोनों"
},
{
    question: "परागकण के बाह्य चोल में सुस्पष्ट द्वारक या रंध्र को कहते हैं",
    option:["बाह्य चोला","अंतः चोला","जनन छिद्र","जनन कोशिका"],
    answer:"जनन छिद्र"
},
{
    question: "प्रत्येक पादप कोशिका से पूर्ण पौधा बन सकता है। इस गुण को कहते हैं।",
    option:["क्लोनिंग","सोमाक्लोनिंग","टोटीपोटेंसी","इनमें से कोई नहीं"],
    answer:"टोटीपोटेंसी"
},
{
    question: "आहार श्रृंखला के परस्पर समूह को क्या कहते हैं?",
    option:["आहार चक्र","आहार जटिल","आहार जाल","पोषी स्तर"],
    answer:"आहार जाल"
},
{
    question: "प्रोटोप्लास्ट कल्चर का फ्यूजोजेन क्या है?",
    option:["तरल नाइट्रोजन","PEG","लैक्टिक अम्ल","इनमें से सभी"],
    answer:"PEG"
},
{
    question: "गाइनेन्ड्रोमार्फ में",
    option:["कुछ कोशिकाओं का जीनप्रारूप XX तथा कुछ कोशिकाओं का XY होता है","सभी कोशिकाओं का जीनप्रारूप XX होता है","सभी कोशिकाओं का जीनप्रारूप XY होता है","सभी कोशिकाओं का जीनप्रारूप XXY होता है"],
    answer:"कुछ कोशिकाओं का जीनप्रारूप XX तथा कुछ कोशिकाओं का XY होता है"
},
{
    question: "जैव सक्रिय अणु साइक्लोस्पोरिन A को बनाया जाता है:",
    option:["कवक से","यीस्ट से","जीवाणु से","विषाणु से"],
    answer:"कवक से"
},
{
    question: "डी०एन०ए० में निहित पायरिमिडिन है:",
    option:["थायमीन एवं साइटोसिन","साइटोसिन एवं गुआनीन","एडिनीन एवं युरासिल","एडिनीन एवं थायमीन"],
    answer:"थायमीन एवं साइटोसिन"
},
{
    question: "परपोषी कोशिकाओं में विजातीय DNA को प्रवेश कराने के लिए किनका उपयोग किया जाता है?",
    option:["सूक्ष्म अंतःक्षेपण","जीन गन","अहानिकारक रोगजनक","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "यदि पिता का रक्त वर्ग AB और माता का B है तो उनकी संतान के रक्त वर्ग होने की सम्भावना है",
    option:["0%","50%","25%","इनमें से कोई नहीं"],
    answer:"0%"
},
{
    question: "विश्व की बेशकीमती ऊन देने वाली ‘पश्मीना’ नस्ल है।",
    option:["भेड़ की","बकरी की","भेड़-बकरी संकरण","कश्मीर भेड़-अफगान भेड़ संकर से"],
    answer:"बकरी की"
},
{
    question: "पहली ट्रान्सजेनिक फसल थी:",
    option:["सूत","अलसी","मटर","तम्बाकू"],
    answer:"तम्बाकू"
},
{
    question: "एक पारिस्थितिक तंत्र में ऊर्जा प्रवाह का सही क्रम है:",
    option:["उत्पादक → मांसाहारी → शाकाहारी → विघटनकारी","उत्पादक → शाकाहारी → मांसाहारी → विघटनकारी","शाकाहारी → मांसाहारी → उत्पादक → विघटनकारी","शाकाहारी → उत्पादक → मांसाहारी → विघटनकारी"],
    answer:"उत्पादक → शाकाहारी → मांसाहारी → विघटनकारी"
},
{
    question: "निम्नलिखित में से अनुलेखन के लिए महत्त्वपूर्ण है:",
    option:["DNA मिथाइलेज","CAAT बॉक्स","प्रमोटर","DNA पॉलिमरेज"],
    answer:"प्रमोटर"
},
{
    question: "कीटों को भगाने वाला नीम का उत्पाद है:",
    option:["रेटिनोन","एजाडारेक्टिन","पेराथिआन","एन्ड्रिन"],
    answer:"एजाडारेक्टिन"
},
{
    question: "निम्नलिखित में कौन-सा ‘बेकर यीस्ट’ है?",
    option:["S. cerevisiae","S. ludwigii","S. octosporus","Schizosaccharomyces"],
    answer:"S. cerevisiae"
},
{
    question: "एक नदी के जल का B.O.D. लगभग कितना होता है?",
    option:["8","20","400","500"],
    answer:"8"
},
{
    question: "प्रकाश रासायनिक धूमकोहरा इनमें से किससे बनता है?",
    option:["सल्फर डाइऑक्साइड, PAN एवं धुआँ","ओजोन, PAN एवं नाइट्रोजन डाइऑक्साइड","ओजोन, सल्फर डाइऑक्साइड एवं हाइड्रोकार्बन","सल्फर डाइऑक्साइड, कार्बन डाइऑक्साइड एवं हाइड्रोकार्बन"],
    answer:"ओजोन, PAN एवं नाइट्रोजन डाइऑक्साइड"
},
{
    question: "‘पारिस्थितिक तंत्र’ शब्द के उपयोग का श्रेय दिया जाता है।",
    option:["गार्डनर","ओडम को","टॉनसली","वार्मिंग को"],
    answer:"टॉनसली"
},
{
    question: "तीन फसलें जो विश्व खाद्य उत्पादन का सबसे अधिक भाग बनाती हैं।",
    option:["गेहूँ, चावल और मक्का","गेहूँ, चावल और जौ","गेहूँ, मक्का और ज्वार","चावल, मक्का और ज्वार"],
    answer:"गेहूँ, चावल और मक्का"
},
{
    question: "पहला मानव जिसके जीवाश्म अफ्रीका के अलावा यूरोप और एशिया में मिले",
    option:["होमो हैबिलिस","होमो इरेक्टस","होमो निएण्डरथल","होमो सैपियंस"],
    answer:"होमो इरेक्टस"
},
{
    question: "कौन-सा मत व्यक्तिगत जातिवृत्त की पुनरावृत्ति करता है?",
    option:["उत्परिवर्तन सिद्धांत","वंशागति सिद्धांत","पुनरावृत्ति सिद्धांत","प्राकृतिक चयनवाद"],
    answer:"पुनरावृत्ति सिद्धांत"
},
{
    question: "जैव प्रौद्योगिकी द्वारा निर्मित औषधि जिसका प्रयोग कैंसर निदान में किया जाता है:",
    option:["इंटरफेरॉन","HGH","TSH","इन्सुलिन"],
    answer:"इंटरफेरॉन"
},
{
    question: "निम्नलिखित में से किसका निर्माण पारिस्थितिक तंत्र से होता है?",
    option:["खाद्य-श्रृंखला","खाद्य-जाल","(A) और (B) दोनों","इनमें से कोई नहीं"],
    answer:"(A) और (B) दोनों"
},
{
    question: "परागकोश क्या दर्शाता है",
    option:["Sporogonium","नर गैमेटोफायट","नर स्पोरोफिल","Sporangium"],
    answer:"Sporogonium"
},
{
    question: "इनफन्डीबुलम में अंगुलाकार प्रवर्ध कहलाते हैं",
    option:["फिम्ब्री","एम्पुला","इस्थमस","इनमें से कोई नहीं"],
    answer:"फिम्ब्री"
},
{
    question: "सहलग्नता की खोज किसने की?",
    option:["मेंडल ने","स्टेनली एवं मिलर ने","मॉर्गन ने","इनमें से कोई नहीं"],
    answer:"मॉर्गन ने"
},
{
    question: "एक प्रारूपी न्यूक्लियोसोम में हिस्टोन अष्टक पर लिपटे DNA कुंडली में क्षार युग्मों की संख्या होती है।",
    option:["100","200","300","400"],
    answer:"200"
},
{
    question: "प्राचीन काल में यीस्ट का प्रयोग किसके निर्माण में किया जाता था?",
    option:["वाइन","बियर","रम","सभी"],
    answer:"सभी"
},
{
    question: "पुष्पीय पौधों में एकलिंगी नर पुष्प को कहते हैं",
    option:["Pistillate","Monoecious","Dioecious","Staminate"],
    answer:"Staminate"
},
{
    question: "इनमें किसमें एरिल नहीं पाया जाता है",
    option:["शरीफा","लीची","आम","मिरिस्टिका"],
    answer:"आम"
},
{
    question: "अगुणित कोशिकाओं के संलयन की प्रक्रिया को कहते हैं।",
    option:["कोशिका चक्र","अर्द्धसूत्री विभाजन","समसूत्री विभाजन","संयुग्मन (syngamy)"],
    answer:"संयुग्मन (syngamy)"
},
{
    question: "परागकोश में परागकण के निर्माण एवं विभेदन को कहते हैं",
    option:["Megasporogenesis","Microsporogenesis","Spermatogenesis","द्विनिषेचन"],
    answer:"Microsporogenesis"
},
{
    question: "चरम समुदाय बनने तक एक समुदाय की प्रजाति का दूसरे से क्रमिक परिवर्तन कहलाता है",
    option:["अनुक्रमण","पारितंत्र","जनसंख्या","इनमें से कोई नहीं"],
    answer:"अनुक्रमण"
},
{
    question: "पुंकेसर कितने भागों में बँटा होता है",
    option:["1","2","3","4"],
    answer:"2"
},
{
    question: "परभक्षण और परजीविता में इस तरह पारस्परिक क्रिया होती है:",
    option:["+,+","-,-","+,0","+,-"],
    answer:"+,-"
},
{
    question: "अधिकांश प्रतिजैविक तैयार किए जाते हैं",
    option:["कवकों से","यीस्ट से","शैवाल से","जीवाणु से"],
    answer:"जीवाणु से"
},
{
    question: "रूक्षांश (Roughage) की अधिकता होती है।",
    option:["अंडे में","खनिज पदार्थों में","अनाज में","घास, भूसा, चारा में"],
    answer:"घास, भूसा, चारा में"
},
{
    question: "प्राकृतिक आनुवंशिक अभियंता है:",
    option:["बैसीलस सबटिलस","स्यूडोमोनास प्रजाति","ईश्चेरिचिया कोलाई","एग्रोबैक्टीरियम ट्यूमीफेसिएन्स"],
    answer:"एग्रोबैक्टीरियम ट्यूमीफेसिएन्स"
},
{
    question: "मानव जीनोम में क्षार युग्मों की संख्या है:",
    option:["3 × 10^6","3 × 10^9","3 × 10^12","इनमें से कोई नहीं"],
    answer:"3 × 10^9"
},
{
    question: "एक ही जाति के जीवों के सामाजिक-स्थानिक संगठन को क्या कहते हैं?",
    option:["स्पीशीज","आबादी","समुदाय","व्यष्टि"],
    answer:"आबादी"
},
{
    question: "परिवार नियोजन के लिए शुक्रवाहिनी को काटकर बाँधने की विधि को कहते हैं:",
    option:["Tubectomy","Ovarectomy","Vasectomy","Castration"],
    answer:"Vasectomy"
},
{
    question: "ट्रांसजेनिक जन्तुओं में:",
    option:["विदेशी RNA इनके सभी कोशिकाओं में होता है","विदेशी DNA इनके सभी कोशिकाओं में होता है","विदेशी DNA इनके कुछ कोशिकाओं में होता है","(B) एवं (C) दोनों"],
    answer:"विदेशी DNA इनके सभी कोशिकाओं में होता है"
},
{
    question: "1000 परागकण से कितने पराग मातृ कोशिका का निर्माण होगा",
    option:["200","250","300","100"],
    answer:"250"
},
{
    question: "पेरॉक्सी एसीटिल नाइट्रेट (PAN) किस प्रकार का प्रदूषक है?",
    option:["प्राथमिक प्रदूषक","द्वितीयक प्रदूषक","जल प्रदूषक","ध्वनि प्रदूषक"],
    answer:"द्वितीयक प्रदूषक"
},
{
    question: "कॉपर-टी रोकता है:",
    option:["निषेचन को","ओवूलेशन को","यूटेरस की दीवारों पर इम्ब्रियों के बनने को","रिप्रोडक्टिव डक्ट में रुकावट को"],
    answer:"निषेचन को"
},
{
    question: "शुक्राणुजनन किसके द्वारा अभिभूत होता है?",
    option:["FSH","MSH","ACTH","HCG"],
    answer:"FSH"
},
{
    question: "भारतवर्ष में हॉट स्पॉट्स पाए जाते हैं",
    option:["केवल पूर्वी हिमालय में","केवल पश्चिमी घाट में","पूर्वी हिमालय तथा पश्चिमी घाट में","राजस्थान के रेगिस्तान में"],
    answer:"पूर्वी हिमालय तथा पश्चिमी घाट में"
},
{
    question: "Spermatids का रूपांतरण Spermatozoa में किस विधि द्वारा होता है?",
    option:["Spermiation","Spermatogenesis","Spermiogenesis","Spermatosis"],
    answer:"Spermiogenesis"
},
{
    question: "LSD प्राप्त होता है:",
    option:["कवक से","लाइकेन से","शैवाल से","जीवाणु से"],
    answer:"कवक से"
},
{
    question: "इनमें से कौन सर्वाधिक ऊर्जा प्राप्त करता है?",
    option:["शीर्ष उपभोक्ता","उत्पादक","सर्वहारी","इनमें से कोई नहीं"],
    answer:"उत्पादक"
},
{
    question: "व्यावसायिक स्तर पर सूक्ष्मजीवों को उत्पन्न करने में आवश्यकता होती है",
    option:["किण्वन की","बायोगैस संयंत्र की","पेनीसिलिन की","स्टैटिन की"],
    answer:"किण्वन की"
},
{
    question: "घाना पक्षी विहार स्थित है –",
    option:["उत्तर प्रदेश","राजस्थान","हरियाणा","बिहार"],
    answer:"राजस्थान"
},
{
    question: "वृक्क तथा जनन अंग का निर्माण किससे होता है?",
    option:["endoderm","Mesoderm","ectoderm","ecto-mesoderm"],
    answer:"Mesoderm"
},
{
    question: "नारमेन बारलॉग किससे सम्बन्धित हैं?",
    option:["सफेद क्रान्ति","हरित क्रान्ति","नीली क्रान्ति","पीली क्रान्ति"],
    answer:"हरित क्रान्ति"
},
{
    question: "मानस सेंचुरी स्थित है।",
    option:["राजस्थान","असम","बिहार","गुजरात"],
    answer:"असम"
},
{
    question: "इनमें से कौन-सा निमेटोड तम्बाकू के पौधों की जड़ों को संक्रमित करता है?",
    option:["बैसिलस थुरिजिएन्सिस","क्राई आइ ए सी","मेलॉयडॉजिन इन्कोग्निटा","(A) एवं (B) दोनों"],
    answer:"मेलॉयडॉजिन इन्कोग्निटा"
},
{
    question: "जेनेटिक इंजीनियरिंग में इस्तेमाल पहले प्रतिबंधन एंजाइम का नाम है:",
    option:["EcoRI","HindIII","BamHI","इनमें से सभी"],
    answer:"EcoRI"
},
{
    question: "Cri-du-chat सिंड्रोम किस गुणसूत्रीय aberration के कारण होता है?",
    option:["Inversion","Translocation","Deletion","Duplication"],
    answer:"Deletion"
},
{
    question: "किसी शुक्राणु में केन्द्रकयुक्त आनुवंशिक पदार्थ किसमें पाया जाता है?",
    option:["एक्रोसोम","सिर","मध्य पीस","पूँछ"],
    answer:"सिर"
},
{
    question: "वाहितमल के प्राथमिक उपचार में किन क्रियाओं का उपयोग होता है?",
    option:["प्लवन","छानन","निस्पंदन","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "आबादी का स्थान होता है:",
    option:["स्पीशीज","स्पीशीज के अधीनस्थ","समुदाय का","स्पीशीज के बराबर"],
    answer:"स्पीशीज के अधीनस्थ"
},
{
    question: "शुक्राणुजनन का नियंत्रण किसके द्वारा होता है?",
    option:["एस्ट्रोजन","LH","एंड्रोजन","इनमें से कोई नहीं"],
    answer:"एंड्रोजन"
},
{
    question: "इनमें कौन ठहरे हुए पानी में उगकर ऑक्सीजन खींच लेता है?",
    option:["जलकुंभी","हाइड्रिला","कमल","धान"],
    answer:"जलकुंभी"
},
{
    question: "किसी निश्चित भू-भाग में ही पाए जाने वाले जीवों को किस संज्ञा से जाना जाता है?",
    option:["एंडेमिक","वैश्विक","महामारी","इनमें से कोई नहीं"],
    answer:"एंडेमिक"
},
{
    question: "O रक्तसमूह वाले पिता तथा O समूह वाले बच्चे का जीनोटाइप होगा",
    option:["IᴬIᴬ","Iᴬi","IᴬIᴮ","ii"],
    answer:"ii"
},
{
    question: "एक जाति के लिए अनुपात नियम है:",
    option:["T+C/G+A","A+C/T+G","G+C/A+T","A+C/C+T"],
    answer:"A+C/T+G"
},
{
    question: "युग्मक संलयन पूर्ण होने पर क्या होता है",
    option:["युग्मनज (zygote) की रचना होती है","त्रिगुणित/त्रिसंलयन होता है","दोहरा निषेचन होता है","उपरोक्त सभी कार्य होते हैं"],
    answer:"युग्मनज (zygote) की रचना होती है"
},
{
    question: "पारिस्थितिक पिरामिड होते हैं:",
    option:["दो प्रकार के","तीन प्रकार के","चार प्रकार के","पाँच प्रकार के"],
    answer:"तीन प्रकार के"
},
{
    question: "समताप मंडल में UV विकिरण अवशोषित करता है:",
    option:["O₂","O₃","SO₂","Ar"],
    answer:"O₃"
},
{
    question: "निम्नलिखित में कौन-सा गोलकार (globular) प्रोटीन का उदाहरण है?",
    option:["मायोसिन","कोलेजन","कीराटिन","हीमोग्लोबिन"],
    answer:"हीमोग्लोबिन"
},
{
    question: "किसी कोशिका में सबसे अधिक पाया जाने वाला RNA है:",
    option:["t-RNA","r-RNA","m-RNA","hn-t-RNA"],
    answer:"r-RNA"
},
{
    question: "आनुवंशिक अपवाहन किसकी जीन आवृत्ति में परिवर्तन लाता है?",
    option:["प्रथम पीढ़ी","अगली पीढ़ी","अप्रभावी जीन","प्रभावी जीन"],
    answer:"अगली पीढ़ी"
},
{
    question: "चेचक किसके कारण होता है?",
    option:["विषाणु","जीवाणु","कवक","मच्छड़"],
    answer:"विषाणु"
},
{
    question: "मोनोक्लोनल एन्टीबॉडीज प्राप्त की जाती हैं:",
    option:["एक प्रतिजन के लिए एक पैतृक से","एक प्रतिजन के लिए भिन्न पैतृकों से","अनेक प्रतिजनों के लिए एक पैतृक से","अनेक प्रतिजनों के लिए अनेक पैतृकों से"],
    answer:"एक प्रतिजन के लिए एक पैतृक से"
},
{
    question: "गंगाजल में शव को प्रवाहित करने से क्या होता है?",
    option:["घुलित ऑक्सीजन में कमी","BOD में वृद्धि","जीवाणुओं में वृद्धि","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "जलाशयों में सुपोषण के लिए सबसे प्रभावशाली है:",
    option:["अकार्बनिक फॉस्फेट","कार्बनिक पदार्थ","शैवाल","जीवाणु"],
    answer:"अकार्बनिक फॉस्फेट"
},
{
    question: "शरीर के बाहर होने वाले निषेचन को क्या कहते हैं?",
    option:["इन विट्रो","इन वीवो","(A) और (B) दोनों","इनमें से कोई नहीं"],
    answer:"इन विट्रो"
},
{
    question: "ओजोन परत का क्षय इनमें से किसके कारण होता है?",
    option:["कार्बन डाइऑक्साइड","क्लोरोफ्लोरोकार्बन","पैन (PAN)","इनमें से कोई नहीं"],
    answer:"क्लोरोफ्लोरोकार्बन"
},
{
    question: "चिपको आंदोलन चलाया गया",
    option:["मध्यप्रदेश में","उत्तराखंड में","हरियाणा में","दिल्ली में"],
    answer:"उत्तराखंड में"
},
{
    question: "निम्नलिखित वैज्ञानिकों में से किसने प्रोटीनयुक्त संरचनाओं को कोएसरवेट नाम दिया?",
    option:["ओपेरिन द्वारा","हेल्डेन द्वारा","डार्विन द्वारा","इन सभी के द्वारा"],
    answer:"ओपेरिन द्वारा"
},
{
    question: "किसी भी जीन की अनभिव्यक्ति इनमें से किसके द्वारा संपादित होती है?",
    option:["छोटा व्यतिकारी RNA (RNAi)","एंटीसेन्स RNA","A एवं B दोनों","इनमें से कोई नहीं"],
    answer:"A एवं B दोनों"
},
{
    question: "जीवन की रासायनिक उत्पत्ति का सिद्धान्त किसके द्वारा बताया गया?",
    option:["मिलर व फॉक्स","ओपेरिन व हाल्डेन","मिलर व वाटसन","वाटसन व मेल्विन"],
    answer:"ओपेरिन व हाल्डेन"
},
{
    question: "तम्बाकू की तरह के पौधों में Polygenic आनुवंशिकता का अध्ययन सर्वप्रथम किसने किया था?",
    option:["डेवेनपोर्ट","निल्सन-इहले","कोलरियूटर","गैल्टन"],
    answer:"कोलरियूटर"
},
{
    question: "भूमि-फलनी फल है",
    option:["आलू","मूंगफली","प्याज","अदरक"],
    answer:"मूंगफली"
},
{
    question: "नियो-डार्विनिज्म द्वारा डार्विनिज्म के सिद्धांत में मुख्य परिवर्तन किया गया",
    option:["विभिन्नता के उद्गम में","प्राकृतिक चयन की व्याख्या में","स्पीशीज निर्माण की व्याख्या में","आइसोलेशन की व्याख्या में"],
    answer:"विभिन्नता के उद्गम में"
},
{
    question: "DNA में कौन-सा नाइट्रोजन क्षार अनुपस्थित होता है?",
    option:["A","C","T","U"],
    answer:"U"
},
{
    question: "कौन-सा धान की संकर किस्म है?",
    option:["सोनारा","शरबती","जया","गंगा"],
    answer:"जया"
},
{
    question: "केन्द्रीय औषधि अनुसंधान संस्थान द्वारा कौन-सी गर्भनिरोधक गोली तैयार की गई है?",
    option:["माला-D","संयुक्त गोली","सहेली","निरोध"],
    answer:"सहेली"
},
{
    question: "बायोगैस में मिश्रित गैसों का नाम है:",
    option:["CH₄, H₂S, CO₂, CO","CH₄, H₂S, CO₂","CH₄, CO₂","CO, CH₄, H₂S"],
    answer:"CH₄, H₂S, CO₂"
},
{
    question: "निम्नलिखित में कौन-सा वाहन का exhaust नहीं है?",
    option:["SO₂","CO₂","CO","Fly ash (राख)"],
    answer:"Fly ash (राख)"
},
{
    question: "निम्न में परजीवी जंतु कौन-सा है?",
    option:["मछली","खरगोश","सूअर","उपरोक्त सभी"],
    answer:"उपरोक्त सभी"
},
{
    question: "जब हम ध्रुव से भूमध्यरेखा की ओर बढ़ते हैं तब जैव-विविधता",
    option:["बढ़ती है","घटती है","स्थिर रहती है","इनमें से कोई नहीं"],
    answer:"बढ़ती है"
},
{
    question: "मासिक धर्म के आरंभ से स्रावित होने वाले हॉर्मोन के क्रम हैं",
    option:["FSH, प्रोजेस्ट्रॉन, इस्ट्रोजेन","इस्ट्रोजेन, FSH, प्रोजेस्ट्रॉन","FSH, इस्ट्रोजेन, प्रोजेस्ट्रॉन","इस्ट्रोजेन, प्रोजेस्ट्रॉन, FSH"],
    answer:"FSH, इस्ट्रोजेन, प्रोजेस्ट्रॉन"
},
{
    question: "बैक्टीरिया को किसने खोजा था?",
    option:["कोच","ल्यूवेनहुक","पाश्चर","इनमें से कोई नहीं"],
    answer:"ल्यूवेनहुक"
},
{
    question: "उष्ण कटिबंधीय वनों में कुछ प्रजातियों की विलुप्ति का मुख्य कारण है।",
    option:["वनोन्मूलन","वृक्षारोपण","प्रदूषण","मृदा अपरदन"],
    answer:"वनोन्मूलन"
},
{
    question: "निम्नलिखित अणु पहला आनुवंशिक पदार्थ बना:",
    option:["DNA","RNA","प्रोटीन","उपर्युक्त में कोई नहीं"],
    answer:"RNA"
},
{
    question: "इनमें से कौन नर युग्मक से संयोजन करके भ्रूणपोष बनता है",
    option:["अनिषेचित अंड","सहायक कोशिका","एंटीपोडल्स","द्वितीयक केन्द्रक"],
    answer:"द्वितीयक केन्द्रक"
},
{
    question: "टैपेटम का कार्य है",
    option:["सुरक्षा","पोषण","श्वसन","उपरोक्त सभी"],
    answer:"पोषण"
},
{
    question: "पारिस्थितिक तंत्र नहीं है एक",
    option:["खुला तंत्र","बंद तंत्र","अस्थिर तंत्र","इनमें से कोई नहीं"],
    answer:"बंद तंत्र"
},
{
    question: "परखनली शिशु के संबंध में सत्य है:",
    option:["मादा के जननांग में निषेचन तथा परखनली में वृद्धि","जन्मपूर्व शिशु को इन्क्यूबेटर में रखना","जननांगों से बाहर निषेचन तथा गर्भाशय में परिवर्धन","निषेचन तथा परिवर्धन गर्भाशय के बाहर"],
    answer:"जननांगों से बाहर निषेचन तथा गर्भाशय में परिवर्धन"
},
{
    question: "मानव प्लेसेन्टा होता है",
    option:["हीमोकोरियल","सिनडेस्मोकोरियल","पीत कोष","हीमोएण्डोथीलियल"],
    answer:"हीमोकोरियल"
},
{
    question: "DNA के रूप में हेलिक्स का एक चक्कर होता है:",
    option:["20 Å","2 nm","20 nm","34 nm"],
    answer:"34 nm"
},
{
    question: "निम्नलिखित में कौन-सी संयुक्त कड़ी पक्षी एवं सरीसृप के बीच है?",
    option:["सीमैरिया","आर्कियोप्टेरिक्स","पेरिपेटस","डिप्नोई"],
    answer:"आर्कियोप्टेरिक्स"
},
{
    question: "कौन मीसोडर्मल उत्पत्ति का नहीं है?",
    option:["तन्त्रिका तंत्र","परिसंचरण तंत्र","पेशी तंत्र","कंकाल तंत्र"],
    answer:"तन्त्रिका तंत्र"
},
{
    question: "RNA संबंधन के पश्चात् कौन-सा एंजाइम एक्सॉन खण्डों को पुनः जोड़ता है?",
    option:["RNA पॉलीमरेज","RNA प्राइमेस","RNA लाइगेज","RNA प्रोटिएज"],
    answer:"RNA लाइगेज"
},
{
    question: "एस्ट्रोजन और प्रोजेस्टेरोन स्रावित होता है",
    option:["अंडाशय","वृषण","अपरा","किडनी"],
    answer:"अपरा"
},
{
    question: "शुक्राणु बनने की क्रियाविधि को कहते हैं:",
    option:["शुक्राणुजनन","मादाजनन","युग्मकजनन","अंगजनन"],
    answer:"शुक्राणुजनन"
},
{
    question: "एड्स के लिए स्क्रीनिंग परीक्षण है:",
    option:["वेस्टर्न ब्लॉट","एलिसा","PCR","सदर्न ब्लॉट"],
    answer:"एलिसा"
},
{
    question: "रोग के विरुद्ध प्रतिरोधकता किस कारण होती है?",
    option:["इम्यूनोग्लोब्यूलिन","HLA प्रोटीन","प्रतिजन","हिस्टामीन"],
    answer:"इम्यूनोग्लोब्यूलिन"
},
{
    question: "मनुष्य में किस cord द्वारा वृषण scrotal sac से जुड़ा होता है?",
    option:["Gubernaculum","Ligament","Spermatic cord","Spemann"],
    answer:"Gubernaculum"
},
{
    question: "टर्नर सिंड्रोम में मौजूद बार-बॉडी की संख्या होती है",
    option:["0","1","2","8"],
    answer:"0"
},
{
    question: "किसी मादा में blastocyst के लिए क्या सही है?",
    option:["यह Implantation से पहले प्लासेंटा बनता है।","अंडोत्सर्जन के तीन दिन बाद Implanted होता है","Implantation के बाद गर्भाशय की दीवार से पोषक पदार्थ लेता है","Implantation के साथ trophoblast कोशिका द्वारा Implanted होता है"],
    answer:"Implantation के साथ trophoblast कोशिका द्वारा Implanted होता है"
},
{
    question: "ओजोन परत किस स्तर पर पाई जाती है?",
    option:["स्ट्रैटोस्फियर","लीथोस्फियर","ट्रोपोस्फियर","हेमोस्फीयर"],
    answer:"स्ट्रैटोस्फियर"
},
{
    question: "वायुमंडल में CO₂ की सांद्रता में वृद्धि हानिकारक है क्योंकि यह:",
    option:["धूम बनाता है","ताप अवशोषित करता है","श्वसन संबंधी रोग उत्पन्न करता है","त्वचा रोग उत्पन्न करता है"],
    answer:"ताप अवशोषित करता है"
},
{
    question: "भ्रूण के विकास की क्रिया को कहते हैं:",
    option:["Vivipary","पार्थेनोजेनेसिस","Embryogenesis","स्पोरोजेनेसिस"],
    answer:"Embryogenesis"
},
{
    question: "‘गोल्डेन राइस’ में कौन-सा विटामिन प्रचुर मात्रा में रहता है?",
    option:["विटामिन A","विटामिन K","विटामिन E","विटामिन C"],
    answer:"विटामिन A"
},
{
    question: "इनमें कौन क्राई जीन फसल को छेदक से बचाता है?",
    option:["cry I Ac","cry II Ab","cry I Ab","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "किसी निषेचन के समय शुक्राणु की पूँछ",
    option:["अंडाणु के अंदर प्रवेश कर जाती है","अंडाणु के बाहर ही रह जाती है","अंडा के प्लाज्माझिल्ली तक पहुँचती है","अंडा के कोशिकाद्रव्य तक पहुँचती है"],
    answer:"अंडाणु के बाहर ही रह जाती है"
},
{
    question: "ऊतक संवर्धन द्वारा बड़ी संख्या में प्लांटलेट्स प्राप्त करने की तकनीक कहलाती है।",
    option:["ऑर्गन कल्चर","सूक्ष्म प्रवर्धन","मैक्रोप्रोपेगेशन","प्लांटलेट कल्चर"],
    answer:"सूक्ष्म प्रवर्धन"
},
{
    question: "सुजाक (गोनोरिया) रोग है:",
    option:["जल जनित रोग","हवा जनित रोग","यौन संचारित रोग","रोग नहीं है"],
    answer:"यौन संचारित रोग"
},
{
    question: "एनाटॉपस बीजांड होता है",
    option:["सीधा","उल्टा","गोल","वक्र"],
    answer:"उल्टा"
},
{
    question: "अबुर्दीय विषाणु कारक हैं:",
    option:["पोलियो","क्षय-रोग","पीलिया","कैंसर"],
    answer:"कैंसर"
},
{
    question: "इनमें से कौन वायु प्रदूषक नहीं है?",
    option:["CO","CO₂","SO₂","कोई भी नहीं"],
    answer:"कोई भी नहीं"
},
{
    question: "किसी जीव का विकासीय इतिहास कहलाता है",
    option:["ऑन्टोजेनी","फाइलोजेनी","पूर्वजता","जीवाश्मिकी"],
    answer:"फाइलोजेनी"
},
{
    question: "सोमैटिक हाइब्रिडाइजेशन संपादित किया जा सकता है।",
    option:["प्रोटोप्लास्ट संलयन द्वारा","अगुणित परागकोष द्वारा","कोशिका कल्चर द्वारा","टोटीपोटेंसी द्वारा"],
    answer:"प्रोटोप्लास्ट संलयन द्वारा"
},
{
    question: "Implantation के बाद Parturition होता है, इसका तात्पर्य है",
    option:["भ्रूण का अलग होना","भ्रूण का विकास","जन्म की क्रिया","गर्भाशय का सिकुड़न"],
    answer:"जन्म की क्रिया"
},
{
    question: "Entomophily में परागण किसके द्वारा होता है",
    option:["जल","कीट","जानवर","वायु"],
    answer:"कीट"
},
{
    question: "मानवों में त्वचा के रंग की वंशागति किसका एक उदाहरण है?",
    option:["गुणसूत्र विपथन","बिन्दु उत्परिवर्तन","बहुजीनी वंशागति","सहप्रभाविता"],
    answer:"बहुजीनी वंशागति"
},
{
    question: "मेंडल के नियम का एक अपवाद है",
    option:["प्रभाविता","युग्म की शुद्धता","सहलग्नता","स्वतंत्र अपव्यूहन"],
    answer:"सहलग्नता"
},
{
    question: "द्विखण्डन एक प्रकार का",
    option:["कायिक प्रवर्द्धन है","अलैंगिक जनन है","लैंगिक जनन है","इनमें से कोई नहीं"],
    answer:"अलैंगिक जनन है"
},
{
    question: "XYY पर लक्षण दर्शाता है",
    option:["अविकसित जननांग, वन्ध्य, अविकसित छाती","लंबाई में अधिक, सामान्य जननांग विकास तथा व्यवहार संबंधी समस्याएँ","सामान्य ऊँचाई एवं जननांग का सामान्य विकास","उपर्युक्त में से कोई नहीं"],
    answer:"लंबाई में अधिक, सामान्य जननांग विकास तथा व्यवहार संबंधी समस्याएँ"
},
{
    question: "खाद्य उत्पादन में वृद्धि हेतु कौन-सी संभावना हम सोच सकते हैं?",
    option:["कृषि रसायन आधारित कृषि","कार्बनिक कृषि","आनुवंशिक आधारित कृषि","उपरोक्त सभी"],
    answer:"उपरोक्त सभी"
},
{
    question: "कैंसर का कारक है:",
    option:["ऑन्कोजीन्स","अबुर्दीय विषाणु","दोनों (A) तथा (B)","इनमें से कोई नहीं"],
    answer:"दोनों (A) तथा (B)"
},
{
    question: "निम्नलिखित में कौन-सा 7 pairs contrasting characters को नहीं दर्शाता है?",
    option:["पौधों की ऊँचाई","पत्तियों का आकार","Pod का आकार","Pod का रंग"],
    answer:"Pod का आकार"
},
{
    question: "DNA की जाँच की विधि है:",
    option:["आयोडीन टेस्ट","फ्यूलजेन रिएक्शन","रोलिश टेस्ट","मिलॉन्स रीएजेंट"],
    answer:"फ्यूलजेन रिएक्शन"
},
{
    question: "एंटीबॉडी रासायनिक रूप से होता है:",
    option:["प्रोटीन","लिपोप्रोटीन","लिपिड","न्यूक्लियोप्रोटीन"],
    answer:"प्रोटीन"
},
{
    question: "'क्राई-जीन' बॉलकृमि से किस फसल को बचाता है?",
    option:["कपास","आम","चाय","गेहूँ"],
    answer:"कपास"
},
{
    question: "प्राइमर्स (Primers) का उपयोग किया जाता है:",
    option:["PCR","क्लोनिंग में","DNA संसाधन में","इनमें से कोई नहीं"],
    answer:"PCR"
},
{
    question: "एक द्विवलीय DNA अणु में दो वलयों का विन्यास होता है:",
    option:["एक मुख्य अक्ष के चारों ओर कुंडली द्वारा","एक-दूसरे के ऊपर कुंडलित द्वारा","विभिन्न रूपों में कुंडलित","प्रोटीन आवरण के ऊपर कुंडलित"],
    answer:"एक मुख्य अक्ष के चारों ओर कुंडली द्वारा"
},
{
    question: "पूर्ण लिंकेज दिखाई पड़ती है",
    option:["मक्का में","स्त्री में","मादा ड्रोसोफिला में","नर ड्रोसोफिला में"],
    answer:"नर ड्रोसोफिला में"
},
{
    question: "निम्न में से कौन पत्ती के अग्र भाग द्वारा जनन करता है?",
    option:["वाकिंग फर्न","स्प्राउट लीफ पौधा","मारकेसिया","मॉस"],
    answer:"वाकिंग फर्न"
},
{
    question: "जीन को सिस्ट्रॉन, रिकॉन एवं म्यूटॉन के रूप में किसने परिभाषित किया था?",
    option:["जैकब एवं मोनोद","ब्रिटन एवं डेविडसन","वाटसन एवं क्रिक","बेंजर"],
    answer:"बेंजर"
},
{
    question: "वायुमंडलीय नाइट्रोजन को कौन स्थिरीकृत करता है?",
    option:["साइनोबैक्टीरिया","शैवाल","विषाणु","इनमें से कोई नहीं"],
    answer:"साइनोबैक्टीरिया"
},
{
    question: "मानव साधारणतया ध्वनि तीव्रता सहन कर सकता है:",
    option:["20–30 डेसीबेल","80–90 डेसीबेल","120–130 डेसीबेल","140–150 डेसीबेल"],
    answer:"120–130 डेसीबेल"
},
{
    question: "वायुमंडलीय आर्द्रता को किससे मापा जाता है?",
    option:["ऑक्सेनोमीटर","हाइग्रोमीटर","फोटोमीटर","पोटोमीटर"],
    answer:"हाइग्रोमीटर"
},
{
    question: "Amphimixis से तात्पर्य है",
    option:["Antifertilizin एवं Fertilizin प्रोटीन के बीच प्रतिक्रिया","नर एवं मादा प्रतिकेन्द्रकों का संयोजन","अंडाणु द्वारा संग्रही शंकु का निर्माण","शुक्राणु द्वारा अंडाणु का छेदन"],
    answer:"नर एवं मादा प्रतिकेन्द्रकों का संयोजन"
},
{
    question: "भ्रूणावस्था में सभी ऊतक का निर्माण किससे होता है?",
    option:["Ectoderm","Mesoderm","Endoderm","Stem cells"],
    answer:"Stem cells"
},
{
    question: "किस RNA का क्लोवर लीफ मॉडल होता है?",
    option:["t-RNA","r-RNA","hn-RNA","m-RNA"],
    answer:"t-RNA"
},
{
    question: "जन्म से लेकर प्राकृतिक मृत्यु के बीच की अवस्था को कहते हैं:",
    option:["जीवन-काल","जीवन चक्र","कायिक अवस्था","सभी"],
    answer:"जीवन-काल"
},
{
    question: "जनसंख्या अधिक होने से क्या होता है?",
    option:["आय में कमी","जमीन में कमी","खनिज पदार्थ की कमी","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "पौधों की जड़ों में ट्यूमर पैदा करता है:",
    option:["E. coli","एग्रोबैक्टीरियम","थर्मस एक्वेटिकस","इनमें से कोई नहीं"],
    answer:"एग्रोबैक्टीरियम"
},
{
    question: "दात्र कोशिका अरक्तता में बीटा ग्लोबिन जीन के GAG codon का किस codon से प्रतिस्थापन हो जाता है?",
    option:["GUG","GCG","GGG","उपर्युक्त में कोई नहीं"],
    answer:"GUG"
},
{
    question: "DNA को देखने के लिए प्रयुक्त होता है:",
    option:["इथीडियम ब्रोमाइड","एनीलीन ब्लू","सेफ्रेनीन","फास्ट ग्रीन"],
    answer:"इथीडियम ब्रोमाइड"
},
{
    question: "तीन परतों वाली संरचना जिसके अंदर एक नयी गुहा आद्यंत्र (Archenteron) बन गयी होती है, कहलाती है:",
    option:["ब्लास्टूला","गैस्ट्रुला","विद्लन","इनमें से कोई नहीं"],
    answer:"गैस्ट्रुला"
},
{
    question: "इनमें से कौन एक जैव खाद नहीं है?",
    option:["अजोटोबैक्टर","बैसिलस थुरिन्जिएंसिस","क्लॉस्ट्रिडियम","अजोला"],
    answer:"बैसिलस थुरिन्जिएंसिस"
},
{
    question: "कोला, चाय व कोको में पाया जाने वाला उत्तेजक है:",
    option:["कोकीन","टेनिन","एम्फीटामीन","कैफीन"],
    answer:"कैफीन"
},
{
    question: "स्वपरागण के लिए एक पुष्प को होना चाहिए",
    option:["अलैंगिक","एकललिंगी","एकलिंगी","द्विलिंगी"],
    answer:"द्विलिंगी"
},
{
    question: "आम के फल में खाने वाला भाग है –",
    option:["बाह्य फल भित्ति","मध्य फल भित्ति","अन्तः फल भित्ति","इनमें से कोई नहीं"],
    answer:"मध्य फल भित्ति"
},
{
    question: "निम्नांकित में से कौन विलुप्त प्राणी है?",
    option:["शेर","डोडो","मोर","इनमें से सभी"],
    answer:"डोडो"
},
{
    question: "आवृत्तबीजियों में मादा युग्मकोद्भिद् कहलाता है",
    option:["भ्रूणपोष","भ्रूणकोष","भ्रूण","युग्मनज"],
    answer:"भ्रूणकोष"
},
{
    question: "अनुप्रवाह संसाधन में क्या होता है?",
    option:["पृथक्करण","शोधन","पृथक्करण तथा शोधन","उत्पादन"],
    answer:"पृथक्करण तथा शोधन"
},
{
    question: "कैंसर बीमारी का उपचार है:",
    option:["शल्य-चिकित्सा","कीमोथेरैपी","रेडियोथेरैपी","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "ब्रेड बनाने में इस्तेमाल होता है:",
    option:["जीवाणु","बेकर यीस्ट","स्यूडोमोनास","इनमें से कोई नहीं"],
    answer:"बेकर यीस्ट"
},
{
    question: "यदि माता का रक्त समूह A तथा पिता का AB हो तो शिशु का रक्त-समूह क्या हो सकता है?",
    option:["AB","A या B","A, B या AB","O सिर्फ"],
    answer:"A, B या AB"
},
{
    question: "आनुवंशिकी के पिता किसे कहते हैं?",
    option:["मेंडल","मॉर्गन","लेमार्क","डि व्रीज"],
    answer:"मेंडल"
},
{
    question: "निम्न में से जैव प्रौद्योगिकी का अनुसंधान क्षेत्र कौन-सा है?",
    option:["उन्नत जीवों का निर्माण करना","सर्वोत्तम परिस्थितियों का निर्माण करना","प्रोटीन/कार्बनिक यौगिक के शुद्धिकरण में उपयोग करना","उपरोक्त सभी"],
    answer:"उपरोक्त सभी"
},
{
    question: "यूकैरिओट्स में पाए जाने वाले नॉनकोडिंग क्रम को क्या कहते हैं?",
    option:["प्रोमोटर","एक्सोन","इंट्रोन","विखंडित जीन"],
    answer:"इंट्रोन"
},
{
    question: "RU-486 दवा प्रयोग की जाती है:",
    option:["गर्भनिरोधन में","एम्नियोसेन्टेसिस","गर्भपात कारक के रूप में","म्यूटाजन के रूप में"],
    answer:"गर्भपात कारक के रूप में"
},
{
    question: "स्टर्टोली कोशिकाएँ पायी जाती हैं",
    option:["वृषण में","गर्भाशय में","अंडाशय में","यकृत में"],
    answer:"वृषण में"
},
{
    question: "भोपाल गैस त्रासदी किस गैस के रिसाव से हुई?",
    option:["PAN","स्मॉग","मिथाइल आइसोसाइनेट","SO₂"],
    answer:"मिथाइल आइसोसाइनेट"
},
{
    question: "माइक्रोस्पोरेंजियम की आंतरिक भित्ति जो पोषक होती है, उसे क्या कहते हैं",
    option:["एन्डोथीसियम","इंटाइन","टैपीटम","मध्य स्तर"],
    answer:"टैपीटम"
},
{
    question: "वह स्थान जहाँ बीजाण्ड, बीजाण्डवृन्त से जुड़ता है",
    option:["Chalaza","बीजाण्डद्वार","बीजाण्डकाय","नाभिका"],
    answer:"नाभिका"
},
{
    question: "टमाटर की ट्रांसजेनिक किस्म है:",
    option:["बीटी कपास","पामफ्रेट","फ्लेवर सेवर","इनमें से कोई नहीं"],
    answer:"फ्लेवर सेवर"
},
{
    question: "DNA से mRNA बनाने की क्रिया को क्या कहते हैं?",
    option:["ट्रांसक्रिप्शन","रिप्लिकेशन","ट्रांसलेशन","इनमें से कोई नहीं"],
    answer:"ट्रांसक्रिप्शन"
},
{
    question: "जब संतति की उत्पत्ति एकल जनक द्वारा होती है तब यह क्या कहलाता है?",
    option:["लैंगिक जनन (sexual reproduction)","अलैंगिक जनन (asexual reproduction)","(A) और (B) दोनों","आंतरिक निषेचन (Internal fertilization)"],
    answer:"अलैंगिक जनन (asexual reproduction)"
},
{
    question: "SO₂ प्रदूषण से प्रभावित होता है:",
    option:["माइटोकॉन्ड्रिया","क्लोरोप्लास्ट","गॉल्जी निकाय","ER"],
    answer:"क्लोरोप्लास्ट"
},
{
    question: "Nodes को ‘आँख’ कहते हैं, जो निम्नलिखित में से किसमें नया पौधा बनाते हैं?",
    option:["अदरक","ब्रायोफायलम","एलोकेसिया","आलू"],
    answer:"आलू"
},
{
    question: "मनुष्य में ABO रुधिर समूह का निर्धारण तीन alleles से होता है। इनसे कितने genotypes संभव हैं?",
    option:["3","4","6","8"],
    answer:"6"
},
{
    question: "पादप संवर्धन होता है।",
    option:["पुतंदु","पुंकेसर","परागकोष","पुंमंग"],
    answer:"परागकोष"
},
{
    question: "जेल वैद्युत का संचलन (इलेक्ट्रोफोरेसिस) का उपयोग होता है:",
    option:["DNA को पृथक करने के लिए","RNA को पृथक करने के लिए","प्रोटीन को पृथक करने के लिए","सभी को पृथक करने के लिए"],
    answer:"सभी को पृथक करने के लिए"
},
{
    question: "निषेचन के समय किसी प्रारूपिक द्विबीजपत्री (Polygonum) के मादा gametophyte होते हैं",
    option:["8-केन्द्रकीय 7-कोशीय","7-केन्द्रकीय 8-कोशीय","4-केन्द्रकीय 4-कोशीय","8-केन्द्रकीय 8-कोशीय"],
    answer:"8-केन्द्रकीय 7-कोशीय"
},
{
    question: "निम्नलिखित गैसों को सामान्यतः ग्रीनहाउस गैस कहते हैं:",
    option:["CFC, CH₄, N₂O एवं CO₂","CFC, CO₂, NH₃ एवं N₂","CO₂, CO, NH₃ एवं NO₂","CFC, N₂, CO₂ एवं NH₂"],
    answer:"CFC, CH₄, N₂O एवं CO₂"
},
{
    question: "Polynology में किसका अध्ययन करते हैं",
    option:["परागकण","बेर","पुष्प","फल"],
    answer:"परागकण"
},
{
    question: "कोलस्ट्रम में पाया जाने वाला एंटीबॉडी का प्रकार है:",
    option:["IgA","IgG","IgD","IgE"],
    answer:"IgA"
},
{
    question: "चीटियों द्वारा परागण को क्या कहते हैं",
    option:["ऑरनिथोफिली","मारमीकोफिली","मलेकोफिली","कापरोटीरोफिली"],
    answer:"मारमीकोफिली"
},
{
    question: "अनुलेखन के समय यदि DNA वलयक के न्यूक्लियोटाइड क्रम को ATACG द्वारा कोडित किया जाता है, तो mRNA में न्यूक्लियोटाइड का क्रम होगा:",
    option:["UATGC","TATGC","TCTGC","UAUGC"],
    answer:"UAUGC"
},
{
    question: "यौन-संचारित रोग है:",
    option:["क्लैमाइडिया","एड्स","हर्पिस","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "DNA इनमें से किसका आनुवंशिक पदार्थ है?",
    option:["टी०एम०वी०","बैक्टीरियोफेज","इनमें से दोनों का","किसी का नहीं"],
    answer:"बैक्टीरियोफेज"
},
{
    question: "प्रतिमाजक (Anticoagulant) हिरुडिन पायी जाती है:",
    option:["सर्प में","छिपकली में","जोंक में","बिच्छू में"],
    answer:"जोंक में"
},
{
    question: "कुक्कुट पालन में कोक्सिडियोसिस रोग का कारण है।",
    option:["प्रोटोजोआ परजीवी","निमैटोड परजीवी","विषाणु","फीताकृमि"],
    answer:"प्रोटोजोआ परजीवी"
},
{
    question: "उत्परिवर्तन प्रेरित किए जा सकते हैं",
    option:["एथिलीन द्वारा","इथाइल अल्कोहल द्वारा","गामा विकिरणों द्वारा","अवरक्त विकिरणों द्वारा"],
    answer:"गामा विकिरणों द्वारा"
},
{
    question: "‘विनेगार’ का खट्टा स्वाद किसके कारण होता है?",
    option:["लैक्टिक अम्ल","एसिटिक अम्ल","ब्यूटाइरिक अम्ल","फ्यूमेरिक अम्ल"],
    answer:"एसिटिक अम्ल"
},
{
    question: "गेंडा अभ्यारण्य किस राज्य में अवस्थित है?",
    option:["असम","पश्चिम बंगाल","उत्तर प्रदेश","बिहार"],
    answer:"असम"
},
{
    question: "दुधवा राष्ट्रीय उद्यान स्थित है",
    option:["लखीमपुर खीरी में","मथुरा में","नैनीताल में","काशी में"],
    answer:"लखीमपुर खीरी में"
},
{
    question: "कुछ एंजाइम अपनी क्रियाशीलता को बढ़ाने के लिए कौन-सा नॉन-प्रोटीन पदार्थ प्रयोग करते हैं?",
    option:["उत्प्रेरक","प्रतिरोधक","सह-एंजाइम","एपिमर"],
    answer:"सह-एंजाइम"
},
{
    question: "एथेनॉल के औद्योगिक उत्पादन में प्रयुक्त होता है:",
    option:["लैक्टोबैसिलस","एजोबैक्टर","पेनिसिलियम","सैकेरोमाइसीज"],
    answer:"सैकेरोमाइसीज"
},
{
    question: "गर्भ की प्रथम गति तथा इसके सिर पर बालों की उपस्थिति प्रायः गर्भावस्था के किस माह के दौरान अनुभव होती है?",
    option:["चौथे माह","पाँचवें माह","छठे माह","तीसरे माह"],
    answer:"पाँचवें माह"
},
{
    question: "वायुमंडलीय नाइट्रोजन को निम्न में से कौन स्थिरीकृत कर सकता है?",
    option:["ऐनाबीना","नॉसटॉक","ऑसिलेटोरिया","उपर्युक्त सभी"],
    answer:"उपर्युक्त सभी"
},
{
    question: "निम्नलिखित में से कौन-सा सिद्धांत विकास को जीन आवृत्ति के परिवर्तन का कारण मानता है?",
    option:["नव-लामार्किज्म","नव-डार्विनिज्म","संश्लेषणात्मक सिद्धांत","डार्विनिज्म"],
    answer:"संश्लेषणात्मक सिद्धांत"
},
{
    question: "मासिक चक्र की अवस्था जो 7-8 दिनों पर समाप्त होती है, कहलाती है",
    option:["रजोधर्म","लुटियल प्रावस्था","अण्डोत्सर्ग प्रावस्था","पुटिकीय प्रावस्था"],
    answer:"पुटिकीय प्रावस्था"
},
{
    question: "ड्रोसोफिला (Fruit fly) के Meiocyte में गुणसूत्र की संख्या होती है:",
    option:["2","4","6","8"],
    answer:"8"
},
{
    question: "स्थानांतरण की प्रक्रिया संबंधित है:",
    option:["DNA संश्लेषण","RNA संश्लेषण","राइबोसोम संश्लेषण","प्रोटीन संश्लेषण"],
    answer:"प्रोटीन संश्लेषण"
},
{
    question: "खाद्य श्रृंखला में सर्वाधिक आबादी किसकी होती है?",
    option:["उत्पादक","प्राथमिक उपभोक्ता","द्वितीयक उपभोक्ता","तृतीयक उपभोक्ता"],
    answer:"उत्पादक"
},
{
    question: "भारत का पहला राष्ट्रीय उद्यान है",
    option:["कॉर्बेट","बांदीपुर","कान्हा","पेरियार"],
    answer:"कॉर्बेट"
},
{
    question: "बड़े पैमाने पर वांछित प्रोटीन के निर्माण के लिए उत्पादक द्वारा किस पात्र का उपयोग किया जाता है?",
    option:["बायोरिएक्टर","फ्लास्क","टेस्ट ट्यूब","पेट्री प्लेट्स"],
    answer:"बायोरिएक्टर"
},
{
    question: "एक वयस्क मनुष्य के वृषण में शुक्राणु का निर्माण करने वाली शुक्रजननीय अवस्थाओं का सही क्रम है",
    option:["स्पर्मेटोसाइट-स्पर्मेटोगोनिया-स्पर्मेटिड-शुक्राणु","स्पर्मेटिड-स्पर्मेटोसाइट-स्पर्मेटोगोनिया-शुक्राणु","स्पर्मेटोसाइट-स्पर्मेटिड-स्पर्मेटोगोनिया-शुक्राणु","स्पर्मेटोगोनिया-स्पर्मेटोसाइट-स्पर्मेटिड-शुक्राणु"],
    answer:"स्पर्मेटोगोनिया-स्पर्मेटोसाइट-स्पर्मेटिड-शुक्राणु"
},
{
    question: "सेमल में किसके द्वारा परागण होता है",
    option:["चमगादड़","पक्षी","जल","वायु"],
    answer:"चमगादड़"
},
{
    question: "एक प्राथमिक शुक्राणु कोशिका है",
    option:["द्विगुणित","एकगुणित","त्रिगुणित","बहुगुणित"],
    answer:"द्विगुणित"
},
{
    question: "भारत में पहला राष्ट्रीय पार्क विकसित किया गया",
    option:["गिर","काजीरंगा","जिम कार्बेट","इनमें से कोई नहीं"],
    answer:"जिम कार्बेट"
},
{
    question: "द्विनिषेचन का परिणाम होता है:",
    option:["बीजपत्र","बीजाण्डकाय","भ्रूणपोष","भ्रूण"],
    answer:"भ्रूणपोष"
},
{
    question: "किस गैर-फली पौधे के जड़ पिंड में जैविक खाद मौजूद है?",
    option:["एजोटोबैक्टर","क्लॉस्ट्रिडियम","फ्रैंकिया","इनमें से कोई नहीं"],
    answer:"फ्रैंकिया"
},
{
    question: "परागकण के साथ परागनलिका प्रतिदर्शित करता है",
    option:["नर स्पोरोफाइट","नर गैमेटोफाइट","मादा स्पोरोफाइट","मादा गैमेटोफाइट"],
    answer:"नर गैमेटोफाइट"
},
{
    question: "संतान जो लगभग एक-दूसरे के Identical हो, साथ ही उनके Parent के भी Identical हो, कहलाती है:",
    option:["Twins","प्रतिलिपि बनाता है","ड्रोन्स","क्लोन"],
    answer:"क्लोन"
},
{
    question: "तेल अधिप्लाव (छलकन) के जैवोपचार में सफलतापूर्वक उपयोग की आनुवंशिकता इंजीनियरित सूक्ष्मजीव स्पीशीज किसकी है?",
    option:["स्यूडोमोनास","ट्राइकोडर्मा","जैथोमोनास","बेसिलस"],
    answer:"स्यूडोमोनास"
},
{
    question: "RNA के पाइरिमिडिन में पाया जाता है:",
    option:["साइटोसिन एवं थायमीन","एडिनीन एवं गुआनीन","साइटोसिन एवं यूरासिल","थायमीन एवं यूरासिल"],
    answer:"साइटोसिन एवं यूरासिल"
},
{
    question: "डाउन सिंड्रोम है",
    option:["21वें क्रोमोसोम की त्रिसूत्री","21वें क्रोमोसोम की द्विअधिसूत्री","21वें क्रोमोसोम की द्विन्यूनसूत्री","उपरोक्त में कोई नहीं"],
    answer:"21वें क्रोमोसोम की त्रिसूत्री"
},
{
    question: "मांसाहारी जीव निम्नलिखित में से क्या प्रदर्शित करता है",
    option:["प्राथमिक उपभोक्ता","द्वितीयक व तृतीयक उपभोक्ता","द्वितीयक उपभोक्ता","प्राथमिक उत्पादक"],
    answer:"द्वितीयक व तृतीयक उपभोक्ता"
},
{
    question: "तालाबीय पारिस्थितिक तंत्र में बड़ी मछली क्या होती है?",
    option:["उत्पादक","अपघटनकर्ता","प्राथमिक उपभोक्ता","तृतीयक उपभोक्ता"],
    answer:"तृतीयक उपभोक्ता"
},
{
    question: "निम्नलिखित में से कौन-सा पिरामिड कभी उल्टा नहीं होता?",
    option:["ऊर्जा का पिरामिड","जैवभार का पिरामिड","संख्या का पिरामिड","शुष्क भार का पिरामिड"],
    answer:"ऊर्जा का पिरामिड"
},
{
    question: "आलू के कन्द में ‘आँखें’ होती हैं:",
    option:["पुष्प कलिकाएँ","प्ररोह कलिकाएँ","कक्षस्थ कलिकाएँ","मूल कलिकाएँ"],
    answer:"कक्षस्थ कलिकाएँ"
},
{
    question: "निम्नलिखित में कौन-सा रक्त समूह मनुष्य तथा कपि में पाया जाता है पर बंदर में नहीं?",
    option:["A तथा O","A तथा B","AB तथा O","B तथा AB"],
    answer:"A तथा B"
},
{
    question: "अनुलेखन में भाग लेने वाला एंजाइम है:",
    option:["DNA पॉलीमरेज I","DNA पॉलीमरेज II","RNA पॉलीमरेज","DNA पॉलीमरेज III"],
    answer:"RNA पॉलीमरेज"
},
{
    question: "किसी भी पारिस्थितिक तंत्र में ऊर्जा का स्रोत होता है",
    option:["शर्करा का किण्वन","प्राणी एवं पौधों का जीवाणुओं द्वारा अपघटन","पौधों द्वारा प्रकाश संश्लेषण","सूर्य-प्रकाश"],
    answer:"सूर्य-प्रकाश"
},
{
    question: "फॉस्फोरस निम्नलिखित में किसका घटक है?",
    option:["न्यूक्लिक अम्ल","जैविक झिल्लियाँ","कोशिकीय ऊर्जा स्थानांतरण प्रणाली","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "निकोटीन है:",
    option:["क्षारीय","अमीनो अम्ल","अमीनो अम्ल","विटामिन"],
    answer:"क्षारीय"
},
{
    question: "अम्लीय वर्षा के कारण हैं:",
    option:["N₂ तथा NO₃","NO₂ तथा SO₂","CO तथा CO₂","CO₂ तथा NO₂"],
    answer:"NO₂ तथा SO₂"
},
{
    question: "निम्नलिखित में अल्पकालिक अंतःस्रावी ग्रंथि का कार्य करता है",
    option:["अण्डाशय","वृषण","ग्राफी पुटक","कॉर्पस ल्यूटियम"],
    answer:"कॉर्पस ल्यूटियम"
},
{
    question: "ऑन्कोलॉजी किसका अध्ययन है?",
    option:["कैंसर","ऑन्कोजीन्स","(A) और (B) दोनों","विषाणु"],
    answer:"कैंसर"
},
{
    question: "निम्नलिखित में कौन Anther wall का हिस्सा नहीं है",
    option:["Endothecium","Endothelium","Tapetum","Middle layers"],
    answer:"Endothelium"
},
{
    question: "प्रोस्टाग्लैंडीन है",
    option:["प्रोटीन","कार्बोहाइड्रेट","लिपिड","असंतृप्त"],
    answer:"असंतृप्त"
},
{
    question: "जन्म नियंत्रण की सर्वाधिक उपयुक्त विधि है:",
    option:["गर्भपात","मुखीय गोलियाँ","वीर्यसेचन","बंध्याकरण"],
    answer:"बंध्याकरण"
},
{
    question: "थक्का स्फोटन के रूप में उपयोग में लाया जाने वाला एन्जाइम है:",
    option:["लाइपेज","एमाइलेज","स्ट्रेप्टोकाइनेज","प्रोटीएजेज"],
    answer:"स्ट्रेप्टोकाइनेज"
},
{
    question: "परपोषी कोशिकाओं में विजातीय DNA को प्रवेश कराने के लिए किनका उपयोग किया जाता है?",
    option:["सूक्ष्म अंतःक्षेपण","जीन गन","अहानिकारक रोगजनक","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "कौन-सा उत्पाद औषधीय महत्त्व का है?",
    option:["पेठा","कॉफी","ग्रेडी फ्लोरा","राउल्फिया सर्पेन्टिना"],
    answer:"राउल्फिया सर्पेन्टिना"
},
{
    question: "निम्नलिखित में से कौन सही आहार श्रृंखला है?",
    option:["टिड्डा → घास → सर्प → मेंढक → बाज","घास → टिड्डा → मेंढक → सर्प → बाज","बाज → सर्प → टिड्डा → घास → मेंढक","मेंढक → सर्प → बाज → टिड्डा → बाज"],
    answer:"घास → टिड्डा → मेंढक → सर्प → बाज"
},
{
    question: "पुष्पीय पौधों के भ्रूणपोष में कितने गुणसूत्र होते हैं",
    option:["n","2n","3n","4n"],
    answer:"3n"
},
{
    question: "Ti-प्लाज्मिड पाया जाता है:",
    option:["एग्रोबैक्टिरियम ट्यूमीफेसीयन्स में","ई. कोलाई में","जीवाणु भोजी में","इनमें से सभी में"],
    answer:"एग्रोबैक्टिरियम ट्यूमीफेसीयन्स में"
},
{
    question: "विषाणु आक्रमण से बचाव के लिए जीवाणु द्वारा उत्पादित होता है:",
    option:["Exonuclease","Endonuclease","DNA लिगेज","गाइरेज"],
    answer:"Endonuclease"
},
{
    question: "इनमें से पश्चविषाणु (Retrovirus) कौन है?",
    option:["ह्यूमन इम्यूनो डेफिसिएंसी वायरस","हेपेटाइटिस वायरस","माइक्रो वायरस इन्फ्लूएंजी","इनमें से सभी"],
    answer:"ह्यूमन इम्यूनो डेफिसिएंसी वायरस"
},
{
    question: "अगर किसी पारिस्थितिक तंत्र से अपघटकों को नष्ट कर दिया जाए तो क्या होगा?",
    option:["ऊर्जा का प्रवाह रुक जाएगा","खनिजों का प्रवाह रुक जाएगा","अपघटन की दर बढ़ जाएगी","प्रकाशसंश्लेषण की क्रिया रुक जाएगी"],
    answer:"खनिजों का प्रवाह रुक जाएगा"
},
{
    question: "दुग्ध ग्रंथि किसका रूपांतरण है?",
    option:["तेल ग्रंथि","स्वेद् ग्रंथि","काउपर्स ग्रंथि","बर्थोलिंस ग्रंथि"],
    answer:"स्वेद् ग्रंथि"
},
{
    question: "‘स्मॉग’ किससे संबंधित है?",
    option:["धुआँ तथा कुहासा","आग एवं जल","जल तथा धुआँ","वायु तथा जल"],
    answer:"धुआँ तथा कुहासा"
},
{
    question: "क्लोरोफ्लोरोकार्बन उत्तरदायी है:",
    option:["अम्ल वर्षा","ओजोन परत क्षरण के लिए","ग्लोबल वार्मिंग के लिए","तापीय प्रतिलोमन के लिए"],
    answer:"ओजोन परत क्षरण के लिए"
},
{
    question: "Ovule की सबसे बड़ी कोशिका है",
    option:["MMC","परिवर्तनशील कोशिका का आकार","मध्य कोशिका","Antipodal"],
    answer:"मध्य कोशिका"
},
{
    question: "उस वैज्ञानिक का नाम क्या है जिसने वंशागति के नियम दिए?",
    option:["ग्रेगर मेंडल","न्यूटन","पुनेट","इनमें से कोई नहीं"],
    answer:"ग्रेगर मेंडल"
},
{
    question: "भारत में जैवमण्डल रिजर्व कब प्रारम्भ किया था?",
    option:["1984","1985","1986","1987"],
    answer:"1986"
},
{
    question: "किसके लिए लैंगिक प्रजनन जिम्मेदार है?",
    option:["द्विगुणित अवस्था को बनाने हेतु","Identical young ones के सृजन हेतु","विकासवाद में कोई भूमिका नहीं","एकगुणित (Haploid) अवस्था को बनाने हेतु"],
    answer:"द्विगुणित अवस्था को बनाने हेतु"
},
{
    question: "एक्रोसोम भाग है",
    option:["डी.एन.ए. (DNA)","आर.एन.ए. (RNA)","शुक्राणु का","इनमें से सभी का"],
    answer:"शुक्राणु का"
},
{
    question: "किसी ovule का शरीर, embryo sac, micropyle तथा funicle यदि एक सीध में हो तो इसे कहते हैं",
    option:["Orthotropous","Amphitropous","Anatropous","Campylotropous"],
    answer:"Orthotropous"
},
{
    question: "वंशागति के क्रोमोसोम सिद्धांत को किसने प्रतिपादित किया?",
    option:["ग्रेगर मेंडल ने","सटन एवं बोवेरी ने","थॉमस मॉर्गन ने","वाटसन एवं क्रिक ने"],
    answer:"सटन एवं बोवेरी ने"
},
{
    question: "लीची का खाने योग्य भाग है",
    option:["Endosperm","Mesocarp","Fleshy aril","Pericarp"],
    answer:"Fleshy aril"
},
{
    question: "प्रथम उभयचर प्राणी के रूप में विकसित मछलियाँ जो आज के मेंढक और सैलामैंडर के पूर्वज बने",
    option:["सीलाकैंथ","लंगफिश","स्टारफिश","उपर्युक्त में कोई नहीं"],
    answer:"लंगफिश"
},
{
    question: "मेंडल के Segregation Law का संबंध मुख्यतः किससे है?",
    option:["मोनोहाइब्रिड क्रॉस","हाइब्रिड क्रॉस","द्विसंकर क्रॉस","गुणसूत्र के बीच होमोलोगस जोड़े"],
    answer:"मोनोहाइब्रिड क्रॉस"
},
{
    question: "अम्लीय वर्षा होती है:",
    option:["जीवाश्म ईंधन के दहन से","सी.एफ.सी. से","ओजोन से","इनमें से कोई नहीं"],
    answer:"जीवाश्म ईंधन के दहन से"
},
{
    question: "नंदनकानन चिड़ियाघर जाना जाता है",
    option:["नीलगिरि टाइगर के लिए","हिप्पोपोटेमस के लिए","सफेद टाइगर के लिए","ह्वेल के लिए"],
    answer:"सफेद टाइगर के लिए"
},
{
    question: "किसी पर-परागण का विशिष्ट उदाहरण है",
    option:["गेहूँ","टमाटर","आलू","मक्का"],
    answer:"मक्का"
},
{
    question: "किसी A रक्त-समूह वाले व्यक्ति में होता है",
    option:["एंटीजन A, एंटीबॉडी B","एंटीजन B, एंटीबॉडी A","एंटीजन A, एंटीबॉडी B","एंटीजन A, एंटीबॉडी अनुपस्थित"],
    answer:"एंटीजन A, एंटीबॉडी B"
},
{
    question: "बीजाण्ड में अर्धसूत्री विभाजन होता है",
    option:["बीजाण्डकाय में","गुरुबीजाणु मातृ कोशिका में","गुरुबीजाणु में","आर्कीस्पोरियम में"],
    answer:"गुरुबीजाणु मातृ कोशिका में"
},
{
    question: "जनसंख्या अधिक होने से:",
    option:["प्रति व्यक्ति आय कम हो जाएगी","प्रति व्यक्ति आय बढ़ जाएगी","जनसाधारण का स्वास्थ्य अच्छा हो जाएगा","इनमें से सभी"],
    answer:"प्रति व्यक्ति आय कम हो जाएगी"
},
{
    question: "डफ (सना हुआ आटा) इनमें से किसके कारण मुलायम (हल्का) होता है?",
    option:["कार्बन डायऑक्साइड","मिथेन","ऑक्सीजन","इनमें से कोई नहीं"],
    answer:"कार्बन डायऑक्साइड"
},
{
    question: "मेंडल का Independent Assortment किस क्रॉस से संबंधित है?",
    option:["एकल हाइब्रिड क्रॉस","द्विसंकर हाइब्रिड क्रॉस","अपूर्ण वर्चस्व","बैक क्रॉस"],
    answer:"द्विसंकर हाइब्रिड क्रॉस"
},
{
    question: "मनुष्य में शुक्राणु का संग्रहण एवं पोषण किसमें होता है?",
    option:["वृषण","vasa efferentia","एपिडिडाइमिस","spermatic cord"],
    answer:"एपिडिडाइमिस"
},
{
    question: "किसी Pure tall pea के पौधे को pure बौने पौधे के साथ क्रॉस कराया गया। F1 वंशज के सारे पौधे tall प्राप्त हुए। इसका कारण है",
    option:["Dominance","F1 वंशज में बौनापन के गुण का गायब होना","घटकों का segregation","सामंजस्य/समन्वय"],
    answer:"Dominance"
},
{
    question: "ओकाजाकी खण्ड है:",
    option:["RNA प्राइमर्स","लीडिंग स्ट्रेण्ड पर RNA के छोटे खण्ड","लेजिंग स्ट्रेण्ड पर DNA के छोटे खण्ड","इनमें से कोई नहीं"],
    answer:"लेजिंग स्ट्रेण्ड पर DNA के छोटे खण्ड"
},
{
    question: "अंडाशय के अंदर का ऊतक भाग जो ovules के साथ जुड़ा होता है, कहलाता है",
    option:["Funicle","Hilum","Placenta","Chalaza"],
    answer:"Placenta"
},
{
    question: "टी.बी. किससे होता है?",
    option:["गोनोरिया से","माइकोबैक्टीरियम से","ट्रैपोनेमा से","बैसिलस से"],
    answer:"माइकोबैक्टीरियम से"
},
{
    question: "शुक्राणु का अक्षीय तंतु किससे बनता है?",
    option:["समीपस्थ वर्तुलिका","दूरस्थ वर्तुलिका","माइटोकोंड्रिया","केन्द्रक"],
    answer:"दूरस्थ वर्तुलिका"
},
{
    question: "निम्न में से कौन कीटभक्षी पौधा है?",
    option:["ड्रॉसेरा","नेपेन्थीस","(A) और (B) दोनों","हाइड्रिला"],
    answer:"(A) और (B) दोनों"
},
{
    question: "ट्रांसजेनिक जानवर का उदाहरण है:",
    option:["गाय","चूहा","सूअर","इनमें से सभी"],
    answer:"इनमें से सभी"
},
{
    question: "मिलर-यूरे प्रयोग में किस गैस का मिश्रण फ्लास्क में लिया गया था?",
    option:["मिथेन, अमोनिया तथा CO₂","मिथेन, अमोनिया, हाइड्रोजन तथा जलवाष्प","मिथेन, अमोनिया तथा नाइट्रोजन","CO₂, नाइट्रोजन तथा जलवाष्प"],
    answer:"मिथेन, अमोनिया, हाइड्रोजन तथा जलवाष्प"
},
{
    question: "T-लिम्फोसाइट कहाँ उत्पन्न होता है?",
    option:["थाइमस में","आमाशय में","यकृत में","अस्थि-मज्जा में"],
    answer:"अस्थि-मज्जा में"
},
{
    question: "वह जो दूसरे के कारण भोजन प्राप्त करता है:",
    option:["परजीवी","कीटाहारी","परभक्षी","सहजीवी"],
    answer:"परजीवी"
},
{
    question: "किसी जीव में दो समान एलील हों तो कहते हैं",
    option:["हाइब्रिड","समजात","विषमजात","वर्चस्वता"],
    answer:"समजात"
},
{
    question: "रात में खिलने वाले पुष्प साधारणतः ______।",
    option:["हल्के होते हैं","छोटे होते हैं","चमकीले रंगों वाले हैं","गच्छों में खिलते हैं"],
    answer:"हल्के होते हैं"
},
{
    question: "आनुवंशिकीय अभियांत्रिकी में प्रयुक्त आण्विक कैंची है:",
    option:["DNA लाइगेज","DNA पॉलीमरेज","हेलिकेज","रिस्ट्रिक्शन एंडोन्यूक्लिऐज"],
    answer:"रिस्ट्रिक्शन एंडोन्यूक्लिऐज"
},
{
    question: "Gonorrhoea एवं Syphilis कहाँ सबसे अधिक पाया जाता है?",
    option:["अफ्रीकन देशों में","यूरोपियन देशों में","पूरे विश्व में","एशियन देशों में"],
    answer:"पूरे विश्व में"
},
{
    question: "जीवों में प्रजनन की क्रिया होती है",
    option:["जीवों की संख्या में वृद्धि के लिए","पृथ्वी पर जीवन की निरंतरता बनाये रखने के लिए","अपनी जाति के जीवों को बनाये रखना","(A), (B) एवं (C) तीनों"],
    answer:"(A), (B) एवं (C) तीनों"
},
{
    question: "भ्रूणपोष में कितने गुणसूत्र होते हैं (पुष्पीय पौधों में)",
    option:["n","2n","3n","(A) एवं (C) दोनों"],
    answer:"3n"
},
{
    question: "परागकण Embryo sac से जिस प्रकार संबंधित है, उसी प्रकार",
    option:["शुक्राणु अंडाणु से","नर gametophyte मादा gametophyte से","नर gametophyte अंडाणु से","शुक्राणु मादा gametophyte से"],
    answer:"नर gametophyte मादा gametophyte से"
},
{
    question: "शल्क कंद (Bulb) का उदाहरण है:",
    option:["अदरक","दूब घास","प्याज","आलू"],
    answer:"प्याज"
},
{
    question: "किसी अनिषेचित अंडज से बीज के विकास को कहते हैं:",
    option:["विविपेरस","पार्थेनोकोपी","एपोगेमी","एपोस्पोरी"],
    answer:"पार्थेनोकोपी"
},
{
    question: "शुक्राणुजनन का नियंत्रण किसके द्वारा होता है?",
    option:["एंड्रोजन","एस्ट्रोजन","L.H.","इनमें से कोई नहीं"],
    answer:"एंड्रोजन"
},
{
    question: "एक बड़े क्षेत्रीय, भौमिक इकाई को विशाल वनस्पति प्रकार और संबंधित फौना द्वारा जाना जाता है:",
    option:["लैंडस्केप","बायोम","पारितंत्र","समुदाय"],
    answer:"बायोम"
},
{
    question: "डायनासोर किस युग के दौरान उपस्थित थे?",
    option:["पेलियोजोइक","प्रीकैम्ब्रियन","सीनोजोइक","मेसोजोइक"],
    answer:"मेसोजोइक"
},
{
    question: "पेनीसिलिन प्रतिजैविक उत्पन्न होता है:",
    option:["पौधे","विषाणु","P. notatum","कृमि"],
    answer:"P. notatum"
},
{
    question: "एक प्रारूपिक आवृत्तबीजी भ्रूणकोष प्रायः है",
    option:["एक-कोशिकीय","दो-कोशिकीय","पाँच-कोशिकीय","सात-कोशिकीय"],
    answer:"सात-कोशिकीय"
},
{
    question: "असमजात गुणसूत्रों के खंड का आदान-प्रदान कहलाता है",
    option:["क्रॉसिंग ओवर","Inversion","Duplication","Translocation"],
    answer:"Translocation"
},
{
    question: "वह जन्तु जो अपने शरीर के एक तिहाई भार के बराबर जल की कमी सहन कर सकता है:",
    option:["नेक्टयूरस","ऊँट","छिपकली","काइटोन"],
    answer:"ऊँट"
},
{
    question: "यदि DNA में 10 वलय हों, तो DNA की लंबाई होगी:",
    option:["34 Å","340 Å","640 Å","64 Å"],
    answer:"340 Å"
},
{
    question: "निम्नलिखित में से किसमें oestrus cycle नहीं होता है?",
    option:["गाय","भेड़","बंदर","कुत्ता"],
    answer:"बंदर"
},
{
    question: "जन्मदर 100 प्रतिशत है तथा मृत्यु दर 10 है। समष्टि समुदाय में 1000 व्यक्ति विशेष हैं। प्राकृतिक वृद्धि दर कितना प्रतिशत होगा?",
    option:["0.09%","9.0%","0.9%","90%"],
    answer:"9.0%"
},
{
    question: "पुनेट वर्ग विकसित किया",
    option:["मेंडल ने","वाटसन एवं सटन ने","रेजीनेल्ड पुनेट ने","बोवेरी ने"],
    answer:"रेजीनेल्ड पुनेट ने"
},
{
    question: "परागकोष भित्ति में इनमें से कौन-सा नहीं होता है",
    option:["एंडोथिसियम","मध्य परतें","टैपीटम","इंटेगुमेंट"],
    answer:"इंटेगुमेंट"
},
{
    question: "अंडे का जीवन-काल है",
    option:["48 घंटे","12 घंटे","24 घंटे","8 घंटे"],
    answer:"24 घंटे"
},
{
    question: "पारिस्थितिक तंत्र में नियंत्रण करने वाला कारक होता है",
    option:["मृदा नमी","भोजन","शिकार करना","ताप"],
    answer:"शिकार करना"
},
{
    question: "परिभ्रूणपोष (Perisperm) किसका बचा हुआ भाग है",
    option:["बीजांडकाय (nucellus)","भ्रूणपोष (embryo)","भ्रूणपोष (endosperm)","अध्यावरण (integument)"],
    answer:"बीजांडकाय (nucellus)"
},
{
    question: "वायु द्वारा स्थानान्तरित मृदा होती है:",
    option:["ऐलुवियल","ग्लैसियल","कोलुवियल","इयोलिन"],
    answer:"इयोलिन"
},
{
    question: "Bt cotton प्रतिरोधी है:",
    option:["कीट का","खर-पतवारनाशी का","लवण का","सूखा का"],
    answer:"कीट का"
},
{
    question: "EcoRI एंजाइम का स्रोत है:",
    option:["BamHI","E. coli","BamHI और E. coli दोनों","HindIII"],
    answer:"E. coli"
},
];

// English Questions
const biologyEnglish = [
{
    question: "T-of DNA Vector which is?",
    option:["Thermus aquaticus","Salmonella typhimurium","Agrobacterium tumefaciens","Bacillus thuringiensis"],
    answer:"Agrobacterium tumefaciens"
},
{
    question: "Fertilizin protein where is found?",
    option:["onerosoma on","sperm sira on","sperm of sataha on","egg membrane on"],
    answer:"sperm of sataha on"
},
{
    question: "somatic hybridization of ofrya kior jaa sakataa is:",
    option:["protoplaasta of phyoojana by","ardhacharacterita pollenkosha by","of the cell kalchara by","pollen grain of kalchara by"],
    answer:"protoplaasta of phyoojana by"
},
{
    question: "among the following air-borne disease which-saa is?",
    option:["tuberculosis","diphtheria","pneumonia","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "biosphere nichaya kisawith chetaavagrasta ho rahaa is?",
    option:["population growth","rainfall","pollution","all of the above"],
    answer:"pollution"
},
{
    question: "which-saa raashtareeya park one seenga having gende for new home is",
    option:["dudhavaa","ofrbeta","ofnhaa","bandhavagadha"],
    answer:"dudhavaa"
},
{
    question: "DNA in which-saa nitrogenous base is?",
    option:["ATUC","AUGC","UTGC","ATGC"],
    answer:"ATGC"
},
{
    question: "goldena raathis kisa vitamin from rich rahataa is:",
    option:["A","C","D","E"],
    answer:"A"
},
{
    question: "SCP is obtained:",
    option:["klorelaa","spaairulinaa","fromnedesamasa","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "chromosome praaroopa 2n - 1 ko is called",
    option:["monosomy","nullisomy","trisomy","tetrasomy"],
    answer:"monosomy"
},
{
    question: "cultivation yogya crop of average age is:",
    option:["1-2 year","5-15 year","10-20 year","20-30 year"],
    answer:"5-15 year"
},
{
    question: "Indian buffalo of animal vaijnyaanika name is।",
    option:["byoobailasa byoobailasa","bosa indikasa","bosa taorasa","gailasa gailasa"],
    answer:"byoobailasa byoobailasa"
},
{
    question: "Spermatid of Spermatozoon in roopaantarana ko are called",
    option:["Spermatogenesis","Spermiogenesis","Spermatocytogenesis","Gametogenesis"],
    answer:"Spermiogenesis"
},
{
    question: "thesein which diploid is",
    option:["egg cells","sahaayaka cells","secondary nucleus","enteepodala cells"],
    answer:"secondary nucleus"
},
{
    question: "jenitika koda where rahataa is?",
    option:["r-RNA","t-RNA","DNA","m-RNA"],
    answer:"m-RNA"
},
{
    question: "DNA paoleemareja of khoja kisane of?",
    option:["oofjaaof","ofrnabarga","mesalasana va staahala","vaatasana va krika"],
    answer:"ofrnabarga"
},
{
    question: "kisee anther of Pollen sac in Microspore mother cell of number is",
    option:["diploid","haploid","triploid","tetraploid"],
    answer:"diploid"
},
{
    question: "DNA organuliof-printinga ko kisane vikasita kior?",
    option:["phleminga","eleka jaapharee","smitha","vaatsana"],
    answer:"eleka jaapharee"
},
{
    question: "when kisee in mutation pyoorina of sthaana on pirimideena pratisthaapita ho jaae to ifrom are called:",
    option:["traanjishana","traansavarsana","traansaloofshana","thesevarsana"],
    answer:"traansavarsana"
},
{
    question: "Inner cell mass whose Precursor is?",
    option:["baahya level","madhya level","anth level","snpoorna embryo"],
    answer:"snpoorna embryo"
},
{
    question: "if mother and child both of blood group O ho to father of blood group can be",
    option:["A or B or O","A or B","only O","only AB"],
    answer:"A or B or O"
},
{
    question: "egge from lekara vayaska up to formation of snpoorna process ko are called:",
    option:["conception","fertilization","development","cleavage"],
    answer:"development"
},
{
    question: "forest ecosystem in number of pyramid occurs:",
    option:["seedhaa","ultaa","both","none of the above"],
    answer:"ultaa"
},
{
    question: "female heterogamety what is?",
    option:["female by two bhinna praofra of gametes of formation","male by four praofra of bhinna gametes of formation","both (A) and (B)","none of these"],
    answer:"female by two bhinna praofra of gametes of formation"
},
{
    question: "birth rate control for which-see chemical method is used?",
    option:["condom","loop","jelly cream","diaphragm"],
    answer:"jelly cream"
},
{
    question: "green coconut (daabha) in nihita milky water is",
    option:["liquid chalaza","liquid nucellus","degenerated liquid free nuclear endosperm","liquid female gametophyte"],
    answer:"degenerated liquid free nuclear endosperm"
},
{
    question: "which jaiva development of sabafrom spashta pramaana detaa is?",
    option:["fossil","vestigial organ","embryo","aaofriof"],
    answer:"fossil"
},
{
    question: "of DNA one bacterium cell from doosare bacterium cell in bacteriumbhojee by transfer ko koar are called?",
    option:["traansaphaorameshana or roopaantarana","traansadakshana","thesevarsana","traansaleshana"],
    answer:"traansadakshana"
},
{
    question: "factor which pair of contrasting characters ko rateshaataa ho, is called",
    option:["Dominance to Recessive","Alleles","Homologous pairs","Determinants"],
    answer:"Alleles"
},
{
    question: "sperm poonchha in Microtubules of arrangement occurs",
    option:["9+0","9+2","7+0","7+2"],
    answer:"9+2"
},
{
    question: "heemokoriyala plaafromntaa is found",
    option:["shashaka in","kutton in","horse in","human in"],
    answer:"human in"
},
{
    question: "maasika chakra in which occurs?",
    option:["monkey","ape","human","sabhee"],
    answer:"sabhee"
},
{
    question: "bamboo species in flowerna (Flowering) occurs",
    option:["poore organismnaofla in one baara","12 in the year one baara","pratiyear","50-100 in the year two baara"],
    answer:"poore organismnaofla in one baara"
},
{
    question: "‘greena haathat prabhaava’ of main ofraka is:",
    option:["CFCs","CO₂","CO","CH₄"],
    answer:"CO₂"
},
{
    question: "laika prachaaleka regulation dior:",
    option:["vaatasana and krika","beedala and taitama","milara and yoore","jaiwhen and monaoda"],
    answer:"jaiwhen and monaoda"
},
{
    question: "laaiofna soochaka is:",
    option:["CO₂ pollution of","SO₂ pollution of","CO pollution of","water pollution of"],
    answer:"SO₂ pollution of"
},
{
    question: "when organism unfavorable condition ko leaving migration does, to ufrom are called:",
    option:["migration","vernalization","both (A) and (B)","none of these"],
    answer:"migration"
},
{
    question: "jaiva vyavasthaa in sabafrom spashta iofee ko koar are called?",
    option:["cell","tissue","organ","organism"],
    answer:"organism"
},
{
    question: "levelvinoarsa thisaan milataa is।",
    option:["traopikala renaphaoresta","desert","disidyuasa forest","both (A) and (B)"],
    answer:"traopikala renaphaoresta"
},
{
    question: "viktorior lake sthita is:",
    option:["South Africa","South America","Australia","Switzerland"],
    answer:"South Africa"
},
{
    question: "Anemophily in pollination by whom occurs",
    option:["chamagaadada","air","bird","ghonghaa"],
    answer:"air"
},
{
    question: "blood in found jaane having major immunoglobulin is:",
    option:["IgA","IgD","IgG","IgM"],
    answer:"IgG"
},
{
    question: "vishva Biodiversity Day is:",
    option:["22 maee","5 joona","16 sitambara","29 disambara"],
    answer:"22 maee"
},
{
    question: "animal, which infanton ko birth dete are, are called:",
    option:["eggja","jaraayuja","amphibians","dvilingee"],
    answer:"jaraayuja"
},
{
    question: "Antifertilizin one protein is, which is found",
    option:["egg membrane on","vitelline ficcit","sperm between peesa on","sperm of agra sira having bhaaga on"],
    answer:"sperm of agra sira having bhaaga on"
},
{
    question: "kina pramaanon from this saabita occurs ki human languron of tulanaa in chimpanzee of more nikata is?",
    option:["linga chromosomes of DNA from","of chromosome aaofriof from","fossil avashesha from","otosomsa and hetrosoma of DNA from"],
    answer:"otosomsa and hetrosoma of DNA from"
},
{
    question: "honey of produces।",
    option:["male bee or drona","worker or fromvaka bee","queen bee","(A) and (C)"],
    answer:"worker or fromvaka bee"
},
{
    question: "barrier method of experiment birth rate of control for which-saa is?",
    option:["condom","Vaginal pouch","diaphragm","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "among the following which-saa 16 vibhinna gamete utpanna karegaa?",
    option:["AaBbccDd","AaBbccDDEeFf","AaBbCcddEEFF","AaBbCcDDEeFf"],
    answer:"AaBbCcDDEeFf"
},
{
    question: "kisee moola cell in of chromosome number 14 is। Synergids in thisof number koar hogee",
    option:["14","21","7","28"],
    answer:"7"
},
{
    question: "beetee (Bt) toxin (Toxin) kisafrom is obtained?",
    option:["prokairiyota from","yookairiyota from","both (A) and (B)","none of these"],
    answer:"prokairiyota from"
},
{
    question: "chickenpox kisadue to occurs?",
    option:["edino vaayarasa","vairifromlaa vaayarasa","bacteriumbhojee T2","SV-40 vaayarasa"],
    answer:"vairifromlaa vaayarasa"
},
{
    question: "in bacteria is found:",
    option:["plaajamida DNA","RNA","plaajamida DNA and RNA both","none of these"],
    answer:"plaajamida DNA and RNA both"
},
{
    question: "which amara are?",
    option:["reproduction cells","yakrita cells","vrikka cells","tntriof cells"],
    answer:"reproduction cells"
},
{
    question: "pollination sabhee flower organon of abscission ko induces is, apavaatenvaroopa",
    option:["anther","Pistil","Sepals","Receptacles"],
    answer:"Pistil"
},
{
    question: "Clitoris whose homologous organs is?",
    option:["skarotama","shishna","eggaashaya","valbhaa"],
    answer:"shishna"
},
{
    question: "baayolistika/gene gun of use in which is done?",
    option:["plaajmida ko oftane in","kate DNA ko whichdane in","vijaateeya DNA ko onposhee cells in pravesha karaane for","DNA ko shuddha karane for"],
    answer:"vijaateeya DNA ko onposhee cells in pravesha karaane for"
},
{
    question: "daayanaasora kisa dauraana upasthita the?",
    option:["peliyowhichika","preekaimbariyana","seenowhichika","mesowhichika"],
    answer:"mesowhichika"
},
{
    question: "munbaee and kolaoftaa of shaharon in main pradooshaka are:",
    option:["CO, SO₂","owhichna","haaidroofrbana and garma air","algaeon of seedaanu"],
    answer:"CO, SO₂"
},
{
    question: "kisee hatoar of jagaha khoona of dhabbe mile। if DNA prophaaila karanaa ho to jaancha for among the following koar sabafrom upayukta rahegaa?",
    option:["RBC","WBC","pletaletsa","plaajmaa"],
    answer:"WBC"
},
{
    question: "complementary gene in 9 : 3 : 3 : 1 of daaihaaibrida anupaata in which onivartita ho jaataa is?",
    option:["9 : 7","12 : 3 : 1","15 : 1","13 : 3"],
    answer:"9 : 7"
},
{
    question: "among the following biofertilizer which is?",
    option:["saatheseobacteria","virus","bacteriophage","sabhee"],
    answer:"saatheseobacteria"
},
{
    question: "among the following which-saa one kukkuta disease is?",
    option:["smata","isjaa","raaneekheta","(B) and (C) both"],
    answer:"(B) and (C) both"
},
{
    question: "estarojena and projestaraona of hormone secretion kisafrom occurs?",
    option:["plaafromntaa","egg","vrishana","vrikka"],
    answer:"plaafromntaa"
},
{
    question: "400 sperm formation in kitane secondary sperm cell of aavashyakataa hogee?",
    option:["100","200","40","400"],
    answer:"200"
},
{
    question: "inheritance of acquired characters of theory kinaof by given?",
    option:["daarvina","laimaarka","dee vreeja","iskala"],
    answer:"laimaarka"
},
{
    question: "among the following from which kraaee gene crop ko chhedaka from protects is?",
    option:["Cry I Ab","Cry II Ab","Cry Ac","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "'niorseena' vitamin is:",
    option:["B₁","B₂","B₁₂","B₃"],
    answer:"B₃"
},
{
    question: "alkohala by kisa organ on kuprabhaava padataa is?",
    option:["hridaya","yakrita","mastishka","phephadaaa"],
    answer:"yakrita"
},
{
    question: "among the following which-saa reshedaara protein of udaaharana is?",
    option:["insulina","hemoglobin","phaaibrothese","glookojana"],
    answer:"phaaibrothese"
},
{
    question: "fungusmoola udaaharana is:",
    option:["decomposer","anth parasitism","symbiotic relationship","baahya parasitism"],
    answer:"symbiotic relationship"
},
{
    question: "Autogamy for anukoola is",
    option:["Homogamy","Heterostyle","Dichogamy","svabndhoarkarana"],
    answer:"Homogamy"
},
{
    question: "kalionukiyon of which-from samooha in snkatagrasta species of number highest is?",
    option:["fish","reptiles","chidaior","mammals"],
    answer:"mammals"
},
{
    question: "ovulation kisa hormone of praorsa from snbhava is?",
    option:["LH","FSH","Estrogen","Progestrone"],
    answer:"LH"
},
{
    question: "among these phaphoondee by utpanna disease which-saa is?",
    option:["tuberculosis","smallpox","ringworm and shaloaf vikshatiorn","shleepada"],
    answer:"ringworm and shaloaf vikshatiorn"
},
{
    question: "Polymerase Chain Reaction (PCR) whose jaancha for is used?",
    option:["Genital herpes","malaria","Small pox","Measles"],
    answer:"Genital herpes"
},
{
    question: "one gene of vibhinna roopon ko are called",
    option:["allele","onka gene","onicomplementary gene","ipeestetika gene"],
    answer:"allele"
},
{
    question: "kisee species of anraate organism-diversity ko are called",
    option:["species diversity","alphaa diversity","genetic diversity","specieskarana"],
    answer:"genetic diversity"
},
{
    question: "human in conception of avadhi dinon in is",
    option:["200","250","260","270 dina"],
    answer:"270 dina"
},
{
    question: "AZT aushadhi of whom treatment in is used?",
    option:["malaria","AIDS","tee.bee.","oflaa jvaree"],
    answer:"AIDS"
},
{
    question: "egg formation of method ko are called:",
    option:["oogenesis","eggaashaya","ovulation","female reproduction"],
    answer:"oogenesis"
},
{
    question: "yoka formation ko are called",
    option:["Histogenesis","Glycogenesis","Oogenesis","Proteolysis"],
    answer:"Histogenesis"
},
{
    question: "biodiversity in sammilita are",
    option:["jameeneeya","watereeya","ecosystem","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "kaloarna sonaa whose variety is?",
    option:["wheat of improved variety","sonaa","both (A) and (B)","none of these"],
    answer:"wheat of improved variety"
},
{
    question: "among the following which-saa vestigial organ is?",
    option:["ofna of pinnaa","ependiksa","fish of shalka","indhaka of agrabaahu"],
    answer:"ependiksa"
},
{
    question: "among the following which-see method of by disease of praarnbhika pahachaana of jaa sakatee is?",
    option:["mootra vishleshana","blood vishleshana","PCR","none of these"],
    answer:"PCR"
},
{
    question: "among these which plant waterodbhida is?",
    option:["water chestnut","cactus","shisham","oneesior"],
    answer:"water chestnut"
},
{
    question: "among these which greenhouse gas naheen is?",
    option:["CO₂","CH₄","owhichna","CFCs"],
    answer:"owhichna"
},
{
    question: "among these which apane desha of pahalaa national park is",
    option:["baandeepura","kaorbeta","ofnhaa","none of these"],
    answer:"kaorbeta"
},
{
    question: "elarjee in formation having antibody is:",
    option:["IgA praofra of","IgE praofra of","IgM praofra of","IgG praofra of"],
    answer:"IgE praofra of"
},
{
    question: "vaahanon in ‘kaitelitika kanvartara’ of use of whom control for is done?",
    option:["air pollution","water pollution","rediyoonetiva pollution","soil pollution"],
    answer:"air pollution"
},
{
    question: "kisee organism of symptom praaroopa whose oninaama occurs?",
    option:["mutation and sahalagnataaen","cytoplasmee prabhaava and laingika viroopataa","environmenteeya onivartana and laingika dviroopataa","genepraroopa and environment of onsoan krioren"],
    answer:"genepraroopa and environment of onsoan krioren"
},
{
    question: "onkolaojee whose adhyayana is?",
    option:["cancer","onkogenesa","both (A) and (B)","virus"],
    answer:"cancer"
},
{
    question: "when pregnancy thaharane in asamartha ho to kaorpasa lyootiyama in which badala jaataa is?",
    option:["Corpus haemorrhagicum","kaorpasa alabiknsa","kaorpasa kaivaranosama","kaorpasa spaunjiyosama"],
    answer:"kaorpasa alabiknsa"
},
{
    question: "kraosinga ovara kisa avasthaa in occurs?",
    option:["jaaigoteena","leptoteena","paiinsecteena","metaapheja"],
    answer:"paiinsecteena"
},
{
    question: "elarjee due to nikalane having rasaayana are:",
    option:["histaamina","sirotonina","both (A) and (B)","none of these"],
    answer:"both (A) and (B)"
},
{
    question: "one species of evolutionary itihaasa jaanaa jaataa is",
    option:["vyaktivritta (Ontogeny)","speciesvritta (Phylogeny)","poorvajataa","fossil science"],
    answer:"speciesvritta (Phylogeny)"
},
{
    question: "variationon of srota is",
    option:["samasootree","ardadhasootree","niveshana","mutation"],
    answer:"mutation"
},
{
    question: "onesnkara kraosa of pheenotipika anupaata what is?",
    option:["1 : 2 : 1","3 : 1","9 : 3 : 3 : 1","none of these"],
    answer:"3 : 1"
},
{
    question: "male hormone of origin where from is?",
    option:["eggaashaya","vrishana","yakrita","mangoaashaya"],
    answer:"vrishana"
},
{
    question: "among the following which diploid is?",
    option:["pollen","egg","(A) and (B)","yugmanaja"],
    answer:"yugmanaja"
},
{
    question: "onkhanalee infant that technique is jisain:",
    option:["andavaahinee from yugmanaja lekara snvardhita is done, phira ifrom ropita do","andaanu lekara, phira ifrom nishechita karaakara ropita do","sperm and andaanu of snlayana occurs and yugmanaja of development onkhanalee in occurs","none of these"],
    answer:"andaanu lekara, phira ifrom nishechita karaakara ropita do"
},
{
    question: "commensalism in:",
    option:["both withiyon ko laabha occurs","both withiyon ko haani is","durfaorce ko laabha whenki praforce nukasaana-viheena rahataa is","uonyukta in from koee naheen"],
    answer:"durfaorce ko laabha whenki praforce nukasaana-viheena rahataa is"
},
{
    question: "AIDS beemaaree in HIV kisa cell ko destroys?",
    option:["B-cell","C-cell","T-linphosaaita","A and B both"],
    answer:"T-linphosaaita"
},
{
    question: "when koee character one from more vioneeta whichdaon of allele by snchaalita occurs to ufrom are called",
    option:["multiple allelism","bahuandajataa (paoleeimbariyonee)","incomplete dominance","none of these"],
    answer:"multiple allelism"
},
{
    question: "one area special in primary produceron of number maximum in which hogee?",
    option:["grassland ecosystem in","forest ecosystem in","reservoir ecosystem in","desert in"],
    answer:"reservoir ecosystem in"
},
{
    question: "one gene by kaee pheenotaaipa of control of kriormethod ko are called",
    option:["Epistasis","Pleiotropism","codominance","Multiple allelism"],
    answer:"Pleiotropism"
},
{
    question: "artificial veerya-fromchana in nishechita eggon ko kisa avasthaa in nioflaa jaataa is?",
    option:["4–12 cell avasthaa in","8–16 cell avasthaa in","8–32 cell avasthaa in","all of these avasthaa in"],
    answer:"8–32 cell avasthaa in"
},
{
    question: "recapitulation theory proposed kior gaor is",
    option:["vaona beyara by","daarvina by","hekala by","arastoo by"],
    answer:"hekala by"
},
{
    question: "among the following which symbiotic relationship by naaitrojana sthira does?",
    option:["vaolavaksa","raaiwhichbiyama","ofraa","none of these"],
    answer:"raaiwhichbiyama"
},
{
    question: "protein of main snrachanaatmaka specialtaa is:",
    option:["eethara bnwealth","thistara bnwealth","peptaaida bnwealth","uonokta sabhee"],
    answer:"peptaaida bnwealth"
},
{
    question: "nimna in which one aushadheeya plant is?",
    option:["mango","bael","peepal","Sarpagandha"],
    answer:"Sarpagandha"
},
{
    question: "uterus in Decidua baahara when aataa is?",
    option:["infant of birth with","infant of birth of baada","infant of birth of pahale","maasika pravaaha at the time of"],
    answer:"infant of birth of baada"
},
{
    question: "owhichna level ko is destroying:",
    option:["SO₂","CFCs","Smog","light chemical okseejana"],
    answer:"CFCs"
},
{
    question: "plaajmotomee in which occurs?",
    option:["haaidraa","obaelior","opelinaa and plaajmodiyama","plaajmodiyama"],
    answer:"opelinaa and plaajmodiyama"
},
{
    question: "among the following which-saa maize of major variety is?",
    option:["gngaa 101","sharabatee","sonaaliof","shakti"],
    answer:"gngaa 101"
},
{
    question: "kisee female in 21ven of chromosome three replicayon due to 47 chromosomes of upasthiti main symptom is",
    option:["daathose-sindroma of","triploidaa of","tarmaale-sindroma of","suon-pheemelanesa of"],
    answer:"daathose-sindroma of"
},
{
    question: "fourlsa daarvina ne jisa ship on apanee sea voyage of thatof name thaa",
    option:["beegala","philipsa","elekjendara","none of the above"],
    answer:"beegala"
},
{
    question: "Cleavage for koar correct kathana is?",
    option:["embryo of aaofra increases is","cell of aaofra decreases is","cell of aaofra increases is","embryo of aaofra decreases is"],
    answer:"cell of aaofra decreases is"
},
{
    question: "avasaadee chakra of antargata whose chakreekarana occurs?",
    option:["lauha","phaosphorasa","both (A) and (B)","none of these"],
    answer:"phaosphorasa"
},
{
    question: "antariksha orna in among these mainth kinaof use okseejana utpaadana hetu is done?",
    option:["algae","fungus","braayophaitsa","none of these"],
    answer:"algae"
},
{
    question: "peedojenesisa kisa laarvaa in is found?",
    option:["teenior","phaisiyolaa","raanaa","titalee"],
    answer:"phaisiyolaa"
},
{
    question: "chhotee gardana, chhote ofna and chaudaee chhaatee of symptom relationshipita are",
    option:["XXX chromosome having female from","XO chromosome having female from","XX chromosome having female from","uonyukta in from koee naheen"],
    answer:"XO chromosome having female from"
},
{
    question: "ameebaa in reproduction kisa praofra occurs?",
    option:["konidior","kaliof","jemyoolsa","dvikhndana by"],
    answer:"dvikhndana by"
},
{
    question: "India in harita kraanti for vikasita of gaee ‘jaor’ and ‘ratnaa’ in which are?",
    option:["rice of","wheat of","baajare of","makoaf of"],
    answer:"rice of"
},
{
    question: "spermatogenesis by one primary sperm cell from kitane sperm banate are?",
    option:["1","4","16","32"],
    answer:"4"
},
{
    question: "kisee ritrovaayarasa in genetic material is:",
    option:["RNA","DNA","hn RNA","none of these"],
    answer:"RNA"
},
{
    question: "humanon in ‘kraaee-du-chaita’ sindroma kisadue to paidaa occurs?",
    option:["XX egge of normal Y-dhaaraka sperm by fertilization","chromosome 5 of laghu bhujaa of one bhaaga of haani","chromosome 5 of deergha bhujaa of one bhaaga of haani","21ven of chromosome trisootrataa"],
    answer:"chromosome 5 of laghu bhujaa of one bhaaga of haani"
},
{
    question: "among these kina two vibhinna praofra of animalon between aarkiyopteriksa one yojaka kadaee is?",
    option:["water and land","land and pahaada","land and air","none of these"],
    answer:"land and air"
},
{
    question: "gravity of prabhaava against land which water of amount snchaya does, ufrom are called:",
    option:["land of kshamataa","gravityaakarshana force","snchaya water","haaigroskopika water"],
    answer:"land of kshamataa"
},
{
    question: "of RNA synthesis occurs:",
    option:["DNA of both valaya on","DNA of sense strand on","DNA of complementary strand on","cDNA on"],
    answer:"DNA of complementary strand on"
},
{
    question: "among the following cotton of baola varma pratirodhee gene snyojana is:",
    option:["cry I Ac","cry II Ab","cry I Ab","cry I Ac and cry II Ab"],
    answer:"cry I Ac and cry II Ab"
},
{
    question: "HIV aakramana does:",
    option:["B-limphosaaita","enteebaodeeja","T-limphosaaita","erithrosaaitsa"],
    answer:"T-limphosaaita"
},
{
    question: "gharon in harmful radiation of main source what is?",
    option:["tyooforceaaita","rngeena tee.vee.","choolhaa","heetara"],
    answer:"rngeena tee.vee."
},
{
    question: "vaayarasa janita disease what is?",
    option:["malaria","influenza","diphtheria","syphilis"],
    answer:"influenza"
},
{
    question: "baaralaoga ne whose naee species vikasita of?",
    option:["wheat","rice","sugarcane","mango"],
    answer:"wheat"
},
{
    question: "India in methena of major srota is:",
    option:["ganne of kheta","paddy of kheta","wheat of kheta","baagaana"],
    answer:"paddy of kheta"
},
{
    question: "transgenic crop in nimna for gene are:",
    option:["naye protein of synthesis for","enteebaayotika of pratirodha for","enteebaayotiksa for enjaaima of formation in","uonokta sabhee"],
    answer:"uonokta sabhee"
},
{
    question: "ozone layer airmndala in where is found?",
    option:["kshobhamndala","samataapamndala","baahyamndala","aayanamndala"],
    answer:"samataapamndala"
},
{
    question: "prithvee on origin of life from relationshipita book likhee gaee thee",
    option:["operina by","heldena by","daarvina by","these sabhee of by"],
    answer:"operina by"
},
{
    question: "AIDS for sabafrom correct draga is:",
    option:["Acyclovir","Didanosine","Zidovudine","Tetracycline"],
    answer:"Zidovudine"
},
{
    question: "forest conservation of upaaya are:",
    option:["saamaajika foresteekarana oniyojanaaen","agriculture foresteekarana oniyojanaaen","shaharee foresteekarana oniyojanaaen","uonokta sabhee"],
    answer:"uonokta sabhee"
},
{
    question: "among the following which-saa tof RNA recognition is?",
    option:["enteekodona","loop I","Loop IV","3-OH chhora"],
    answer:"enteekodona"
},
{
    question: "kisee O blood group having infant of mother-father in which-saa blood group can be?",
    option:["B and B","A and B","O and O","AB and B"],
    answer:"O and O"
},
{
    question: "haardee-venabarga sntulana in adishaatmaka onivartana are",
    option:["gene pravaaha","mutation","genetic apavaahana (Genetic drift)","gene rikaombineshana"],
    answer:"genetic apavaahana (Genetic drift)"
},
{
    question: "thesein which restarikshana enzyme naheen is?",
    option:["EcoRI","BamHI","HindIII","pektineja"],
    answer:"pektineja"
},
{
    question: "gatisheela silioryukta seedaanu ko are called:",
    option:["Aplanospores","konidior","joosporsa","oosporsa"],
    answer:"joosporsa"
},
{
    question: "‘katalaa’ fish is found।",
    option:["mriduwater","kathora water","mriduwater and kathora water both","none of these"],
    answer:"mriduwater"
},
{
    question: "seedchola khaaor jaataa is",
    option:["shareephaa of","apple of","orange of","among these sabhee"],
    answer:"shareephaa of"
},
{
    question: "gene therapy of pahale experiment kisa year kior gaor thaa?",
    option:["1988","1989","1990","1992"],
    answer:"1990"
},
{
    question: "paineesilina enteebaayotika is produced",
    option:["bacterium from","fungus from","algae from","virus from"],
    answer:"fungus from"
},
{
    question: "fertilization preventing of surgical method ko are called:",
    option:["Vasectomy","Tubectomy","MTP","sabhee"],
    answer:"Vasectomy"
},
{
    question: "probaayotiksa is:",
    option:["naye praofra of khaadya-padaartha","surakshita enteebaayotiksa","organismita maaikrobiyala khaadya complementary","cancer utpanna karane having maaikrobsa"],
    answer:"organismita maaikrobiyala khaadya complementary"
},
{
    question: "DNA anu of nucleotideon of complementary occurs:",
    option:["tof RNA naaitrojanee besa","mof RNA naaitrojanee besa","raaibosoma of RNA","none of these"],
    answer:"mof RNA naaitrojanee besa"
},
{
    question: "among the following which onivartanasheela is, but khaasa species for sthira is?",
    option:["A+T=G+C","G+C=T+T","A+G=T+C","none of these"],
    answer:"A+T=G+C"
},
{
    question: "riyo de jenero in year 1992 in snpanna huee prithvee shikhara sammelana of oninaamasvaroopa:",
    option:["laala aankadae soochee of snkalana","jaiva nichayon of sthaapanaa","biodiversity sammelana","prakriti and natural"],
    answer:"biodiversity sammelana"
},
{
    question: "DNA of separation during in bacteria which-from of enzyme use is done?",
    option:["laathisojaaima","ofitineja","fromluleja","proteineja"],
    answer:"laathisojaaima"
},
{
    question: "dhatooraa of haploid by whom praapta are?",
    option:["embryo culture","vibhajyoup to culture","callus culture","anther culture"],
    answer:"anther culture"
},
{
    question: "seed ko sexual reproduction of utpaada is called whyki ye",
    option:["gamete of snyojana from formed are","nae plants ko banaate are","lnbee avadhi up to sngrahita kara rakhe jaa sakate are","pollennalee of snyojana from banate are"],
    answer:"gamete of snyojana from formed are"
},
{
    question: "twoharaa fertilization in snyojana occurs",
    option:["one egg and two sperm","sperm nucleus and egg nucleus with dhruva nucleus of","one male gamete egg with and doosare male gamete of synergid with","one male gamete of egg with and doosare male gamete of secondary nucleus with"],
    answer:"one male gamete of egg with and doosare male gamete of secondary nucleus with"
},
{
    question: "prakriti in two vibhinna speesheeja between antarajaateeya antarareproduction why snbhava naheen can be?",
    option:["jaivika baadhaaon of chalate","environmenteeya baadhaaon of chalate","both praofra of baadhaaon due to","none of these"],
    answer:"both praofra of baadhaaon due to"
},
{
    question: "Genital warts one virus janita disease is, which kisafrom occurs?",
    option:["klomaaidior traikometisa by","traaikomonaasa vaijaatheselisa by","trepeenemaa paileedama by","hyoomana paipeelomaa vaayarasa by"],
    answer:"hyoomana paipeelomaa vaayarasa by"
},
{
    question: "andaanu in baahara from anrate of ora levelon of among the following which-saa krama occurs?",
    option:["whichnaa pailyoosidaa, peeup to kalaa and koronaa rediaitaa","whichnaa pailyoosidaa, koronaa rediaitaa and peeup to kalaa","koronaa rediaitaa, whichnaa pailyoosidaa and peeup to kalaa","peeup to kalaa, whichnaa pailyoosidaa and koronaa rediaitaa"],
    answer:"koronaa rediaitaa, whichnaa pailyoosidaa and peeup to kalaa"
},
{
    question: "gaatheseekomestior symptom is",
    option:["klaatheseepheltarsa sindroma of","tarmaalesa sindroma of","saarsa of","daathosesa sindroma of"],
    answer:"klaatheseepheltarsa sindroma of"
},
{
    question: "jaivika shakti of maana nioflaa jaataa is:",
    option:["birth-rate from death rate subtracting","birth-rate in death rate ko whichdakara","birth-rate and death rate of bhaagaphala from","none of these"],
    answer:"birth-rate from death rate subtracting"
},
{
    question: "one m-RNA in amino acid of koda for kitane nucleotide sequence are?",
    option:["one","two","three","four"],
    answer:"three"
},
{
    question: "among the following from in which 12 in the year only one baara flower khilate are?",
    option:["sunflower","peepal","neelaa kurenjee","neem"],
    answer:"neelaa kurenjee"
},
{
    question: "soil aondana ko kisa praofra roof jaa sakataa is?",
    option:["human kriorkalaapon ko pratibandhita karaof","animals of pragati rokakara","air skareena of experiment karaof","shreshtha plant aavarana from"],
    answer:"shreshtha plant aavarana from"
},
{
    question: "“Morning after pills” from conception ko roof jaa sakataa is, if ifrom ______ ghnte of anrate lior jaae।",
    option:["50","60","30","72"],
    answer:"72"
},
{
    question: "‘ikosistama’ shabda ko prastaavita kior:",
    option:["odama ne","tensale ne","vitekara ne","golee ne"],
    answer:"tensale ne"
},
{
    question: "dvifertilization in which is found?",
    option:["aavrittaseedee","anaavrittaseedee","teridophaaitsa","braayophaayatsa"],
    answer:"aavrittaseedee"
},
{
    question: "indala apane experiments in saphala hue whyki",
    option:["thatne matara of plants ko chunaa","svatntra traits of adhyayana kior gaor","atyadhika traits ko chunaa gaor","matara of plant dvilingee occurs"],
    answer:"thatne matara of plants ko chunaa"
},
{
    question: "100 secondary egg cell and 200 secondary sperm cell from gametereproduction at the time of kitane egg and sperm banenge?",
    option:["50 egg, 100 sperm","100 egg, 400 sperm","100 egg, 100 sperm","200 egg, 200 sperm"],
    answer:"100 egg, 400 sperm"
},
{
    question: "one DNA anu in edeeneena and thaayameena between upasthita haaidrojana bndhon of number is:",
    option:["2","3","4","8"],
    answer:"2"
},
{
    question: "nimnalikhita nyooklika amla genetic material and utpareraka both of ofrya does:",
    option:["DNA","RNA","both (A) and (B)","none of the above"],
    answer:"RNA"
},
{
    question: "among the following kaloarna sonaa whose variety is?",
    option:["paddy","wheat","maize","matara"],
    answer:"wheat"
},
{
    question: "vaayarasa of kora in among these koar is found?",
    option:["DNA","RNA","DNA or RNA in from koee one","none of these"],
    answer:"DNA or RNA in from koee one"
},
{
    question: "among the following which-see birth control of natural method naheen is?",
    option:["baahya ejaculation","aavadhika snyama","vaafromktomee","breastfeeding anaartava"],
    answer:"vaafromktomee"
},
{
    question: "stenalee milara of experiment bataataa is",
    option:["rasaayanavaada","aorganismotpatti mata","organismotpatti mata","penajenesisa"],
    answer:"rasaayanavaada"
},
{
    question: "protein synthesis for Initiation codon is:",
    option:["AUG","GGU","Met","AUG and GUG"],
    answer:"AUG"
},
{
    question: "bird by pollination ko are called",
    option:["Entomophily","Myrmecophily","Ornithophily","Chiropterophily"],
    answer:"Ornithophily"
},
{
    question: "which-saa third shrenee of insectnaashaka is?",
    option:["insect ripelentsa","pheromonsa","paithojensa","insect hormone enaalaoga"],
    answer:"insect hormone enaalaoga"
},
{
    question: "kisee paoleepeptaaida shrrinkhalaa in 100 amino acid are। thisfrom kitane praofra of protein-formation tripleta jenetika koda of tahata can be?",
    option:["20^100","100^20","100 × 20 × 3","100 × 3"],
    answer:"20^100"
},
{
    question: "among the following which-saa evolutionism from yukta is?",
    option:["viluptataa","variation","reproduction","pratisoandhaa"],
    answer:"variation"
},
{
    question: "dvifertilization of oninaama occurs",
    option:["cotyledon","ovuleofya","endosperm","embryo"],
    answer:"endosperm"
},
{
    question: "highest jameenee primary producertaa having paaritntra occurs",
    option:["pond","ocean","desert","forest"],
    answer:"forest"
},
{
    question: "without fertilization of hee seed paidaa karane of process ko koar are called",
    option:["asngareproduction","pollination","trisnlayana","anya"],
    answer:"asngareproduction"
},
{
    question: "mada chakra (oestrus cycles) is found",
    option:["cow","bheda","dog","these sabhee in"],
    answer:"these sabhee in"
},
{
    question: "among the following taaichunga-1 whose variety is?",
    option:["paddy of","wheat of","maize of","fromma of"],
    answer:"paddy of"
},
{
    question: "owhichna of motaaee maapee jaatee is:",
    option:["NTU","daobasana iofee","paarta on miliyana","kilomeetara"],
    answer:"daobasana iofee"
},
{
    question: "jnka DNA kisako is called?",
    option:["kodinga krama","naonakodinga krama","promotara gene","histona protein"],
    answer:"naonakodinga krama"
},
{
    question: "vibhaajana gene in, kodinga krama ko are called:",
    option:["introna","onesona","sistaraana","operaona"],
    answer:"onesona"
},
{
    question: "among the following kisa animal of conservation asama of ofjeerngaa fromnchuree in kior jaa rahaa is",
    option:["Indian baathisna","Indian lion","Indian rhinoceros","Indian elephant"],
    answer:"Indian rhinoceros"
},
{
    question: "among the following which yauna-snfourita disease is?",
    option:["malaria","AIDS","dengoo","none of these"],
    answer:"AIDS"
},
{
    question: "seed of that ankurana ko jisain cotyledon land from ooon aa jaate are, are called",
    option:["adholandka","bhoomyooonika","saorganismprajataa","none of these"],
    answer:"bhoomyooonika"
},
{
    question: "kuchha animals in being having sheetanishkariyataa is:",
    option:["layabaddha","saamayika","kadaachita","kshanika"],
    answer:"saamayika"
},
{
    question: "one bindu mutation is",
    option:["thaileseemior","sikila fromla eneemior","daathose sindroma","rataundhee"],
    answer:"sikila fromla eneemior"
},
{
    question: "‘sahelee’ which ki female contraceptive pill is, experiment is done:",
    option:["rojaanaa","saaptaahika","timaahee","maasika"],
    answer:"saaptaahika"
},
{
    question: "plants which chattaanon on ugate are, are called:",
    option:["okfaromlophaaita","lithophaaita","airiyophaaita","helophaaita"],
    answer:"lithophaaita"
},
{
    question: "aifrom padaartha jinaof prati immune response is, thosehen are called:",
    option:["allergen","vaccine","antibody","antigen"],
    answer:"antigen"
},
{
    question: "kisee dnpatti ko two putra are। teesaree offspring of putree being of snbhaaforestaa is",
    option:["100%","50%","25%","12.5%"],
    answer:"50%"
},
{
    question: "one saadhaarana food chain of correct krama is:",
    option:["ghaasa → bakaree → human","bakaree → ghaasa → human","human → bakaree → ghaasa","none of these"],
    answer:"ghaasa → bakaree → human"
},
{
    question: "‘convergent evolution’ prarateshita occurs",
    option:["homologous organson by","analogous organson by","vestigial organon by","uonokta sabhee by"],
    answer:"analogous organson by"
},
{
    question: "in which pollen grain of formation occurs",
    option:["anther","stigma","filament","Pollen sac"],
    answer:"Pollen sac"
},
{
    question: "graaphiyana putee of growth and maturena by whom niyntrita occurs?",
    option:["FSH-LH","FSH-LTH","ACTH-LH","GH-ADH"],
    answer:"FSH-LH"
},
{
    question: "among the following in which water pollination occurs",
    option:["water hyacinth","lotus","Hydrilla","(B) and (C) both"],
    answer:"Hydrilla"
},
{
    question: "phloraaida of concentration airmndala in increase from occurs:",
    option:["klorosisa","nekrosisa","phlorosisa","among these sabhee"],
    answer:"phlorosisa"
},
{
    question: "vishva of climate ko khataraa is:",
    option:["CO₂ of amount increase from","O₂ of amount increase from","owhichna of amount increase from","N₂ of amount increase from"],
    answer:"CO₂ of amount increase from"
},
{
    question: "stema cell kisafrom utpanna is?",
    option:["yoka saika from","pregnancystha infant of yakrita from","asthimajjaa from","sabhee from"],
    answer:"sabhee from"
},
{
    question: "klorelaa among the following what is?",
    option:["bacterium","algae","protozoa","onela cell protein"],
    answer:"algae"
},
{
    question: "beedala and taotama of nyoorosporaa on kior gaor mahatvapoorna experiment siddha does ki:",
    option:["one enzyme one gene ko sudhaarataa is","one enzyme one gene utpanna does","one gene by aneka gene utpanna are","none of these"],
    answer:"one enzyme one gene utpanna does"
},
{
    question: "Bt what is?",
    option:["one organismtoxin protein","one pratirodhaka","peedakanaashaka","uonokta sabhee"],
    answer:"one organismtoxin protein"
},
{
    question: "prokairiyotika genetic tntra in nihita is:",
    option:["DNA + histonsa","DNA + histona rahita","DNA + naonahistona","DNA and histona both hee anupasthita"],
    answer:"DNA + histona rahita"
},
{
    question: "entomophilasa flowers in pollination of maadhyama occurs",
    option:["ant","insect","bird","havaa"],
    answer:"insect"
},
{
    question: "among the following which greenhouse gas naheen is?",
    option:["SO₂","CH₄","CO₂","CFCs"],
    answer:"SO₂"
},
{
    question: "kisee flowering plants in maximum of chromosome number 2n=265 is। plant litorosaa in is, to minimum number is",
    option:["2n = 4","2n = 14","2n = 2","2n = 16"],
    answer:"2n = 4"
},
{
    question: "asexual reproduction in kitane organism bhaaga lete are?",
    option:["one","two","three","one bhee naheen"],
    answer:"one"
},
{
    question: "pollen kanon in specialkara which-saa vitamin occurs",
    option:["vitamin B","vitamin A","vitamin D","vitamin C"],
    answer:"vitamin B"
},
{
    question: "nyooklika amla one praforce amla is। thisof amlataa of ofrana is:",
    option:["phosphates","sugar","nitrogenous base","haaidrojana bnwealth"],
    answer:"phosphates"
},
{
    question: "of coconut endosperm of which-saa bhaaga liquid syncytium is called",
    option:["coconut seed of liquid endosperm","Endosperm TET","Endosperm of baaharee level","among these sabhee"],
    answer:"coconut seed of liquid endosperm"
},
{
    question: "virus which cancer utpanna do, are called:",
    option:["aburdeeya virus","bacteriumbhojee","tee.ema.vee. (TMV)","koee naheen"],
    answer:"aburdeeya virus"
},
{
    question: "photochemical smog in upasthita shaktishaalee tatva which aankhon in waterna paidaa do:",
    option:["naaitrika oksaaida","SO","CO₂","naaitrasa oksaaida"],
    answer:"naaitrasa oksaaida"
},
{
    question: "ephaairaa laarvaa orelior in is found। thisof formation kisa method from occurs?",
    option:["rijemaleeshana","vikhndeekarana","tootana","starobaailesana"],
    answer:"starobaailesana"
},
{
    question: "paarthenojenesisa is found:",
    option:["onesolotala laarvaa in","miraasidiyama in","saroafrior in","sporosista and redior laarvaa in"],
    answer:"sporosista and redior laarvaa in"
},
{
    question: "AIDS by whom phailataa is?",
    option:["blood of aadaana-pradaana","aonaa from aadaana-pradaana","laingika snbhoga","all of the above"],
    answer:"all of the above"
},
{
    question: "ubhayalingee praanee is:",
    option:["hen","snake","both (A) and (B)","earthworm"],
    answer:"earthworm"
},
{
    question: "among the following which-saa tharmophilika bacteria from nikarshita taapa sthiree (Thermostable) enzyme is?",
    option:["RNA paoleemareja","DNA polymerase","ristarikshana endonyookliaija","DNA ligeja"],
    answer:"DNA polymerase"
},
{
    question: "coconut in tarala and guddedaara padaartha occurs",
    option:["embryo","anthbhittee daanaa","endosperm","none of these"],
    answer:"endosperm"
},
{
    question: "kisee mature pollen grain in kitane nuclei are",
    option:["1","2","3","4"],
    answer:"2"
},
{
    question: "genetic code in kitane code are?",
    option:["4","165","32","64"],
    answer:"64"
},
{
    question: "first parasitic cow of name koar thaa?",
    option:["rojee","baforceee","heeraa","motee"],
    answer:"rojee"
},
{
    question: "SO₂ pollution of soochaka is:",
    option:["algae","laaiofna","fungus","among these sabhee"],
    answer:"laaiofna"
},
{
    question: "on-pollination laabhadaayaka is, whyki thisof oninaama are",
    option:["male offspring of birth lenaa","weak offspring","superior offspring","seed of formation"],
    answer:"superior offspring"
},
{
    question: "Follicles of rupture and ova of release is called",
    option:["copulation","conjugation","ovulation","oviposition"],
    answer:"ovulation"
},
{
    question: "if pollination bee by sampanna ho to ifrom are called",
    option:["Ornithophily","Myrmecophily","Entomophily","Chiropterophily"],
    answer:"Entomophily"
},
{
    question: "ofnon on baala of bahulataa of gene is found",
    option:["X-kromosoma on","Y-kromosoma on","linga nirdhaaraneeya kromosoma on","alinga kromosoma on"],
    answer:"Y-kromosoma on"
},
{
    question: "kocha of avadhaaranaa kisafor correct naheen is?",
    option:["diphtheria","leprosee","tee.bee.","isjaa"],
    answer:"leprosee"
},
{
    question: "blood of kolestaraola ko less karane for staitina of is used, ye kisafrom utpanna isn?",
    option:["monoskasa onpyooreeyasa","traaikodarmaa","stareptokokasa","none of these"],
    answer:"monoskasa onpyooreeyasa"
},
{
    question: "oofjaaof tukadaaa relationshipita is।",
    option:["traansavarsana","traansaleshana","otomeshana both","repleeofshana"],
    answer:"repleeofshana"
},
{
    question: "G-6-P deehaaidrogeneeja of lessee of whom heemolaathisisa from relationshipita is?",
    option:["limphosaaitsa of","RBCs of","pletaletsa of","lyookosaaitsa of"],
    answer:"RBCs of"
},
{
    question: "one poshana level from doosare in energy pravaahita is",
    option:["5%","10%","15%","20%"],
    answer:"10%"
},
{
    question: "gene abhiyntrita cropen agriculture in ofphee phaayademnda are, whyki:",
    option:["theseof poshaka kshamataa less is","ye chemical fertilizer of paidaavaara badhaaate are","ye ajaivika dabaava of prati joardaa sahanasheela are","among these sabhee"],
    answer:"ye ajaivika dabaava of prati joardaa sahanasheela are"
},
{
    question: "genetic abhiorntriof in thistemaala pahalaa pratibnwealth of enzyme name what is?",
    option:["EcoRV","EcoRI","Hind-III","none of these"],
    answer:"EcoRI"
},
{
    question: "organismnumber of samasta genes of yoga is called",
    option:["genekosha","genepravaaha","gene bainka","none of the above"],
    answer:"genekosha"
},
{
    question: "hnsiorofra bloodaanu abloodtaa in amino acid snfactor occurs",
    option:["α shrrinkhalaa in veleena by glootamika amla","α shrrinkhalaa in glootemika amla by veleena","β shrrinkhalaa in veleena by glootemika amla","β shrrinkhalaa in glootemika amla by veleena"],
    answer:"β shrrinkhalaa in veleena by glootemika amla"
},
{
    question: "fertilization what is",
    option:["eggaa and male nyookliyasa of snyojana","eggaa and fromkndaree nyookliyasa of snyojana","eggaa and simalejida of snyojana","none of these"],
    answer:"eggaa and male nyookliyasa of snyojana"
},
{
    question: "doodha in which-saa daathisaiofraaida upasthita occurs?",
    option:["maaltoja","glaiktoja","sukroja","laiktoja"],
    answer:"laiktoja"
},
{
    question: "‘mukulana’ by reproduction in which occurs?",
    option:["penisiliyama","paaraamishiyama","yeesta","among these sabhee in"],
    answer:"yeesta"
},
{
    question: "‘he pheevara’ kisafrom occurs?",
    option:["virus","vitamin of lessee from","elarjee","koee naheen"],
    answer:"elarjee"
},
{
    question: "poarja of gamete in of chromosome number is:",
    option:["8","16","24","32"],
    answer:"16"
},
{
    question: "svatntraorganismee aairveeya naaitrojana sthireeofree bacterium is:",
    option:["raaiwhichbiyama","stareptokokasa","ewhichtobaiktara","klostareediyama"],
    answer:"klostareediyama"
},
{
    question: "ecosystem in aahaara-level ko is called:",
    option:["producer level","consumer level","shaaofhaaree level","poshana level"],
    answer:"poshana level"
},
{
    question: "sarvottama dudhaaroo nasla of pashu are।",
    option:["laala sindhee (Red Sindhi)","holsatina-phrijiyana","saahivaala","none of these"],
    answer:"holsatina-phrijiyana"
},
{
    question: "antara-hybridization from growth is।",
    option:["samajaatataa in","toxinmajaatataa in","both in","none of these"],
    answer:"toxinmajaatataa in"
},
{
    question: "katalaa is found।",
    option:["alavaneeya water in","khaare water in","alavaneeya and lavaneeya both praofra of water in","kisee bhee water in"],
    answer:"alavaneeya water in"
},
{
    question: "monosomy and trisomy ko nimnavat aniroopita kior jaa sakataa is।",
    option:["2n + 1, 2n + 3","2n – 1, 2n – 2","2n, 2n + 1","2n – 1, 2n + 1"],
    answer:"2n – 1, 2n + 1"
},
{
    question: "birth rate control of method which-see is?",
    option:["GIFT","IVF-ET","IUCDs","ICSI"],
    answer:"IUCDs"
},
{
    question: "water pollution of normal soochaka organism is:",
    option:["Lemna paucicostata","Eichhornia crassipes","Escherichia coli","Entamoeba histolytica"],
    answer:"Escherichia coli"
},
{
    question: "diploid is",
    option:["egg","pollen","both (A) and (B)","yugmanaja"],
    answer:"yugmanaja"
},
{
    question: "veerya snchita is done।",
    option:["tarala okseejana in","tarala naaitrojana in","tarala sodiyama in","none of these"],
    answer:"tarala naaitrojana in"
},
{
    question: "if jaivamndala from ofrbana daaioksaaida ko hataa dior jaae to which-from organism on sarvafirst buraa asara padaegaa?",
    option:["primary producer","producer","secondary consumer","third consumer"],
    answer:"primary producer"
},
{
    question: "genetic material of mutation from prabhaavita being having chhote-from-chhotaa khnda is",
    option:["reekaona","sistaraona","myootaona","onesaona"],
    answer:"myootaona"
},
{
    question: "taajamahala by whom nashta can be?",
    option:["yamunaa nadee in baadha from","sngamaramara of uchcha taapa on apaghatana from","mathuraa of tela shodhaka ofrakhaane from nikalee SO₂ from","uonokta sabhee from"],
    answer:"mathuraa of tela shodhaka ofrakhaane from nikalee SO₂ from"
},
{
    question: "sameekarana dN/dt = rN kifrom niroopita does?",
    option:["birth rate","growth rate","death rate","all of the above"],
    answer:"growth rate"
},
{
    question: "klona of pahachaana do",
    option:["PCR from","jela ilektarophoresisa from","otorediyograaphee from","among these sabhee"],
    answer:"otorediyograaphee from"
},
{
    question: "urdhavavartee/shikharaanga (upright) pyramid that pyramid is which",
    option:["energy pyramid which sadaiva khadaee avasthaa in are","energy pyramid which sadaiva ulatee avasthaa in adhovartee rahatee is","both (A) and (B)","none of these"],
    answer:"energy pyramid which sadaiva khadaee avasthaa in are"
},
{
    question: "linofja (sahalagnataa) of khoja kisane of thee?",
    option:["indala","maorgana","puneta","moolara"],
    answer:"maorgana"
},
{
    question: "among the following from which biofertilizer is?",
    option:["maaikoraaijaa","kior","ewhichbaiktara","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "hisaaradela (Hisardale) whose variety is?",
    option:["cow of","buffalo of","bheda of","fish of"],
    answer:"bheda of"
},
{
    question: "among the following which yauna snfourita disease is?",
    option:["taayaphaayada","isjaa","malaria","syphilis"],
    answer:"syphilis"
},
{
    question: "egg prajaka is",
    option:["hen","snake","magaramachchha","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "Implantation from pahale embryo ko poshana milataa is",
    option:["Ovary from","eggvaahinee from","uterus of secretionna from","apane hee yolk from"],
    answer:"uterus of secretionna from"
},
{
    question: "one svastha female of poore organismna ofla in utpanna kula eggon of number is",
    option:["4000","400","40","365"],
    answer:"400"
},
{
    question: "ikolaojee shabda kisane dior is?",
    option:["odama","iskala","haorave","none of these"],
    answer:"iskala"
},
{
    question: "onkhanalee infanton ko utpanna karane in",
    option:["fertilization baahya occurs va embryo of formation anraate occurs","fertilization anth occurs va embryo formation baahya occurs","fertilization va embryo formation both hee anraate are","fertilization va embryo formation both baahya are"],
    answer:"fertilization baahya occurs va embryo of formation anraate occurs"
},
{
    question: "human in that immunity which birth at the time of from maujooda rahatee is, kahalaatee is:",
    option:["sahaja immunity","upaarjita immunity","svaimmunity","nishkariya immunity"],
    answer:"sahaja immunity"
},
{
    question: "one ecosystem in hare plants are",
    option:["producer","consumer","decomposer","thesein koee naheen"],
    answer:"producer"
},
{
    question: "onesonyookfaorja of snratebha in which-saa vaakya wrong is?",
    option:["DNA of sire from nucleotide ko alaga do।","this DNA ko bheetara vishishta sthalon on oftate are।","ye nucleotide ko alaga karane of atirikta bheetara vishishta sthalon on oftate are।","ye nyookleeeja enzymeon of one badae varga of satenya are।"],
    answer:"this DNA ko bheetara vishishta sthalon on oftate are।"
},
{
    question: "Parturition for snofta (Signal) where from shuroo occurs?",
    option:["plaafromntaa","plaafromntaa and poorna vikasita pregnancystha infant","mother of pityootaree from secretionita oxytocin by","poorna vikasita pregnancystha infant by"],
    answer:"plaafromntaa and poorna vikasita pregnancystha infant"
},
{
    question: "reseed of vaccine kisane prachalita kior?",
    option:["jemale","paashchara","daarvina","laimaarka"],
    answer:"paashchara"
},
{
    question: "sapheda cheetaa madhyapradesha in where surakshita is?",
    option:["reevaa","bhopaala","indaura","gvaaliyara"],
    answer:"reevaa"
},
{
    question: "watereeya community in primary consumer are:",
    option:["maansaahaaree","mritabhojee","shaaofhaaree","sarvaahaaree"],
    answer:"shaaofhaaree"
},
{
    question: "one vivaahita pairs of pahale from three putriorn are। aba chauthee offspring of socha rahe are। this bhaavee offspring of putra being of snbhaaforestaa kitane pratishata hogee?",
    option:["100%","50%","25%","0%"],
    answer:"50%"
},
{
    question: "among the following which-saa jaiva factor is?",
    option:["soil","vaashpa","water","sabhee"],
    answer:"soil"
},
{
    question: "kisee dvikundalita DNA of valaya in kshaara shrrinkhalaa between of dooree is?",
    option:["0.34 nm","34 nm","5 Å","10"],
    answer:"0.34 nm"
},
{
    question: "bacterium of anulekhana iofee in snrachanaatmaka gene occurs:",
    option:["monosistaraoneeka","paoleesistaraoneeka","naonasistaraoneeka","none of the above"],
    answer:"paoleesistaraoneeka"
},
{
    question: "idalee-dosaa of aate in which-saa sookshamaorganism is used?",
    option:["yeesta","bacterium","virus","among these sabhee"],
    answer:"yeesta"
},
{
    question: "pregnancydhaarana of baada mother of mootra in which-saa hormone occurs?",
    option:["LH","projestaraona","FSH","HCG"],
    answer:"HCG"
},
{
    question: "kisee Dihybrid cross for Independent assortment of niyama of anusaara koar correct is?",
    option:["F2 vnshaja in 4 genotypes are","F2 in 16 phenotypes are","both Characters for only one individual homozygous recessive occurs","vibhinna phenotypes of bhatoxinyavaanee snbhava naheen is"],
    answer:"both Characters for only one individual homozygous recessive occurs"
},
{
    question: "DNA ko dekhane for is used:",
    option:["itheediyama bromaaida","eneeleena bloo","fromphreneena","phaasta greena"],
    answer:"itheediyama bromaaida"
},
{
    question: "age snrachanaa of joarmiteeya niroopana whose vishishtataa is?",
    option:["jaivika community of","samashti","bhoodrishya","paaritntra"],
    answer:"samashti"
},
{
    question: "among the following anulekhana and transfer with-with snpanna ho sakate are:",
    option:["bacterium","sunucleusee","yeesta","none of the above"],
    answer:"bacterium"
},
{
    question: "maaikrospheeyarsa name kisane dior thaa?",
    option:["sidanee phaoksa","operina","milara","yoore"],
    answer:"sidanee phaoksa"
},
{
    question: "among these which shrrinkhalaa praarnbhana kodaona is?",
    option:["AUG","CCC","UAG","UAA"],
    answer:"AUG"
},
{
    question: "among the following which-saa reshedaara protein of udaaharana is?",
    option:["insulina","hemoglobin","phaaibrojana","glookojana"],
    answer:"phaaibrojana"
},
{
    question: "among the following in which gamete sthaanaantarana for water of aavashyakataa naheen hotee?",
    option:["algae","braayophaaitsa","teridophaaitsa","jimnosoanma"],
    answer:"jimnosoanma"
},
{
    question: "SCP is obtained।",
    option:["klorelaa","spaairulinaa","soafnedesamasa","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "koesaravetsa ko praayogika roopa from by whom utpanna kior gaor?",
    option:["operina va sidanee phaoksa","phishara va haksale","jewhen va monaoda","yoore va milara"],
    answer:"operina va sidanee phaoksa"
},
{
    question: "pistior in ofyiof pravarwaealth by whom occurs?",
    option:["staolona","ophafromta","ramale","sakara"],
    answer:"ophafromta"
},
{
    question: "replica during DNA paoleemareja by bahulakana of dishaa is।",
    option:["5′ from 3′","3′ from 5′","5′ from 5′","3′ from 3′"],
    answer:"5′ from 3′"
},
{
    question: "nimnalikhita kshaara of doosaraa name 5-mithila yooraisila is:",
    option:["edeneena","guaaneena","thaayameena","saaitoseena"],
    answer:"thaayameena"
},
{
    question: "watereeya pharna which biofertilizer of behada achchhaa udaaharana is:",
    option:["saalvinior","ewhichlaa","maarsilior","teridiyama"],
    answer:"ewhichlaa"
},
{
    question: "variationon of onma srota is",
    option:["samasootree","ardhasootree","fertilization","mutation"],
    answer:"mutation"
},
{
    question: "among these by whom dengoo of vistaara occurs?",
    option:["see see makkhee","machchhara","pradooshita air","none of these"],
    answer:"machchhara"
},
{
    question: "kisee floweringya plants in one Pollen mother cell from one mature gametophyte of formation occurs",
    option:["3 samasootree vibhaajana by","1 ardadhasootree and 3 sootree vibhaajana by","1 ardadhasootree and 2 samasootree vibhaajana by","onela ardadhasootree vibhaajana by"],
    answer:"1 ardadhasootree and 2 samasootree vibhaajana by"
},
{
    question: "nikata relationshipee between anthreproduction by occurs:",
    option:["variationon in hraasa","variationon in growth","varchasva in hraasa","none of these"],
    answer:"variationon in hraasa"
},
{
    question: "air pollination in occurs",
    option:["Salvia","Vallisneria","coconut (Coconut)","baotala-brusha (Bottle Brush)"],
    answer:"coconut (Coconut)"
},
{
    question: "forest-paaritntra in lion of poshana level is:",
    option:["T₃","T₄","T₂","T₁"],
    answer:"T₄"
},
{
    question: "haardee-venabarga ko laagoo kior jaa sakataa is, among these whose anupasthiti in?",
    option:["mutation","natural chayana","pumalesnyojana","these sabhee of anupasthiti in"],
    answer:"these sabhee of anupasthiti in"
},
{
    question: "Sertoli cells of control pityootaree of kisa hormone by occurs?",
    option:["GH","prolektina","LH","FSH"],
    answer:"FSH"
},
{
    question: "goldena raathis in kisa vitamin ko sthaanaantarita kior gaor is?",
    option:["vitamin A","vitamin B12","vitamin C","vitamin D"],
    answer:"vitamin A"
},
{
    question: "paddy of kheton in normal naaitrojana sthireeofraka is:",
    option:["raaiwhichbiyama","ewhichspaairilama","osiletorior","phrenkior"],
    answer:"ewhichspaairilama"
},
{
    question: "anunmeelya pollination having paudhon in nishchita roopa from occurs",
    option:["sva-pollination","on-pollination","both","none of these"],
    answer:"sva-pollination"
},
{
    question: "sunraateforest national park sthita is",
    option:["raajasthaana","madhyapradesha","pashchima bngaala","uttarapradesha"],
    answer:"pashchima bngaala"
},
{
    question: "among the following correct of chunaava karen:",
    option:["spnja of joospora","penisiliyama in jemyoolasa","algae in konidior","haaidraa of kaliof (bud)"],
    answer:"haaidraa of kaliof (bud)"
},
{
    question: "myootaajena which-saa is?",
    option:["onesa-re","rediyoaiktiva kirana","sarason gaisa","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "laika operaona and triptophaana operaona correct dhnga from gene of kriormethod rateshaate are",
    option:["baiktirior in","fungus in","yookairiotsa in","none of these"],
    answer:"baiktirior in"
},
{
    question: "pratibnwealth endonyookfaorja of main use occurs:",
    option:["gene laaibreree in","physical pratibnwealth maanachitra banaane in","gene kloninga in","these sabhee in"],
    answer:"these sabhee in"
},
{
    question: "pollen grainon of laghu seedaanu utpanna being in laghuseedaanu maatri cell in",
    option:["one ardadhasootree vibhaajana","one samasootree vibhaajana","one ardadhasootree and one samasootree vibhaajana","one ardadhasootree and two samasootree vibhaajana"],
    answer:"one ardadhasootree and one samasootree vibhaajana"
},
{
    question: "male in Andropause of whom samatulya is?",
    option:["Androgen binding protein","Female menopause","prostaaglaadina","endrojana"],
    answer:"Female menopause"
},
{
    question: "andavaahinee of antima bhaaga is called",
    option:["thisthamasa","empulaa","phimbaree","thesephandeebulama"],
    answer:"thisthamasa"
},
{
    question: "PCR from jaancha is:",
    option:["HIV of","cancer of","kshayaof disease","isjaa of"],
    answer:"HIV of"
},
{
    question: "pratibnwealth endonyookfaorja oftataa is:",
    option:["one DNA rajju ko vishishta sthala on","DNA of both rajjuon ko","DNA of both rajjuon ko kisee bhee sthala on","onela rajjuof RNA ko"],
    answer:"DNA of both rajjuon ko"
},
{
    question: "shaanta ghaatee (Silent Valley) national park sthita is",
    option:["ofrala in","tamilanaadu in","chhatteesagadha in","israteaabaada in"],
    answer:"ofrala in"
},
{
    question: "daarvina ne kisa ship on bhramana kior?",
    option:["H.M.S. eegala","H.M.S. beegala","taaratonika","dee. maitriof"],
    answer:"H.M.S. beegala"
},
{
    question: "one gene whichdaaa doosare gene pairs of prabhaava ko dabaa detaa is। this ghatanaa ko are called",
    option:["epistaisisa","prabhaavitaa","mutation","none of these"],
    answer:"epistaisisa"
},
{
    question: "decomposer (Decomposer) are",
    option:["svaposhee","svath toxinmaposhee","aargenotraophsa","toxinmaposhee"],
    answer:"toxinmaposhee"
},
{
    question: "India in kitane jaivabhaugolika area are?",
    option:["10","13","4","5"],
    answer:"10"
},
{
    question: "among the following kifrom kaoon-tee prevents is?",
    option:["fertilization","andotsarga","veerya patana","aaropana"],
    answer:"fertilization"
},
{
    question: "when snkatotpanna plants and animalon ko thoseof natural aavaasa from alaga one special sthaana on thoseof dekhabhaala is done, ufrom are called",
    option:["svasthaane","baahya sthaane","kraayoprijarveshana","none of these"],
    answer:"baahya sthaane"
},
{
    question: "one chromosome of two najadeeof genes between hogaa",
    option:["twoharaa kraosinga ovara","koee kraosinga ovara naheen","bahuta less kraosinga ovara","niyamita kraosinga ovara"],
    answer:"bahuta less kraosinga ovara"
},
{
    question: "onecotyledonee in graaphtinga birale hee saphala occurs whyki:",
    option:["onecotyledonee in bnda vaiskulara bndala occurs","onecotyledonee kaimbiyamaviheena are","samaanaantara venation occurs","one from more correct"],
    answer:"onecotyledonee kaimbiyamaviheena are"
},
{
    question: "RNA in nihita pyoorina are:",
    option:["guaaneena and edineena","yoorasila and thaayameena","edineena and saaitoseena","yooraasila and guaaneena"],
    answer:"guaaneena and edineena"
},
{
    question: "Menstruation of tatoafla ofrana kisa hormone of vaapasee is?",
    option:["FSH","FSH-RH","Progesterone","Estrogen"],
    answer:"Progesterone"
},
{
    question: "taajamahala of sunratetaa ko is destroying:",
    option:["taapa","yamunaa nadee of pradooshita water","air pradooshaka","all of the above"],
    answer:"air pradooshaka"
},
{
    question: "DNA of two paolinucleotide shrrinkhalaaen kaisee isn?",
    option:["samaantara","asantata","pratisamaantara","ardadhasnrakshee"],
    answer:"pratisamaantara"
},
{
    question: "seedaanda of seedaandaofya in paaee jaane having rachanaa which sporophaaita of antima is, ufrom koar are called",
    option:["guruseedaanu maatricell","laghuseedaanu maatricell","sahaayaka cell","none of these"],
    answer:"guruseedaanu maatricell"
},
{
    question: "organismna of atirikta sthaleeya origin by whom bataaee gayee?",
    option:["kaitestaraophijma","species formation","painsaonmior","svath origin"],
    answer:"painsaonmior"
},
{
    question: "when koee gene-whichdaaa doosare of prabhaava ko chhipaa detaa is, to ifrom are called",
    option:["mutation","prabhaavitaa","Epistasis","none of these"],
    answer:"Epistasis"
},
{
    question: "thesein dvikhandana in which is found?",
    option:["waterkumbhee","lotus","ameebaa","sarpa"],
    answer:"ameebaa"
},
{
    question: "Cryptorchidism of avasthaa in vrishana",
    option:["ooneshana by baahara niofla dior jaataa is","embryo in vrishana vikasita naheen ho paataa is","sperm utpanna being from vrishana asamartha occurs","vrishana scrotum in jaane in asamartha occurs"],
    answer:"vrishana scrotum in jaane in asamartha occurs"
},
{
    question: "kraosinga ovara kisa avasthaa in occurs?",
    option:["leptoteena","saayatooftheseesisa","paiinsecteena","daayaoftheseesisa"],
    answer:"paiinsecteena"
},
{
    question: "among the following which-saa enteebaodee elarjee shuroo does?",
    option:["IgM","IgE","IgD","IgA"],
    answer:"IgE"
},
{
    question: "chhotee samashti from allele of aakasmika vilopana is",
    option:["anukoolana","genetic apavaahana","species formation ofraka","chayanaatmaka daaba"],
    answer:"genetic apavaahana"
},
{
    question: "kisee haaibrida kraosa in sntati of geneotaaipika anupaata occurs",
    option:["9 : 3 : 3 : 1","1 : 1 : 1 : 1","1 : 2 : 1","1 : 7 : 1"],
    answer:"1 : 2 : 1"
},
{
    question: "valaorofra maaitokondrior (Nebenkern) of aksheeya filament of fouron ora Arrangement where occurs?",
    option:["Head","madhyapeesa","poonchha of end piece","poonchha of main peesa"],
    answer:"madhyapeesa"
},
{
    question: "gaimeeta of formation ko are called:",
    option:["gaimeetojenesisa","saayatoofyanesisa","sporojenesisa","miyosaayata"],
    answer:"gaimeetojenesisa"
},
{
    question: "hybridization of pahachaana by whom is done?",
    option:["PCR","otorediyograaphee","ELISA","ilektarophoresisa"],
    answer:"otorediyograaphee"
},
{
    question: "one hee sthaana on upasthita rahane having gene, jinaof vibhinna abhivyakti ho, are called:",
    option:["bahualeela","bahugene","onkogene","sahaprabhaavitaa gene"],
    answer:"bahugene"
},
{
    question: "graama (+) and graama (-) bacteria in bhinnataa is found thoseof",
    option:["cell wall in","nucleus in","mesosoma in","none of these"],
    answer:"cell wall in"
},
{
    question: "sabafrom badaaa paaritntra is",
    option:["forest of paaritntra","samudree paaritntra","pond of paaritntra","ghaasa sthala of paaritntra"],
    answer:"samudree paaritntra"
},
{
    question: "fish of maansa anya jaanavaron of maansa from achchhaa is, whyki thisin prachura amount in is found।",
    option:["protein","water","vasaa","staarcha"],
    answer:"protein"
},
{
    question: "two Microsporangia yukta Monothecous anther in which is found",
    option:["braasiof","wealthiorn","ligyoomsa","hibiskasa"],
    answer:"hibiskasa"
},
{
    question: "saradaara sarovara baandha this nadee on banaa is",
    option:["jhelama on","malemadaa on","taaptee on","voarsa on"],
    answer:"malemadaa on"
},
{
    question: "paaritntra shabda kisane dior?",
    option:["khuraanaa","elenabarga","A.G. taansale","none of these"],
    answer:"A.G. taansale"
},
{
    question: "owhichna divasa when manaaor jaataa is?",
    option:["5 sitambara","16 sitambara","25 disambara","30 janavaree"],
    answer:"16 sitambara"
},
{
    question: "among these which-see greenhouse gas is?",
    option:["meethena","ofrbana daaioksaaida","klorophloroofrbana","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "among the following watereeya ghaasa which-see is",
    option:["vailisanairior","Hydrilla","whichsteraa","among these sabhee"],
    answer:"whichsteraa"
},
{
    question: "Tapetum which ovule in badalaava ho, is called",
    option:["Amoeboid tapetum","Glandular tapetum","Integumentary tapetum","Flagellar tapetum"],
    answer:"Integumentary tapetum"
},
{
    question: "saapekshika jaivika sntulana of hraasa of ofrana is:",
    option:["nimna temperature","uchcha temperature","radiation","pollution"],
    answer:"pollution"
},
{
    question: "traansakripshana of samaapti by whom is?",
    option:["ko-protein of by","sigmaa phaiktara of by","ro-protein by","omegaa phaiktara of by"],
    answer:"ro-protein by"
},
{
    question: "when sntati of origin onela janaka by is taba this koar is called?",
    option:["sexual reproduction","asexual reproduction","both (A) and (B)","aantarika fertilization"],
    answer:"asexual reproduction"
},
{
    question: "operaona maodala kisane prastaavita kior?",
    option:["neerenabarga ne","jaiwhen and monaoda ne","khuraanaa","methaaee"],
    answer:"jaiwhen and monaoda ne"
},
{
    question: "sunrateforest of snrakshita jaivamndala India of kisa raajya of antargata is?",
    option:["bihaara","uttara pradesha","asama","pashchima bngaala"],
    answer:"pashchima bngaala"
},
{
    question: "mineemother disease occurs:",
    option:["kromiyama by","kaidamiyama of by","mithaaila marakaree by","rediyoonetiva tatva of by"],
    answer:"mithaaila marakaree by"
},
{
    question: "pratibnwealth enzyme Hind-III of srota is:",
    option:["ee. kolaaee","bee. kolaaee","baiseelasa","heemopheelasa thesephlooenjee"],
    answer:"heemopheelasa thesephlooenjee"
},
{
    question: "nyoomaitophora normalth paae jaate are:",
    option:["marudbhitwon in","waterodbhitwon in","meesophaaitsa in","lavanodbhitwon in"],
    answer:"lavanodbhitwon in"
},
{
    question: "bekaree in experiment being having yeesta is:",
    option:["saikaromaathiseeja fromreevaathisee","saikaromaathiseeja oktosporasa","saikaromaathiseeja kyookoraathis","raaiwhichfromkaromaayaseeja"],
    answer:"saikaromaathiseeja fromreevaathisee"
},
{
    question: "femaleon in surgicalkrior by bndhoarkarana process ko are called:",
    option:["naliof uchchhedana","shukravaahaka uchchhedana","pratoarropana","rodhaka"],
    answer:"naliof uchchhedana"
},
{
    question: "Follicles of rupture and ova of release is called",
    option:["maithuna","snyugmana","eggobhedana","eggeekarana"],
    answer:"eggobhedana"
},
{
    question: "linga jaancha of which-see method of highest durupayoga is done?",
    option:["Clotting test","amniyofromntesisa","irithroblaastosisa","enjeeograama"],
    answer:"amniyofromntesisa"
},
{
    question: "genetic roopa from one samaana organisms ko tissue kalchara of by vikasita is done, ifrom are called:",
    option:["graaphtinga","kloninga","plaajmida","hybridization"],
    answer:"kloninga"
},
{
    question: "land of urvaraa shakti ko onibhaashita karane having organism samooha is:",
    option:["maaikrobsa","jaivika khaada","yeesta","jaivika insectaanunaashaka"],
    answer:"maaikrobsa"
},
{
    question: "kramika development in yogadaana is",
    option:["sva-pollination of","on-pollination of","ofyika pravarwaealth of","hybridization of"],
    answer:"on-pollination of"
},
{
    question: "kisa gene with enzyme RNA paolimareja jutaa huaa rahataa is?",
    option:["niyntraka gene","promotara gene","snrachanaatmaka gene","oonetara gene"],
    answer:"promotara gene"
},
{
    question: "trika UUU koda kisafor occurs?",
    option:["lyooseena","methioneena","phenilaeleneena","glaathiseena"],
    answer:"phenilaeleneena"
},
{
    question: "Tunica albuginea whose aavarana is?",
    option:["shishna","vrishana","eggaashaya","vrishana kosha"],
    answer:"vrishana"
},
{
    question: "Mirabilis plants of laala (RR) and sapheda (rr) flowers of hybridization from gulaabee (Rr) flower is produced। gulaabee flower of hybridization sapheda flower from karaaor jaae to snbhaavita pheenotaaipa anupaata koar hogaa?",
    option:["laala : gulaabee : sapheda (1 : 2 : 1)","gulaabee : sapheda (1 : 1)","laala : gulaabee (1 : 1)","laala : sapheda (3 : 1)"],
    answer:"gulaabee : sapheda (1 : 1)"
},
{
    question: "EcoRI of enzyme srota what is?",
    option:["ee. kolaaee","tee.ema.vee.","praayaona","none of these"],
    answer:"ee. kolaaee"
},
{
    question: "water vaidyuta of snchalana (ilektarophoresisa) of use do:",
    option:["DNA ko prithaka karane for","RNA ko prithaka karane for","protein ko prithaka karane for","among these sabhee ko prithaka karane for"],
    answer:"among these sabhee ko prithaka karane for"
},
{
    question: "DNA of paairimidina in is found:",
    option:["thaayameena and saaitosina","edineena and guaanina","saaitosina and yooresila","thaayamina and yooresila"],
    answer:"thaayameena and saaitosina"
},
{
    question: "among the following which-from paoleepeptaaida human insulina in paae jaate are?",
    option:["A and B","A and C","B and C","none of these"],
    answer:"A and B"
},
{
    question: "mashahoora vaijnyaanika indala mainth jaane jaate are apane",
    option:["matara of paudhon of ofrya hetu","genetics of niyamon hetu","matara of paudhon of ofrya and genetics of niyamon hetu","none of these"],
    answer:"matara of paudhon of ofrya and genetics of niyamon hetu"
},
{
    question: "which-saa pyramid hameshaa ooon of ora occurs, ultaa kabhee naheen occurs?",
    option:["number of pyramid","jaivaamount of pyramid","energy of pyramid","watereeya vyavasthaa of pyramid"],
    answer:"energy of pyramid"
},
{
    question: "paoleeploidee ko prerita karane for kisa rasaayana of is used?",
    option:["saaitooftheseina","naaitrasa amla","kaolcheeseena","IAA"],
    answer:"kaolcheeseena"
},
{
    question: "kisee Dithecous anther in occurs",
    option:["4 microsporangia","3 microsporangia","2 microsporangia","1 microsporangia"],
    answer:"4 microsporangia"
},
{
    question: "ELISA testa in prayukta enzyme (Reagent) ko are called:",
    option:["endonyookliyeja","paoleemireja","laaigeja","peroksideja"],
    answer:"peroksideja"
},
{
    question: "pratijaiviof pratirodhee bacterium of praadurbhaava among these whose udaaharana is?",
    option:["anukoolee radiation","traansadakshana","kisee community in poorvasthita variation","apasaaree krama development"],
    answer:"kisee community in poorvasthita variation"
},
{
    question: "beetee (Bt) toxin of rave kuchha bacteriumon by banaae jaate are, but bacterium svayn ko naheen maarate are whyki:",
    option:["toxin nishkariya occurs","bacterium toxin of prati pratirodhee is","toxin amature is","toxin bacterium of special thailee in milataa is"],
    answer:"toxin nishkariya occurs"
},
{
    question: "one contraceptive pill ovulation ko kisa praofra rokatee is?",
    option:["phailopiyana tyooba ko avaruddha kara","FSH and LH ko rokakara","FSH and LH pravana ko badhaaakara","Released ovum ko turnta barbaada kara"],
    answer:"FSH and LH ko rokakara"
},
{
    question: "baayolistika or gene gun of use in which occurs?",
    option:["plaajmida ko oftane for","kate DNA ko whichdane for","vijaateeya DNA ko onposhee cells in pravesha karaane for","DNA ko shuddha karane for"],
    answer:"vijaateeya DNA ko onposhee cells in pravesha karaane for"
},
{
    question: "antibody by whom banatee is?",
    option:["phaaibroblaasta","plaajmaa cells","histiyosaaitsa","maasta cells"],
    answer:"plaajmaa cells"
},
{
    question: "dee.ena.e. of kate bhaagon ko whichdane hetu among these whose is used?",
    option:["traansakripteja","laaigeja","raaibonyookfaorja","none of these"],
    answer:"laaigeja"
},
{
    question: "among the following which-saa yauna-snlagna disease is?",
    option:["rataundhee","glookomaa","heemophilior","sabhee"],
    answer:"heemophilior"
},
{
    question: "among the following which-saa primary reproduction organ is?",
    option:["scrotum","penis","vrishana","prosteta"],
    answer:"vrishana"
},
{
    question: "if kisee lake in DDT is found to sarvaadhika concentration paaee jaaegee:",
    option:["paada plavakon in","animal plavakon in","fish bhakshaka chidaiyon in","machhaliyon in"],
    answer:"fish bhakshaka chidaiyon in"
},
{
    question: "daarvina of phincha one achchhaa udaaharana is",
    option:["audyogika melaanijma of","snyojee kadaee of","anukoolee radiation of","abhisaaree jaiva-development of"],
    answer:"anukoolee radiation of"
},
{
    question: "if normal male of shaadee heemophilior of vaahaka staree from ho to utpanna male offspringon of koar sthiti hogee?",
    option:["sabhee heemophilior from grasta","50% normal, 50% diseasegrasta","sabhee normal","sabhee disease of vaahaka"],
    answer:"50% normal, 50% diseasegrasta"
},
{
    question: "one food chain in among the following sarvaadhika number whose is?",
    option:["producer","primary consumer","secondary consumer","decomposer"],
    answer:"producer"
},
{
    question: "reda daataa buka in sammilita is",
    option:["vilupta ho rahe paudhon of soochee","durlabha paudhon of soochee","aapattigrasta praaniyon of soochee","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "paudhon in geneticsya abhiorntriof for whose bahutaayata in experiment occurs?",
    option:["egrobaikteeriyama tyoomepheshiyansa","jenthomonaosa sitraaee","baisilasa kaogyoolensa","klaostareediyama frompteeless"],
    answer:"egrobaikteeriyama tyoomepheshiyansa"
},
{
    question: "flower of female reproduction organ ko are called",
    option:["jaaornga","pumnga","anther","punofsara"],
    answer:"jaaornga"
},
{
    question: "bacterium of cellwall ko todakara thatof DNA and anya vrihad ajaiva anuon ko mukta karane hetu among these which-saa enzyme is used?",
    option:["laathisojaaima","fromluleja","ofitineja","kolaijineja"],
    answer:"laathisojaaima"
},
{
    question: "aastarelior of infantpaddyee praaniyon of anukoolee radiation among these whose udaaharana is?",
    option:["apasaaree krama development","abhisaaree krama development","saalteshana","none of these"],
    answer:"apasaaree krama development"
},
{
    question: "baartholina of grnthi is",
    option:["vaasa diphensa of kinaaron on","yoni of kinaaron on","pakshiyon of poonchha on","amphibianson of sira on"],
    answer:"yoni of kinaaron on"
},
{
    question: "thesein which videshee speesheeja naheen is?",
    option:["lentaanaa lessaaraa","maingeepheraa indiof","aaikaornior kresipisa","paartheniyama histerophoraso"],
    answer:"maingeepheraa indiof"
},
{
    question: "pollen grain occurs",
    option:["haploid","diploid","triploid","tetraploid"],
    answer:"haploid"
},
{
    question: "meenameaataa disease vikasita occurs:",
    option:["peya water in aarfaromnika snchita being from","peya water in phloraaida jamaa being from","paare from pradooshita machhaliyon of fromforest from","water in tela of phaila jaane from"],
    answer:"paare from pradooshita machhaliyon of fromforest from"
},
{
    question: "eekha (sugarcane) in graaphtinga naheen can be, whyki",
    option:["vascular bundles bikhare are","phloema jaailama of anrate of ora are","eekha of plants komala (delicate) are","this chota ko sahane in asamartha occurs"],
    answer:"vascular bundles bikhare are"
},
{
    question: "anunmeelya pollenita flower are",
    option:["insect pollenita","chamagaadada pollenita","svapollenita","water pollenita"],
    answer:"svapollenita"
},
{
    question: "________ in pattiyon of khandon by ofyika reproduction occurs?",
    option:["egeva and oflenchoya","baayophilama and oflenchoya","aisaperegasa and braayophilama","kraaeefromnthiyama and egeva"],
    answer:"baayophilama and oflenchoya"
},
{
    question: "genetic complementary which Nullisomic organism in hogaa",
    option:["2n - 1","2n - 2","2n + 1","2n + 2"],
    answer:"2n - 2"
},
{
    question: "airmndala of nichale bhaaga from shikhara up to air stambha (kaolama) in owhichna of motaaee kisa iofee in maapee jaatee is?",
    option:["daobasana iofee","araba iofee","paaskala iofee","none of these"],
    answer:"daobasana iofee"
},
{
    question: "one ardadhasootree cell vibhaajana from kitane male gamete banate are",
    option:["4","1","2","8"],
    answer:"4"
},
{
    question: "ristarikshana enzyme among the following from which is?",
    option:["laaigeja","onesonyookfaorja","endonyookfaorja","onesonyookfaorja and endonyookfaorja both"],
    answer:"onesonyookfaorja and endonyookfaorja both"
},
{
    question: "prosteta cancer for prayukta major enjaaima kleenikala jaancha which-saa is?",
    option:["emaaileja","kshaareeya phaaspheteja","γ-GT","amleeya phaaspheteja"],
    answer:"amleeya phaaspheteja"
},
{
    question: "if kisee flower of anther and stylena one with mature ho jaaen to ifrom are called",
    option:["Allogamy","Dichogamy","Homogamy","Syngamy"],
    answer:"Homogamy"
},
{
    question: "alkohala from ‘vinegaara’ of formation by whom occurs?",
    option:["baisilasa sabatilisa","klostaridiyama","esitobaiktara esiti","ewhichtobaiktara"],
    answer:"esitobaiktara esiti"
},
{
    question: "apamaarjaka snroopana and dhulaaee in kapadaon from tela of dhabbe hataane for kisa sookshamaorganismee of is used?",
    option:["saiofromaathiseeja fromrebaayasee","stareptokokasa","kaindeedaa laaipolitiof","laaipeja"],
    answer:"kaindeedaa laaipolitiof"
},
{
    question: "RNA for which correct is?",
    option:["A=U","G=C","A+C","AEG"],
    answer:"A=U"
},
{
    question: "among the following kifrom stanadhaariyon of svarnaofla are called?",
    option:["mesowhichika eraa","seenowhichika eraa","peliyowhichika eraa","koee naheen"],
    answer:"seenowhichika eraa"
},
{
    question: "among the following which uchcha organisms in gene kloninga hetu one vaahaka as experiment occurs?",
    option:["baikulo virus","saalamonelaa taayapheemyooriyama","raaiwhichpasa naaigreekainsa","ritrovirus"],
    answer:"ritrovirus"
},
{
    question: "energy of pyramid occurs, hameshaa:",
    option:["seedhaa","ultaa","tirachhaa","among these sabhee"],
    answer:"seedhaa"
},
{
    question: "Bt taoksina of baare in sacha what is?",
    option:["thisof baiseelasa of anraate enteetaoksina occurs","nishkariya prototaoksina insect of aanta in sakriya ho jaataa is","Bt protein taoksina baiseelasa in sakriya rahataa is","sakriya taoksina peedaka of andaashaya in jaakara reproduction in baadhaa daalataa is"],
    answer:"nishkariya prototaoksina insect of aanta in sakriya ho jaataa is"
},
{
    question: "pollen thaile kinain paae jaate are",
    option:["anther","floweraasana","eggaashaya","dalapunja"],
    answer:"anther"
},
{
    question: "svasthaane conservation (In situ conservation) of udaaharana is",
    option:["animal udoarna","vaanaspatika udoarna","organism saphaaree park","among these sabhee"],
    answer:"organism saphaaree park"
},
{
    question: "saayanobacteria of experiment biofertilizer as is done:",
    option:["wheat","maize","paddy","sugarcane"],
    answer:"paddy"
},
{
    question: "pollen grain of baahyachola banaa occurs",
    option:["pektofromluloja","lignofromluloja","sporopaolenina","pollen kita"],
    answer:"sporopaolenina"
},
{
    question: "among the following from which yauna snfourita disease is?",
    option:["gonorior","malaria","isjaa","none of these"],
    answer:"gonorior"
},
{
    question: "milara of experiment in use in laaor gaor thaa",
    option:["H₂O, HCN, H₂ and CH₄","CH₄, NH₃, N₂ and H₂O","CH₄, HCN, N₂ and H₂","CH₄, H₂O, N₂ and H₂"],
    answer:"CH₄, NH₃, N₂ and H₂O"
},
{
    question: "yauna snfourita disease is:",
    option:["khasaraa","tee.bee.","gonorior","taayaphaaida"],
    answer:"gonorior"
},
{
    question: "vishuddha laala flower and vishuddha sapheda flower having paudhon in hybridization karaane from pahalee sntati in sabhee gulaabee flower having plants mile। this one praofra of",
    option:["incomplete dominance","poorna prabhaavitaa","snkara","none of these"],
    answer:"incomplete dominance"
},
{
    question: "among the following which-saa aanvika naaitrojana poshaka as use occurs?",
    option:["mithenomonaasa","myookara","raaiwhichbiyama","spaaidiseaseaairaa"],
    answer:"raaiwhichbiyama"
},
{
    question: "child's blood group O and father of B blood group ho, to father of geneotaaipa hogaa",
    option:["IᴮIᴮ","Iᴮi","IᴬIᴮ","ii"],
    answer:"Iᴮi"
},
{
    question: "uchcha kula of paudhon of jadaon and fungus between banaae jaane having symbiotic relationship ko are called:",
    option:["biodiversity","laaiofna","nodyoola","maaikoraaijaa"],
    answer:"maaikoraaijaa"
},
{
    question: "yootophiofshana praayh dekhaa jaataa is:",
    option:["svachchha watereeya lakeon in","oceanon in","pahaadaon in","deserton in"],
    answer:"svachchha watereeya lakeon in"
},
{
    question: "among the following which videshee species is?",
    option:["katalaa","rohoo","neela onchaa","hitpokaimpasa"],
    answer:"neela onchaa"
},
{
    question: "1928 in one vaijnyaanika ne first prabhaavee pratijaivika padaartha of khoja of। vaijnyaanika va pratijaivika padaartha are:",
    option:["phleminga-stareptomaayaseena","phleminga-penisileena","vaaksamaina-penisileena","vaaksamaina-stareptomaayaseena"],
    answer:"phleminga-penisileena"
},
{
    question: "indala of second niyama is",
    option:["separation of niyama","prabhaavitaa of niyama","bahuorganismee vnshaagati of niyama","svatntra apavyoohana of niyama"],
    answer:"svatntra apavyoohana of niyama"
},
{
    question: "sarvafirst formed paaraorganismee cow of name among these which thaa?",
    option:["dejee","mejee","daolee","rojee"],
    answer:"rojee"
},
{
    question: "anther relationshipita is",
    option:["pollen grain formation from","pollen grain development from","flowerkaliof of khulane from","stigma by pollen grain of grahana from"],
    answer:"flowerkaliof of khulane from"
},
{
    question: "among the following which-saa plant dvilingee is?",
    option:["papeetaa","khajoora","coconut","among these koee two"],
    answer:"coconut"
},
{
    question: "ghareloo apavaahita water (seeveja) of reservoiron, nadiyon, lakeon in milane from among these in which growth is?",
    option:["B.O.D.","C.O.D.","(A) and (B) both","none of these"],
    answer:"(A) and (B) both"
},
{
    question: "reservoiron in suposhana for sabafrom prabhaavashaalee are:",
    option:["aofrbanika phaospheta","ofrbanika padaartha","algae","bacterium"],
    answer:"aofrbanika phaospheta"
},
{
    question: "among the following which-see baayogaisa is?",
    option:["CO₂","CH₄","N₂","NO"],
    answer:"CH₄"
},
{
    question: "pashuon of more charane due to from occurs:",
    option:["forestya animalon of naasha","forestspati of naasha","paudhon, animalon and soil of naasha","foreston of naasha"],
    answer:"paudhon, animalon and soil of naasha"
},
{
    question: "gene of Segregation kisa dauraana occurs?",
    option:["metaapheja","enaapheja","propheja","embryo formation"],
    answer:"enaapheja"
},
{
    question: "siphalisa for sabafrom upayukta jaancha is:",
    option:["ELISA","PCR","VDRL","DNA haaibreedaaijeshana"],
    answer:"VDRL"
},
{
    question: "enteehistaamina and steraoyada of experiment from sheeghrataa from aaraama milataa is:",
    option:["elarjee from","naosior from","kapha from","sirarateda from"],
    answer:"elarjee from"
},
{
    question: "poliyo ko chikitseeya bhaashaa in koar are called?",
    option:["shaishava lakavaa","wateraantaof","whendae of lakavaa","among these sabhee"],
    answer:"shaishava lakavaa"
},
{
    question: "edeenoseena diemeeneja of lessee ko kisa praofra doora kior jaa sakataa is?",
    option:["gene therepee by","enteebaayotiksa banaakara","human-growth haormona by","intarapheraona of utpaadana kara"],
    answer:"gene therepee by"
},
{
    question: "indala of avadhaaranaa ko indala of niyama in kisane roopaantarita kior?",
    option:["korensa","lionmaika","hyoogo di vreeja","maorgana"],
    answer:"korensa"
},
{
    question: "vidaala oneekshana kisa beemaaree for is done?",
    option:["malaria","taaiphaaida","dengoo","none of these"],
    answer:"taaiphaaida"
},
{
    question: "one sva-nishechita trisnkara plant utpanna karegaa",
    option:["4 bhinna gamete va 16 bhinna yugmanaja","8 bhinna gamete va 16 bhinna yugmanaja","8 bhinna gamete va 32 bhinna yugmanaja","8 bhinna gamete va 64 bhinna yugmanaja"],
    answer:"8 bhinna gamete va 64 bhinna yugmanaja"
},
{
    question: "onerosoma among the following from whose snbhaaga is?",
    option:["gaoljeeofya","human sperm of sheersha","human sperm of madhya bhaaga","none of these"],
    answer:"human sperm of sheersha"
},
{
    question: "among the following from which naaitrojana chaorpachaya does?",
    option:["raaiwhichbiyama","syoodomonaasa","ewhichbaiktara","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "goldena raathis in is found।",
    option:["vitamin-A","vitamin-B","vitamin-C,D","rice from one petrola-sareekhaa eenwealth banaane in"],
    answer:"vitamin-A"
},
{
    question: "kisa phala of seedchola khaaor jaataa is?",
    option:["shareephaa","leechee","jaayaphala","among these sabhee ko"],
    answer:"among these sabhee ko"
},
{
    question: "tiddaa in linga nirdhaarana occurs",
    option:["XY praofra","XO praofra","ZW praofra","none of the above"],
    answer:"XO praofra"
},
{
    question: "AaBbCc of testa kraosa by kitane pheenotaaipa utpanna are?",
    option:["16","12","8","4"],
    answer:"8"
},
{
    question: "tripala enteejena vaccine of use naheen occurs:",
    option:["diphtheria for","ontusisa for","taayaphaaida for","tetanasa for"],
    answer:"taayaphaaida for"
},
{
    question: "oofjaaof phregiantsa when becomes is?",
    option:["pratilekhana","transfer","dvicharacterna","paarakramana"],
    answer:"dvicharacterna"
},
{
    question: "madhumeha diseaseiyon by use in laaor jaane having insulina of whom agnaashaya from nioflaa jaataa is?",
    option:["sooara","bakaree","murgaa","buffalo"],
    answer:"sooara"
},
{
    question: "which jaiva fertilizer is?",
    option:["maaikoraaijaa","naaitrojana sthireeofraka bacterium","naaitrojana sthireeofraka saayanobacteria","all of the above"],
    answer:"all of the above"
},
{
    question: "human gametes in chromosomes of kitanee number is?",
    option:["21","23","44","46"],
    answer:"23"
},
{
    question: "among the following which-saa jaiva technique from relationshipita is?",
    option:["plaastidsa","plaajmidsa","mutation","haaibrida"],
    answer:"plaajmidsa"
},
{
    question: "among the following which-saa chemical padaartha owhichna of onta on asara daalataa is?",
    option:["klorophloroofrbana","kloreena","heksaaphloroofrbana","maolikyoolara ofrbana"],
    answer:"klorophloroofrbana"
},
{
    question: "protoplaasta kalchara of phyoowhichjena what is?",
    option:["tarala naaitrojana","PEG","laiktika amla","among these sabhee"],
    answer:"PEG"
},
{
    question: "indala of experiments in vioneeta traits of whichdaee ko koar are called?",
    option:["gene","pheenotaaipa","geneotaaipa","allele"],
    answer:"allele"
},
{
    question: "among these kinaof svara uchcha picha (svaramaana) of occurs",
    option:["male","staree","kinmaale (hijadaaa/chhakoaf)","none of these"],
    answer:"staree"
},
{
    question: "kisa phala of seedchola khaaor jaataa is",
    option:["jaayaphala","leechee","shareephaa","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "embryokosha in among the following which-saa naheen occurs",
    option:["egg samuchchaya","two dhruveeya nucleus","guruseedaanureproduction cell","enteepodalsa"],
    answer:"guruseedaanureproduction cell"
},
{
    question: "kaliof ropana udaaharana is:",
    option:["ofyika reproduction of","tissue culture of","sexual reproduction of","praofrnana of"],
    answer:"ofyika reproduction of"
},
{
    question: "vikasita sperm ko poshana kisafrom milataa is?",
    option:["antarkoshiofya cell","soanmetogoniyama","sperm cell","sartolee cell"],
    answer:"sartolee cell"
},
{
    question: "tritiofla human by formed first paddyya crop is। this wheat of kisawith hybridization karaof taiorra of gaee is?",
    option:["raaee","millet","sugarcane","jau"],
    answer:"raaee"
},
{
    question: "among the following from which natural paaritntra of udaaharana is?",
    option:["forest","nadee","pond","sabhee"],
    answer:"sabhee"
},
{
    question: "human blood AB varga in",
    option:["enteebaodee upasthita are","enteebaodee anupasthita are","enteebaodee A upasthita are","enteebaodee B upasthita are"],
    answer:"enteebaodee anupasthita are"
},
{
    question: "DNA of naonakodinga krama ko are called:",
    option:["vikhndita gene","introna","onesona","none of these"],
    answer:"introna"
},
{
    question: "rodha code of number is।",
    option:["one","two","three","four"],
    answer:"three"
},
{
    question: "among the following which-saa correct krama is?",
    option:["gametereproduction – snyugmana – embryo reproduction – yugmajaa","snyugmana – gametereproduction – yugmaja – embryo reproduction","gametereproduction – snyugmana – yugmaja – embryo reproduction","yugmaja – embryo reproduction – snyugmana – gametereproduction"],
    answer:"gametereproduction – snyugmana – yugmaja – embryo reproduction"
},
{
    question: "among these vilupta ho gae are:",
    option:["dodo","laala paandaa","steelarsa see ofoo","dodo and steelarsa see ofoo"],
    answer:"dodo and steelarsa see ofoo"
},
{
    question: "flower of male reproduction-organ ko are called",
    option:["jaaornga","pumnga","korolaa","anya"],
    answer:"pumnga"
},
{
    question: "kisee aavrittaseedee of endosperm cell in 24 chromosome are। thisof gamete in of chromosome number hogee",
    option:["8","16","24","48"],
    answer:"8"
},
{
    question: "pollen grain of cytoplasm in which wealthee occurs",
    option:["vasaa and staarcha","protein","staarcha and Flavonoids","DNA"],
    answer:"vasaa and staarcha"
},
{
    question: "kaee traits ko prabhaavita karane having gene is called",
    option:["edeetiva","pliyotraopika","epistetika","sapleeintaree"],
    answer:"pliyotraopika"
},
{
    question: "among the following which-saa ecological pyramid formation in bhaaga naheen letaa?",
    option:["shushka bhaara","vyashtiyon of number","energy pravaaha of rate","taajaa bhaara"],
    answer:"taajaa bhaara"
},
{
    question: "female in Clitoris of whom samajaata is?",
    option:["male of Penis of samajaata","male of shishna of samaroopa","Vestigeal organ","prosteta of samajaata"],
    answer:"male of Penis of samajaata"
},
{
    question: "kisee pollen grain of baaharee level among the following kisa pratirodhee padaartha from banaa occurs",
    option:["tainina","pektofromluloja","sporopolenina","liganina"],
    answer:"sporopolenina"
},
{
    question: "among these which bacterium janita disease is?",
    option:["kushtha disease","tuberculosis","isjaa","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "reproduction-prithakataa aavashyaka is:",
    option:["organisms of astitva for","vibhinna speciesyon in suspashtataa banaae rakhane for","ganeeja of anukoolataa for","death rate of growth for"],
    answer:"vibhinna speciesyon in suspashtataa banaae rakhane for"
},
{
    question: "anukoolana of aadhaara on bhinna organisms between samaanataa kahalaatee is",
    option:["samaanaantara development","apasaaree development","convergent evolution","kramika development"],
    answer:"convergent evolution"
},
{
    question: "raaibotaaida banaa occurs:",
    option:["raaiboja + phaospheta + yooresila","deeokseeraaiboja + yooresila + phaospheta","thaaimeena + raaiboja + phaospheta","deeoksee raaiboja + phaospheta + edeneena"],
    answer:"raaiboja + phaospheta + yooresila"
},
{
    question: "daatra cell abloodtaa is",
    option:["daihika sahalagna prabhaavee symptom due to","hemoglobin of β-globina shrinkhalaa in glootaimika amla of sthaana on veleena aane due to","DNA of kisee bhee one kshaaraka yugma in onivartana due to","nucleusyukta lnbee hnsiorofra cells by"],
    answer:"hemoglobin of β-globina shrinkhalaa in glootaimika amla of sthaana on veleena aane due to"
},
{
    question: "among the following which-saa one symptom bahugeneeeya vnshaagati of udaaharana is?",
    option:["Mirabilis jalapa in flower of rnga","male bee of utpaadana","udoarna matara in phalee of aakriti","humanon in tvachaa of rnga"],
    answer:"humanon in tvachaa of rnga"
},
{
    question: "one baalaka of blood varga O is and thatof father of blood varga B is to thatof father of gene praaroopa among these which hogaa?",
    option:["IᴼIᴼ","IᴮIᴼ","IᴮIᴮ","IᴬIᴬ"],
    answer:"IᴮIᴼ"
},
{
    question: "eggaashaya from nikalane on human egge in nihita are",
    option:["one Y-chromosome","two X-chromosome","one X-chromosome","XY-chromosome"],
    answer:"one X-chromosome"
},
{
    question: "praaimarsa of use is done:",
    option:["PCR","kloninga","DNA snsaawealth","none of these"],
    answer:"PCR"
},
{
    question: "when one anther amature occurs taba ghane susnbaddha sajaateeya cells of samooha occurs, which are called",
    option:["seedaanureproduction tissue","laghuseedaanu chatushtaya","laghuseedaanureproduction","pollen grain"],
    answer:"seedaanureproduction tissue"
},
{
    question: "thesein which bahuroopataa ko rateshaataa is?",
    option:["spaaidiseaseaairaa","khajoora","bee","papeetaa"],
    answer:"bee"
},
{
    question: "human female of embryo in kisa praofra of Cleavage occurs?",
    option:["Holoblastic and samaana","Meroblastic","Holoblastic","Diploblastic"],
    answer:"Holoblastic and samaana"
},
{
    question: "kisee geneotaaipa AaBBCcDD by kitane praofra of gamete bana sakate are?",
    option:["4","3","16","64"],
    answer:"4"
},
{
    question: "human gamete in of chromosome number is:",
    option:["21","23","44","46"],
    answer:"23"
},
{
    question: "genetic complementary which Nullisomic organism in hogaa",
    option:["2n - 1","2n - 2","2n + 1","2n + 2"],
    answer:"2n - 2"
},
{
    question: "among the following in which sarvaadhika jaivaamount is?",
    option:["sheetoshna forest","traopikala rainfall forest","alpaathese forest","taayagaa"],
    answer:"traopikala rainfall forest"
},
{
    question: "among the following from which virus janita disease is?",
    option:["isjaa","malaria","poliyo","among these sabhee"],
    answer:"poliyo"
},
{
    question: "makoaf in pushta haaibrida kaifrom is obtained?",
    option:["prerita mutation","two haaibrida laatheseon ko kraosa karavaakara","seedon of phailaava DNA with","joardaa producer paudhon from seed praapta karaof"],
    answer:"two haaibrida laatheseon ko kraosa karavaakara"
},
{
    question: "kisafrom vikasita sperm ko poshana milataa is?",
    option:["Interstitial cells","spermatogonia","spermatocytes","Sertoli cell"],
    answer:"Sertoli cell"
},
{
    question: "starobaayalenthasa kuntheeornaa (neelaakurnjee) 12 in the year one baara floweringkarana from gujarataa is। this kisa pahaadaee area in is found",
    option:["ofrala and karnaataka","odaishaa","aandhra pradesha","madhya pradesha"],
    answer:"ofrala and karnaataka"
},
{
    question: "operaona maodala prastaavita kior thaa:",
    option:["vaatsana and krika ne","nirenabarga ne","jaiwhen and monaada ne","none of these"],
    answer:"jaiwhen and monaada ne"
},
{
    question: "pollen grain whose pratinidhitva does",
    option:["male gameteodbhida","female gameteodbhida","both (A) and (B)","none of these"],
    answer:"male gameteodbhida"
},
{
    question: "vishva environment divasa manaaor jaataa is:",
    option:["6 disambara ko","5 joona ko","6 janavaree ko","none of these"],
    answer:"5 joona ko"
},
{
    question: "nyooklika amla paolimara are:",
    option:["nucleotide of","nyookliyosaaida of","amino acid of","nyookliyoprotein of"],
    answer:"nucleotide of"
},
{
    question: "plants in kloninga hetu kisa snvaahaka of use occurs?",
    option:["pBR 322","Ti plaajamida","pBR 322 and Ti plaajamida both","none of these"],
    answer:"pBR 322 and Ti plaajamida both"
},
{
    question: "enzyme laaigeja of is used:",
    option:["DNA ko khndita karane for","khndita DNA ko whichdane for","DNA ko shodhita karane for","organism-pratiofraka of utpaadana kshamataa badhaaane for"],
    answer:"khndita DNA ko whichdane for"
},
{
    question: "insect pratirodhee onaageneee cotton of formation of whom DNA tukadae ko pratoxinta karaakara kior gaor is?",
    option:["one insect of","one bacterium of","cotton of forestee relationshipee of","one virus of"],
    answer:"one bacterium of"
},
{
    question: "among these which andaja is?",
    option:["oneidanaa","kngaaroo","cow","none of these"],
    answer:"oneidanaa"
},
{
    question: "among the following which samaapana kodona is?",
    option:["AUG","CCC","UAG","GGG"],
    answer:"UAG"
},
{
    question: "eggaashaya of najadeeka of phailopiyana tyooba of bhaaga is",
    option:["thisthamasa","thesephandeebulama","greevaa","Ampulla"],
    answer:"thesephandeebulama"
},
{
    question: "pratibnwealth enzyme of khoja from kifrom oftanaa snbhava ho saof?",
    option:["DNA","RNA","protein","among these sabhee"],
    answer:"DNA"
},
{
    question: "lemaarkavaada of relationship is",
    option:["use and anupayoga","upaarjita traits of vnshaagati","(A) and (B) both","none of these"],
    answer:"(A) and (B) both"
},
{
    question: "endometrium whose aavarana banaataa is?",
    option:["Bladder","yoni","uterus","eggvaahinee"],
    answer:"uterus"
},
{
    question: "among the following which cancer from relationshipita is?",
    option:["lipomaa","lyooofmior","limphomaa","all of these"],
    answer:"all of these"
},
{
    question: "if mother of blood group O and infant of bhee blood group O ho to father of blood group koar can be?",
    option:["O","A","B","AB"],
    answer:"O"
},
{
    question: "bandhaorkarana (sterilization) of one method is",
    option:["IUDCB","madhyachchhada","shukravaahikochchhedana","loop"],
    answer:"shukravaahikochchhedana"
},
{
    question: "haploid chromosome in which is found?",
    option:["jaaigota","gamete","embryo","seed"],
    answer:"gamete"
},
{
    question: "photoofmikala smaoga in hameshaa upasthita rahataa is:",
    option:["O₃","H₂S","CO","kloreena"],
    answer:"O₃"
},
{
    question: "staniyon in ‘baara baodee’ prarateshita does",
    option:["staree of cells in upasthita sampoorna heterokromaitina","staree of ofyika cells in two X-chromosomes in from one nishkariya X-chromosome","staree and male of cells in upasthita sampoorna heterokromaitina","male of ofyika cells in upasthita Y-chromosome"],
    answer:"staree of ofyika cells in two X-chromosomes in from one nishkariya X-chromosome"
},
{
    question: "human blood varga which-which from are?",
    option:["A, B, C and O","B, C, D and O","A, B, AB and O","all of the above"],
    answer:"A, B, AB and O"
},
{
    question: "aadi vaataavarana in among the following whose abhaava thaa?",
    option:["naaitrojana","amonior","okseejana","mithena"],
    answer:"okseejana"
},
{
    question: "lnbe va baune matara of plants in monohaaibrida anupaata 3 : 1 is to theseof geneotaaipa koar hogaa?",
    option:["TT × Tt","Tt × Tt","TT × tt","Tt × tt"],
    answer:"Tt × Tt"
},
{
    question: "maize in proteinyukta endosperm ko are called",
    option:["Apophysis","Scutellum","Coleoptile","alyoorona wall"],
    answer:"alyoorona wall"
},
{
    question: "‘poosaa svarnimaa’ sarason of variety kisa disease of pratirodhaka variety is?",
    option:["chilee mojeka vaayarasa","baikteeriyala vaayarasa","shveta gerika","kuchita organmaaree"],
    answer:"shveta gerika"
},
{
    question: "Human female of embryo in kisa praofra of Cleavage occurs?",
    option:["Holoblastic and samaana","Meroblastic","Holoblastic and asamaana","Diploblastic"],
    answer:"Holoblastic and samaana"
},
{
    question: "plants of aisaa which-saa bhaaga is jisain one of anrate doosaree peedhaee is",
    option:["ankurita pollen grain","seed","anishechita ovule","embryo"],
    answer:"seed"
},
{
    question: "among the following which-saa disease protozoa parasitic by snfourita occurs?",
    option:["ameebaayasisa","malaria","oflaajaara","sabhee"],
    answer:"sabhee"
},
{
    question: "thesein which-saa kathana correct naheen is?",
    option:["Ori that sequence is jahaan from replica of shuruaata is।","pashchavirus normal cells ko cancer cells in roopaantarita kara dete are।","paudhon in vijaateeya DNA ko pravesha karaane for genegana of experiment naheen is done।","DNA ko vishishta sthalon on oftane for pratibnwealth of enzyme is used।"],
    answer:"paudhon in vijaateeya DNA ko pravesha karaane for genegana of experiment naheen is done।"
},
{
    question: "human protein alphaa-1 enteetripseena of use which-see beemaaree of nidaana in is done?",
    option:["AIDS","cancer","imphaayafrommaa","uonokta sabhee"],
    answer:"imphaayafrommaa"
},
{
    question: "kraosinga ovara among these kisa avasthaa in occurs?",
    option:["paiinsecteena","diploteena","daaoroftheseesisa","none of these"],
    answer:"paiinsecteena"
},
{
    question: "first human population visphota of ofrana huaa:",
    option:["agriculture","audyogiofkarana","alpaayu vivaaha","sabhyataa in onivartana"],
    answer:"agriculture"
},
{
    question: "among the following which praarnbhika kodona is?",
    option:["AUG","UAG","UAA","UUA"],
    answer:"AUG"
},
{
    question: "when F1 plant lambepana for toxinmayugmajee ko svapollenita karaaor gaor, F2 peedhaee in both lnbe and baune plants utpanna hue। this kisa theory ko siddha does?",
    option:["prabhaavitaa","blendeda vnshaagati","separation of niyama","svatntra apavyoohana of niyama"],
    answer:"separation of niyama"
},
{
    question: "samooha of antibodyja from elarjika krior praarnbha is:",
    option:["IgG","IgE","IgM","IgA"],
    answer:"IgE"
},
{
    question: "eggaashaya from eggaa nikalane of process ko koar are called?",
    option:["oogenesis","ovulation","rawhichchakra","spermatogenesis"],
    answer:"ovulation"
},
{
    question: "anda upakarana in is",
    option:["egg punja","egg va dhruveeya nucleus","egg va prativoarsaanta cells","egg va sahaayaka cells"],
    answer:"egg va sahaayaka cells"
},
{
    question: "kisee onela snkara in geneotaaipa of anupaata hogaa",
    option:["3 : 1","1 : 1","1 : 2 : 1","2 : 1"],
    answer:"1 : 2 : 1"
},
{
    question: "among the following which-saa kshaara RNA in maujooda naheen occurs?",
    option:["thaaimeena","yooraasila","edineena","guaaneena"],
    answer:"thaaimeena"
},
{
    question: "enteekodona kisafrom relationshipita is?",
    option:["t-RNA","m-RNA","r-RNA","genetic RNA"],
    answer:"t-RNA"
},
{
    question: "among the following which virus janita disease is?",
    option:["phloo","poliyo","AIDS","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "human tvachaa of rnga kisafrom niyntrita occurs?",
    option:["onela allele","dvika allele","less from less three prithaka gene","four allele"],
    answer:"less from less three prithaka gene"
},
{
    question: "kisee aabaadee of svaroopa nirbhara does:",
    option:["vitarana on","ghanatva on","jaateeya rachanaa on","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "ofjeerngaa raashtareeya park is:",
    option:["ofrala","karnaataka","bngaala","asoma"],
    answer:"asoma"
},
{
    question: "among these in which erila (aril) naheen is found",
    option:["shareephaa","leechee","mango","miristiof"],
    answer:"mango"
},
{
    question: "human in tvachaa of rngon of vnshaagati udaaharana is:",
    option:["one gene of vnshaagati","two gene of vnshaagati","more gene of vnshaagati","among these sabhee"],
    answer:"more gene of vnshaagati"
},
{
    question: "among the following which-saa bacterium naaitrojana sthireekarana karane in samartha is?",
    option:["ee. kolaaee","raaiwhichbiyama","egrobaiktiriyama","none of these"],
    answer:"raaiwhichbiyama"
},
{
    question: "anulekhana at the time of of DNA that sthala jisa on RNA paolimareja judataa is, is called:",
    option:["graanhee","pramotara","thesehensara","niormaka"],
    answer:"pramotara"
},
{
    question: "indala ne one shuddha bainganee flower having matara of plants ko sapheda flower having plants from kraosa karavaaor to pahalee peedhaee in kaifrom plants mile?",
    option:["sabhee bainganee flower having plants","sabhee sapheda flower having plants","50% bainganee and 50% sapheda flower having plants","75% bainganee and 25% sapheda flower having plants"],
    answer:"sabhee bainganee flower having plants"
},
{
    question: "which-saa plant maingrova area in is found?",
    option:["raaiwhichphoraa","baboola","cheeda","tektonaa"],
    answer:"raaiwhichphoraa"
},
{
    question: "kisee Monohybrid cross of Phenotypes of F2 vnshaja in anupaata is",
    option:["3 : 1","1 : 2 : 1","9 : 3 : 3 : 1","2 : 1"],
    answer:"3 : 1"
},
{
    question: "baisilasa thurinjiensisa by secretionita toxin protein among these which is?",
    option:["tyoobuleena","insulina","kraaee protein","among these sabhee"],
    answer:"kraaee protein"
},
{
    question: "anaavarodhita reproduction kshamataa is:",
    option:["birth rate","thatna kshamataa","biodiversity","reproduction kshamataa"],
    answer:"reproduction kshamataa"
},
{
    question: "prithvee sammelana kisa year aayojita huaa thaa?",
    option:["1972 in","1992 in","1952 in","among these sabhee"],
    answer:"1992 in"
},
{
    question: "bacterium and virus by human in being having of disease pataa karane for upayukta ELISA method kisa theory on aadhaarita is?",
    option:["pratijana-antibody krior","pratijana-pratijana krior","antibody-antibody krior","none of these"],
    answer:"pratijana-antibody krior"
},
{
    question: "among the following by whom insectnaashee paairethrama made jaataa is?",
    option:["saaimopogona","tephrosior","kraaifromntheemama","viteeverior"],
    answer:"kraaifromntheemama"
},
{
    question: "paudhon in neemaitodon from being having diseases ko jaiviofya control among the following by whom ofragara siddha huaa?",
    option:["paathisolithasa tiktoriyasa","syoodomonaasa frompaisior","glaaioklaidiyama vaairasa","peesilomaathiseeja lilaisinasa"],
    answer:"peesilomaathiseeja lilaisinasa"
},
{
    question: "Egg apparatus banaa occurs",
    option:["Egg cell","Synergids","Antipodals","both (A) and (B)"],
    answer:"both (A) and (B)"
},
{
    question: "one chhotee fish saarka of aadhaara on chipaof rahatee is and thisfrom bhojana praapta does। this relationship is called:",
    option:["pratiorganismitaa","commensalism","onbhakshana","parasitism"],
    answer:"commensalism"
},
{
    question: "among the following which-saa enjaaima uchcha temperature on bhee sakriya occurs?",
    option:["fromlyooleja","taika paolimareja","laathisojaaima","pekteneja"],
    answer:"taika paolimareja"
},
{
    question: "ghaasasthaleeya ecosystem in graasahaoon is",
    option:["producer","primary consumer","secondary consumer","tertiary consumer"],
    answer:"primary consumer"
},
{
    question: "onela kosheeya protein (SCP) kisafrom is obtained?",
    option:["onekosheeya sookshamaorganisms from","bahukosheeya sookshamaorganisms from","bacterium by","onekosheeya and bahukosheeya sookshamaorganisms both from"],
    answer:"onekosheeya and bahukosheeya sookshamaorganisms both from"
},
{
    question: "‘krisamasa disease’ of doosaraa name is",
    option:["daathose sindroma","nidraa disease","heemopheelior B","hipetaaitisa B"],
    answer:"heemopheelior B"
},
{
    question: "fertilization of baada ovule vikasita hokara seed becomes is, whenki carpel from koar vikasita occurs?",
    option:["pereesoanma","periofrpa","testaa","none of these"],
    answer:"periofrpa"
},
{
    question: "“ecosystem” shabda of use of shreya dior jaataa is:",
    option:["gaardamale ko","odama ko","taonasalee ko","vaarminga ko"],
    answer:"taonasalee ko"
},
{
    question: "which-saa RNA thodae samaya for occurs?",
    option:["mRNA","tRNA","rRNA","snRNA"],
    answer:"mRNA"
},
{
    question: "among the following from which satya phala is?",
    option:["apple","naashapaatee","ofjoolaa","coconut"],
    answer:"coconut"
},
{
    question: "among the following which-see orntrika technique pregnancydhaarana preventing for greevaa of ooon lagaaee jaatee is?",
    option:["diaphragm","condom","loop","kaoon-tee"],
    answer:"diaphragm"
},
{
    question: "among the following which mithoar phala is?",
    option:["apple","mango","oflaa","none of these"],
    answer:"apple"
},
{
    question: "SO₂ of pollution destroys:",
    option:["laaiofna","fungus","algae","fish"],
    answer:"laaiofna"
},
{
    question: "nimna in which-saa lambavat advivibhaajana (Longitudinal binary fission) does?",
    option:["yooglinaa","plaajamodiyama","plenerior","peraamishiyama"],
    answer:"yooglinaa"
},
{
    question: "soybean of crop in growth for jaiva fertilizer as experiment being having organism is:",
    option:["ewhichspaairilama","raaiwhichbiyama","naostaoka","ewhichtobaiktara"],
    answer:"raaiwhichbiyama"
},
{
    question: "gamete in chromosome of fromta occurs:",
    option:["2n","3n","4n","n"],
    answer:"n"
},
{
    question: "stanapaayee organisms in male hormone of origin where is?",
    option:["leevara in","andakosha in","kidanee in","phephadaaa in"],
    answer:"andakosha in"
},
{
    question: "among the following which-see khoja mahaja one snyogavasha ghatanaa is?",
    option:["penisilina","thesesulina","klorophenikola","DNA"],
    answer:"penisilina"
},
{
    question: "alkohala udyoga in utpanna bacteria of naor starena which-saa is?",
    option:["ee. kolaaee","saikromaayaseeja","baiseelasa sabataayalisa","syoodomonaasa puteedaa"],
    answer:"baiseelasa sabataayalisa"
},
{
    question: "embryo science of janaka which isn?",
    option:["Hippocrates","Pander","arastoo","Spemann"],
    answer:"arastoo"
},
{
    question: "human male in sperm bhndaarana kisa reproduction organ in occurs?",
    option:["shishna","shukravaahiof","epidimisa","vrishana"],
    answer:"epidimisa"
},
{
    question: "onkogene among these kisafor uttaradaayee is?",
    option:["cancer","AIDS","kshaya-disease","poliyo"],
    answer:"cancer"
},
{
    question: "ofrbana monooksaaida from human of mauta ho jaatee is whyki this nashta kara detaa is",
    option:["hemoglobin","phaaitokroma","saaitokroma","both (A) and (B)"],
    answer:"hemoglobin"
},
{
    question: "amla rainfall in SO₂ salphayoorika amla of bhaaga occurs:",
    option:["100%","70%","50%","30%"],
    answer:"70%"
},
{
    question: "among the following kisa DNA anu in pyoorina is?",
    option:["A and C","C and T","A and G","none of these"],
    answer:"A and G"
},
{
    question: "among the following which correct phala is",
    option:["coconut","apple","naashapaatee","ofjoo"],
    answer:"coconut"
},
{
    question: "if pollen grain of sthaanaantarana air by occurs to ifrom are called",
    option:["Anemophily","Entomophily","Ornithophily","Myrmecophily"],
    answer:"Anemophily"
},
{
    question: "among the following which eggja naheen is?",
    option:["sarpa","hen","ghadaiorla","human"],
    answer:"human"
},
{
    question: "prithvee of nikata airmandala of area is called:",
    option:["staretospheeyara","meesospheeyara","tropospheeyara","tharmospheeyara"],
    answer:"tropospheeyara"
},
{
    question: "human egg about yokarahita occurs, ifrom are called",
    option:["Microlecithal","Alecithal","Macrolecithal","Mesolecithal"],
    answer:"Alecithal"
},
{
    question: "pollen grain of thatee plants of doosare flower of stylena on jamaa being ko are called",
    option:["Dichogamy","Geitonogamy","Xenogamy","Hydrogamy"],
    answer:"Geitonogamy"
},
{
    question: "Ti plaajmida is found:",
    option:["egrobaikteeriyama tyoomeephesiensa in","thischirichior kolaaee in","baikteeriyopheja in","among these kisee in naheen"],
    answer:"egrobaikteeriyama tyoomeephesiensa in"
},
{
    question: "dengoo bukhaara kisadue to occurs?",
    option:["bacterium","virus","protozoa","krimi"],
    answer:"virus"
},
{
    question: "somaaklonala variation kisafrom praapta ho sakatee is?",
    option:["kaolcheeseena of experiment from","hybridization from","gaamaa kiranon of radiation from","tissue culture from"],
    answer:"tissue culture from"
},
{
    question: "DNA ripeyaringa is:",
    option:["DNA paoleemareja I by","DNA paoleemareja II by","both (A) and (B)","laaigeja by"],
    answer:"DNA paoleemareja I by"
},
{
    question: "Y-chromosome on sthita genesa are",
    option:["mutant genesa","otosomala genesa","holaindarika genesa","linga sahalagna gene"],
    answer:"holaindarika genesa"
},
{
    question: "among the following which-saa prabhaavashaalee character is?",
    option:["varnaandhataa","rataundhee","Rht","elbinijma"],
    answer:"Rht"
},
{
    question: "dvisnkara kraosa of pheenotipika anupaata what is?",
    option:["1 : 2 : 1","3 : 1","9 : 3 : 3 : 1","none of these"],
    answer:"9 : 3 : 3 : 1"
},
{
    question: "vuchererior bainkrophtee aadamee in phaailerior disease paidaa does। this kisa samooha of is?",
    option:["protozoa","virus","bacterium","helamintha"],
    answer:"helamintha"
},
{
    question: "egrobaikteeriyama tyoomeepheseeyansa in is found:",
    option:["A-plaajmida","Ti-plaajmida","C-plaajmida","G-plaajmida"],
    answer:"Ti-plaajmida"
},
{
    question: "samataapa mndala in onaabainganee radiationon ko nimnalikhita of by avashoshita is done:",
    option:["okseejana","owhichna","SO₂","organa"],
    answer:"owhichna"
},
{
    question: "Indian graameena area in baayodeewater of srota as whose use kior jaa rahaa is?",
    option:["yoophaorbior","chukanraate","sugarcane","pongaamior"],
    answer:"pongaamior"
},
{
    question: "cancer kisa ofrana from occurs?",
    option:["bacterium by","onkogenesa of by","both (A) and (B)","none of these"],
    answer:"onkogenesa of by"
},
{
    question: "nimnalikhita vaijnyaanikon ne ee. kolaaee in laika prachaaleka of spashta jaanaofree dee:",
    option:["jaiwhen and monaoda","vaatasana and krika","beedala and taitama","none of these"],
    answer:"jaiwhen and monaoda"
},
{
    question: "jaiva technique in prayukta 'aanvika kainchee' is:",
    option:["DNA paoleemareja","DNA laaigeja","ristarikshana endonyookliaija","heliofja"],
    answer:"ristarikshana endonyookliaija"
},
{
    question: "if one nadee seeveja from dooshita ho jaae to fish mara jaaengee, whyki",
    option:["O₂ of water in lessee ho jaatee is","water of durgndha due to","seeveja in maujooda diseaseaanuon due to","thosa padaarthon of kleshma in phnsane due to"],
    answer:"O₂ of water in lessee ho jaatee is"
},
{
    question: "aaloo in ofyika sncharana by whom occurs?",
    option:["pattiorn","stnbha","jada","seed"],
    answer:"stnbha"
},
{
    question: "pollen grain whose specialtaa is",
    option:["braayophaayatsa and aavrittaseedee","teridophaayatsa and aavrittaseedee","aavrittaseedee and anaavrittaseedee","aavrittaseedee and fungus"],
    answer:"aavrittaseedee and anaavrittaseedee"
},
{
    question: "DNA pumaleyogaja technique in Restriction endonuclease vrihat apaimaane on use is done। ye praapta are:",
    option:["baikteeriyopheja from","bacterium cell from","plaajmidsa from","sabhee prokairiyotika cells from"],
    answer:"bacterium cell from"
},
{
    question: "if one nadee seeveja from dooshita ho jaae to fish mara jaaengee:",
    option:["buree durgndha from","O₂ of lessee from","seeveja in upasthita diseaseaanuon from","thosa padaarthon of gilon in phnsane on"],
    answer:"O₂ of lessee from"
},
{
    question: "conception avadhi is",
    option:["birth and Puberty between of","embryo formation and conception between of","fertilization and infant birth between of","fertilization and pregnancydhaarana between of"],
    answer:"fertilization and infant birth between of"
},
{
    question: "owhichna level is found:",
    option:["troposphiyara in","onesosphiyara in","meewhichsphiyara in","staraitosphiyara in"],
    answer:"staraitosphiyara in"
},
{
    question: "pratibnwealth endonyookfaorja DNA of kisa vishishta nucleotide sequenceon ko pahachaanataa is?",
    option:["pailindaromika","enzyme","plaajmida","among these sabhee"],
    answer:"pailindaromika"
},
{
    question: "ecosystem of two factor are:",
    option:["plants and praanee","jaivika and ajaivika","okseejana and ofrbana","none of the above"],
    answer:"jaivika and ajaivika"
},
{
    question: "jaiva dakaitee nimna in kisafrom relationshipita is?",
    option:["paaramoanika jnyaana","jaiva anu and jaiva snsaawealth and jaiva snsaawealthon from gene ko nioflanaa","jaiva snsaawealth","uonokta sabhee"],
    answer:"uonokta sabhee"
},
{
    question: "varnaandhataa in diseaseee naheen pahachaana paataa is",
    option:["laala and peelaa rnga","laala and haraa rnga","neelaa and haraa rnga","none of these"],
    answer:"laala and haraa rnga"
},
{
    question: "nirantara kriortmaka gene is:",
    option:["gene baitaree","laksaree genesa","maailda genesa","haathat ofpinga genesa"],
    answer:"haathat ofpinga genesa"
},
{
    question: "daatra cell abloodtaa in beetaa globina shrrinkhalaa in glootaimika amla of kisa amino acid from pratisthaapana occurs?",
    option:["glaathiseena","vaileena","espaartika amla","none of the above"],
    answer:"vaileena"
},
{
    question: "one hee phala of bheetara antheron from pollen grainon of stylena in pahunchanaa koar is called?",
    option:["svapollination","ovulation","onpollination","fertilization"],
    answer:"svapollination"
},
{
    question: "gene of Segregation occurs",
    option:["embryo formation in","enaapheja first in","enaapheja second in","metaapheja second in"],
    answer:"enaapheja first in"
},
{
    question: "sabafrom prachalita bacterium fertilizer is:",
    option:["naaitrosomonaasa","naaitrobaiktara","naaitrosokokasa","raaiwhichbiyama"],
    answer:"raaiwhichbiyama"
},
{
    question: "praaimaree soanmetosaaita from formation having sperms of number is",
    option:["8","4","3","1"],
    answer:"4"
},
{
    question: "indala of niyamon ko maanyataa dilaaee",
    option:["korensa","lionmaika","dee vreeja","these sabhee ne"],
    answer:"these sabhee ne"
},
{
    question: "staree in kisa hormone of pratikrior due to secondary laingika symptom vikasita are?",
    option:["rileksina","projestaraona","thistrojena","gonedotropina"],
    answer:"thistrojena"
},
{
    question: "laika operaona of factor naheen is:",
    option:["praaimara gene","promotara gene","snrachanaatmaka gene","niormaka gene"],
    answer:"praaimara gene"
},
{
    question: "among the following which-saa plant ubhayalingaashrayee occurs?",
    option:["maaraofnshior","paathesesa","saaikasa","papeetaa"],
    answer:"paathesesa"
},
{
    question: "embryo of 16 koshiofya avasthaa kahalaatee is",
    option:["morulaa","blaastomiyara","blaastulaa","gaistulaa"],
    answer:"morulaa"
},
{
    question: "nimnalikhita ne organuleechhaapee technique ko sarvafirst vikasita kior:",
    option:["eleka jephareeja","aarthara kaornabarga","jemsa vaatasana","none of the above"],
    answer:"eleka jephareeja"
},
{
    question: "kyoto protokaola relationshipita is:",
    option:["owhichna kshaya","harita griha prabhaava","water pollution","forestya organismna of conservation"],
    answer:"harita griha prabhaava"
},
{
    question: "among the following which DNA synthesis hetu of RNA tempaleta as experiment does?",
    option:["rivarsa traansakripteja","DNA-dipendenta RNA paoleemareja","DNA paoleemareja","RNA paoleemareja"],
    answer:"rivarsa traansakripteja"
},
{
    question: "if kisee anther in 4-sporogenous cells hon, to pollen grain of number hogee",
    option:["4","8","16","12"],
    answer:"16"
},
{
    question: "B-DNA of one poorna ghumaava in kitane besa peyarsa are?",
    option:["10","12","20","15"],
    answer:"10"
},
{
    question: "Egg of Cortex in maujooda Cortical granules in is found, mainth",
    option:["lipida","protein","glaaikojana","myookopaulisaiofraaidsa"],
    answer:"lipida"
},
{
    question: "pollen grain peele varna of are whyki thisin maujooda are",
    option:["Flavonoids and Carotenoids","salphara","kromoplaasta","Etiolin"],
    answer:"Flavonoids and Carotenoids"
},
{
    question: "otomobaaila nirvaaup to in upasthita sarvaadhika harmful kanaofya padaartha is:",
    option:["marakaree","leda","kaidamiyama","aarfaromnika"],
    answer:"leda"
},
{
    question: "gamete of snchayana ko are called:",
    option:["pollination","sinagemee","paarthenojenesisa","sporojenesisa"],
    answer:"sinagemee"
},
{
    question: "MMC in 24 chromosome are। thisof endosperm in chromosomes of number hogee",
    option:["12","24","36","48"],
    answer:"36"
},
{
    question: "among the following kisa plant in seed to becomes is but flower naheen",
    option:["maize","pudeenaa","peepal","cheeda"],
    answer:"cheeda"
},
{
    question: "moola roma in which naheen hotee?",
    option:["waterodbhida","lavanodbhida","sthalodbhida","heliophaaita"],
    answer:"waterodbhida"
},
{
    question: "normalth Capsella in endosperm occurs",
    option:["haploid","diploid","triploid","bahucharacterita"],
    answer:"triploid"
},
{
    question: "kisee B-DNA of one valaya (spiral) in nucleotide of number is:",
    option:["5","10","20","25"],
    answer:"10"
},
{
    question: "among these kisa krior from DDT of concentration agale poshee level in badhatee is?",
    option:["water-prasphutana","jaiva aavarwaealth","suposhana","owhichna pollution"],
    answer:"jaiva aavarwaealth"
},
{
    question: "staarcha from ithenaola of audyogika utpaadana kisa khaasa species by occurs?",
    option:["penisilina","ewhichtobaiktara","saiofromaayasija","laiktobaisilasa"],
    answer:"saiofromaayasija"
},
{
    question: "among the following which genetic material is called?",
    option:["DNA","protein","vasaa","all of these"],
    answer:"DNA"
},
{
    question: "protein synthesis of krior snpanna is:",
    option:["maaitokaondarior","lavaka","raaibosoma","fromntrosoma"],
    answer:"raaibosoma"
},
{
    question: "maleon from koar relationshipita is?",
    option:["munha from khaayee jaane having goliorn","dimbavaahiofchchhedana","shukravaahikochchhedana","uonyukta in from koee naheen"],
    answer:"shukravaahikochchhedana"
},
{
    question: "dodo is",
    option:["vilupta praanee","snkatagrasta praanee","aapattigrasta praanee","none of these"],
    answer:"vilupta praanee"
},
{
    question: "GAATTC kisa pratibanwaealth endonyookfaorja of abhijnyaana sthaana is?",
    option:["HindIII","EcoRI","BamI","HindII"],
    answer:"EcoRI"
},
{
    question: "malaria parasitic of diseasevaahaka among these which is?",
    option:["female kyooleksa","female enophileeja","female baaloo makkhee","among these sabhee"],
    answer:"female enophileeja"
},
{
    question: "meenameaataa disease is produced:",
    option:["airmndala in aarfaromnika from","peene of paanee in phloraaida being from","peene of paanee in paaraayukta pradooshaka from","water in tela of phaila jaane from"],
    answer:"peene of paanee in paaraayukta pradooshaka from"
},
{
    question: "mother by die gae gamete and father by die gae gamete of snlayana from koar becomes is?",
    option:["gamete","yugmanaja","sntati","kloma"],
    answer:"yugmanaja"
},
{
    question: "among the following aabhaasee phala which-saa is",
    option:["staraoberee","akharota","apple","uonokta threeon"],
    answer:"uonokta threeon"
},
{
    question: "raaibosoma of badae guchchha ko are called:",
    option:["megaasoma","maaikrosoma","paoleeraaibosoma","oligosoma"],
    answer:"paoleeraaibosoma"
},
{
    question: "DNA dvicharacterna in kisa enzyme of main landof rahatee is?",
    option:["laaigeja","RNA paolimareja","DNA paolimareja","rivarsa traansakripteja"],
    answer:"DNA paolimareja"
},
{
    question: "Ecosystem for nirdeshee force is।",
    option:["producer","jaivaamount","producer in nihita ofrbohaaidreta","saura energy"],
    answer:"saura energy"
},
{
    question: "ten pratishata energy-haasa of niyama kisane made?",
    option:["lindemaina","lipamena","nyoobarga","barjiliyasa"],
    answer:"lindemaina"
},
{
    question: "embryokosha of fromntarala cell is",
    option:["praarnbhika nucleus","secondary nucleus","sahaayaka cell","both (A) and (B)"],
    answer:"secondary nucleus"
},
{
    question: "speesheeja plaanterama book kisane likhee?",
    option:["jaona re","kairolasa liniyasa","thiyophrestasa","none of these"],
    answer:"kairolasa liniyasa"
},
{
    question: "human in hima andhataa of main ofrana among these which-saa is?",
    option:["UV-B kirana of avashoshana","thesephraa radiation of avashoshana","kaosmika radiation of avashoshana","svachchha mndala of hima aondana"],
    answer:"UV-B kirana of avashoshana"
},
{
    question: "siraof udyoga in kisa sookshamaorganism of use occurs?",
    option:["klostareediyama of","eseetobaiktara of","traaikodarmaa of","stareptokokasa of"],
    answer:"eseetobaiktara of"
},
{
    question: "snkramita peyawater from phailane having disease among these which is?",
    option:["miordee bukhaara or taaiphaaida","malaria","phaailerior","oflaa jvara"],
    answer:"miordee bukhaara or taaiphaaida"
},
{
    question: "gobara gaisa of one major factor is:",
    option:["byootena","amonior","mithena","ithena"],
    answer:"mithena"
},
{
    question: "watereeya paudhon in katee-phatee pattiorn isn:",
    option:["satahee areaphala less karane for","satahee areaphala badhaaane for","waterdhaaraaon of prabhaava less karane for","randharon of number badhaaane for"],
    answer:"waterdhaaraaon of prabhaava less karane for"
},
{
    question: "plants of pratyeka of the cell anrate one nae plants ko birth dene of kshamataa is। cells of this genetic character ko koar are called?",
    option:["somaa klonala vairieshana","gene kloninga","fromlyoolara toteepotensee","among these sabhee"],
    answer:"fromlyoolara toteepotensee"
},
{
    question: "nimna in parasitic animal which-saa is?",
    option:["fish","kharagosha","sooara","uonokta sabhee"],
    answer:"uonokta sabhee"
},
{
    question: "RNA antarakshepa what is?",
    option:["peedakanaashee","koshiofya surakshaa of method","protein","none of these"],
    answer:"koshiofya surakshaa of method"
},
{
    question: "dvisnkara kraosa in anusymptomee (phenotaaipika) anupaata occurs",
    option:["3 : 1","1 : 2 : 1","9 : 7","9 : 3 : 3 : 1"],
    answer:"9 : 3 : 3 : 1"
},
{
    question: "triptophaina operaona kisa praofra of tntra ko rateshaataa is?",
    option:["preraneeya","damanaofree","A and B both","thesein koee naheen"],
    answer:"damanaofree"
},
{
    question: "which-saa enzyme uchcha taapakrama on bhee sakriya rahataa is?",
    option:["fromlooleja","pektineja","taika paolimareja","laathisosaaima"],
    answer:"taika paolimareja"
},
{
    question: "genetics abhiorntriof in prayukta sabafrom normal bacterium is:",
    option:["ishcheereeshior (Escherichia)","klaosatreediyama","saalmonelaa","besilasa"],
    answer:"ishcheereeshior (Escherichia)"
},
{
    question: "kailasa and saspenshana kalchara in which-saa oksina is used?",
    option:["NAA","IBA","2,4-D","ebsisika amla"],
    answer:"2,4-D"
},
{
    question: "pollen and seedaanu of adhyayana ko koar are called",
    option:["peleenolaojee","maarapholaojee","phaaikolaojee","saaitolaojee"],
    answer:"peleenolaojee"
},
{
    question: "among these which onelingee naheen is?",
    option:["tilachattaa","dog","cow","earthworm"],
    answer:"earthworm"
},
{
    question: "gene in mutation, edeeneena gvaanina by pratisthaapita occurs, this is:",
    option:["phrema-shiphta mutation","traansakripshana","traanjishana","traansavarjana"],
    answer:"traanjishana"
},
{
    question: "paanee by on-pollination ko are called",
    option:["air-pollination","water-pollination","insect-pollination","these sabhee in"],
    answer:"water-pollination"
},
{
    question: "stareptomaathisina utpaadita is done:",
    option:["stareptomaathisina skoliyasa by","stareptomaathisisa phredee by","stareptomaathisisa venejuelo by","stareptomaathisisa greesiyasa by"],
    answer:"stareptomaathisisa greesiyasa by"
},
{
    question: "among the following which onelingee is?",
    option:["sarason","udahula","papeetaa","none of these"],
    answer:"papeetaa"
},
{
    question: "indala of theory ko twoharaane having vaijnyaanika which the?",
    option:["daarvina, vailesa and hyoogo di veeja","daarvina, korensa and lionmaika","hyoogo di veeja, korensa and lionmaika","maorgana, hyoogo di vreeja and korensa"],
    answer:"hyoogo di veeja, korensa and lionmaika"
},
{
    question: "one flowering plant in female reproduction organ iofee ko are called",
    option:["stareeofsara","punofsara","pollenkosha","anya"],
    answer:"stareeofsara"
},
{
    question: "mithemoglobina of formation in hemoglobin of pratikrior kisafrom is?",
    option:["naaitreta","CO","CO₂","naaitrasa oksaaida"],
    answer:"naaitreta"
},
{
    question: "that organism or plant jisaof shareera in male and female both praofra of reproduction paae jaate are, is called:",
    option:["spora","snyugmana","ubhayalingee","onelingee"],
    answer:"ubhayalingee"
},
{
    question: "Bt toxin is:",
    option:["anthkoshiofya lipidsa","anthkoshiofya kristaleeya protein","baahya koshiofya kristaleeya protein","lipidsa"],
    answer:"baahya koshiofya kristaleeya protein"
},
{
    question: "leechee of khaaor jaane having bhaaga is called?",
    option:["tegmena","endosperm","adhoarvarana","seedchola"],
    answer:"seedchola"
},
{
    question: "indala by given gametes of shuddhataa of niyama aadhaarita is",
    option:["oneekshana hybridization","prateepa hybridization","onesnkara hybridization","dvisnkara hybridization"],
    answer:"onesnkara hybridization"
},
{
    question: "control (Regulatory) gene ko koar is called?",
    option:["nirodhaka gene","ripresara","oonetara gene","promotara gene"],
    answer:"nirodhaka gene"
},
{
    question: "pollen grain of baahya chola kisafrom becomes is",
    option:["fromluloja","pektina","sporopolenina","tepitama"],
    answer:"sporopolenina"
},
{
    question: "anthuterus technique of average asaphalataa of rate is:",
    option:["23%","20%","1%","4%"],
    answer:"4%"
},
{
    question: "ushna katibndheeya saghana foreston of ofrana is",
    option:["less rainfall and less temperature","more rainfall and less temperature","less rainfall and more temperature","more rainfall and more temperature"],
    answer:"more rainfall and more temperature"
},
{
    question: "G. J. Mendel thaa",
    option:["britisha paarateee","aastareliyana paarateee","aastariyana paarateee","jarmana vaijnyaanika"],
    answer:"aastariyana paarateee"
},
{
    question: "dvisnkara kraosa in pheenotaaipika anupaata occurs",
    option:["3 : 1","1 : 2 : 1","9 : 7","9 : 3 : 3 : 1"],
    answer:"9 : 3 : 3 : 1"
},
{
    question: "raaibosoma of vrihata samooha is called:",
    option:["megaasoma","maaikrosoma","aleegosoma","paoleeraaibosoma"],
    answer:"paoleeraaibosoma"
},
{
    question: "100 pollen grain formation for kitane sootree vibhaajana of aavashyakataa hogee",
    option:["100","50","25","20"],
    answer:"25"
},
{
    question: "Indiain the year environment surakshaa adhiniyama kisa year paasa huaa thaa?",
    option:["1976","1986","1966","1996"],
    answer:"1986"
},
{
    question: "jinaof number bahuta less ho gaee is and vilupta being of kagaara on are thosehen are called:",
    option:["bheja speciesorn","durlabha speciesorn","snkatamayee","kshati-aashnkita"],
    answer:"snkatamayee"
},
{
    question: "jaivika roopaantarita organism ho sakate are",
    option:["diseaseaanu pratirodhaka","sookhaa pratirodhaka","diseaseaanu and sookhaa both pratirodhaka","none of these"],
    answer:"diseaseaanu and sookhaa both pratirodhaka"
},
{
    question: "aadhunika embryoscience of janaka are",
    option:["shleedena and shvaana","hartaviga","arastoo","vaana beyara"],
    answer:"vaana beyara"
},
{
    question: "matara in aprabhaavee character is",
    option:["jhurreedaara seed","lnbaa tanaa","gola seed","rngeena seedaavarana"],
    answer:"jhurreedaara seed"
},
{
    question: "which-saa 'thiormina' vitamin is?",
    option:["B₁","B₂","B₆","B₁₂"],
    answer:"B₁"
},
{
    question: "human in ABO blood group whose udaaharana is?",
    option:["Polygenic inheritance","Multifactor inheritance","Pleiotropic gene","Multiple alleles"],
    answer:"Multiple alleles"
},
{
    question: "paudhon of jadaon from tyoomara paidaa does:",
    option:["E. coli","egrobaikteeriyama tyoomeephesiensa","tharmasa onevetiksa","none of these"],
    answer:"egrobaikteeriyama tyoomeephesiensa"
},
{
    question: "murde ko daphana karane and dharma of pramaana sarvafirst kisa fossil from milate are?",
    option:["niendarathala","kro-maignaona","homo irektasa","homo isbilisa"],
    answer:"niendarathala"
},
{
    question: "ghareloo makkhee of Meiocytes in of chromosome number is:",
    option:["8","12","34","21"],
    answer:"12"
},
{
    question: "indala of Law of Segregation kisa F2 anupaata on aadhaarita is?",
    option:["1 : 2","9 : 3 : 3 : 1","1 : 2 : 1","3 : 1"],
    answer:"1 : 2 : 1"
},
{
    question: "among the following which-saa traansajenika plant naheen is?",
    option:["soybean","maize","goldena raathis","kheeraa"],
    answer:"kheeraa"
},
{
    question: "heemopheelior femaleon of apekshaa maleon in normal roopa from is found whyki",
    option:["this disease X-sahalagna prabhaavee mutation due to occurs","ladakiyon of number of badaaa bhaaga baaloarvasthaa in mara jaataa is","this disease X-sahalagna aprabhaavee mutation by occurs","this disease Y-sahalagna aprabhaavee mutation by occurs"],
    answer:"this disease X-sahalagna aprabhaavee mutation by occurs"
},
{
    question: "kisee Incomplete Dominance of F2 sntati in",
    option:["pheenotaaipa of anupaata 3 : 1 is","geneotaaipa of anupaata 3 : 1 is","both hee","pheenotaaipa anupaata geneotaaipa anupaata of anuroopa occurs"],
    answer:"pheenotaaipa anupaata geneotaaipa anupaata of anuroopa occurs"
},
{
    question: "laojistika/onesaponenshiyala growth for sootra is:",
    option:["dt/dN","dN/rN = dt","rN/dN = dt","dN/dt = rN"],
    answer:"dN/dt = rN"
},
{
    question: "kisee AABBCC genotype having organism from kitane taraha of gametes of snbhaaforestaa banatee is?",
    option:["one","two","four","eight"],
    answer:"one"
},
{
    question: "among these protozoa parasitic by sncharita disease which-saa is?",
    option:["ameebaayasisa","malaria","oflaa jvara","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "anupravaaha snsaawealth in shaamila is:",
    option:["separation","showealth","both (A) and (B)","utpaadana"],
    answer:"both (A) and (B)"
},
{
    question: "bindu in mutation occurs",
    option:["sanniveshana","one kshaara yugma in onivartana","dvicharacterna","vilopana"],
    answer:"one kshaara yugma in onivartana"
},
{
    question: "which sahaayaka reproduction grnthi is?",
    option:["shukraashaya grnthi","prosteta grnthi","kaoon grnthi","sabhee"],
    answer:"sabhee"
},
{
    question: "female in which-see grnthi prosteta of samajaata is?",
    option:["Perineal gland","dugdhagrnthi","paaraayurithrala grnthi","ofuon grnthi"],
    answer:"paaraayurithrala grnthi"
},
{
    question: "kisee nyookliyosaaida of pentoja sugar of kisa ofrbana with nitrogenous base judaaa occurs?",
    option:["1","2","3","5"],
    answer:"1"
},
{
    question: "HIV nimna in kisa cell on aakramana does?",
    option:["B-cell","T-cell","epitheeliyala cell","T heloan cell"],
    answer:"T heloan cell"
},
{
    question: "traopikala foreston in kuchha speciesyon of vilupti of main ofrana is।",
    option:["diphorestaishana","ephoresteshana","paolyooshana","soila irosina"],
    answer:"diphorestaishana"
},
{
    question: "greevaa (Cervix) in which is found?",
    option:["vrikka","phailopiyana tyooba","uterus of body and yoni between in","epididymis in"],
    answer:"uterus of body and yoni between in"
},
{
    question: "Gonorrhoea what is?",
    option:["baikteeriyala disease","yauna disease","S.T.D.","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "among these which-saa blood group saarvabhaumika blooddaataa is?",
    option:["B","A","AB","O"],
    answer:"O"
},
{
    question: "Acrosome viheena sperm for koar naheen can be?",
    option:["this bhojana naheen le sakataa","prachalana naheen kara sakataa","Seminal vesicle in chheda naheen kara sakataa","egg in chheda naheen kara sakataa is"],
    answer:"egg in chheda naheen kara sakataa is"
},
{
    question: "jirontolojee in whose adhyayana occurs?",
    option:["bird","asthi","Ageing","prithvee"],
    answer:"Ageing"
},
{
    question: "among the following which-see orntrika technique pregnancydhaarana preventing for and IUCD for is?",
    option:["kaoon-tee","sammishrita golee","phoma","Abortant golee"],
    answer:"kaoon-tee"
},
{
    question: "among the following which-saa tatva prithvee of aadiofleena vaataavarana in aanavika sthiti in upasthita naheen thaa?",
    option:["ofrbana","okseejana","haaidrojana","naaitrojana"],
    answer:"okseejana"
},
{
    question: "jaiva-development of of the theory main relationship is",
    option:["svath utpaadana from","vishishta srishtivaada from","dheere-dheere being having onivartanon from","vaataavarana of sthiti from"],
    answer:"dheere-dheere being having onivartanon from"
},
{
    question: "natural anishekareproduction (Parthenogenesis) is found",
    option:["makkhee","bee in","machchhara in","all of these in"],
    answer:"bee in"
},
{
    question: "maize in 10 whichdaaa chromosome is। thisin kitane linofja samooha honge",
    option:["20","40","10","5"],
    answer:"10"
},
{
    question: "yoka of vitarana if samaana roopa from ho to aifrom egge are",
    option:["Isolecithal","Mesolecithal","Macrolecithal","Centrolecithal"],
    answer:"Isolecithal"
},
{
    question: "gira national park vikhoarta is",
    option:["hirana for","sinha for","cheetaa for","bird for"],
    answer:"sinha for"
},
{
    question: "among the following which greenhouse gas is?",
    option:["ofrbana daaioksaaida","meethena","CFC","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "of whom adhyayana ko onkolaojee are called?",
    option:["kaoleraa","kushtha","tyoomara","malaria"],
    answer:"tyoomara"
},
{
    question: "ostareliyana enteejana jaancha by kisa beemaaree of pataa lacowaa jaataa is?",
    option:["AIDS","hipetaaitisa-B","Genital warts","Chancroid"],
    answer:"hipetaaitisa-B"
},
{
    question: "pollination tabhee occurs when koee pollen grain",
    option:["apanaa sperm nuclei vimukta does","stigma on aataa is","mature occurs and thisin 3 nuclei are","apanee sperm nuclei vimukta kare and eggaa and dhruva nucleus with fertilization kare"],
    answer:"stigma on aataa is"
},
{
    question: "virus-mukta plants by whom praapta ho sakate are?",
    option:["embryo development","vibhajyoup to culture","protoplaasta culture","anther culture"],
    answer:"vibhajyoup to culture"
},
{
    question: "soil in upasthita raaiwhichbiyama bacterium apratyaksha roopa from paudhon of aabaadee in kisa praofra growth do?",
    option:["naaitrojana-sthireekarana and soil of urvarataa in growth kara","fungusmoola by","pratiorganismitaa by","none of these"],
    answer:"naaitrojana-sthireekarana and soil of urvarataa in growth kara"
},
{
    question: "enthesisa of onighatanaa relationshipita is:",
    option:["pollen grain formation","stylena on pollen grain of pahunchanaa","anther of development","flower kaliof of khulanaa"],
    answer:"flower kaliof of khulanaa"
},
{
    question: "indala ne kisa plants of chayana kior?",
    option:["chanaa","paathesesa","tamaatara","gaardena matara"],
    answer:"gaardena matara"
},
{
    question: "kisa praofra of reproduction karane having praaniyon in more variationen dekhane ko milatee are?",
    option:["sexual reproduction","asexual reproduction","gametereproduction","ofyika reproduction"],
    answer:"sexual reproduction"
},
{
    question: "paudhon in laingika reproduction ko sarvafirst kisane rateshaaor",
    option:["Kolreuter","Camerarius","Van Benden","Nawaschin"],
    answer:"Camerarius"
},
{
    question: "ofyika reproduction among the following kisa praofra occurs?",
    option:["jada","stnbha","pattee","threeon by"],
    answer:"threeon by"
},
{
    question: "among the following which forest ecosystem of one producer is?",
    option:["vailisanerior","spaaidiseaseaairaa","tektonaa","nimphior"],
    answer:"tektonaa"
},
{
    question: "endosperm of origin kisafrom is",
    option:["pollennaliof from","laghuseedaanu from","laghuseedaanupaddyee from","guruseedaanu from"],
    answer:"guruseedaanu from"
},
{
    question: "laaiofna whose samoohana is?",
    option:["algae and algae","algae and fungus","algae and uchcha vargeeya paudhon of jadaen","fungus and fungus"],
    answer:"algae and fungus"
},
{
    question: "aanvika technique jisain kisee bhee ichchhita gene of anekon prati these-vitro synthesized of jaa sakatee are, kahalaatee is:",
    option:["ELISA","PCR","jela ilektarophoresisa","phlo saaitometree"],
    answer:"PCR"
},
{
    question: "floweringya paudhon in sexual reproduction of khoja of thee",
    option:["ofmeraariyasa","naavaashchina","staraasavargara","maaheshvaree"],
    answer:"ofmeraariyasa"
},
{
    question: "among the following which-saa pollen grain of stigma on shuroo in pollination in madada does",
    option:["P","Ca++","Mo","Cl−"],
    answer:"Ca++"
},
{
    question: "among the following which diploid snrachanaa is?",
    option:["andaanu","sperm","yugmanaja","among these sabhee"],
    answer:"yugmanaja"
},
{
    question: "kisee secretionna in pharaktoja, kailshiyama and enzymes highest is found in which?",
    option:["male sahaayaka grnthi","yakrita","agnaorshaya","laara grnthi"],
    answer:"male sahaayaka grnthi"
},
{
    question: "samasootree vibhaajana occurs।",
    option:["ofyika cell in","reproduction cell in","(A) and (B) both in","none of these"],
    answer:"(A) and (B) both in"
},
{
    question: "kisee gamete in kula gene of haploid set ko are called",
    option:["geneotaaipa","pheenotaaipa","geneoma","linofja samooha"],
    answer:"geneoma"
},
{
    question: "diploid is",
    option:["eggaa","pollen","both (A) and (B)","yugmanaja"],
    answer:"yugmanaja"
},
{
    question: "spaairulinaa whose prachura srota is?",
    option:["protein","vitamin","khanija","all of the above"],
    answer:"protein"
},
{
    question: "traansajenika baasamatee rice of improved variety kaisee is?",
    option:["ufrom chemical fertilizeron and growth of aavashyakataa naheen is","uchcha utpaadana and vitamin-A from prachura is","sabhee insect-peedakon and paddy of diseases of prati poornataor pratirodhaka is","uchcha utpaadana does kintu thisin koee abhilaakshanika sugndha naheen is"],
    answer:"uchcha utpaadana and vitamin-A from prachura is"
},
{
    question: "one hee locus on upasthita kisee gene of vibhinna roopon ko koar are called?",
    option:["malteepala allele","paoleegenesa","onkogenesa","sahaprabhaavee"],
    answer:"malteepala allele"
},
{
    question: "one correct sequence in DNA khanda judate are:",
    option:["DNA laaigeja by","RNA paoleemareja by","heliofja by","DNA TÍCIATO GRI"],
    answer:"DNA laaigeja by"
},
{
    question: "among the following from which vilupta speesheeja is?",
    option:["onesoraa","nipenthisa","teekomaa","none of these"],
    answer:"none of these"
},
{
    question: "pheromona jaala in koar occurs?",
    option:["male pheromona","female pheromona","(A) and (B) both","none of these"],
    answer:"female pheromona"
},
{
    question: "havaa of by pollenita being having floweron ko are called",
    option:["insect pollenitaa","air pollenita","havaa pollenita","none of these"],
    answer:"air pollenita"
},
{
    question: "paaritntra shabda of namekarana kior:",
    option:["mauragana","e. jee. taansale","laamaarka","none of these"],
    answer:"e. jee. taansale"
},
{
    question: "stareeofsara of bhaaga among the following which-saa is",
    option:["stigma","vartatiof","eggaashaya","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "indala ne proposed kior",
    option:["sahalagnataa of niyama","heredity of niyama","tharmodaayanameiksa of niyama","none of these"],
    answer:"heredity of niyama"
},
{
    question: "thesein which cow of species naheen is?",
    option:["jarsee","karana svisa","karana phraathis","soortee"],
    answer:"soortee"
},
{
    question: "onelingataa of sthiti ko ullikhita karane for kisa shabda of experiment occurs?",
    option:["samagameteee","ubhayalingaashrayee","onelingaashrayee","toxinma gamete"],
    answer:"onelingaashrayee"
},
{
    question: "among these which yauna-snbaddha character is?",
    option:["varnaandhataa","rataundhee","poorna andhataa","none of these"],
    answer:"varnaandhataa"
},
{
    question: "fertilization of baada seed of aavarana kisafrom becomes is",
    option:["Embryo sac","Integuments","Ovule","Chalazal region"],
    answer:"Integuments"
},
{
    question: "developmentsheela embryo by of endosperm upabhoga of whom seed in occurs",
    option:["coconut","arnda","matara","maize"],
    answer:"matara"
},
{
    question: "cancer kisa ofrana from occurs?",
    option:["bacterium by","onkogenesa of by","A and B both","none of these"],
    answer:"onkogenesa of by"
},
{
    question: "kuchha flowers of pollenkosha and stylena between kuchha natural rodha are jinadue to pollination mushkila from occurs or hotaa hee naheen, thosehen koar are called",
    option:["svaynbndhyataa","heterostaailee","harakogaimee","geigaimee"],
    answer:"harakogaimee"
},
{
    question: "which-saa diploid is",
    option:["pollen grain","Egg","Megaspore","MMC"],
    answer:"MMC"
},
{
    question: "klorelaa among the following what is?",
    option:["bacterium","algae","protozoa","onela cell protein"],
    answer:"algae"
},
{
    question: "among the following which Mendelian Law of Independent Assortment of apavaada is?",
    option:["kraosinga ovara","apoorna varchasva","Segregation","sahalagnataa"],
    answer:"sahalagnataa"
},
{
    question: "spaairulinaa is:",
    option:["jaiva fertilizer","jaiva peedakanaashee","khaane yogya fungus","singala fromla protein"],
    answer:"singala fromla protein"
},
{
    question: "jaane-maane paaritntra ecology are",
    option:["pee. maaheshvaree","ee. pee. odama","ema. esa. svaameenaathana","beeraforce saahanee"],
    answer:"ee. pee. odama"
},
{
    question: "paomphareta (Pomfret) is।",
    option:["samudree fish","jheengaa of one species","anthsthalee fish","mriduwatereeya fish"],
    answer:"samudree fish"
},
{
    question: "pollen grain in maujooda oksina (Auxin) whose growth in madada does",
    option:["pollennalee and eggaashaya","only pollennalee","only eggaashaya","male gamete"],
    answer:"pollennalee and eggaashaya"
},
{
    question: "asexual reproduction in organismdhaariyon of origin kitane janakon of bhaaga lene from is?",
    option:["one","two","three","four"],
    answer:"one"
},
{
    question: "vaifrom bacteriumon of samooha, which phaphoondee of filamenton from judakara jaala jaisee snrachanaa banaate are, are called",
    option:["phlaoksa","mithenojena","plaajminojena","none of these"],
    answer:"phlaoksa"
},
{
    question: "eseetaabulerior among the following what is?",
    option:["onela cell protein","algae","protozoa","bacterium"],
    answer:"algae"
},
{
    question: "among the following which murgiyon of beemaaree naheen is?",
    option:["raaneekheta","isjaa","smata","barda phloo"],
    answer:"smata"
},
{
    question: "kisee normal dvicotyledonee embryokosha in nucleus of Arrangement occurs",
    option:["3 + 3 + 2","2 + 3 + 3","3 + 2 + 3","2 + 4 + 2"],
    answer:"3 + 2 + 3"
},
{
    question: "which-saa Terminal (stop) kodona is?",
    option:["UAG (anbara)","UAA (okara)","UGA (opala)","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "pahachaanie among these which-saa adhoore paaritntra of udaaharana is?",
    option:["ghaasa of maidaana","guphaa","nadee","daladalee area"],
    answer:"guphaa"
},
{
    question: "Micropyle in which is found",
    option:["Ovule","Seed","anupalabdha/aspashta vikalpa","anupalabdha/aspashta vikalpa"],
    answer:"Ovule"
},
{
    question: "laala tvachaa having maveshee ko when sapheda rnga having from kraosa karavaaor gaor to F1 peedhaee in maveshiyon of rnga chitawhenraa or rona ho gaor। this kisako prarateshita does?",
    option:["sahaprabhavitaa","poorna prabhaavitaa","incomplete dominance","sahalagnataa"],
    answer:"sahaprabhavitaa"
},
{
    question: "operaona maodala koar prarateshita does?",
    option:["gene of sinthesisa","gene of onesapreshana","gene of reguleshana","gene of phnkshana"],
    answer:"gene of reguleshana"
},
{
    question: "sabafrom praarnbhika organism the",
    option:["rasaayana svaposhee","rasaayana toxinmaposhee","light svaposhee","svath utpanna being having"],
    answer:"rasaayana toxinmaposhee"
},
{
    question: "anther one four-kosheeya snrachanaa is jisain fouron konon on koar samaahita is",
    option:["laghuseedaanupaddyee","pollenputee","tepeetama","organismdravya"],
    answer:"laghuseedaanupaddyee"
},
{
    question: "among these which krimi janita snkraamaka disease naheen is?",
    option:["esoafriorsisa","phaailerior","hepetaaitisa","enofilostomiorsisa"],
    answer:"hepetaaitisa"
},
{
    question: "diseaseee of shareera in diseaseaanuon ko nashta karane having aushadhiorn are:",
    option:["pratijaiviof","vaccine","opioidsa","among these sabhee"],
    answer:"pratijaiviof"
},
{
    question: "one food chain kisafrom aarnbha is?",
    option:["naaitrojana sthireekarana karane having organisms from","lightsynthesis karane having from","shvasana from","vighatanakartaa from"],
    answer:"lightsynthesis karane having from"
},
{
    question: "among the following which onela cell protein is?",
    option:["spaairulinaa","klorelaa","sinedesmasa","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "indala ne traits of vnshaagati on ofrya when lightita karaaor?",
    option:["1870","1900","1865","1845"],
    answer:"1865"
},
{
    question: "prabhaavee symptom praaroopa whose oninaama occurs?",
    option:["oneekshaartha hybridization by","dvisnkara hybridization by","vnshaavalee vishleshana by","prateepa hybridization by"],
    answer:"oneekshaartha hybridization by"
},
{
    question: "among the following maasika chakra avadhi for which-saa correct kathana is?",
    option:["egg of sarjana : 5ven dina","endometrium of pumaleformation : 5-10ven dina","endometrium by poshaka of formation Implantation for : 11-18ven dina","projestaraona level in growth : 1-15ven dina"],
    answer:"endometrium of pumaleformation : 5-10ven dina"
},
{
    question: "gaimeeta formation ko are called",
    option:["gaimeetojesisa","saaitoofyanesisa","sporojenesisa","miyosaayata"],
    answer:"gaimeetojesisa"
},
{
    question: "egaaroja jela is obtained:",
    option:["samudree ghaasa from","maize from","Hydrilla from","pharna from"],
    answer:"samudree ghaasa from"
},
{
    question: "Embryo sac in pravesha karate samaya pollennaliof in are",
    option:["two male gamete","two male nucleus","four nae gamete","three male gamete"],
    answer:"two male gamete"
},
{
    question: "among the following which-saa male flower of bhaaga is",
    option:["jaaornga","pumnga","stareeofsara","eggaashaya"],
    answer:"pumnga"
},
{
    question: "aapatita saura radiation in lightsynthesisaatmaka sakriya radiation (PAR) of pratishata kitanaa occurs?",
    option:["100%","50%","1-5%","2-10%"],
    answer:"50%"
},
{
    question: "protein synthesis in two amino acids between kisa praofra of bndha becomes is?",
    option:["peptaaida","haaidrojana","nucleotide","nyookliyosaaida"],
    answer:"peptaaida"
},
{
    question: "DNA anu pratisamaanaantarana is, whyki:",
    option:["H-bond","phaospho-daathistara bnwealth","daayasalphaaida bnwealth","none of these"],
    answer:"H-bond"
},
{
    question: "one lake in second poshana level occurs:",
    option:["plantplavaka","praaniplavaka","nitalaka","fish"],
    answer:"praaniplavaka"
},
{
    question: "blood group A in occurs",
    option:["pratijana A, antibody B","pratijana B, antibody A","pratijana A, antibody B","pratijana A, antibody anupasthita"],
    answer:"pratijana A, antibody B"
},
{
    question: "human of ardadhasootreebhaajana cell (Meiocyte) in of chromosome number is:",
    option:["40","42","44","46"],
    answer:"46"
},
{
    question: "among the following which-saa secondary pradooshaka is?",
    option:["SO₂","CO₂","PAN","erosola"],
    answer:"PAN"
},
{
    question: "kina ofranon from aabaadee sadaa onivartanasheela is?",
    option:["physical","jaivika","both (A) and (B)","none of these"],
    answer:"both (A) and (B)"
},
{
    question: "penisiliyama nameka fungus in asexual reproduction main roopa from kisa snrachanaa of by occurs?",
    option:["mukulana","vikhndana","konidior","jemyoolasa"],
    answer:"konidior"
},
{
    question: "laiktika esida bacterium uchita taapa on doodha ko dahee in onivartita does and kisa vitamin of amount badhaaakara thisof poshakataa in growth does?",
    option:["A","B","C","D"],
    answer:"B"
},
{
    question: "organism-pratiofraka or baayorionetara of snratebha in which-saa vaakya wrong is?",
    option:["pratyeka organism-pratiofraka in one prakshobhaka tntra occurs।","vilodana tainka organism-pratiofraka normaltaor baelnaaofra are।","vaanchhita utpaada paane for organism-pratiofraka okseejana upalabdha naheen does।","pratyeka organism-pratiofraka in taapakrama and pH-control tntra are।"],
    answer:"vaanchhita utpaada paane for organism-pratiofraka okseejana upalabdha naheen does।"
},
{
    question: "DNA anu in saaitosina 18% is। edinina of pratishata is:",
    option:["64","36","82","32"],
    answer:"32"
},
{
    question: "pavitra upaforest paae jaate are",
    option:["pashchimee ghaata","araavalee of pahaadaiorn","khaasee and jayntior pahaadaee, meghaalaya","all of the above in"],
    answer:"all of the above in"
},
{
    question: "ozone layer in chhidra for which-saa desha sarvaadhika uttaradaayee is?",
    option:["USA","jarmanee","roosa","jaapaana"],
    answer:"USA"
},
{
    question: "one lake-paaritntra occurs",
    option:["artificial","aorganismeeya","natural","watervijnyaa"],
    answer:"natural"
},
{
    question: "among the following snvedanamndaka padaartha is?",
    option:["tnbaakoo","daaroo or alkohala","hasheesha or herothese","bhaanga or opiyama"],
    answer:"tnbaakoo"
},
{
    question: "hama logon in varmiphaorma apendiksa kaisaa organ is?",
    option:["aavashyaka organ","vestigial organ","ahomologous organs","none of these"],
    answer:"vestigial organ"
},
{
    question: "roota kaipa (moola topee) thesein upasthita occurs:",
    option:["jeerophaaita","meewhichphaaita","haaidrophaaita","islophaaita"],
    answer:"jeerophaaita"
},
{
    question: "DNA khanda nimna by whichdaaa jaataa is:",
    option:["laaigeja","paoleemareja","heliofja","jaayareja"],
    answer:"laaigeja"
},
{
    question: "ghadaiorla and me phlaaee (May fly) of organismnaofla occurs kramashh",
    option:["15 year, 1 saptaaha","30 year, 1 saptaaha","45 year, 1 maheenaa","60 year, 1 dina"],
    answer:"60 year, 1 dina"
},
{
    question: "twoharaa fertilization whose specialtaa is",
    option:["dvicotyledonee and onecotyledonee sabhee aavrittaseedee of","sabhee anaavritaseedee of","phenediseaseemsa of","Spermatophytes of"],
    answer:"dvicotyledonee and onecotyledonee sabhee aavrittaseedee of"
},
{
    question: "jnpinga gene is called:",
    option:["khndita gene","traansaposona","saailenta gene","among these sabhee"],
    answer:"traansaposona"
},
{
    question: "sarvaadhika kapaala kshamataa is",
    option:["niendarathala human of","kro-maignaona human of","aadhunika human of","jaavaa human of"],
    answer:"niendarathala human of"
},
{
    question: "mammals egg in Cleavage occurs",
    option:["Meroblastic","Holoblastic","Unequal","Spiral"],
    answer:"Holoblastic"
},
{
    question: "uterus in kaoon-tee of one prabhaavee and anthuterusee yukti being of main ofrana is",
    option:["sperms of fertilization kshamataa in lessee","uterus in kaoon aayana mochita being due to sperms of bhakshaofnu krior in growth","sperms of gatisheelataa in lessee","none of these"],
    answer:"sperms of gatisheelataa in lessee"
},
{
    question: "among these which population control of natural upaaya is।",
    option:["shiofra","parasitism","(A) and (B) both","none of these"],
    answer:"(A) and (B) both"
},
{
    question: "pollen grain haraa naheen occurs whyki",
    option:["thisin harita lavaka naheen are","plaastidsa of hraasa ho jaataa is","Plastids of badalaava kromoplaastasa in ho jaataa is","Vectors by aakarshana due to"],
    answer:"thisin harita lavaka naheen are"
},
{
    question: "among the following from kisa plants of species in seed of utpaadana asngareproduction by occurs?",
    option:["estarersior and ghaasa","saaitrasa and mango","sarason","none of these"],
    answer:"estarersior and ghaasa"
},
{
    question: "among these which saarvabhaumika blooddaataa samooha is?",
    option:["A","B","AB","O"],
    answer:"O"
},
{
    question: "aabaadee of adhyayana in kina ofrakon of dhoarna jarooree is?",
    option:["satenyon of number and praofra","nishchita area or praofra","nishchita samaya","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "cell-snvaahita disease pratirodhee kisadue to occurs?",
    option:["bee-limphosaaitsa","tee-limphosaaitsa","both (A) and (B)","plaajmaa cell"],
    answer:"tee-limphosaaitsa"
},
{
    question: "kraaee IAb gene one protein utpaadita does which rokathaama does:",
    option:["kaorna borara","cotton baola krimi","neemaitoda ko","bacterium"],
    answer:"kaorna borara"
},
{
    question: "thesein which restarikshana enzyme naheen is?",
    option:["EcoRI","BamHI","HindIII","Pectinase"],
    answer:"Pectinase"
},
{
    question: "enteebaayotika shabda of pranetaa are:",
    option:["phleminga","jemale","vaaksamaina","none of these"],
    answer:"vaaksamaina"
},
{
    question: "hamaare jaivika sroton of main factor are:",
    option:["insect","bird","nimaitodsa","foresteeya organismna"],
    answer:"foresteeya organismna"
},
{
    question: "milara-yoore experiment by major roopa from which-from amino acid taiorra kie gae the?",
    option:["proleena","proleena and fromreena","elaaneena and glaathiseena","fromreena and triptophena"],
    answer:"elaaneena and glaathiseena"
},
{
    question: "AB blood group in 2 gene are which are",
    option:["Co-dominant","Co-recessive","Incomplete dominant","Dominant-recessive"],
    answer:"Co-dominant"
},
{
    question: "mammals of sperm between bhaaga in koar is found",
    option:["nucleus","rasapaddyee","maaitokaondarior","fromntreeola"],
    answer:"maaitokaondarior"
},
{
    question: "one hee flower of female reproductionaanga of anther from pahale mature being of avasthaa ko are called",
    option:["Protogyny","Protandry","Heterogamy","Autogamy"],
    answer:"Protogyny"
},
{
    question: "Estrogen of secretion in which occurs?",
    option:["kaoonsa lyootiyama","Membrane granulosa","Ovary germinal epithelium","pityootaree grnthi"],
    answer:"Membrane granulosa"
},
{
    question: "stanadhaariyon in vrishana vrishanakoshon in utarate are",
    option:["spermatogenesis for","fertilization for","reproduction organon of development for","visarala organon of development for"],
    answer:"spermatogenesis for"
},
{
    question: "vnshaanugata twosha edinosina diemineja (ADA) of lessee of sthaayee treatment is done:",
    option:["enjaaima pratisthaapana chikitsaa by","genetic abhiorntriof by laseeofnu in sakriya ADA gene and cof DNA pravesha karaakara","edinosina diemineja of sakriyaka denaa","asthi-majjaa of cells ko aarnbhika embryoeeya avasthaa in pravesha karaakara"],
    answer:"genetic abhiorntriof by laseeofnu in sakriya ADA gene and cof DNA pravesha karaakara"
},
{
    question: "dee०ena०e० of ve bhaaga which protein synthesis hetu kodinga in bhaaga naheen lete thosehen are called",
    option:["intraonsa","onesaonsa","traansapowhichnsa","none of these"],
    answer:"intraonsa"
},
{
    question: "among the following which-saa wheat of improved variety is?",
    option:["sonaaliof","poosaa","ratana","padmaa"],
    answer:"sonaaliof"
},
{
    question: "kutte (Dog) of snbhaavita organismna ofla occurs।",
    option:["20 year","15 year","10 year","5 year"],
    answer:"15 year"
},
{
    question: "kisa avasthaa in shabda Dioecious of use occurs?",
    option:["dvilingee","onelingee","ubhayalingee","gaatheseendromaarpha"],
    answer:"onelingee"
},
{
    question: "oonchaaee in prati 1000 meetara of growth on temperature kitanaa girataa is?",
    option:["6.5°C","2.5°C","7.5°C","3.5°C"],
    answer:"6.5°C"
},
{
    question: "pudeena (Mint) ofyika pravarwaealth does:",
    option:["antarbhoolevelee (sucker)","uonibhoolevelee (runner)","bhoolevelee (offset)","prakanda (rhizome)"],
    answer:"antarbhoolevelee (sucker)"
},
{
    question: "aavrittaseedee plant in seed of formation at the time of secondary nucleus onivartita ho jaataa is",
    option:["embryo in","endosperm in","cotyledon in","seedchola in"],
    answer:"endosperm in"
},
{
    question: "kisa sthiti in F2 peedhaee in samasymptomee and samageneee anupaata samaana occurs?",
    option:["dvisnkara kraosa","anucomplementary gene","incomplete dominance","nirodhaatmaka gene"],
    answer:"incomplete dominance"
},
{
    question: "paanee in ugane having awhichlaa kisa svatntra naaitrojana phiksinga saatheseobaikteeriyama with simbaayotika sammilana in occurs?",
    option:["klorelaa","naastaoka","ainaabienaa","taolipothriksa"],
    answer:"ainaabienaa"
},
{
    question: "immunity-tntra ko poornaroopa from damana karane for which-see cells are?",
    option:["kilara cells","sahaayaka T-cells","nirodhee T-cells","memoree cells"],
    answer:"nirodhee T-cells"
},
{
    question: "sperm ande of ghere ko gholane for one enjaaima yukta padaartha utpanna does। this is called",
    option:["haailooronika amla","haailooronideja","enddaiseaseemona","daaesteja"],
    answer:"haailooronideja"
},
{
    question: "aigaaroja among the following kisafrom nioflaa jaataa is?",
    option:["samudree ghaasa","maize","saaikasa","Hydrilla"],
    answer:"samudree ghaasa"
},
{
    question: "gamete formation of krior ko koar are called",
    option:["oogenesis","gametereproduction","ofyika vibhaajana","none of these"],
    answer:"gametereproduction"
},
{
    question: "if kisee flower of anther and stigma vibhinna samaya in mature are hon, to ifrom are called",
    option:["Dicliny","Dichogamy","Herkogamy","Cleistogamy"],
    answer:"Dichogamy"
},
{
    question: "onerosoma among these whose snbhaaga is?",
    option:["human sperm of sira of","human sperm between bhaaga of","praarnbhika dimbaanujanacell of","blaastosista of"],
    answer:"human sperm of sira of"
},
{
    question: "among these which saa ecological pyramid hameshaa seedhaa occurs।",
    option:["amount (Mass) of","number of","energy of","none of these"],
    answer:"energy of"
},
{
    question: "penisiliyama in reproduction occurs:",
    option:["kaliof","vikhndana","jemyoolsa","konidior"],
    answer:"konidior"
},
{
    question: "which-see one onighatanaa jaiva development in natural chayana of daarvina of dhaaranaa ko sahayoga detee is?",
    option:["paarageneee animalon of development","kloninga by daolee bheda of utpaadana","insecton in insectnaashaka pratirodhakataa utpanna honaa","organ transfer for stema cell from organ development"],
    answer:"insecton in insectnaashaka pratirodhakataa utpanna honaa"
},
{
    question: "aahaara shrrinkhalaa in 10% energy transfer of niyama kisane dior?",
    option:["stenale","lindemaina","veejamaina","tenasle"],
    answer:"lindemaina"
},
{
    question: "AIDS in which-see cells sarvaadhika prabhaavita isn?",
    option:["B-fromlsa","T-fromlsa","monosaaitsa","nyootrophilsa"],
    answer:"T-fromlsa"
},
{
    question: "tee-limphosaaita is produced:",
    option:["peta from","thaaimasa from","yakrita from","asthi majjaa from"],
    answer:"asthi majjaa from"
},
{
    question: "population of adhyayana is called:",
    option:["oflograaphee","mano organismscience","baayograaphee","demograaphee"],
    answer:"demograaphee"
},
{
    question: "which-from desha in biodiversity more is?",
    option:["braajeela","dakshinee aphreeof","roosa","India"],
    answer:"braajeela"
},
{
    question: "hnsiorofra bloodksheenataa is",
    option:["otosomala genetic disease","elosomika genetic disease","epistetika prabhaava","poshana vikriti"],
    answer:"otosomala genetic disease"
},
{
    question: "among the following which virus janita disease is?",
    option:["phloo","poliyo","AIDS","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "gene therapy of first baara experiment when kior gaor thaa?",
    option:["1990 in","2000 in","1890 in","1999 in"],
    answer:"1990 in"
},
{
    question: "toxin protein of name bataaie which baisilasa thooreenajiyensisa by made jaataa is।",
    option:["tyooforceeena","insulina","kraaee protein","all of the above"],
    answer:"kraaee protein"
},
{
    question: "among these which klaayotorisa of homologous organs is",
    option:["yoni","linga","(A) and (B) both hee","none of these"],
    answer:"linga"
},
{
    question: "AaBB and aaBB genotype having parents between kraosa of oninaama hogaa",
    option:["sabhee AaBB","1AaBB : 3aaBB","1AaBB : 1aaBB","3AaBB : 1aaBB"],
    answer:"1AaBB : 1aaBB"
},
{
    question: "among the following which-saa kraosa 3 : 1 of anupaata ko rateshaataa is?",
    option:["AaBb × AaBb","aabb × AABb","Aabb × Aabb","AaBb × aabb"],
    answer:"Aabb × Aabb"
},
{
    question: "Spermatid from sperm formation of antima kshana occurs",
    option:["onerosoma of formation","Microtubules of formation","poonchha formation","cytoplasm of hraasa"],
    answer:"cytoplasm of hraasa"
},
{
    question: "kisee aavrittaseedee of Female gametophyte koar rateshaataa is",
    option:["Egg","Carpel","Pollen grain","Oospore"],
    answer:"Egg"
},
{
    question: "maasika chakra is found",
    option:["human of female in","stanapaayee female in","preemeeta of female in","none of these"],
    answer:"preemeeta of female in"
},
{
    question: "jaivika khaada of main source is:",
    option:["haraa algae","yeesta","bacterium","laala algae"],
    answer:"haraa algae"
},
{
    question: "heemopheelior kisa taraha of beemaaree is?",
    option:["vnshaagata disease","aprabhaavee symptom","X-chromosome sahalagna disease","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "kisee onivaara of aneka peedhaiyon of traits of vishleshana is called?",
    option:["vnshaavalee vishleshana","indala vishleshana","paneta vishleshana","none of these"],
    answer:"vnshaavalee vishleshana"
},
{
    question: "veerya ko in which himeekrita is done?",
    option:["tarala naaitrojana in","rephrijaretara in","barpha in","among these sabhee"],
    answer:"tarala naaitrojana in"
},
{
    question: "uchcha nucleotide in sugar is:",
    option:["raaiboja","diokseeraaiboja","heksoja","koee pentoja"],
    answer:"koee pentoja"
},
{
    question: "aigaaroja of is used:",
    option:["ilektarophoresisa in","gene kloninga in","DNA ko dekhane for","plaajmida ko oftane for"],
    answer:"ilektarophoresisa in"
},
{
    question: "one saaibrida, haaibrida occurs jisain paae jaate are।",
    option:["two vibhinna paudhon of cell dravya","two vibhinna paudhon of geneoma and cell dravya","two vibhinna paudhon of cell dravya and one plants of geneoma","two vibhinna paudhon of geneoma"],
    answer:"two vibhinna paudhon of cell dravya and one plants of geneoma"
},
{
    question: "among these pratyoorjataa utpanna karane having beemaaree which is?",
    option:["tvachaa cancer","he jvara","interika jvara","galagnda"],
    answer:"he jvara"
},
{
    question: "klaathesepheltara sindroma of chromosome factor is",
    option:["2A + XX","2A + XXY","2A + Y","2A - XY"],
    answer:"2A + XXY"
},
{
    question: "protein synthesis of amino acid ko sakriya karane in whose aavashyakataa is:",
    option:["AMP","ADP","GTP","ATP"],
    answer:"ATP"
},
{
    question: "salphara of sabafrom badaaa sngraahaka is",
    option:["airmandala","chattaanen","ocean","lake"],
    answer:"chattaanen"
},
{
    question: "nucleuseeya endosperm in primary endosperm nucleus of vibhaajana of baada",
    option:["cellwall of formation occurs","cellwall of formation naheen occurs","one badaee and one chhotee cell banatee is","none of these"],
    answer:"cellwall of formation naheen occurs"
},
{
    question: "air pollenita flower normalth are",
    option:["aakarshaka","chhote","rngaheena","(B) and (C) both"],
    answer:"(B) and (C) both"
},
{
    question: "hnsiorofra cell abloodtaa prarateshita does",
    option:["epeestesisa","sahaprabhaavitaa","pliyotraopee","incomplete dominance"],
    answer:"pliyotraopee"
},
{
    question: "sheetoshna praarea of major anaaja is।",
    option:["paddy","wheat","maize","jau"],
    answer:"wheat"
},
{
    question: "praaimarsa of use is done",
    option:["PCR in","kloninga in","DNA snsaawealth in","none of these"],
    answer:"PCR in"
},
{
    question: "forestya organismna snrakshita is",
    option:["svasthaane","baahya sthale","both (A) and (B)","shiofriyon by chayanaatmaka shiofra karanaa"],
    answer:"both (A) and (B)"
},
{
    question: "indala ne prastaavita kior thaa",
    option:["sahalagnataa of niyama","10% energy of niyama","heredity of niyama","none of these"],
    answer:"heredity of niyama"
},
{
    question: "sitrika amla of utpaadana occurs",
    option:["aisoanjilasa fungus from","bacterium from","yeesta from","virus from"],
    answer:"aisoanjilasa fungus from"
},
{
    question: "sunucleusiyon in t-RNA, 5S-rRNA and snRNA of anulekhana in among these which antargarasta is?",
    option:["RNA paoleemareja I","RNA paoleemareja II","RNA paoleemareja III","among these sabhee"],
    answer:"RNA paoleemareja III"
},
{
    question: "dosaa and idalee of dheele-dhaale aate of floweree huee ubharee shakla kisa ofrana from is?",
    option:["O₂","CO₂","H₂","N₂"],
    answer:"CO₂"
},
{
    question: "malegamete and female gamete of snyojana from koar becomes is?",
    option:["egg","sperm","veerya","yugmaja"],
    answer:"yugmaja"
},
{
    question: "gene kloninga at the time of gene taiksee kifrom is called?",
    option:["vaikseena","plaajmida","bacterium","protowhichana"],
    answer:"plaajmida"
},
{
    question: "hormone which maasika-chakra from relationshipita na ho",
    option:["LH","FSH","thistraadiyola","TSH"],
    answer:"TSH"
},
{
    question: "kisee flower of eggaashaya are:",
    option:["haploid","diploid","triploid","tetraploid"],
    answer:"diploid"
},
{
    question: "variation of antima srota is:",
    option:["natural selection","laingika reproduction","mutation","hormonela kriormethod"],
    answer:"mutation"
},
{
    question: "moreaansha agriculture plant are।",
    option:["otopaoleeploidsa","elopaoleeploidsa","ainyooploidsa","heploidsa"],
    answer:"elopaoleeploidsa"
},
{
    question: "among the following which ubhayalingaashrayee plant naheen is?",
    option:["papeetaa","sarason","maize","udahula"],
    answer:"papeetaa"
},
{
    question: "population-visphota of oninaama is:",
    option:["aaya in hraasa","land of hraasa","khanija of hraasa","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "DNA shrrinkhalaa growth in oofjaaof khanda:",
    option:["by anulekhana occurs","3′ from 5′ dishaa in bahulakataa rateshaate are and dvishaakhaa banaate are","DNA replica of ardadhasnrakshee prakriti ko rateshaate are","5′ from 3′ dishaa in bahulakataa rateshaate are and 3′ from 5′ DNA replica samajhaate are"],
    answer:"5′ from 3′ dishaa in bahulakataa rateshaate are and 3′ from 5′ DNA replica samajhaate are"
},
{
    question: "among the following which bacterium from being having beemaaree naheen is?",
    option:["taaiphaaida","kushtha","diphtheerior","influenza"],
    answer:"influenza"
},
{
    question: "callus culture in jada of bananaa by whom prerita occurs?",
    option:["jibarelina","saaitooftheseina","oksina","ethileena"],
    answer:"oksina"
},
{
    question: "main air pradooshaka is:",
    option:["CO","CO₂","N₂","gndhaka"],
    answer:"CO"
},
{
    question: "kisee organism in haploid of chromosome number 10 is, thisof Tetrasomic number hogee",
    option:["40","14","22","44"],
    answer:"22"
},
{
    question: "sthaleeya organismdhaariyon of population ghanatva kisa pada in maapaa jaataa is?",
    option:["organismdhaaree/meetara","organismdhaaree/meetara²","organismdhaaree/meetara³","organismdhaaree/meetara²"],
    answer:"organismdhaaree/meetara²"
},
{
    question: "ecological diversity in which sammilita is?",
    option:["alphaa diversity","beetaa diversity","gaamaa diversity","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "F2 vnshaja of Monohybrid genotypic anupaata 1 : 2 : 1 rateshaataa is",
    option:["Segregation","Independent assortment","Dominance","Incomplete dominance"],
    answer:"Segregation"
},
{
    question: "Hysterectomy of taatoanya sarjaree by visthaapanaa is",
    option:["yoni of","eggvaahinee of","uterus of","eggaashaya of"],
    answer:"uterus of"
},
{
    question: "DNA khnda which samaana agra and pashcha of Code ko padhataa is, is called:",
    option:["Palindromic DNA","Plasmic DNA","complementary DNA","copy DNA"],
    answer:"Palindromic DNA"
},
{
    question: "hare plants producer are which",
    option:["light energy ko chemical energy in badala dete are।","chemical energy ko light energy in badala dete are।","both (A) and (B) correct are","none of these"],
    answer:"light energy ko chemical energy in badala dete are।"
},
{
    question: "without fertilization of phala formation ko koar are called?",
    option:["apayugmana","asngareproduction","anishekareproduction","among these sabhee"],
    answer:"anishekareproduction"
},
{
    question: "geneotaaipa of pataa ‘testa kraosa’ by is done। this kisabetween of kraosa is?",
    option:["F1 haaibrida and prabhaavee janaka between","F1 haaibrida and recessive janaka between","two F1 haaibrida between","two F2 haaibrida between"],
    answer:"F1 haaibrida and recessive janaka between"
},
{
    question: "uchcha paidaavaara and disease pratirodhee ‘sonaaliof’ and ‘kaloarna sonaa’ whose varietyen are?",
    option:["paddy","wheat","maize","cotton"],
    answer:"wheat"
},
{
    question: "mittee ko upajaaoo banaane in sahaayaka is?",
    option:["insectnaashaka","jaivika khaada","yeesta","none of these"],
    answer:"jaivika khaada"
},
{
    question: "maorphina and apheema kisafrom is obtained?",
    option:["kajaanasa ofjana","kainaabisa fromtaaivaa","paapaavara somaneepharama","raaulphior sapaitinaa"],
    answer:"paapaavara somaneepharama"
},
{
    question: "maontariyala protokaola of lakshaya is:",
    option:["owhichna kshatiofree padaarthon in lessee laanaa","jaivadiversity of conservation","water pollution of control","ofrbana daaioksaaida nishoafsana in lessee"],
    answer:"owhichna kshatiofree padaarthon in lessee laanaa"
},
{
    question: "kisee Telolecithal egg in yolk is found",
    option:["both sira on","one sire on","madhya in","poore egg of cytoplasm in"],
    answer:"one sire on"
},
{
    question: "malaria of treatment hetu kisa plants from davaa taiorra of gaee is?",
    option:["maameena","kunaina","taiksola","tulasee"],
    answer:"kunaina"
},
{
    question: "human in blood O varga in",
    option:["enteejana anupasthita are","enteebaodee anupasthita are","enteejana upasthita rahate are","enteebaodee A upasthita rahate are"],
    answer:"enteejana anupasthita are"
},
{
    question: "repliofsana among these kisafrom relationshipita is –",
    option:["dee ena e","aara ena e","both from","none of these"],
    answer:"dee ena e"
},
{
    question: "shaaofhaaree insecton ko khaane having medhaka occurs:",
    option:["primary consumer","secondary consumer","tertiary consumer","sheersha maansaahaaree"],
    answer:"secondary consumer"
},
{
    question: "gene kloninga in prayukta 'gene taxi' kifrom are called?",
    option:["vaikseena","plaajmida","baikteeriyama","protozoa"],
    answer:"plaajmida"
},
{
    question: "daatra cell abloodtaa prarateshita does",
    option:["epistaisisa","sahaprabhaavitaa","pleeotraopee","incomplete dominance"],
    answer:"pleeotraopee"
},
{
    question: "vishva AIDS divasa occurs:",
    option:["1 maee","20 disambara","1 joona","1 disambara"],
    answer:"1 disambara"
},
{
    question: "thesein in which only one baara apane organismnaofla in flower khilate are?",
    option:["bamboo","mango","leechee","jaamuna"],
    answer:"bamboo"
},
{
    question: "in which gene whichdaaa in naheen occurs?",
    option:["yugmanaja","ofyika cell","endospermeeya cell","gamete"],
    answer:"gamete"
},
{
    question: "vrishana in hormone secretionita cell is",
    option:["spermatogonia","spermatocyte","sustentacular cell","Leydig cells"],
    answer:"Leydig cells"
},
{
    question: "among the following in which Cleistogamy occurs",
    option:["dhatooraa","pitoonior","komelinaa","glediolasa"],
    answer:"komelinaa"
},
{
    question: "doodha from dahee formation in kisa bacterium of use occurs?",
    option:["stareptokokkasa","laiktobaisilasa","enaabenaa","none of these"],
    answer:"laiktobaisilasa"
},
{
    question: "vaatsana-krika praaroopa of DNA maodala in vrihad agroove whose site is?",
    option:["histona protein of bnwealth","amleeya protein of bnwealth","RNA anu of bnwealth","glaaikoprotein of bnwealth"],
    answer:"histona protein of bnwealth"
},
{
    question: "among the following which dvilingee naheen is?",
    option:["pheetaakrimi","dog","whichnka","spnja"],
    answer:"dog"
},
{
    question: "PCR from jaancha is:",
    option:["HIV of","cancer of","tuberculosis of","isjaa of"],
    answer:"HIV of"
},
{
    question: "twoharaa fertilization in bhaaga lene having male nucleuson of number is",
    option:["2","3","4","5"],
    answer:"2"
},
{
    question: "watereeya paaritntra in energy of pyramid kaisaa occurs?",
    option:["hameshaa seedhaa","hameshaa ultaa","ghnteenumaa","none of these"],
    answer:"hameshaa seedhaa"
},
{
    question: "three vaijnyaanikon ne indala of oninaamon of punh khoja of, jisain which shaamila naheen is?",
    option:["vaaltara satana","dee vreeja","kaorensa","vaona lionmaoka"],
    answer:"vaaltara satana"
},
{
    question: "karnaataka in baandeepura sthala prasiddha is",
    option:["haathiyon for","hngula for","cheeton for","mora for"],
    answer:"haathiyon for"
},
{
    question: "oonona of which-saa gene ripreshana protein banaataa is?",
    option:["oonetara","promotara","reguletara","snrachanaatmaka"],
    answer:"reguletara"
},
{
    question: "Seminal vesicle of secretionna by Fructose of upasthiti Forensic jaancha in prarateshita does?",
    option:["syphilis","AIDS","forceaatoafra","Hepatitis"],
    answer:"forceaatoafra"
},
{
    question: "DNA avakshepita among the following of whom milaane from occurs?",
    option:["sheetita ethenaola","sheetita mithenaola","garma ethenaola","eldihaaida"],
    answer:"sheetita ethenaola"
},
{
    question: "DNA anu in saaitoseena hameshaa kisafrom judaaa rahataa is?",
    option:["thaayameena","yuraasila","guaaneena","saayatoseena"],
    answer:"guaaneena"
},
{
    question: "'phlevara fromvara' among these what is?",
    option:["peedakanaashee","choowhichn of species","paaraorganismee tamaatara","insectnaashee protein"],
    answer:"paaraorganismee tamaatara"
},
{
    question: "LSD praapta is:",
    option:["fungus from","laaiofna from","algae from","bacterium from"],
    answer:"fungus from"
},
{
    question: "agriculture biotechnology in prayukta major technique is:",
    option:["tissue culture","roopaantarana","plant reproduction","DNA copykarana"],
    answer:"tissue culture"
},
{
    question: "among the following which-saa marudbhidee is?",
    option:["kaiperisa","lotus","chaatheseaa roja","aaloo"],
    answer:"kaiperisa"
},
{
    question: "audyogika melaanijma of ghatanaa rateshaatee is",
    option:["reproductionika separation","genetic separation","natural selection","bhaugolika vitarana"],
    answer:"natural selection"
},
{
    question: "B-DNA of one poorna ghumaava in naaitrogenesa besa of kitane peyarsa are?",
    option:["5","10","15","20"],
    answer:"10"
},
{
    question: "kisee aavrittaseedee (Angiosperms) in kitane gamete pollennaliof in are?",
    option:["one","two","three","aneka"],
    answer:"two"
},
{
    question: "sahopaofritaa kisabetween is?",
    option:["titalee va flower","ishcherichior kolaaee va human","jooklorelaa va haaidraa","harmita kreba va samudree aineemona"],
    answer:"jooklorelaa va haaidraa"
},
{
    question: "svapollination ko among the following which-saa plant prevents is",
    option:["ernda","maize","A and B both","none of these"],
    answer:"ernda"
},
{
    question: "goldena raathis in which-which saa padaartha more amount in is found?",
    option:["thaayamina","pholika esida","beetaa-kairoteena","raaibophlevina"],
    answer:"beetaa-kairoteena"
},
{
    question: "by whom kisee aavrittaseedee in tetrad of fouron microspores dhaof rahate are",
    option:["fromluloja","Sporopollenin","Pactose","Stamen"],
    answer:"Sporopollenin"
},
{
    question: "saaikasa in pollination occurs:",
    option:["three koshiofya avasthaa in","four koshiofya avasthaa in","two koshiofya avasthaa in","one koshiofya avasthaa in"],
    answer:"three koshiofya avasthaa in"
},
{
    question: "phaailerior/elephantpaanva of disease diseaseaanu is:",
    option:["vuchererior","esoafrisa","teenior","none of these"],
    answer:"vuchererior"
},
{
    question: "nimna in which-saa disease hemoglobin truti due to occurs?",
    option:["daathose sindroma","phinaailainsectonyoorior","klaatheseepheltara sindroma","sikala fromla eneemior"],
    answer:"sikala fromla eneemior"
},
{
    question: "thesein kifrom ‘bngaala of aatnka’ kahaa gaor is?",
    option:["ageva","waterkumbhee","oflaa","braayophilama"],
    answer:"waterkumbhee"
},
{
    question: "naee species of reproduction in flower kaliofon from punofsara of nikalanaa is called",
    option:["baiginga","imaiskuleshana","taiginga","enthesisa"],
    answer:"imaiskuleshana"
},
{
    question: "bloo bebee sindaroma occurs:",
    option:["TDS of moretaa from","DO of moretaa from","kloraaida of moretaa from","metahemoglobin from"],
    answer:"metahemoglobin from"
},
{
    question: "energy of pyramid occurs:",
    option:["sadaiva ultaa","sadaiva seedhaa","both (A) and (B)","none of these"],
    answer:"sadaiva seedhaa"
},
{
    question: "among the following which-from samaroopa organ (Analogous organs) of udaaharana are?",
    option:["kaskataa of shalka","ependiksa","insect and whenootara of pnkha","bird of pnkha and insect of mukhaanga"],
    answer:"insect and whenootara of pnkha"
},
{
    question: "aigaaroja of is used:",
    option:["ilektarophoresisa in","gene kloninga in","DNA ko dekhane for","plaajmida ko oftane for"],
    answer:"ilektarophoresisa in"
},
{
    question: "jeerophaaitsa in are:",
    option:["sikudae rndhra chhidra","gaharee jada","motee kyootikala","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "among these which svaimmunity of disease udaaharana is?",
    option:["damaa","roometaoyada artharaaitisa","cancer","none of these"],
    answer:"roometaoyada artharaaitisa"
},
{
    question: "ofyajmaa kisa avasthaa in becomes is",
    option:["samasootree cell vibhaajana","emaaitosisa cell vibhaajana","ardadhasootree cell vibhaajana","none of these"],
    answer:"ardadhasootree cell vibhaajana"
},
{
    question: "oneidanaa what is?",
    option:["avashoshee organism","yojaka kadaee","vilupta kadaee","none of these"],
    answer:"yojaka kadaee"
},
{
    question: "ecosystem in aahaara level ko is called:",
    option:["poshana reeti","consumer level","producer level","shaaofhaaree level"],
    answer:"consumer level"
},
{
    question: "among the following in which gamana atyadhika ghata jaataa is?",
    option:["aiwhichsoanmior","bahuspermtaa","alpaspermtaa","veerya in sperms of svath gatisheelataa of ghata jaanaa (esthenosoanmior)"],
    answer:"veerya in sperms of svath gatisheelataa of ghata jaanaa (esthenosoanmior)"
},
{
    question: "in which artificial seed of formation is done?",
    option:["ofyika embryo","bahuembryo","both (A) and (B)","none of these"],
    answer:"ofyika embryo"
},
{
    question: "female gametophyte rateshaataa is",
    option:["Ovule","Embryo sac","Megaspore mother cell","Megasporephyll"],
    answer:"Embryo sac"
},
{
    question: "anormal forestdhya male, shareera on less baala, less vikasita reproductionaanga of symptom kisafrom relationshipita are?",
    option:["XXX chromosome having male from","XY chromosome having male from","XXY chromosome having male from","uonyukta in from koee naheen"],
    answer:"XXY chromosome having male from"
},
{
    question: "highest and sabafrom less gene having human chromosome which-from are?",
    option:["chromosome 21 and Y","chromosome 1 and X","chromosome 1 and Y","chromosome X and Y"],
    answer:"chromosome 1 and Y"
},
{
    question: "one male Grasshopper in sex complement of number is",
    option:["XY","XX","XO","YO"],
    answer:"XO"
},
{
    question: "human of bhojana of major daane are।",
    option:["phalee","paddy","millet","tela seed"],
    answer:"paddy"
},
{
    question: "that animal which apane shareera of one tihaaee bhaara of baraabara water of lessee sahana kara sakataa is",
    option:["nektayoorasa","oonta","chhipakalee","ofitona"],
    answer:"oonta"
},
{
    question: "gene vinimaya kisa avasthaa in occurs?",
    option:["jaaigoteena","paiinsecteena","diploteena","liptoteena"],
    answer:"paiinsecteena"
},
{
    question: "if mahaaseedaanu maatrikosha in 10 chromosome hon to eliyoorona onta in kitane chromosome honge?",
    option:["10","15","20","25"],
    answer:"15"
},
{
    question: "Y-sahalagnataa samooha of number that of the cell for koar hogee jisain 2n = 14?",
    option:["5","10","7","14"],
    answer:"7"
},
{
    question: "jaivika shakti of maana nioflaa jaataa is:",
    option:["birth rate – mrityurate","birth rate + mrityurate","birth rate ÷ mrityurate","none of these"],
    answer:"birth rate – mrityurate"
},
{
    question: "AIDS of ofraka what is?",
    option:["traaikomonaasa","HIV","hipetaaitisa E","baisilasa entharesisa"],
    answer:"HIV"
},
{
    question: "Pollen kit chemical roopa from banaa occurs",
    option:["protein from","lipida and Carotenoids from","ofrbohaaidretsa and Carotenoids from","Sporopollenin from"],
    answer:"lipida and Carotenoids from"
},
{
    question: "‘laala aankadaon of book’ lightita of is",
    option:["IUCN","NEERI","NWAI","CITES"],
    answer:"IUCN"
},
{
    question: "edeneena of jagaha on saaitosina of aane ko are called",
    option:["traansakripsana","traanjisana","traansavarsana","none of these"],
    answer:"traansavarsana"
},
{
    question: "snpoorna Linkage ko sabafrom pahale in which rateshaaor gaor?",
    option:["maize","female human in","female drosophilaa in","male drosophilaa in"],
    answer:"male drosophilaa in"
},
{
    question: "vishishta genes ko onposhee paudhon in of whom use by pravesha karaaor gaor is?",
    option:["egrobaiktiriyama snvaahaka","fungus","yeesta","kharapatavaara"],
    answer:"egrobaiktiriyama snvaahaka"
},
{
    question: "one hee nasla of pashuon between reproduction ko are called।",
    option:["anthreproduction","bahihreproduction","bahihhybridization","hybridization"],
    answer:"anthreproduction"
},
{
    question: "which-saa dvilingee jaanavara is?",
    option:["earthworm, haaidraa and whichnka","tilachattaa, aisaofrisa and haaidraa","earthworm, aisaofrisa and whichnka","aisoafrisa, tilachattaa and haaidraa"],
    answer:"earthworm, haaidraa and whichnka"
},
{
    question: "EcoRI pratibnwealth enzyme among the following kisa sequence ko pahachaanataa is?",
    option:["GAATTC","GGCC","AGGCCT","TCCGGA"],
    answer:"GAATTC"
},
{
    question: "forest avasthaa among these kisa ecological avasthaa of dyoup to is?",
    option:["charama avasthaa","onvateeya avasthaa","shaaofya avasthaa","none of these"],
    answer:"charama avasthaa"
},
{
    question: "dalahanee paudhon of jada pinda in which-saa bacterium is found?",
    option:["raaiwhichbiyama","ewhichtobaiktara","stephaailokokkasa","laiktobaisilasa"],
    answer:"raaiwhichbiyama"
},
{
    question: "herothese kisa plant onivaara from is obtained?",
    option:["liguminosee","paipaaveresee","liliyesee","solenesee"],
    answer:"paipaaveresee"
},
{
    question: "on-pollination from praapta sntati rateshaataa is",
    option:["uchcha shrenee of variability and evolutionism in mahattavapoorna landof","napunsakataa","recessive character","samajaata and phenotypic samaroopataa"],
    answer:"uchcha shrenee of variability and evolutionism in mahattavapoorna landof"
},
{
    question: "if indala matara in eightven character on vifour karataa to among the following which-saa niyama asaphala ho jaataa?",
    option:["Law of Segregation","Law of Purity of Gametes","Law of Independent Assortment","Law of Dominance"],
    answer:"Law of Independent Assortment"
},
{
    question: "chipako aantwolana whose surakshaa for shuroo kior gaor thaa?",
    option:["forest","ghaasaland","namaland","pashufouraa"],
    answer:"forest"
},
{
    question: "gemaa (Gemma) by reproduction occurs:",
    option:["uchcha shrenee of paudhon in","nimna shrenee of animals in","kuchha braayophaaitaa in","staniyon in"],
    answer:"kuchha braayophaaitaa in"
},
{
    question: "crops of growth niyntraka among the following which isn?",
    option:["oksina","jibarelina","saaitooftheseina","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "uttama praofra of pyramid which sadaiva satya occurs",
    option:["energy of pyramid","jaivabhaara of pyramid","number of pyramid","both (A) and (B)"],
    answer:"energy of pyramid"
},
{
    question: "aonda khaadya shrinkhalaa of shuruaata is",
    option:["bacterium from","virus from","algae from","protozoa from"],
    answer:"bacterium from"
},
{
    question: "among the following from which animalon in gene kloninga hetu snvaahaka is?",
    option:["retrovaayarasa","saatheseobacteria","ee. kolaaee","among these sabhee"],
    answer:"retrovaayarasa"
},
{
    question: "endometriyama of whom prabhaava from motaaee in growth does?",
    option:["okseetosina","estarojena","LH","rileksina"],
    answer:"estarojena"
},
{
    question: "among these whose floweraasana khaaor jaataa is",
    option:["shareephaa","apple","orange","leechee"],
    answer:"apple"
},
{
    question: "among the following which-see ghatanaa jaiva-development in daarvina of of the theory samarthana does?",
    option:["traansajenika animalon of development","kloninga by ‘daolee’ nameka bheda of utpaadana","peedakanaashee pratirodhee insecton of prachurataa","stema cells from organ pratyarpana hetu organon of development"],
    answer:"peedakanaashee pratirodhee insecton of prachurataa"
},
{
    question: "DNA of shrrinkhalaa in F-bond kisa avayava between occurs?",
    option:["shugara and kshaara","phaospheta and kshaara","complementary kshaara","phaospheta and shugara"],
    answer:"complementary kshaara"
},
{
    question: "Sporogenesis are called",
    option:["seedaanu of development and formation ko","Mitospores of utpaadana ko","Meiospores of utpaadana ko","yugmaja and embryo of formation ko"],
    answer:"seedaanu of development and formation ko"
},
{
    question: "Bt cotton kisafrom pratirodhee is?",
    option:["insect","kharapatavaaranaashee","lavana","sookhaa"],
    answer:"insect"
},
{
    question: "among the following from which birth rate control of surgical method is?",
    option:["vaifromktaomee","tyoobektaomee","both (A) and (B)","none of these"],
    answer:"both (A) and (B)"
},
{
    question: "thesein which pondeeya ecosystem in one from more poshana level on ofrya does?",
    option:["indhaka","phaaitoplainktana","fish","jooplainktana"],
    answer:"fish"
},
{
    question: "yeesta among the following whose major srota is?",
    option:["vitamin C","raaibophlevina","sugar","protein"],
    answer:"raaibophlevina"
},
{
    question: "male in koar naheen occurs?",
    option:["Bulbourethral gland","Bertholin’s gland","Prostate","Cowper’s gland"],
    answer:"Bertholin’s gland"
},
{
    question: "egg samuchchaya banaa occurs",
    option:["egg cell","sahaayaka cell","both (A) and (B)","prativoarsaanta cells"],
    answer:"both (A) and (B)"
},
{
    question: "aarthotropasa ovule in ovuledvaara and nibhaaga are",
    option:["ovulevrinta from tirachhe","ovulevrinta from 90° on","ovulevrinta from seedhee rekhaa in","ovulevrinta of samaanaantara"],
    answer:"ovulevrinta from seedhee rekhaa in"
},
{
    question: "among the following which insectbhakshee plant is?",
    option:["draofromraa","nepentheesa","(A) and (B) both","Hydrilla"],
    answer:"(A) and (B) both"
},
{
    question: "pollution of growth of ofrana is:",
    option:["Research","population visphota","udyoga and ortaaorta","rainfall water"],
    answer:"udyoga and ortaaorta"
},
{
    question: "natural peedakanaashee AZD-Reaction is obtained।",
    option:["tambaakoo from","neem from","fungus from","algae from"],
    answer:"neem from"
},
{
    question: "drava (tarala padaartha) ko 70-80 digree fromlsiyasa on garma kara oneaaone tejee from thndaa karane of process ko are called।",
    option:["mitachuraaijeshana","paashcharaaijeshana","likviphiofshana","none of these"],
    answer:"paashcharaaijeshana"
},
{
    question: "among these sarvaadhika harmful which-see gaisa is?",
    option:["ofrbana monooksaaida","salphara daaioksaaida","naaitrasa oksaaida","none of these"],
    answer:"ofrbana monooksaaida"
},
{
    question: "sabafrom badaaa owhichna chhidra of whom ooon is?",
    option:["antaarkatiof","yooropa","aphreeof","India"],
    answer:"antaarkatiof"
},
{
    question: "goldena paddy in which-saa vitamin is found?",
    option:["A","B","C","D"],
    answer:"A"
},
{
    question: "biodiversity ofnoona India in when paasa huaa thaa?",
    option:["1992","1996","2000","2002"],
    answer:"2002"
},
{
    question: "endosoanma by kifrom poshana dior jaataa is",
    option:["seed","phala","endosoanma","embryo"],
    answer:"embryo"
},
{
    question: "among these which-saa naaitrojinasa besa DNA in naheen occurs?",
    option:["thaaimina","yuraasila","guaanina","saaitosina"],
    answer:"yuraasila"
},
{
    question: "tissue culture by badaee number in plants utpanna karane of method kahalaatee is।",
    option:["sookshama reproduction","embryo pravarwaealth","sookshama pravarwaealth","endosperm pravarwaealth"],
    answer:"sookshama pravarwaealth"
},
{
    question: "mukulana by reproduction in which occurs?",
    option:["yeesta","paaraamishiyama","penisiliyama","among these sabhee"],
    answer:"yeesta"
},
{
    question: "nimnalikhita samoohon in which snvedanaatmaka/svaapaka (Narcotic) padaartha are?",
    option:["maorphina, koofna and chaaya","herothese, koofna and tnbaakoo","braathose shugara, hasheesha and kaophee","koofna, herothese and hasheesha"],
    answer:"koofna, herothese and hasheesha"
},
{
    question: "one normal staree jisaof father varnaandha are, of shaadee one normal male from is। thatof putra kitane pratishata varnaandha honge?",
    option:["75%","50%","sabhee normal","sabhee varnaandha"],
    answer:"50%"
},
{
    question: "malaria parasitic of snkramana of main avasthaa what is?",
    option:["draaofjvaaita","sporojvaaita","merojvaaita","kriptojvaaita"],
    answer:"sporojvaaita"
},
{
    question: "aifrom bacterium of name bataaie which snvaahaka as paudhon in gene of pravesha karaane for is used।",
    option:["ewhichtobaiktara","egrobaiktiriyama tyoomepheseeyansa","baisilasa thooreenajiyensisa","ee. kolaaee"],
    answer:"egrobaiktiriyama tyoomepheseeyansa"
},
{
    question: "25 primary sperm cell and 25 primary egg cell from kitane sperm and egg bana sakate are?",
    option:["100 sperm and 100 egg","100 sperm and 50 egg","100 sperm and 25 egg","50 sperm and 25 egg"],
    answer:"100 sperm and 25 egg"
},
{
    question: "diphtheria, titanesa, kukarakhaansee aadi for which-saa vaccine lagavaanaa chaahie?",
    option:["BCG","DTP-Hib","hipetaaitisa-B","none of these"],
    answer:"DTP-Hib"
},
{
    question: "bindu in mutation edeenina gvaanina by pratisthaapita occurs",
    option:["thesevarshana in","phrema shiphta in mutation","traansavarsana in","traanjishana in"],
    answer:"traanjishana in"
},
{
    question: "human stariyon in ande of formation occurs",
    option:["uterus in","phailopiyana nalee in","overiyana phaolikala in","none of these"],
    answer:"overiyana phaolikala in"
},
{
    question: "laika prachaaleka in nimnalikhita gene of by beetaa-gailektosideja of synthesis occurs:",
    option:["gene e","gene vaaee","gene jeda","none of the above"],
    answer:"gene jeda"
},
{
    question: "kisa paaritntra of sakala primary producertaa sarvaadhika is?",
    option:["ghaasa sthala","maingrova","korala reepha","rainfall forest"],
    answer:"korala reepha"
},
{
    question: "among the following one ko chhodakara sabhee mesoderm formed are",
    option:["maansapesheeya tntra","tntriof tntra","onithatna tntra","reproductionaanga"],
    answer:"tntriof tntra"
},
{
    question: "if ovule mudaaa huaa ho and embryokosha ghodae of naala of samaana ho to ifrom are called",
    option:["Anatropous","Circinotropous","Amphitropous","Orthotropous"],
    answer:"Amphitropous"
},
{
    question: "aavrittaseedee in fertilization occurs",
    option:["Nucellus in","embryokosha in","eggaashaya in","Ovule in"],
    answer:"embryokosha in"
},
{
    question: "akhabaara of ofgaja in which-saa toxinailaa padaartha occurs?",
    option:["Cd","Pb","Mg","Hg"],
    answer:"Pb"
},
{
    question: "F1 haaibrida and recessive parent (Tt × tt) between of anupaata is",
    option:["1 : 1","2 : 1","3 : 1","4 : 1"],
    answer:"1 : 1"
},
{
    question: "apheema va herothese kisafrom praapta are?",
    option:["thiaa","pepaavara","kainaabisa","thiyobromaa"],
    answer:"pepaavara"
},
{
    question: "egg-prajaka among the following which is?",
    option:["sarpa","magaramachchha","hen","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "ABO blood group of nirdhaarana occurs",
    option:["3 recessive alleles by","3 codominant alleles by","2 codominant and 1 recessive allele by","2 recessive and 1 dominant allele by"],
    answer:"2 codominant and 1 recessive allele by"
},
{
    question: "lake ecosystem in, jaiva bhaara of pyramid occurs:",
    option:["seedhaa","ulataa","kabhee ulataa, kabhee seedhaa","koee naheen"],
    answer:"ulataa"
},
{
    question: "paudhon in insectnaashee pratirodhaka gene occurs:",
    option:["Bt","Ct","Mt","among these sabhee"],
    answer:"Bt"
},
{
    question: "one saphala parasitic that is which",
    option:["tejee from growth does","tejee from reproduction does","lambe samaya up to aatithya from chipaof rahataa is","apane aatithya from minimum maanga does"],
    answer:"apane aatithya from minimum maanga does"
},
{
    question: "kisee onivaara in 5 putriorn are। chhathee offspring when putra of snbhaaforestaa banatee is",
    option:["2 in 1","5 in 1","3 in 1","6 in 1"],
    answer:"2 in 1"
},
{
    question: "among the following which forest conservation ofrya of virodha in are?",
    option:["lakadaee oftane in bachaava","light of praapti","aaga lagane on control","forestee animal from surakshaa"],
    answer:"light of praapti"
},
{
    question: "bacterium and fungus are:",
    option:["saphaaeekartaa","primary consumer","secondary consumer","decomposer"],
    answer:"decomposer"
},
{
    question: "one species or thisof one samashti in kula genetic diversity ko koar are called?",
    option:["beetaa diversity","geneaa","gaamaa diversity","genekosha"],
    answer:"genekosha"
},
{
    question: "among the following which RNA for uonyukta naheen is?",
    option:["edineena","guaaneena","thaayameena","saaitosina"],
    answer:"thaayameena"
},
{
    question: "siraof (vinegar) of utpaadana molaafromja from kisa sookshamaorganismee by occurs?",
    option:["raaiwhichpasa","stareptokokasa esitobaiktara","eseetobaiktara","maaikoraaija"],
    answer:"eseetobaiktara"
},
{
    question: "human in kisa taraha of plaafromntaa is found?",
    option:["Chorionic","heemokoriyala","Metadiscoidal","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "vaifrom rainfall-water ko amla-water are called whose pH kisafrom less occurs?",
    option:["7","6.5","6","5.6"],
    answer:"5.6"
},
{
    question: "offspring and recessive parent between kraosa ko are called",
    option:["onela snkara","Back cross","Test cross","Reciprocal cross"],
    answer:"Test cross"
},
{
    question: "among the following which-saa nucleotide is?",
    option:["yooridilika amla","thaayameena","saaitosina","glootaamika amla"],
    answer:"yooridilika amla"
},
{
    question: "jaiva development of which-see onibhaashaa uchita is?",
    option:["kisee species of thosenatisheela itihaasa","species of variationon sahita itihaasa","species of embryoeeya itihaasa","species of varnana"],
    answer:"kisee species of thosenatisheela itihaasa"
},
{
    question: "which-saa nyooklika amla of bahulaka are?",
    option:["protein","nyookliyosaaida","nucleotide","bhaaree dhaatuon of naabhika"],
    answer:"nucleotide"
},
{
    question: "kisee aahaara-ankhalaa in energy sthaanaantarana of 10 pratishata niyama ko kisane dior?",
    option:["staanale","lindaramaina","vijamaina","traansale"],
    answer:"lindaramaina"
},
{
    question: "Fertilizin one glaaikoprotein is, which is found",
    option:["egg membrane of sataha on","sperm on","uterus of deevaala on","shukraashaya of deevaala on"],
    answer:"egg membrane of sataha on"
},
{
    question: "‘philosophika joolojika’ book kisane likhee?",
    option:["laamaarka","indala","daarvina","hyoogo dee vreeja"],
    answer:"laamaarka"
},
{
    question: "birth of baada mother from first dugdha secretionna ko Colostrum are called। thisin nihita is",
    option:["IgA","IgD","IgE","IgG"],
    answer:"IgA"
},
{
    question: "among the following in which without fertilization by reproduction of kshamataa is?",
    option:["makadaaa","cow","bee","earthworm"],
    answer:"bee"
},
{
    question: "uchcha death rate due to population in teevra hraasa is called:",
    option:["population ghanatva","population aforestmana","population visphota","uonokta sabhee"],
    answer:"population aforestmana"
},
{
    question: "areaeeya diversity ko are called:",
    option:["alphaa diversity","beetaa-diversity","gaamaa-diversity","jaivika diversity"],
    answer:"gaamaa-diversity"
},
{
    question: "gene kisafrom banaa occurs?",
    option:["lipoprotein","nyookliyosaaidsa","paolinucleotidesa","histonsa"],
    answer:"paolinucleotidesa"
},
{
    question: "pratyeka plant cell from poorna plant bana sakataa is। this character ko are called:",
    option:["kloninga","somaaklonala","toteepotensee","none of these"],
    answer:"toteepotensee"
},
{
    question: "artificial tareeof from thosenata nasla of veerya onetrita karanaa is called।",
    option:["pratiropana","veerya-snchayana","fertilization","veerya-onirakshana"],
    answer:"veerya-snchayana"
},
{
    question: "kisee plants of species in pratimukha koshaa in 8 kromosoma hon to thatof eliyoorona level in kitane kromosoma honge?",
    option:["16","24","32","8"],
    answer:"24"
},
{
    question: "humanon in XO praofra of chromosomeeeya anormaltaa due to which-saa sindroma is produced?",
    option:["tarmaale sindroma","daathose sindroma","daarvinsa sindroma","klaathesepheltara sindroma"],
    answer:"tarmaale sindroma"
},
{
    question: "plefromntaa of by",
    option:["embryo maan of naabhirajju from judaaa occurs","embryo ko maan of blood pradaana is done","embryo maan of blood from poshana praapta does","embryo jhilliyon by ghiraa occurs"],
    answer:"embryo maan of blood from poshana praapta does"
},
{
    question: "organisms of anukoolana occurs",
    option:["nirvaachana","oforntarana","vnshaagata symptom","upaarjita symptom"],
    answer:"vnshaagata symptom"
},
{
    question: "among these poore organismna in one hee baara flowerita are",
    option:["bamboo","mango","taada","none of these"],
    answer:"bamboo"
},
{
    question: "tnbaakoo of main avayava is:",
    option:["koofna","maarphina","nikoteena","thaayameena"],
    answer:"nikoteena"
},
{
    question: "in which anther in ardadhasootree vibhaajana occurs",
    option:["Endothecium cell in","pollen grain in","Tapetal cell in","spora maatri cell in"],
    answer:"spora maatri cell in"
},
{
    question: "kisee haaibrida and both in from kisee one Parent between of kraosa is called",
    option:["testa kraosa","resiprokala kraosa","onela kraosa","baika kraosa"],
    answer:"baika kraosa"
},
{
    question: "vidaala oneekshana by whose pataa chalataa is?",
    option:["AIDS","malaria","tapedika","taaiphaaida"],
    answer:"taaiphaaida"
},
{
    question: "F1 peedhaee of snkara plants ko when samayugmajee aprabhaavee janaka from kraosa karaaor jaataa is to ifrom koar are called?",
    option:["baika kraosa","testa kraosa","onesnkara kraosa","dvisnkara kraosa"],
    answer:"testa kraosa"
},
{
    question: "normalth one mature nishechita ovule in n, 2n and 3n sthiti milatee is, kramashh",
    option:["endosperm, ovuleofya and egg in","egg, enteepodala and endosperm in","adhoarvarana, simalejida and egg in","egg, ovuleofya and endosperm in"],
    answer:"egg, ovuleofya and endosperm in"
},
{
    question: "sahopaofritaa of udaaharana is:",
    option:["rikseeor","seelegeneelaa","laaiofna","spaaidiseaseaairaa"],
    answer:"laaiofna"
},
{
    question: "haploid of the cell snyojana of process is",
    option:["cell chakra","ardadhasootree vibhaajana","sootree vibhaajana","sinagaimee"],
    answer:"sinagaimee"
},
{
    question: "among the following which insectbhakshee plant is",
    option:["drofromraa","nepentheesa","A and B both","Hydrilla"],
    answer:"A and B both"
},
{
    question: "thesein which-saa rasaayana aabaadee of organisms between snfour sthaapita karane in madada does?",
    option:["taayalina","enzyme","pheromona","none of these"],
    answer:"pheromona"
},
{
    question: "acquired characterson of vnshaagati of theory dior thaa",
    option:["hiofla","daarvina","dee vreeja","laamaarka"],
    answer:"laamaarka"
},
{
    question: "ovule of vrinta ko are called",
    option:["phyoonikala","ofrankala","nyoofromlasa","pedeesila"],
    answer:"phyoonikala"
},
{
    question: "soorya of roshanee from onaabainganee radiation of process in utpaadita is:",
    option:["CO","SO₂","O₃","phloraaida"],
    answer:"O₃"
},
{
    question: "if male aaofriof in female from bhinna ho, to ifrom are called:",
    option:["hetediseaseaimee","homogaimee","laingika dviroopataa","haramaaphrodaaitijma"],
    answer:"laingika dviroopataa"
},
{
    question: "insecton by pollination ko are called",
    option:["Ornithophily","Entomophily","Hydrophily","Chiropterophily"],
    answer:"Entomophily"
},
{
    question: "reda daataa buka in sammilita are:",
    option:["vilupta ho rahe paudhon of soochee","durlabha paudhon of soochee","aapattigrasta praaniyon of soochee","all of these"],
    answer:"all of these"
},
{
    question: "trisomy (2n + 1) due to being having sindroma koar is called?",
    option:["pheelaadelphior","daathose sindroma","elbinijma","none of these"],
    answer:"daathose sindroma"
},
{
    question: "vishva in kula kitane biodiversity haota-spaota are?",
    option:["5","15","9","34"],
    answer:"34"
},
{
    question: "stanadhaariyon in fertilization where occurs?",
    option:["eggaashaya","vaasiya bhaaga","uterus","phailopiyana nalee"],
    answer:"phailopiyana nalee"
},
{
    question: "offspringotpatti-control of koar upaaya are?",
    option:["hormonela methodorn","natural methodorn","orntrika methodorn","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "edinaailika amla which-saa is?",
    option:["edineena + raaiboja + phaospheta","diokseeraaiboja + phaospheta","edinoseena + sugar","edineena + sugar"],
    answer:"edineena + raaiboja + phaospheta"
},
{
    question: "pond paaritntra in number of pyramid occurs",
    option:["ooon of ora","aniyamita","ultaa","tarkuroopa"],
    answer:"ooon of ora"
},
{
    question: "kisee genetic code of 64 codon in kitane codons by 20 praofra of amino acid of synthesis occurs?",
    option:["61","64","20","59"],
    answer:"61"
},
{
    question: "one lnbe plants of svapollination karane on lnbe and baune both taraha of plants praapta are। first sntati for which-see snbhaaforestaa ho sakatee is?",
    option:["lnbaa","baunaa","baraabara of snbhaaforestaaen","asakshama detaa"],
    answer:"lnbaa"
},
{
    question: "insulina utpaadana and shareera in thisof krior, daayabiteeja of level for uttaradaayee is। this yaugika among the following kisa varga from relationshipita is?",
    option:["saha-enzyme","enteebaayotika","enzyme","hormone"],
    answer:"hormone"
},
{
    question: "aavrittaseedee in endosperm occurs",
    option:["haploid","diploid","triploid","tetraploid"],
    answer:"triploid"
},
{
    question: "among the following indala ne kifrom proposed naheen kior?",
    option:["prabhutaa","apoorna prabhutaa","visthaapana","svatntra apavyoohana"],
    answer:"apoorna prabhutaa"
},
{
    question: "'daolee' nameka bheda one klona thee। thisfor prayukta daihika cell whose thee?",
    option:["urate of","tvachaa of","jeebha of","karna ubhaara of"],
    answer:"urate of"
},
{
    question: "koee bhee praanee one apavaada ko chhodakara amara naheen is। that apavaada is:",
    option:["onekosheeya organism","harita plant","spora","saayanobaiktirior"],
    answer:"onekosheeya organism"
},
{
    question: "one nyooklika amla anu of aadhaarabhoota iofee ko are called:",
    option:["nyookliyosaaida","nucleotide","nitrogenous base","pentoja sugar"],
    answer:"nucleotide"
},
{
    question: "human female in egge of fertilization where occurs?",
    option:["eggaashaya in","uterus in","yonimaarga in","phailopiyana naliof in"],
    answer:"phailopiyana naliof in"
},
{
    question: "kisee Pure tall pea of plants ko Pure baune plants with kraosa karaaor gaor। F1 vnshaja of saare plants tall praapta hue। thisof ofrana is",
    option:["Dominance","F2 vnshaja in baunaapana of character of cowba honaa","factoron of segregation","saamnjasya/samanvaya"],
    answer:"Dominance"
},
{
    question: "fungus ko kisa enzyme from snsaadhita is done?",
    option:["ofitineja","laathisosaaima","fromluleja","gailekteja"],
    answer:"ofitineja"
},
{
    question: "kisee anaavrittaseedee in endosperm (endosperm) is:",
    option:["haploid","diploid","triploid","tetraploid"],
    answer:"haploid"
},
{
    question: "anuvaadana or sthaanaantarana in becomes is:",
    option:["RNA from protein","DNA from DNA","DNA on RNA","RNA from DNA"],
    answer:"RNA from protein"
},
{
    question: "antarajaateeya pratiyogitaa of chalate one hee species of organism one-doosare from doora are jaate are। this krior ko are called:",
    option:["prithaofkarana","samooheekarana","samaroopa vitarana","onetreekarana"],
    answer:"prithaofkarana"
},
{
    question: "brahmaandavaada of anusaara prithvee on organism anya grahon from kisa roopa in aaor?",
    option:["gamete","seedaanu","virus","seed"],
    answer:"seedaanu"
},
{
    question: "separation of theory ko and koar are called?",
    option:["prabhaavitaa of niyama","svatntra apavyoohana of niyama","gametes of shuddhataa of niyama","none of these"],
    answer:"gametes of shuddhataa of niyama"
},
{
    question: "shabda homothallic and Monoecious of experiment kisafor is done?",
    option:["dvilingee avasthaa for","onelingee avasthaa for","staamineta flower for","pisteeleta flower for"],
    answer:"dvilingee avasthaa for"
},
{
    question: "among the following which-saa kraosa pheenotaaipika roopa from samaana sntati utpanna does?",
    option:["Dd × Dd","Dd × dd","DD × Dd","WW × Ww"],
    answer:"WW × Ww"
},
{
    question: "indala of onela kraosa anupaata is",
    option:["1 : 2","3 : 1","9 : 3 : 3 : 1","9 : 7"],
    answer:"3 : 1"
},
{
    question: "among the following which-saa toxinmayugmajee is?",
    option:["Rrtt","TTrr","TtRr","TTRR"],
    answer:"TtRr"
},
{
    question: "whose anupasthiti in fertilization naheen can be?",
    option:["sodiyama","potaashiyama","kailsiyama","lauha"],
    answer:"kailsiyama"
},
{
    question: "pond of kinaare irda-girda chhichhale paanee of area ko are called:",
    option:["litorala whichna","limanetika whichna","prophndala whichna","benathika whichna"],
    answer:"litorala whichna"
},
{
    question: "second producer is:",
    option:["shaaofhaaree","producer","maansaahaaree","none of these"],
    answer:"none of these"
},
{
    question: "prakanda of one udaaharana is:",
    option:["lahasuna","neenboo","arateka","poarja"],
    answer:"arateka"
},
{
    question: "first transgenic crop is:",
    option:["rooee","matara","tambaakoo","phlaiksa"],
    answer:"tambaakoo"
},
{
    question: "among the following whose species number sarvaadhika is?",
    option:["bird","aavritaseedee","fungus","insect"],
    answer:"insect"
},
{
    question: "two shuddha Individuals from utpanna huee sntati which one fromta characters in bhinna is, kahalaatee is",
    option:["monohaaibrida","utoanivaruap to","paoleeplaaida","vibhinnaka"],
    answer:"monohaaibrida"
},
{
    question: "among the following koee one male in is found",
    option:["uterus","bhaga","lebior mewhichraa","kaoon grnthi"],
    answer:"kaoon grnthi"
},
{
    question: "on-pollination sva-pollination from achchhaa occurs whyki thisin",
    option:["behatara naveena vyashtiorn utpanna isn","naee speciesorn banatee are","this anishekareproduction prerita does","this aarthika drishti from laabhadaayaka is"],
    answer:"behatara naveena vyashtiorn utpanna isn"
},
{
    question: "veerya ko in which himeekrita is done?",
    option:["water in","normal rephrijaretara in","tarala naaitrojana in","koee naheen"],
    answer:"tarala naaitrojana in"
},
{
    question: "female in nishechita egge of pratisthaapana uterus in when occurs?",
    option:["fertilization of two maheene of baada","fertilization of one maheene of baada hee","fertilization of three saptaaha baada","fertilization of seven dina baada"],
    answer:"fertilization of seven dina baada"
},
{
    question: "bee paalana for bee of kisa variety ko highest paalatoo made jaataa is?",
    option:["episa indiof","episa melipheraa","episa daorfaromtaa","episa phlorior"],
    answer:"episa melipheraa"
},
{
    question: "kora, baphara and menipuleshana area in which paae jaate are?",
    option:["raashtareeya park","jaiva surakshita area","sharanasthalee","baagha conservation"],
    answer:"jaiva surakshita area"
},
{
    question: "female in mukheeya contraceptive kifrom rokatee is?",
    option:["andotsarga","fertilization","ropana","yoni in sperm of pravesha"],
    answer:"andotsarga"
},
{
    question: "indala by adhyayana kie gae matara of kula characters of number is",
    option:["5","7","6","4"],
    answer:"7"
},
{
    question: "traansaphara RNA in paae jaane having three kshaarakon of krama which sndeshavaahaka RNA kodona from bndhataa is, is called:",
    option:["trika","naona-fromnsa kodona","enteekodona","samaapana kodona"],
    answer:"enteekodona"
},
{
    question: "Stamen of fertile bhaaga is",
    option:["anther","pollenfilament","snyojeefilament","Ovule"],
    answer:"anther"
},
{
    question: "dahee and paneera (yogarta and cheeja) utpaada are",
    option:["kinfaorest of","paashcharaaijeshana of","nirwaatereekarana of","none of these"],
    answer:"kinfaorest of"
},
{
    question: "among these which samaapana codeka (tarminetinga kodona) is।",
    option:["UAA","UCC","AUG","GUG"],
    answer:"UAA"
},
{
    question: "pollination in Lever mechanism in which is found",
    option:["Antirrhinum","phaaikasa","wheat","saalvior"],
    answer:"saalvior"
},
{
    question: "praaniyon in yauforestaavasthaa of baada aataa is:",
    option:["ofyika avasthaa","reproduction avasthaa","praudhaaavasthaa","vriddhaavasthaa"],
    answer:"reproduction avasthaa"
},
{
    question: "DNA phingara printinga among the following what is?",
    option:["DNA taaipinga","DNA prophaailinga","both (A) and (B)","none of these"],
    answer:"both (A) and (B)"
},
{
    question: "laaiofna soochaka is:",
    option:["CO₂ pollution of","SO₂ pollution of","CO pollution of","water pollution of"],
    answer:"SO₂ pollution of"
},
{
    question: "thesein which sabafrom joardaa energy praapta does?",
    option:["producer","primary consumer","secondary consumer","apaghatanakartaa"],
    answer:"producer"
},
{
    question: "ecosystem in control karane having ofraka occurs:",
    option:["soil namee","bhojana","shiofra karanaa","taapa"],
    answer:"shiofra karanaa"
},
{
    question: "number of aadhaara on one phalahaving vriksha of pyramid kaisaa occurs?",
    option:["seedhaa","tirachhaa","ultaa","none of these"],
    answer:"ultaa"
},
{
    question: "vaahitamala of secondary treatment in mainth whose jaroorata is?",
    option:["yeesta","virus","fungus","bacterium"],
    answer:"bacterium"
},
{
    question: "nyookliyosoma in upasthita occurs:",
    option:["histona anu","nucleotide","nyookliyoplaajamina","nyookliyara phora kaompaleksa"],
    answer:"histona anu"
},
{
    question: "lensa and retinaa kalionooof of kisafrom becomes is?",
    option:["ectoderm from","endoderm from","ectoderm and endoderm both from","Mesoderm from"],
    answer:"ectoderm from"
},
{
    question: "haaibrida and Parent between of kraosa is called",
    option:["monohaaibrida kraosa","Back cross","Test cross","Reciprocal cross"],
    answer:"Back cross"
},
{
    question: "aljaaimara disease human in among the following whose lessee from relationshipita is?",
    option:["dopaamaathese","glootemika amla","eseetaailakolina","gaamaa emeeno byootarika amla"],
    answer:"eseetaailakolina"
},
{
    question: "if jaivamndala from CO₂ ko hataa lior jaae to which-from organism on sarvafirst buraa prabhaava padaegaa?",
    option:["primary producer","primary consumer","secondary consumer","tertiary consumer"],
    answer:"primary producer"
},
{
    question: "21ven chromosome of trisomy from which-see genetic beemaaree is?",
    option:["klaathesepheltara sindroma","tarmaale sindroma","daatra cell abloodtaa","daathose sindroma"],
    answer:"daathose sindroma"
},
{
    question: "pratyeka maasika chakra (Menstrual cycle) during andotsarjana occurs",
    option:["two andaanu of","one andaanu of","two from more andaanuon of","andaanuon of emission naheen occurs"],
    answer:"one andaanu of"
},
{
    question: "vishva of sabafrom achchhee dudhaaroo cow of nasla is।",
    option:["chittaagonga","deforestee","holsateena-phreesiyana","sindhee"],
    answer:"holsateena-phreesiyana"
},
{
    question: "human of nimnalikhita chromosome in gene of number sarvaadhika is:",
    option:["chromosome 1","chromosome X","chromosome Y","chromosome 22"],
    answer:"chromosome 1"
},
{
    question: "ecosystem of aahaara shrrinkhalaa in energy of pravaaha occurs",
    option:["onedisheeya","dvidisheeya","bahudisheeya","thesein koee naheen"],
    answer:"onedisheeya"
},
{
    question: "khuraanaa ko nobael purasoafra why milaa thaa?",
    option:["DNA of khoja","RNA of khoja","gene of chemical synthesis hetu","DNA paoleemareja of khoja"],
    answer:"gene of chemical synthesis hetu"
},
{
    question: "paachanatntra, yakrita and shvaasanalee kisafrom becomes is?",
    option:["aaroafteraona","blaastoseela","endoderm from","ectoderm from"],
    answer:"endoderm from"
},
{
    question: "of whom embryo in parasitic of taraha poshana occurs?",
    option:["bird in","amphibians in","sarisripa in","mammals in"],
    answer:"mammals in"
},
{
    question: "kuchha flowers of pollenkosha and stylena between natural rodha are jinadue to pollination mushkila from occurs or hotaa hee naheen, thosehen koar are called",
    option:["svaynbndhyataa","heterostaailee","harakogaimee","geigaimee"],
    answer:"harakogaimee"
},
{
    question: "entarama whose guhaa is?",
    option:["andaashaya","grephiyana putiof","blaastulaa","gaistarulaa"],
    answer:"grephiyana putiof"
},
{
    question: "kisee tropical pradesha in biodiversity in giraavata of main ofrana is:",
    option:["shahareekarana","pollution","forestonmoolana","soil-ksharana"],
    answer:"forestonmoolana"
},
{
    question: "Hydrilla in rndhra where paae jaate are",
    option:["pattiyon on","tane on bhee","both (A) and (B)","none of these"],
    answer:"none of these"
},
{
    question: "one matara plants in 400 seed formation in kitane ardadhasootree vibhaajana aavashyaka are",
    option:["400","500","600","800"],
    answer:"500"
},
{
    question: "if pollination one hee plants of two flowers between ho to ifrom are called",
    option:["jinogemee","jeetonogemee","podiseaseemee","thesetomophilee"],
    answer:"jeetonogemee"
},
{
    question: "ristarikshana of enzyme use kisako oftane for is done?",
    option:["onela-rajjuof RNA","dvirajjuof DNA","onela-rajjuof DNA","dvirajjuof RNA"],
    answer:"dvirajjuof DNA"
},
{
    question: "vaijnyaanika esa. ela. milara ne ofrbanika anuon of gathana for apane experiment in watervaashpa, mithena and amonior with nimnalikhita gaisa of use kior",
    option:["okseejana","haaidrojana","naaitrojana","koee naheen"],
    answer:"haaidrojana"
},
{
    question: "among these which pahalaa artificial roopa from banaa jaivika padaartha is?",
    option:["thesesulina","ofrmeenee","thaayaraoksina","none of these"],
    answer:"thesesulina"
},
{
    question: "among the following which aahaara shrrinkhalaa correct is?",
    option:["ghaasa, wheat and mango","ghaasa, bakaree and lion","bakaree, cow and ghaasa","ghaasa, fish and bakaree"],
    answer:"ghaasa, bakaree and lion"
},
{
    question: "biodiversity of tapta sthala which-saa is?",
    option:["araavalee","poorvee ghaata","pashchimee ghaata","Indian gngaa of maidaana"],
    answer:"pashchimee ghaata"
},
{
    question: "kuchha neele-hare algae jaiva fertilizer as prayukta are whyki ye kara sakate are:",
    option:["naaitrojana sthireekarana","myooseeleja secretionna","light synthesis","pratyeka sthaana on growth"],
    answer:"naaitrojana sthireekarana"
},
{
    question: "among the following which-see one gaisa greenhouse gas naheen is?",
    option:["CO₂","CH₄","N₂","CFCs"],
    answer:"N₂"
},
{
    question: "limphosaaita of ooon koar rahataa is?",
    option:["IgG","IgM","IgD","IgE"],
    answer:"IgD"
},
{
    question: "human of primary sperm cellon (praaimaree soanmosaaitsa) in otosoma of number is",
    option:["44","46","23","40"],
    answer:"44"
},
{
    question: "saaitoseena and guaanoseena between haaidrojana bnwealth of number is:",
    option:["2","3","4","1"],
    answer:"3"
},
{
    question: "without fertilization of phala banaane of process ko are called",
    option:["pauliofrpika","paarthenoofrpika","pomoofrpika","none of these"],
    answer:"paarthenoofrpika"
},
{
    question: "rodha code of number kitanee is:",
    option:["one","two","three","four"],
    answer:"three"
},
{
    question: "mehasaanaa whose species is?",
    option:["cow of","buffalo of","bheda of","bakaree of"],
    answer:"buffalo of"
},
{
    question: "AIDS of ofraka HIV vaayarasa sarvafirst kisa cell ko destroys?",
    option:["heloan T-limphosaaita ko","B-limphosaaita ko","lyookosaaitsa","thrombosaaita"],
    answer:"heloan T-limphosaaita ko"
},
{
    question: "PCR of use do।",
    option:["kisee khaasa DNA of pravarwaealth for","protein of pravarwaealth for","protein of number ghataane for","A and B both"],
    answer:"kisee khaasa DNA of pravarwaealth for"
},
{
    question: "onerosoma of formation kisafrom occurs?",
    option:["centriole","gaoljeeofya","maaitokondarior","nucleus"],
    answer:"gaoljeeofya"
},
{
    question: "kisee pollen grain in (jaifrom Cyperus) Ploidy of number is",
    option:["5n","3n","n","2n"],
    answer:"n"
},
{
    question: "insectbhakshee plants insecton ko khaate are:",
    option:["maansa for","okseejana for","khaniwhichn for","naaitrojana for"],
    answer:"naaitrojana for"
},
{
    question: "kisee gaardena matara in Recessive trait is",
    option:["lnbaa tanaa","rngeena flower","jhurreedaara seed","floweraa huaa Pod"],
    answer:"jhurreedaara seed"
},
{
    question: "heemopheelior disease is",
    option:["alinga kromosoma-sahalagna aprabhaavee symptom","X-kromosoma-sahalagna aprabhaavee symptom","alinga kromosoma-sahalagna prabhaavee symptom","X-kromosoma-sahalagna prabhaavee symptom"],
    answer:"X-kromosoma-sahalagna aprabhaavee symptom"
},
{
    question: "atyadhika alkohala lene from shareera of which-saa organ highest prabhaavita occurs?",
    option:["phephadaaa","yakrita","mangoaashaya","sleena"],
    answer:"yakrita"
},
{
    question: "eleephaintiorsisa of ofraka is:",
    option:["esoafrisa","teenior","vuchererior","entaameebaa"],
    answer:"vuchererior"
},
{
    question: "among these which-see beemaaree pratyoorjaka by utpanna is?",
    option:["tvachaa cancer","he jvara","interika jvara","galagnda"],
    answer:"he jvara"
},
{
    question: "among the following which-saa yauna snkramita disease is?",
    option:["taayaphaaida","titanasa","leprosee","hipetaaitisa-B"],
    answer:"hipetaaitisa-B"
},
{
    question: "among the following which-saa nucleotide is?",
    option:["edinaailika and guaanaailika amla","saaitidilika and yuridaayalika amla","yuridaayalika and thaayamidaayalika amla","sabhee"],
    answer:"sabhee"
},
{
    question: "one plant speesheeja in thatof sahaayaka-cells in 8 chromosome are। thatof ailyoorona onta of cells in chromosomes of number koar hogee",
    option:["16","24","32","8"],
    answer:"24"
},
{
    question: "among these in which artificial veeryafromchana by conception naheen karaaor jaa sakataa is?",
    option:["ghodae in","oonton in","machhaliyon in","bakaree in"],
    answer:"machhaliyon in"
},
{
    question: "kisee organism of kisee dvi-aprabhaavee from sngama karaaof toxinmayugmee or samayugmee abhisymptom of nirdhaarana karanaa is called",
    option:["vyutkarama hybridization","oneekshaartha hybridization","dvisnkara","prateepa hybridization"],
    answer:"oneekshaartha hybridization"
},
{
    question: "female flower of among the following which-saa bhaaga is",
    option:["jaaornga","pumnga","punofsara","pollen grain"],
    answer:"jaaornga"
},
{
    question: "population control for hormonela contraceptive pill prayukta is:",
    option:["maalaa-D","maalaa-N","sahelee","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "vikhndana (cleavage) samasootree vibhaajana from alaga occurs kisa maayane in?",
    option:["this shareera of sabhee cells in occurs","this zygote in occurs","thisfrom identical putree cell becomes is","this only aofsharooof in occurs"],
    answer:"this zygote in occurs"
},
{
    question: "human (male) in of chromosome number is",
    option:["44 + XX","44 + XY","46 + XY","46 + XX"],
    answer:"44 + XY"
},
{
    question: "traansajenika animalon as sarvaadhika number in found jaane having organism is।",
    option:["choohe","cow","sooara","fish"],
    answer:"choohe"
},
{
    question: "Australiaee infantpaddyee, tasmaanioree bhedaior and one aonaa stanee bhedaior rateshaate are",
    option:["samaanaantara development","apasaaree development","convergent evolution","kramika development"],
    answer:"convergent evolution"
},
{
    question: "shaakha (scion) ko vrinta (stock) on lacowaa jaataa is। this praofra graft kiye vriksha of phala kisa on nirbhara karenge?",
    option:["shaakha (scion)","vrinta (stock)","(A), (B) both","none of the above"],
    answer:"shaakha (scion)"
},
{
    question: "aigaaroja kisafrom is obtained?",
    option:["samudree ghaasa","maize","saaikasa","Hydrilla"],
    answer:"samudree ghaasa"
},
{
    question: "aaloo and tamaatara of ofyika hybridization from formation having plants of koar name is?",
    option:["tamaaloo","pomaito","tomaapoteto","prometo"],
    answer:"pomaito"
},
{
    question: "yauna snfourita disease among the following from which is?",
    option:["AIDS","syphilis","gonorior","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "polimareja shrrinkhalaa abhikrior technique of use is done:",
    option:["DNA of pahachaana for","DNA of Repair for","DNA amplification for","DNA of khndana for"],
    answer:"DNA amplification for"
},
{
    question: "pratilekhana is:",
    option:["of DNA bananaa","sndeshavaahaka of RNA bananaa","protein of bananaa","amino acid of bananaa"],
    answer:"sndeshavaahaka of RNA bananaa"
},
{
    question: "one plaajamida",
    option:["khuda from apane jaisaa banaa sakataa is","laaipeja from relationshipita is","kromosoma from relationshipita is","none of these"],
    answer:"khuda from apane jaisaa banaa sakataa is"
},
{
    question: "‘pheda-baicha’ kinfaorest in sugar of nirantara is used:",
    option:["pratijaivika praapta karane for","enjaaima ko shuddha karane for","malavaaha of vighatana for","mithena utpanna karane for"],
    answer:"enjaaima ko shuddha karane for"
},
{
    question: "biotechnology of uddeshyon of poorti in whose yogadaana is?",
    option:["pumaleyogaja DNA technique","genetics abhiorntriof","sookshamaorganismscience","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "cancer of treatment for among the following which-saa prachalita naheen is?",
    option:["ofmotheraipee","rediyotheraipee","sarjaree","phijiyotheraipee"],
    answer:"phijiyotheraipee"
},
{
    question: "laika operaona in kitane snrachanaatmaka gene paae jaate are?",
    option:["three","five","one","none of these"],
    answer:"three"
},
{
    question: "thesein which PCR from judaaa is?",
    option:["nishkariyakarana","taapaanusheelana","vistaara","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "which-saa oneekshana by paidaa being from pahale child in genetics va ofryiof twosha of adhyayana kior jaa sakataa is?",
    option:["emneeofromntasisa","irithroblaastosisa","enjiyograama","klotinga oneekshana"],
    answer:"emneeofromntasisa"
},
{
    question: "bee in shramika makkhiorn isn।",
    option:["reproductionyukta male","baandhya male","reproductionyukta female","baandhya female"],
    answer:"baandhya female"
},
{
    question: "sarvafirst kleenikala gene therapy of use kisafor kior gaor thaa?",
    option:["edinosina deeemineja of lessee","chiofna paoksa","daayabiteeja melitasa","roometaoyada artharaaitisa"],
    answer:"edinosina deeemineja of lessee"
},
{
    question: "ecosystem of mahattava in which nihita is?",
    option:["energy of pravaaha in","padaarthon of anuchakrana in","uonokta both in","none of the above"],
    answer:"uonokta both in"
},
{
    question: "haaibrida of geneotaaipa of normal testa which-saa is?",
    option:["F1 sntati of laingika vyathataara","F1 sntati of aprabhaavee janaka from kraosa","one F2 janaka of malegamete from kraosa","one F2 janaka of female gamete from kraosa"],
    answer:"F1 sntati of aprabhaavee janaka from kraosa"
},
{
    question: "DNA of daforce heliksa maodala in pratyeka samaakshaara doosare from kitanee dooree on occurs?",
    option:["34 nm","3.4 nm","2 nm","0.34 nm"],
    answer:"0.34 nm"
},
{
    question: "naaitrojana-sthireekarana of yogya bacterium is:",
    option:["ewhichtobaiktara","klostaridiyama","esitobaiktara esiti","raaiwhichbiyama"],
    answer:"klostaridiyama"
},
{
    question: "more lavana saandarataa having kshaareeya soil in ugane having plants are:",
    option:["marudbhidee","lavanodbhidee","shailodbhidee","waterodbhidee"],
    answer:"lavanodbhidee"
},
{
    question: "andotsarga va kaorpasa lyootiyama of development for uttaradaayee hormone is",
    option:["FSH","LH","LTH","ICSH"],
    answer:"LH"
},
{
    question: "among the following antararaapita gene vyavasthaa upasthita naheen is:",
    option:["bacterium","plants","animal","none of the above"],
    answer:"bacterium"
},
{
    question: "gene abhiyntrita human insulina kisafrom becomes is?",
    option:["bacterium","phaphoonda","plant","yeesta"],
    answer:"bacterium"
},
{
    question: "traansajenika plants utpanna karane for tyoomara prerita plaajmida praapta kiye jaate are:",
    option:["esharikiaa kolaaee by","baisilasa thoorienjiensisa by","stephaailokokasa oriyasa by","egrobaikteeriyama tyoomeepheshiensa by"],
    answer:"egrobaikteeriyama tyoomeepheshiensa by"
},
{
    question: "India in onivaara niyojana ofryakrama when aarnbha huaa?",
    option:["1951 in","1960 in","1970 in","1980 in"],
    answer:"1951 in"
},
{
    question: "when kisee mutation from pyoorina of sthaana on pirimideena pratisthaapita ho jaae to ifrom are called",
    option:["traanjishana","traansavarsana","traansaloofshana","thesevarsana"],
    answer:"traansavarsana"
},
{
    question: "mithena of major srota is:",
    option:["eekha ropana","paddy kheta","phala of baagavaanee","wheat kheta"],
    answer:"paddy kheta"
},
{
    question: "aabaadee of prasarana kina on nirbhara does?",
    option:["aagamana on","bahirgamana on","sthaanaantarana on","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "jnka DNA kisako is called?",
    option:["kodinga krama","naonakodinga krama","promotara gene","histona protein"],
    answer:"naonakodinga krama"
},
{
    question: "klaatheseepheltarsa sindroma in linga chromosome snfactor are",
    option:["22A + XXY","22A + XO","22A + XY","22A + XX"],
    answer:"22A + XXY"
},
{
    question: "egg prajanaka is",
    option:["hen","snake","magaramachchha","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "AA Bb cc from kitane praofra of gametes (gametes) of formation hogaa?",
    option:["two","four","six","nine"],
    answer:"two"
},
{
    question: "nyooklika amla in which-saa padaartha maujooda naheen occurs?",
    option:["saaitoseena","edineena","thaaimeena","guaaneedina"],
    answer:"guaaneedina"
},
{
    question: "lake in second poshana-level occurs:",
    option:["plantplavaka","praaniplavaka","plantplavaka and praaniplavaka both","none of these"],
    answer:"praaniplavaka"
},
{
    question: "Sertoli cell paayee jaatee is",
    option:["eggaashaya in and projestarona of secretionna occurs","edreenala kaorteksa in and edreneleena of hormone secretionna occurs","spermnaliof in and germ cells ko poshana detaa is","agnaorshaya in and kolesistooftheseina of secretionna occurs"],
    answer:"spermnaliof in and germ cells ko poshana detaa is"
},
{
    question: "human in shukranaliof (vas deferens) kisafrom nikalataa is?",
    option:["cauda epididymis","caput epididymis","corpora cavernosa","glomus majoritetet"],
    answer:"cauda epididymis"
},
{
    question: "kisee genetic disease ko kisa chikitsaa paddhati from durusta kior jaa sakataa is?",
    option:["elopaithee","surgical paddhati","gene therapy","anya method"],
    answer:"gene therapy"
},
{
    question: "genetics abhiorntriof ko koar is called?",
    option:["pumaleyogaja DNA technique","tissue culture","kloninga snvaahaka","anupravaaha snsaawealth"],
    answer:"pumaleyogaja DNA technique"
},
{
    question: "gaharee nidraa ko prerita karane having aushadhi is:",
    option:["steemulenta","islusinojena","fromdetiva","opieta naarkotika"],
    answer:"fromdetiva"
},
{
    question: "jeta plena niofsa in main pradooshaka are:",
    option:["phluroofrbana","SO₂","mithena","bengaene"],
    answer:"phluroofrbana"
},
{
    question: "one flowering plant in male reproduction organ iofee ko are called",
    option:["punofsara","stareeofsara","pollenkosha","pollen grain"],
    answer:"punofsara"
},
{
    question: "mutation normalth karaaor jaataa is:",
    option:["altaraa-vaayoleta kirana","gaamaa kirana","alphaa kirana","beetaa kirana"],
    answer:"gaamaa kirana"
},
{
    question: "soil of poshana charactervattaa which badhaaataa is?",
    option:["chemical khaada","gobara khaada","biofertilizer","both (B) and (C)"],
    answer:"both (B) and (C)"
},
{
    question: "sookshama reproduction in karaaor jaataa is:",
    option:["alaingika reproduction","samaana genetic characters having paudhon of utpaadana","laingika reproduction","both (A) and (B)"],
    answer:"both (A) and (B)"
},
{
    question: "netra lensa becomes is",
    option:["onetodarma from","misodarma from","endodarma from","onetodarma and misodarma from"],
    answer:"onetodarma from"
},
{
    question: "steraoyadsa formation in prayukta phaphoondee which-saa is?",
    option:["esoanjilasa oraayajaa","toroolopsisa yutilisa","raaiwhichpasa stoloniphara","nyoorosporaa kraisaa"],
    answer:"raaiwhichpasa stoloniphara"
},
{
    question: "kisee ecosystem in jaivika avayava is",
    option:["producer","consumer","vighatanakartaa","uonokta sabhee"],
    answer:"uonokta sabhee"
},
{
    question: "which-saa kshaara RNA in upasthita rahataa is, on DNA in naheen?",
    option:["yooraasila","guaaneena","saaitoseena","thaaimeena"],
    answer:"yooraasila"
},
{
    question: "in which aantarika fertilization occurs?",
    option:["fish","amphibians","algae","aavrittaseedee"],
    answer:"aavrittaseedee"
},
{
    question: "traansakripshana for enzyme jarooree is:",
    option:["DNA paolimareja","RNA paolimareja","indonyookfaorja","among these sabhee"],
    answer:"RNA paolimareja"
},
{
    question: "human in sabafrom joardaa being having cancer is?",
    option:["milenomaa","limphomaa","saarkomaa","ofrsinomaa"],
    answer:"ofrsinomaa"
},
{
    question: "DNA phingaraprintinga of koar ofrya is?",
    option:["offspring of correct mother-father of pahachaana karanaa","phaorensika science by laboratory in aonaadhiyon of pahachaana karanaa","sndigdha mother-father of jaanaofree praapta karanaa","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "among the following which-see svachchhawatereeya bhojana yogya fish is?",
    option:["haarpodaona","sirinaa mrigaalaa","enguilaa","hilsaa"],
    answer:"sirinaa mrigaalaa"
},
{
    question: "haaipenthediyama flowerkrama is found",
    option:["peepal","tulasee","saagauna","madaara"],
    answer:"peepal"
},
{
    question: "retrovaayarasa normal jnta cells ko kina cells in roopaantarita kara detaa is?",
    option:["leevara cell","mrita cell","cancer cell","none of these"],
    answer:"cancer cell"
},
{
    question: "asatat avariation (Discontinuous variation) of major ofrana is",
    option:["kraosinga ovara","mutation","kromosoma of segregation","Independent assortment"],
    answer:"mutation"
},
{
    question: "among these which protozoa-janita disease is?",
    option:["isjaa","kshayadisease","malaria","AIDS"],
    answer:"malaria"
},
{
    question: "podiseaseaimee in pollennaliof kisafrom hokara endosperm up to pahunchatee is",
    option:["chailaajaa","integuinta","maaikropaaila","sabhee ko bhedatee huee"],
    answer:"maaikropaaila"
},
{
    question: "aavrittaseediyon in sabafrom normal praofra ovule is",
    option:["empheetropaasa","etropaasa","enaatropasa","sarsinotropasa"],
    answer:"enaatropasa"
},
{
    question: "one praforce mutagen is",
    option:["thnda","garmee","paanee","X-kiranen"],
    answer:"X-kiranen"
},
{
    question: "murraaha, soortee and mehasaanaa whose speciesorn are?",
    option:["cow of","buffalo of","bakaree of","bheda of"],
    answer:"buffalo of"
},
{
    question: "if koee flower chamaofle rnga of ho and Nectar secretionita karataa ho to this snbhavath",
    option:["air by pollenita occurs","insect by pollenita occurs","one insectbhakshee plant occurs","napunsaka flower hogaa"],
    answer:"insect by pollenita occurs"
},
{
    question: "moretara pravishishta (species) kisa area from vilopita huee is?",
    option:["Islands","Mainland","samudra","svachchha watereeya niofya"],
    answer:"Islands"
},
{
    question: "kisadue to RNA bhinna occurs DNA from?",
    option:["sugar and pyoorina","sugar and paayarimidina","pyoorina and phaospheta","sugar and phaospheta"],
    answer:"sugar and paayarimidina"
},
{
    question: "Indiain the year haota spaotsa paae jaate are:",
    option:["only poorvee himaalaya in","only pashchimee ghaata in","poorvee himaalaya and pashchimee ghaata in","raajasthaana of registaana in"],
    answer:"poorvee himaalaya and pashchimee ghaata in"
},
{
    question: "badhae hue tvachaa cancer and uchcha mutation rate of ofrana is:",
    option:["amla rainfall","owhichna ksharana","CO₂ pollution","CO pollution"],
    answer:"owhichna ksharana"
},
{
    question: "svath reproduction of theory, jisain origin of life kshayamaana padaarthon from maanee gaee thee, ko bacteriumon of snratebha in kisane khaarija kior?",
    option:["phraansisko redee","fourlsa daarvina","luee paashchara","none of the above"],
    answer:"luee paashchara"
},
{
    question: "kisee prokairiyotsa in DNA and of RNA anupaata 1:2 is। yookairiyotsa in this anupaata koar occurs?",
    option:["1:1","2:1","1:2","sthira naheen"],
    answer:"1:1"
},
{
    question: "chaaya of pattiyon on bacteriumon of krior from special sugndha ko utpanna kior jaanaa is called:",
    option:["taininga","kyooringa","kinfaorest","raaipeninga"],
    answer:"kyooringa"
},
{
    question: "egge of cytoplasm in koar naheen occurs?",
    option:["raaibosoma","maaitokondarior","gaoljeeofya","fromntrosoma"],
    answer:"fromntrosoma"
},
{
    question: "oofjaaof khnda of formation kisa dauraana occurs?",
    option:["traansakripshana","traansaleshana","ripliofshana","traansadakshana"],
    answer:"ripliofshana"
},
{
    question: "insulina of aanvika rachanaa of khoja kisane of thee?",
    option:["korenabarga","sveemaanaathana","rijaardasana","saingara"],
    answer:"saingara"
},
{
    question: "among the following which-saa homologous organs is?",
    option:["bogenavilior of ofntaa and pattee","insect and bird of pnkha","daolphina of phlionsa and shaarka of pektorala phinsa","bee and bichchhoo of dnka"],
    answer:"bogenavilior of ofntaa and pattee"
},
{
    question: "BamHI pratibnwealth enzyme kisafrom is obtained?",
    option:["heemophilasa thesephlooenjee","E. coli","baisilasa emaalolikviphesiensa","none of these"],
    answer:"baisilasa emaalolikviphesiensa"
},
{
    question: "among the following which-see hormone rileejinga IUCD is?",
    option:["lipsa loop","malteeloda 375","CuT","LNG-20"],
    answer:"LNG-20"
},
{
    question: "one onivaara jisain five betiorn are, ko chhathee offspring being having is। betaa being of snbhaaforestaa kitanee is?",
    option:["0%","25%","50%","100%"],
    answer:"50%"
},
{
    question: "indala ne kitane traits of adhyayana kior?",
    option:["five","four","seven","three"],
    answer:"seven"
},
{
    question: "nimnalikhita RNA paoleemareja sunucleusee in doota of RNA anulekhana does:",
    option:["paoleemareja-I","paoleemareja-II","paoleemareja-III","none of the above"],
    answer:"paoleemareja-II"
},
{
    question: "taika DNA paolimareja enzyme is obtained:",
    option:["tharmasa onevetikasa from","E. coli from","egrobaikteeriyama tyoomeephesiensa from","thesein kisee from naheen"],
    answer:"tharmasa onevetikasa from"
},
{
    question: "food chain during maximum energy snchita is।",
    option:["producer in","decomposer in","shaaofhaaree in","maansaahaaree in"],
    answer:"producer in"
},
{
    question: "PCR method aavashyaka is:",
    option:["DNA synthesis in","protein synthesis in","emino amla of synthesis in","DNA culture in"],
    answer:"DNA culture in"
},
{
    question: "energy of pyramid sarvadaa occurs:",
    option:["ulataa","seedhaa","ulataa and seedhaa both","forest-paaritntra in ulataa"],
    answer:"seedhaa"
},
{
    question: "India in projekta taaigara praarnbha kior gaor",
    option:["1973","1981","1985","1986"],
    answer:"1973"
},
{
    question: "svasthaane conservation of udaaharana is:",
    option:["vaanaspatika udoarna","animal udoarna","organism saphaaree","among these sabhee"],
    answer:"organism saphaaree"
},
{
    question: "maximum growth rate is found thisin:",
    option:["fromnefromnta pheja","laiga pheja","onesaponenshiyala pheja","steshamaleee pheja"],
    answer:"onesaponenshiyala pheja"
},
{
    question: "vriksharahita organismoma ko are called",
    option:["tundraa","desert","ghaasa of maidaana","all of the above"],
    answer:"all of the above"
},
{
    question: "‘reda daataa buka’ soochee banaane for uttaradaayee sngathana is।",
    option:["IUCN","CITES","WWF","IBWL"],
    answer:"IUCN"
},
{
    question: "Dihybrid Test cross of anupaata which-saa is?",
    option:["1 : 1 : 1 : 1","1 : 1","9 : 3 : 3 : 1","15 : 1"],
    answer:"1 : 1 : 1 : 1"
},
{
    question: "fungusmoola one udaaharana occurs:",
    option:["simbaayotika bandhutva","baahya parasitic","anth parasitic","decomposer"],
    answer:"simbaayotika bandhutva"
},
{
    question: "egge of gaistulaa avasthaa in endoderm cell ko if hataa dior jaaya to naye organism in koar naheen banegaa?",
    option:["aankha","hridaya","aankha and mastishka","aantarika organ"],
    answer:"aantarika organ"
},
{
    question: "totaa of highest umra what is?",
    option:["90 year","25 year","500 year","140 year"],
    answer:"140 year"
},
{
    question: "among these which bacteria-janita disease is?",
    option:["siphalisa","harpisa","paipilomaa","all of these"],
    answer:"siphalisa"
},
{
    question: "pyooreena of jagaha pirimideena athavaa pirimideena of jagaha pyooreena of pratisthaapana ko are called",
    option:["traanjishana","traansavarsana","traansaloofshana","traansaphaorameshana"],
    answer:"traansavarsana"
},
{
    question: "contraceptive pill in nihita projestaraona from koar taatoanya is?",
    option:["ovulation ko rokanaa","fertilization ko rokanaa","yugmaja of Implantation ko rokanaa","Cleavage ko rokanaa"],
    answer:"ovulation ko rokanaa"
},
{
    question: "developmentsheela pollen grain ko poshana kisafrom milataa is",
    option:["tepeetama","Endothecium","madhya level","SMC"],
    answer:"tepeetama"
},
{
    question: "pratibnwealth endonyookliyeja DNA of one vishishta sequence ko pahachaanate are:",
    option:["pailinadromika nucleotide anuon","B.N.T.R.","minee fromtelaaita","among these sabhee"],
    answer:"pailinadromika nucleotide anuon"
},
{
    question: "PCR of use occurs:",
    option:["DNA of kisee khaasa bhaaga of pravarwaealth for","enzyme of pravarwaealth for","protein of pravarwaealth for","among these sabhee"],
    answer:"DNA of kisee khaasa bhaaga of pravarwaealth for"
},
{
    question: "baayogaisa in are:",
    option:["CO₂","H₂S","CH₄","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "grassland of number of pyramid occurs।",
    option:["aonaaita","thesevarteda","both (A) and (B)","none of these"],
    answer:"aonaaita"
},
{
    question: "ecosystem of relationship by whom rateshaaor jaa sakataa is?",
    option:["number of pyramid","organismbhaara of pyramid","energy of pyramid","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "among the following which animal ubhayalingee naheen is?",
    option:["pheetaakrimi","earthworm","ghareloo makkhee","whichnka"],
    answer:"ghareloo makkhee"
},
{
    question: "somaaklonee diversityen:",
    option:["mutation ofrakon by utpanna isn","gaamaa kiranon by utpanna isn","tissue culture in formed isn","sexual reproduction at the time of utpanna isn"],
    answer:"tissue culture in formed isn"
},
{
    question: "leveleekarana (Stratification) is found",
    option:["desert in","ushna katibndheeya forest in","onnapaatee forest in","tundaraa in"],
    answer:"ushna katibndheeya forest in"
},
{
    question: "5 joona ko manaaor jaataa is:",
    option:["vishva environment divasa","vishva forest divasa","vishva redakraosa divasa","vishva baala divasa"],
    answer:"vishva environment divasa"
},
{
    question: "two sookshamaorganism which genetic abhiorntriof in atyadhika mahatvapoorna are:",
    option:["ishcherichior kolaaee and egrobaikteeriyama tyoomeephesiensa","vibriyo koleree and puchchheeya bacteriumbhojee","diplokokasa species and syoodomonaasa species","kraathose gaola bacterium and seenorendeetisa eleegensa"],
    answer:"ishcherichior kolaaee and egrobaikteeriyama tyoomeephesiensa"
},
{
    question: "among the following kisa praanee in ovo-viviperitee occurs?",
    option:["hen","pleteepasa","raitala sarpa","ikidanaa"],
    answer:"raitala sarpa"
},
{
    question: "samagameteee paayee jaatee is:",
    option:["algae","aavrittaseedee","anaavrittaseedee","among these sabhee"],
    answer:"algae"
},
{
    question: "heredity of prabhaava ko linga on dekhane for which-see method pradaana of gaee?",
    option:["testa kraosa","aauta kraosa","resiprokala kraosa","siba kraosa"],
    answer:"resiprokala kraosa"
},
{
    question: "kisee DNA in codon AAA is। thisof anticodon koar honge?",
    option:["UUU","AAA","TTT","AUG"],
    answer:"UUU"
},
{
    question: "paudhon in asexual reproduction among the following kisa method by can be?",
    option:["mukulana","vikhndana","vibhaajana","sabhee"],
    answer:"sabhee"
},
{
    question: "yauna snfourita disease is:",
    option:["khasaraa","tee.bee.","gonorior","taayaphaaida"],
    answer:"gonorior"
},
{
    question: "sabafrom less porasa soil is:",
    option:["kle soil","loma soil","reteelee soil","ailyuviyala soil"],
    answer:"kle soil"
},
{
    question: "blood group of jaancha in prayukta enteeseerama in is found",
    option:["enteebaodee","enteejana","lyookosaaitsa","none of these"],
    answer:"enteebaodee"
},
{
    question: "mesowhichika yuga is",
    option:["matsayon of","amphibianson of","reptileson of","traailobaaitsa of"],
    answer:"reptileson of"
},
{
    question: "among these which one svaimmunity of udaaharana is?",
    option:["damaa","roometaoyada artharaaitisa","cancer","none of these"],
    answer:"roometaoyada artharaaitisa"
},
{
    question: "vaccinekarana one vyakti ko disease from protects is, whyki that:",
    option:["paachana ko achchhaa karane in sahaayataa does","RBC number ko badhaaataa is","antibody padaartha utpanna does","shareera of ooshmaa-tntra ko correct rakhataa is"],
    answer:"antibody padaartha utpanna does"
},
{
    question: "plaajmida of snratebha in satya is:",
    option:["viruses in paae jaate are","gene sthaanaantarana in bahuta experiment are","jaivika krioron for gene dhaarana do","ofndareeyaofya chromosomes of bhaaga are"],
    answer:"gene sthaanaantarana in bahuta experiment are"
},
{
    question: "in which tiryaka dvikhndana is found?",
    option:["monosistisa","plaajmodiyama","plainerior","siraatiyama"],
    answer:"siraatiyama"
},
{
    question: "among the following which-see murgiyon of one virus disease is?",
    option:["saalmonelosisa","koraaijaa","nyookaisala disease","paashchurelosisa"],
    answer:"nyookaisala disease"
},
{
    question: "kisee bhee food chain in haraa-plant first kadaee is whyki:",
    option:["thoseof vitarana vistrita occurs","ve soil in dridhataa from lage are","only theseheen in vaataavarana of CO₂ ko soorya light of upasthiti in sthira karane of kshamataa is","uonokta sabhee in"],
    answer:"only theseheen in vaataavarana of CO₂ ko soorya light of upasthiti in sthira karane of kshamataa is"
},
{
    question: "vibhinna alkohalika peya of formation kisa krior from is done?",
    option:["chhaanana from","nispndana from","kinfaorest from","plaforest from"],
    answer:"kinfaorest from"
},
{
    question: "in which endosperm kadaaa and cellulosic ho jaataa is",
    option:["mango","coconut","Phytelephas (aaivaree paama)","rendee"],
    answer:"Phytelephas (aaivaree paama)"
},
{
    question: "DNA from sndeshavaahaka RNA formation of krior ko are called?",
    option:["pratikarana/dvicharacterna","vaashpotsarjana","pratilekhana","roopaantarana"],
    answer:"pratilekhana"
},
{
    question: "among the following which fertilization for aavashyaka is",
    option:["Corolla","Ovule","Calyx","phala"],
    answer:"Ovule"
},
{
    question: "among the following toxinma/bemela ko chunen",
    option:["Archaesporium","Oogonium","Ovule","Antheridium"],
    answer:"Ovule"
},
{
    question: "daobasana iofee maapaka is:",
    option:["dhfaoresti","havaa","paanee","owhichna level of motaaee"],
    answer:"owhichna level of motaaee"
},
{
    question: "sugarcane-anusnpaddy snsthaana where avasthita is?",
    option:["munbaee in","koyambatoora in","gauhaatee in","patanaa in"],
    answer:"koyambatoora in"
},
{
    question: "one embryoputee in two praofra of snlayana, yugmanaja snlayana and trisnlayana sthaana lete are। this onighatanaa ko koar are called",
    option:["trisnlayana","twoharaa fertilization","endosperm","none of these"],
    answer:"twoharaa fertilization"
},
{
    question: "aaofriof and genetics roopa from samaana organisms ko are called:",
    option:["klona","somaaklona","kaosmidsa","saaibridsa"],
    answer:"klona"
},
{
    question: "India in first janagananaa when huee?",
    option:["1851 in","1872 in","1921 in","1951 in"],
    answer:"1872 in"
},
{
    question: "nimnalikhita RNA anukoolaka anu of ofrya does:",
    option:["doota RNA","antarana RNA","raaibosomala RNA","none of the above"],
    answer:"antarana RNA"
},
{
    question: "DNA RNA from alaga occurs:",
    option:["naaitrojanee samaakshaara va sugaron by","naaitrojanee samaakshaara va phaospheta samoohon by","sugaron in C onmaanuon of number by","sugar va phaospheta samoohon by"],
    answer:"naaitrojanee samaakshaara va sugaron by"
},
{
    question: "that process jisaof antargata organism offspring utpanna karaof apanee species ko nirntara banaae rakhataa is, kahalaatee is:",
    option:["reproduction","sexual reproduction","asexual reproduction","gametereproduction"],
    answer:"reproduction"
},
{
    question: "laghuseedaanupaddyee of sabafrom aantarika onta which-see is",
    option:["epidarmisa","endothesiyama","tepeetama","madhya onta"],
    answer:"tepeetama"
},
{
    question: "tissue culture in ofyika cell from vikasita embryo are called।",
    option:["embaraoyada","klona","kailasa","propegyoolsa"],
    answer:"embaraoyada"
},
{
    question: "kisee DNA in:",
    option:["thaayamina whichdaaa banaataa is guaanina from","edineena whichdaaa banaataa is thaayamina from","edinoseena whichdaaa banaataa is thaayamidina from","guaanina whichdaaa banaataa is saaitosina from"],
    answer:"edineena whichdaaa banaataa is thaayamina from"
},
{
    question: "DNA ko vishishta sthalon on whichdane having enzyme ko koar are called?",
    option:["laathisosaaima enzyme","pratibnwealth enzyme","DNA laaigeja","none of these"],
    answer:"DNA laaigeja"
},
{
    question: "tyoobarakulosisa for which-saa vaccine prayukta is done?",
    option:["BCG","DPT","TT","uonokta sabhee"],
    answer:"BCG"
},
{
    question: "F1 haaibrida and prabhaavee Parent between of kraosa is called",
    option:["testa kraosa","aauta kraosa","baika kraosa","rivarsa kraosa"],
    answer:"aauta kraosa"
},
{
    question: "laboratory in DNA ko dekhane for koar is used?",
    option:["oframeena","eneeleena bloo","itheediyama bromaaida","among these sabhee"],
    answer:"itheediyama bromaaida"
},
{
    question: "among the following which-see beemaaree murgiyon in is?",
    option:["smata","isjaa","both (A) and (B)","raaneekheta"],
    answer:"raaneekheta"
},
{
    question: "oneidanaa is",
    option:["yojaka kadaee","vestigial organ","vilupta kadaee","none of these"],
    answer:"yojaka kadaee"
},
{
    question: "among these in which aantarika fertilization naheen occurs?",
    option:["bird","medhaka","stanapaayee","none of these"],
    answer:"medhaka"
},
{
    question: "protoplaasta kalchara of phyoowhichjena what is?",
    option:["tarala naaitrojana","PEG","laiktika amla","among these sabhee"],
    answer:"PEG"
},
{
    question: "maantriyala protokaola, jisain ozone layer ko human kriorkalaapon from surakshita bachaae rakhane for uchita ofryavaahee karane ko kahaa gaor is, kisa in the year paarita kior gaor thaa?",
    option:["1986","1987","1988","1985"],
    answer:"1987"
},
{
    question: "paudhon in ardhasootree vibhaajana in which occurs?",
    option:["moola chhora","pollen grain","tanaa of chhora","pollenkosha"],
    answer:"pollenkosha"
},
{
    question: "F2 vnshaja of Monohybrid genotypic anupaata 1 : 2 : 1 rateshaataa is",
    option:["Segregation","Independent assortment","Dominance","Incomplete dominance"],
    answer:"Segregation"
},
{
    question: "India of raashtareeya bird is",
    option:["paivo kristesasa","phlemingo","kolambaa leevior","sitaikulaa"],
    answer:"paivo kristesasa"
},
{
    question: "pliyotraopika gene in rahataa is",
    option:["onela geneotaaipa","bahula geneotaaipa","bahula pheenotaaipa","onela pheenotaaipa"],
    answer:"bahula pheenotaaipa"
},
{
    question: "jemyoolsa banate are",
    option:["haaidraa in","spnja in","yeesta in","among these sabhee in"],
    answer:"spnja in"
},
{
    question: "vrishana thailee kisafrom relationshipita is?",
    option:["eggaashaya","yakrita","vrishana","vrikka"],
    answer:"vrishana"
},
{
    question: "DNA of second valayeekarana snrachanaa kisa ofrana from is?",
    option:["ilektarostetika aakarshana","vaandara vaala force","haaidrojana bndha due to","none of these"],
    answer:"haaidrojana bndha due to"
},
{
    question: "onela hybridization vaisaa hybridization is, jisain",
    option:["only one hee plants experiment for thistemaala ho","one whichdaaa contrasting characters ko rakhaa jaataa is","snkara ko samajaata with kraosa karaaor jaataa is","two whichdaaa contrasting characters lior jaataa is"],
    answer:"one whichdaaa contrasting characters ko rakhaa jaataa is"
},
{
    question: "decomposer are:",
    option:["enimelior","protistaa and enimelior","fungus va plant","bacterium va fungus"],
    answer:"bacterium va fungus"
},
{
    question: "sholaa forest paae jaate are",
    option:["udaeesaa of poorvee tata in","uttara-poorvee himaalaya in","pashchimee ghaata (ofrala) in","dakshina of pathaara in"],
    answer:"pashchimee ghaata (ofrala) in"
},
{
    question: "one normal drishti having female, jisaof father varnaandha are, of shaadee one normal drishti having male from is। thatof putra and putriyon in varnaandhataa of snbhaaforestaa koar hogee?",
    option:["25% varnaandha putra and sabhee normal drishti having putriorn","50% varnaandha putra and 50% normal drishti having putriorn","50% varnaandha putra and 50% varnaandha putriorn","sabhee putra normal drishti having and varnaandha putriorn"],
    answer:"50% varnaandha putra and 50% normal drishti having putriorn"
},
{
    question: "melaanina rngadravya of anupasthiti in dashaa utpanna is",
    option:["varnaandhataa","rnjakaheenataa","phinaailainsectonoorior","eloafptonoorior"],
    answer:"rnjakaheenataa"
},
{
    question: "rikaombeenenta DNA technique in plaajmida vaiktara of vikhandana by whom honaa aavashyaka is?",
    option:["garma kshaareeya ghola by","roopaantarita DNA laaigeja by","four prithaka enzyme by","thatee enzyme jisaof by daataa gene ko khandita kior gaor is"],
    answer:"thatee enzyme jisaof by daataa gene ko khandita kior gaor is"
},
{
    question: "anunmeelya flower nishchita roopa from are",
    option:["svapollenita","onpollenita","svapollenita and onpollenita both","none of these"],
    answer:"svapollenita"
},
{
    question: "kisee baanjha plant haaibrida ko by whom Fertile made jaa sakataa is?",
    option:["kaolcheesina of experiment from","paoleeplaoidee","gainosana yukti by","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "flower organ whose roopaantarita bhaaga is",
    option:["pattiyon of","shaakhaaon of","Sporangia","agra meristems"],
    answer:"pattiyon of"
},
{
    question: "Nucellus or Integument from atirikta embryo of formation ko are called",
    option:["Polyspermy","anishekareproduction","paarthenoofrpa","poliimbaraayonee"],
    answer:"poliimbaraayonee"
},
{
    question: "tambaakoo of fromforest from shareera in which-saa upaapachayee onivartana sheeghra onilakshita occurs?",
    option:["adhivrikka grnthi of uddeepana from kaitekolemeena of in blood secretion","vyakti of bloodchaapa and hridaya spandana of rate in oneaaone growth","among these both (A) and (B)","none of these"],
    answer:"among these both (A) and (B)"
},
{
    question: "thesein which-saa natural air pradooshaka is?",
    option:["jhaavingmukhee from nikalee gaifromn","pollen grain","dhoolakana","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "one sndeshavaahaka RNA in kitane nucleotide of krama amino acid for one kodona becomes is?",
    option:["one","two","three","four"],
    answer:"three"
},
{
    question: "human veerya (semen) of pH is",
    option:["4.5 – 5.5","6.5 – 6.8","7.3 – 7.5","8.2 – 8.5"],
    answer:"7.3 – 7.5"
},
{
    question: "Indian aavrittaseed embryo science of janaka are",
    option:["bee.ema. whichharee","bee.jee.ela. svaamee","aara.ena. apela","pee. maaheshvaree"],
    answer:"pee. maaheshvaree"
},
{
    question: "antariksha organismmndala of avadhaaranaa kisane vikasita of?",
    option:["DST","UGC","CRIS","MAB"],
    answer:"MAB"
},
{
    question: "AIDS of ofraka is:",
    option:["bacteria","protozoa","HIV vaayarasa","traaikomonaasa"],
    answer:"HIV vaayarasa"
},
{
    question: "histaamina relationshipita is:",
    option:["udaaseena","B-limphosaaita","enteebaodee","elarjee"],
    answer:"elarjee"
},
{
    question: "Corpus Spongiosum peshee in which is found?",
    option:["vrishana","shishna","eggaashaya","vrikka"],
    answer:"shishna"
},
{
    question: "indala ne prastaavita kior",
    option:["inheritance of acquired characters","genetics of niyama","sahalagnataa of niyama","energy of niyama"],
    answer:"genetics of niyama"
},
{
    question: "ee. kolaaee kloninga snvaahaka pBR 322 in pratibnwealth sthala shrrinkhalaa maujooda is:",
    option:["EcoRI","HindIII","BamHI","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "laika operaona in laiktosa koar ofrya does?",
    option:["niyntraka","preraka","avarodhaka","thesein hara praofra"],
    answer:"preraka"
},
{
    question: "vaahita mala from water of pollution whose putiyon from prarateshita occurs?",
    option:["eshoafrichior","entaameebaa","syoodomonaasa","leeshmaanior"],
    answer:"entaameebaa"
},
{
    question: "two nitrogenous base of haaidrojana bnwealth between of dooree (jaifrom A-T, G-C) is:",
    option:["samaana","asamaana","onivartanasheela","none of these"],
    answer:"samaana"
},
{
    question: "that process jisaof by male gamete and female gamete banate are, kahalaatee is:",
    option:["fertilization","embryoreproduction","gametereproduction","aaofrareproduction"],
    answer:"gametereproduction"
},
{
    question: "vishva in paae jaane having biodiversity haota spaota of number among these which-see is?",
    option:["25","9","34","none of these"],
    answer:"34"
},
{
    question: "bahuembryotaa sabafrom joardaa in which is",
    option:["jimnosoanma","teridophaaita","aavrittaseedee","braayophaaita"],
    answer:"jimnosoanma"
},
{
    question: "yugmana and vikarshana of theory ko kisane proposed kior?",
    option:["maorgana","betesana and paneta","hyoogo di vreeja","indala"],
    answer:"betesana and paneta"
},
{
    question: "DNA from pratyaksha roopa in synthesis naheen kior jaa sakataa:",
    option:["m-RNA","t-RNA","r-RNA","protein"],
    answer:"protein"
},
{
    question: "Filiform upakarana whose specialtaa is",
    option:["Synergids","egg","anther wall","Antipodal cells"],
    answer:"Synergids"
},
{
    question: "if father of blood group O and mother of AB ho to child in kisa blood group of snbhaaforestaa ho sakatee is?",
    option:["O","AB","O or AB","A or B"],
    answer:"A or B"
},
{
    question: "guddedaara (maansala) tane of honaa anukoolana is।",
    option:["deserteeya paudhon of","watereeya paudhon of","uonyukta (A) and (B) both of","none of these"],
    answer:"deserteeya paudhon of"
},
{
    question: "among these pashchavirus (Retrovirus) which is?",
    option:["hyoomana imyoono diphisiensee vaayarasa","hepetaaitisa vaayarasa","maaikovaayarasa influenza","none of these"],
    answer:"hyoomana imyoono diphisiensee vaayarasa"
},
{
    question: "poore bhaugolika area in diversity of vaasa-sthala is:",
    option:["gaamaa diversity","beetaa diversity","omegaa diversity","deltaa diversity"],
    answer:"gaamaa diversity"
},
{
    question: "somaaklona praapta are।",
    option:["tissue culture by","plant reproduction by","radiationna by","geneee abhiorntriof by"],
    answer:"tissue culture by"
},
{
    question: "nyookliyosaaida is:",
    option:["nitrogenous baseka + sugar","naaitrojanee kshaaraka + sugar + phaospheta","sugar + phaospheta","naaitrojanee kshaaraka + phaospheta"],
    answer:"nitrogenous baseka + sugar"
},
{
    question: "ethaanaola of badae paimaane on utpaadana for whose is used?",
    option:["yeesta","bacterium","fungus","virus"],
    answer:"yeesta"
},
{
    question: "kisee aavrittaseedee (onecotyledonee) of male gametophyte are",
    option:["Microsporangium","Nucellus","Microspore","Stamen"],
    answer:"Microspore"
},
{
    question: "kisee shugara diseaseee vyakti in insulina ko seedhe taura on mukha by naheen dior jaataa is, whyki this one:",
    option:["C-peptide","daayasalphaaida","paoleepeptaaida","none of these"],
    answer:"paoleepeptaaida"
},
{
    question: "vibhinna praofra of gamete which one plants of genotype AaBbCc from praapta are, thoseof number is",
    option:["2","8","4","16"],
    answer:"8"
},
{
    question: "human of udgama sthala maanaa jaataa is",
    option:["eshior","aphreeof","yooropa","ameriof"],
    answer:"aphreeof"
},
{
    question: "‘jaivika diversity’ shabda of sarvafirst experiment when kior gaor?",
    option:["1980","1970","1985","1975"],
    answer:"1985"
},
{
    question: "nimna in which birth control in prayukta orntriofya avarodhaka is?",
    option:["kaoon T","madhyachchhada","delakaona chaarate","loop"],
    answer:"madhyachchhada"
},
{
    question: "see.aara. kisa disease of pahachaana for thistemaala is done?",
    option:["taaiphaayada","cancer","tee.bee.","among these sabhee"],
    answer:"cancer"
},
{
    question: "forest oftane of ofrana:",
    option:["human population in growth","formation ofrya","agriculture yogya land of badhatee huee maanga","uonokta sabhee"],
    answer:"uonokta sabhee"
},
{
    question: "sheetoshna sadaabahaara forest where milate are?",
    option:["himaalaya","pashchimee ghaata","araavalee","asama"],
    answer:"pashchimee ghaata"
},
{
    question: "of DNA formation kisafrom occurs?",
    option:["rivarsa traansakripteja","klona DNA","vrittaaofra DNA","pumaleyogaja DNA"],
    answer:"rivarsa traansakripteja"
},
{
    question: "genetic code in kitane code are?",
    option:["8","16","32","64"],
    answer:"64"
},
{
    question: "among these kisa disease hetu elisaa (ELISA) jaancha karanaa chaahie?",
    option:["malaria","miordee bukhaara (taayaphaaida)","echa.aaee.vee./AIDS","none of these"],
    answer:"echa.aaee.vee./AIDS"
},
{
    question: "snkataapanna speciesyon of conservation for baahyasthaana conservation of one method is",
    option:["national park","nimnataapa onirakshana","pashu bihaara","surakshita jaivamndala"],
    answer:"nimnataapa onirakshana"
},
{
    question: "jaiva gaisa utpaadana in prayukta bacterium of samooha is:",
    option:["yoobacteria","aargenotraapha","methenotraapha","methenojena"],
    answer:"methenojena"
},
{
    question: "if DNA of kisee prithaka kie gae starena ko 82-92°C taapa on rakhaa jaae to:",
    option:["this RNA in onivartita ho jaataa is","this two khndon in toota jaataa is","this aneka khandon in toota jaataa is","this khula jaataa is and both rajjuka prithak aho jaate are"],
    answer:"this khula jaataa is and both rajjuka prithak aho jaate are"
},
{
    question: "somaaklonala variationen are:",
    option:["tissue culture by utpanna variationen","laingika reproduction by utpanna variationen","myootaajena by ofrita variationen","gaamaa kirana by ofrita variationen"],
    answer:"tissue culture by utpanna variationen"
},
{
    question: "paneera in special praofra of sugndha kisafrom aatee is?",
    option:["yeesta from","fungus from","bacterium from","virus from"],
    answer:"bacterium from"
},
{
    question: "nyoometophorsa thisaan upasthita occurs:",
    option:["jeerophaaita","haaigrophaaita","meewhichphaaita","islophaaita"],
    answer:"islophaaita"
},
{
    question: "sookshama reproduction in karaaor jaataa is:",
    option:["alaingika reproduction","samaana genetic characters having plants","laingika reproduction","both (A) and (B)"],
    answer:"both (A) and (B)"
},
{
    question: "seedaanuon by reproduction karane having plants jaifrom maosa, pharna normalth kisa samooha in rakhe jaate are?",
    option:["sporophaaitsa","thailophaaitsa","kriptogemsa","baayophaaitsa"],
    answer:"kriptogemsa"
},
{
    question: "pregnancyaavasthaa of kisa maheene in pregnancystha infant gatisheela occurs and sira on baala uga aate are?",
    option:["chauthaa maheenaa","fivevaan maheenaa","chhathaa maheenaa","teesaraa maheenaa"],
    answer:"fivevaan maheenaa"
},
{
    question: "forest hamaare for mahattavapoorna are whyki ve hain pradaana do:",
    option:["bhojana","fouraa","filament","uonokta sabhee"],
    answer:"uonokta sabhee"
},
{
    question: "thesesineretara of experiment kisa praofra of avashishta nistaarana hetu karanaa chaahie?",
    option:["taapeeya vidyuta ofndara","agriculture relationshipita","human mala and anya avashishta","aspataala"],
    answer:"aspataala"
},
{
    question: "reproduction svaasthaya for koar saavapaddyee of jaroorata is?",
    option:["yauna snfourita disease from bachaava","pregnancypaata","pregnancyvatee of samuchita dekhabhaala","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "phlaavara-saavara whose traansajenika praofra is?",
    option:["wheat","tamaatara","paddy","rooee"],
    answer:"tamaatara"
},
{
    question: "among these which birth rate control of shailya method is",
    option:["tyubekataumee","vaifromkataumee","(A) and (B) both hee","none of these"],
    answer:"(A) and (B) both hee"
},
{
    question: "braathose shugara chemical roopa from what is?",
    option:["daaiesitila maorpheena haaidrokloraaida","thiyophaaileena","loraajipama","metheedrina"],
    answer:"daaiesitila maorpheena haaidrokloraaida"
},
{
    question: "Indeterminate cleavage in which is found?",
    option:["earthworm","kalionooof","nireeja","whichnka"],
    answer:"kalionooof"
},
{
    question: "one sfaorestishechita triploid plant banaataa is।",
    option:["4 bhinna gamete and 16 bhinna yugmanaja","8 bhinna gamete and 16 bhinna yugmanaja","8 bhinna gamete and 32 bhinna yugmanaja","8 bhinna gamete and 64 bhinna yugmanaja"],
    answer:"8 bhinna gamete and 64 bhinna yugmanaja"
},
{
    question: "nyooklika amla of naaitrogenesa besa between which-saa bnwealth rahataa is?",
    option:["peptaaida bnwealth","thistara bnwealth","both (A) and (B)","haaidrojana bnwealth"],
    answer:"haaidrojana bnwealth"
},
{
    question: "bhoo-mndala of sabafrom badaaa biodiversity having area is:",
    option:["poorvee himaalaya","India of pashchimee ghaata","amejana of rainfallforest","pashchimee himaalaya"],
    answer:"amejana of rainfallforest"
},
{
    question: "khachchara of origin in kinabetween hybridization occurs?",
    option:["male gadahaa and female horse","male horse and female gadahaa","saandha and gadahee","none of these"],
    answer:"male horse and female gadahaa"
},
{
    question: "milara-yoore by for gae gaiseeya mishrana of anupaata is",
    option:["2:1:2","1:2:1","1:1:2","2:1:1"],
    answer:"2:1:2"
},
{
    question: "trisnchayana is",
    option:["one male gamete of two dhruva nucleuson with embryo sac in snlayana","one male gamete of three nucleuson with embryo sac in snlayana","one male gamete of two synergids with snlayana","one embryo sac in three snlayana"],
    answer:"one male gamete of two dhruva nucleuson with embryo sac in snlayana"
},
{
    question: "ELISA of experiment kina beemaariyon of pataa lagaane for is done?",
    option:["heepaitaaitisa","AIDS","thaayaraoida disaordara","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "ozone layer dhaof rahatee is:",
    option:["madhya mndala in","baahya mndala in","samataapa mndala in","among these sabhee"],
    answer:"samataapa mndala in"
},
{
    question: "vaahita malawater of shuddhikarana in kriorsheela are:",
    option:["animal organismka","fish","bacterium","among these sabhee"],
    answer:"bacterium"
},
{
    question: "Scutellum whose bhaaga is",
    option:["Grass cotyledon","Dicot cotyledon","Maize endosperm","Pericarp"],
    answer:"Grass cotyledon"
},
{
    question: "daarvina of whom ofrya from atyadhika prabhaavita hue?",
    option:["maolthasa","vailesa","spensara","laamaarka"],
    answer:"maolthasa"
},
{
    question: "kaindeediyosisa of ofrana is:",
    option:["Pubic Lice","yoni yeesta","pina vaorma","Giant amoeba"],
    answer:"yoni yeesta"
},
{
    question: "human in highest being having cancer is?",
    option:["melaanomaa","limphomaa","saarkomaa","ofrsinomaa"],
    answer:"ofrsinomaa"
},
{
    question: "yoni dvaara praayh one patalee membrane from dhnof occurs which are called",
    option:["klaaitorisa","mewhichraa","thisthamasa","haayamana"],
    answer:"haayamana"
},
{
    question: "among the following which-saa jaiva peedakanaashee is?",
    option:["beetee cotton","beetee maize","beetee paddy","uonokta sabhee"],
    answer:"uonokta sabhee"
},
{
    question: "species of jaivika avadhaaranaa mainth aadhaarita is:",
    option:["reproductionika vilagana on","only aaofriof traits on","only reproduction of method on","aaofriofya and reproduction of methodyon on"],
    answer:"reproductionika vilagana on"
},
{
    question: "haploid cell which samasootree vibhaajana by embryo sac banaatee is, kahalaatee is",
    option:["Megaspore mother cell","Microspore mother cell","Functional megaspore","Non-functional megaspore"],
    answer:"Functional megaspore"
},
{
    question: "fourlsa daarvina by prayukta ship of name thaa",
    option:["H.M.S. eegala","H.M.S. beegala","H.M.S. reegala","H.M.S. taaitenika"],
    answer:"H.M.S. beegala"
},
{
    question: "ofnhaa neshanala park prasiddha is",
    option:["pakshiyon for","gaindon for","baagha for","magaramachchhon for"],
    answer:"baagha for"
},
{
    question: "mammals of embryo in, naabhi in blood pravaaha occurs",
    option:["50% Maternal and 50% Foetal","100% Foetal","100% Maternal","75% Maternal and 25% Foetal"],
    answer:"100% Foetal"
},
{
    question: "histaamina relationshipita is:",
    option:["udaaseenataa","B-limphosaaita from","enteebaodee from","elarjee from"],
    answer:"elarjee from"
},
{
    question: "if two gamete dekhane in samaana lagen, to are called:",
    option:["aathisogaimitsa","istediseaseaimitsa","Anisogametes","Exogamy"],
    answer:"aathisogaimitsa"
},
{
    question: "influenza among these by whom occurs?",
    option:["thesepho vaayarasa","mikso vaayarasa","harpisa vaayarasa","none of these"],
    answer:"mikso vaayarasa"
},
{
    question: "kisee chhote bhaaga/tukadae of snpoorna shareera of formation ko are called:",
    option:["Morphallaxis","Epimorphosis","Morphogenesis","Metabolism"],
    answer:"Morphallaxis"
},
{
    question: "owhichna of vighatana in which-saa tatva utpareraka as ofrya does?",
    option:["kloreena","phloreena","okseejana","potaishiyama"],
    answer:"kloreena"
},
{
    question: "kanaofya padaartha in upasthita occurs:",
    option:["thosa kana","tarala kana","both (A) and (B)","only gaifromn"],
    answer:"both (A) and (B)"
},
{
    question: "paudhon in cytoplasmee male-bndhyataa hetu gene sthita are",
    option:["maaitokaondariyala geneoma in","saaitosaola in","haritalavaka geneoma in","nucleuseeya geneoma in"],
    answer:"maaitokaondariyala geneoma in"
},
{
    question: "shareera of kisa hisfarom in spermnaashaka by sperm ko maaraa jaataa is?",
    option:["yoni","greevaa","phailopiyana tyooba","(A) and (B) both"],
    answer:"(A) and (B) both"
},
{
    question: "pollen grain of baahya chola in suspashta dvaaraka or rndhra ko are called",
    option:["baahya cholaa","anth cholaa","reproduction chhidra","reproduction cell"],
    answer:"reproduction chhidra"
},
{
    question: "pratyeka plant cell from poorna plant bana sakataa is। this character ko are called।",
    option:["kloninga","somaakloninga","toteepotensee","none of these"],
    answer:"toteepotensee"
},
{
    question: "aahaara shrrinkhalaa of onsoan samooha ko koar are called?",
    option:["aahaara chakra","aahaara jatila","aahaara jaala","poshee level"],
    answer:"aahaara jaala"
},
{
    question: "protoplaasta kalchara of phyoowhichjena what is?",
    option:["tarala naaitrojana","PEG","laiktika amla","among these sabhee"],
    answer:"PEG"
},
{
    question: "gaatheseendaromaarpha in",
    option:["kuchha cells of genepraaroopa XX and kuchha cells of XY occurs","sabhee cells of genepraaroopa XX occurs","sabhee cells of genepraaroopa XY occurs","sabhee cells of genepraaroopa XXY occurs"],
    answer:"kuchha cells of genepraaroopa XX and kuchha cells of XY occurs"
},
{
    question: "jaiva sakriya anu saaiklosporina A ko made jaataa is:",
    option:["fungus from","yeesta from","bacterium from","virus from"],
    answer:"fungus from"
},
{
    question: "dee०ena०e० in nihita paayarimidina is:",
    option:["thaayameena and saaitosina","saaitosina and guaaneena","edineena and yuraasila","edineena and thaayameena"],
    answer:"thaayameena and saaitosina"
},
{
    question: "onposhee cells in vijaateeya DNA ko pravesha karaane for kinaof use is done?",
    option:["sookshama anthkshepana","gene gun","aharmful pathogen","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "if father of blood varga AB and mother of B is to thoseof offspring of blood varga being of sambhaaforestaa is",
    option:["0%","50%","25%","none of these"],
    answer:"0%"
},
{
    question: "vishva of beshaofmatee oona dene having ‘pashmeenaa’ nasla is।",
    option:["bheda of","bakaree of","bheda-bakaree hybridization","kashmeera bheda-aphagaana bheda snkara from"],
    answer:"bakaree of"
},
{
    question: "pahalee traansajenika crop thee:",
    option:["soota","alasee","matara","tambaakoo"],
    answer:"tambaakoo"
},
{
    question: "one ecosystem in energy pravaaha of correct krama is:",
    option:["producer → maansaahaaree → shaaofhaaree → vighatanaofree","producer → shaaofhaaree → maansaahaaree → vighatanaofree","shaaofhaaree → maansaahaaree → producer → vighatanaofree","shaaofhaaree → producer → maansaahaaree → vighatanaofree"],
    answer:"producer → shaaofhaaree → maansaahaaree → vighatanaofree"
},
{
    question: "among the following anulekhana for mahattavapoorna is:",
    option:["DNA mithaaileja","CAAT baoksa","pramotara","DNA paolimareja"],
    answer:"pramotara"
},
{
    question: "insecton ko bhagaane having neem of utpaada is:",
    option:["retinona","ejaadaarektina","peraathiaana","endarina"],
    answer:"ejaadaarektina"
},
{
    question: "among the following which-saa ‘bekara yeesta’ is?",
    option:["S. cerevisiae","S. ludwigii","S. octosporus","Schizosaccharomyces"],
    answer:"S. cerevisiae"
},
{
    question: "one nadee of water of B.O.D. about kitanaa occurs?",
    option:["8","20","400","500"],
    answer:"8"
},
{
    question: "photochemical smogkoharaa among these kisafrom becomes is?",
    option:["salphara daaioksaaida, PAN and dhuaan","owhichna, PAN and naaitrojana daaioksaaida","owhichna, salphara daaioksaaida and haaidroofrbana","salphara daaioksaaida, ofrbana daaioksaaida and haaidroofrbana"],
    answer:"owhichna, PAN and naaitrojana daaioksaaida"
},
{
    question: "‘ecosystem’ shabda of use of shreya dior jaataa is।",
    option:["gaardamale","odama ko","taonasalee","vaarminga ko"],
    answer:"taonasalee"
},
{
    question: "three cropen which vishva khaadya utpaadana of highest bhaaga banaatee are।",
    option:["wheat, rice and maize","wheat, rice and jau","wheat, maize and jvaara","rice, maize and jvaara"],
    answer:"wheat, rice and maize"
},
{
    question: "pahalaa human jisaof fossil aphreeof of alaavaa yooropa and eshior in mile",
    option:["homo isbilisa","homo irektasa","homo niendarathala","homo saipiynsa"],
    answer:"homo irektasa"
},
{
    question: "which-saa mata vyaktigata speciesvritta of pumaleaavritti does?",
    option:["mutation theory","vnshaagati theory","pumaleaavritti theory","natural chayanavaada"],
    answer:"pumaleaavritti theory"
},
{
    question: "biotechnology by formed aushadhi whose experiment cancer nidaana in is done:",
    option:["intarapheraona","HGH","TSH","thesesulina"],
    answer:"intarapheraona"
},
{
    question: "among the following whose formation ecosystem from occurs?",
    option:["food chain","khaadya-jaala","both (A) and (B)","none of these"],
    answer:"both (A) and (B)"
},
{
    question: "anther koar rateshaataa is",
    option:["Sporogonium","male gaimetophaayata","male sporophila","Sporangium"],
    answer:"Sporogonium"
},
{
    question: "thesephandeebulama in organulaaofra pravardha are called",
    option:["phimbaree","empulaa","thisthamasa","none of these"],
    answer:"phimbaree"
},
{
    question: "sahalagnataa of khoja kisane of?",
    option:["indala ne","stenalee and milara ne","maorgana ne","none of these"],
    answer:"maorgana ne"
},
{
    question: "one praaroopee nyookliyosoma in histona ashtaka on lipate DNA kundalee in kshaara yugmon of number is।",
    option:["100","200","300","400"],
    answer:"200"
},
{
    question: "praacheena ofla in yeesta of experiment of whom formation in kior jaataa thaa?",
    option:["vaathese","biyara","rama","sabhee"],
    answer:"sabhee"
},
{
    question: "floweringya paudhon in onelingee male flower ko are called",
    option:["Pistillate","Monoecious","Dioecious","Staminate"],
    answer:"Staminate"
},
{
    question: "thesein in which erila naheen is found",
    option:["shareephaa","leechee","mango","miristiof"],
    answer:"mango"
},
{
    question: "haploid cells of snlayana of process ko are called।",
    option:["cell chakra","ardadhasootree vibhaajana","samasootree vibhaajana","snyugmana (syngamy)"],
    answer:"snyugmana (syngamy)"
},
{
    question: "anther in pollen grain of formation and differentiation ko are called",
    option:["Megasporogenesis","Microsporogenesis","Spermatogenesis","dvifertilization"],
    answer:"Microsporogenesis"
},
{
    question: "charama community formation up to one community of species of doosare from kramika onivartana is called",
    option:["sequencena","paaritntra","population","none of these"],
    answer:"sequencena"
},
{
    question: "punofsara kitane bhaagon in bntaa occurs",
    option:["1","2","3","4"],
    answer:"2"
},
{
    question: "onbhakshana and parasitism in this taraha paarasoanika krior is:",
    option:["+,+","-,-","+,0","+,-"],
    answer:"+,-"
},
{
    question: "moreaansha pratijaivika taiorra are done",
    option:["fungi from","yeesta from","algae from","bacterium from"],
    answer:"bacterium from"
},
{
    question: "rookshaansha (Roughage) of moretaa is।",
    option:["egge in","khanija padaarthon in","anaaja in","ghaasa, bhoosaa, fouraa in"],
    answer:"ghaasa, bhoosaa, fouraa in"
},
{
    question: "natural genetic abhiyntaa is:",
    option:["baiseelasa sabatilasa","syoodomonaasa species","eeshcherichior kolaaee","egrobaikteeriyama tyoomeephesiensa"],
    answer:"egrobaikteeriyama tyoomeephesiensa"
},
{
    question: "human geneoma in kshaara yugmon of number is:",
    option:["3 × 10^6","3 × 10^9","3 × 10^12","none of these"],
    answer:"3 × 10^9"
},
{
    question: "one hee species of organisms of saamaajika-sthaanika sngathana ko koar are called?",
    option:["speesheeja","aabaadee","community","vyashti"],
    answer:"aabaadee"
},
{
    question: "onivaara niyojana for shukravaahinee ko oftakara baanwealthe of method ko are called:",
    option:["Tubectomy","Ovarectomy","Vasectomy","Castration"],
    answer:"Vasectomy"
},
{
    question: "traansajenika animals in:",
    option:["videshee RNA theseof sabhee cells in occurs","videshee DNA theseof sabhee cells in occurs","videshee DNA theseof kuchha cells in occurs","(B) and (C) both"],
    answer:"videshee DNA theseof sabhee cells in occurs"
},
{
    question: "1000 pollen grain from kitane pollen maatri cell of formation hogaa",
    option:["200","250","300","100"],
    answer:"250"
},
{
    question: "peraoksee eseetila naaitreta (PAN) kisa praofra of pradooshaka is?",
    option:["primary pradooshaka","secondary pradooshaka","water pradooshaka","dhfaoresti pradooshaka"],
    answer:"secondary pradooshaka"
},
{
    question: "kaoon-tee prevents is:",
    option:["fertilization ko","ovooleshana ko","yooterasa of deevaaron on imbariyon of formation ko","riprodaktiva dakta in ruofvata ko"],
    answer:"fertilization ko"
},
{
    question: "spermatogenesis by whom abhibhoota occurs?",
    option:["FSH","MSH","ACTH","HCG"],
    answer:"FSH"
},
{
    question: "Indiain the year haota spaotsa paae jaate are",
    option:["only poorvee himaalaya in","only pashchimee ghaata in","poorvee himaalaya and pashchimee ghaata in","raajasthaana of registaana in"],
    answer:"poorvee himaalaya and pashchimee ghaata in"
},
{
    question: "Spermatids of roopaantarana Spermatozoa in kisa method by occurs?",
    option:["Spermiation","Spermatogenesis","Spermiogenesis","Spermatosis"],
    answer:"Spermiogenesis"
},
{
    question: "LSD is obtained:",
    option:["fungus from","laaiofna from","algae from","bacterium from"],
    answer:"fungus from"
},
{
    question: "among these which sarvaadhika energy praapta does?",
    option:["sheersha consumer","producer","sartahataaree","none of these"],
    answer:"producer"
},
{
    question: "voarvasaayika level on sookshamaorganisms ko utpanna karane in aavashyakataa is",
    option:["kinfaorest of","baayogaisa snyntra of","peneesilina of","staitina of"],
    answer:"kinfaorest of"
},
{
    question: "ghaanaa bird vihaara sthita is –",
    option:["uttara pradesha","raajasthaana","hariornaa","bihaara"],
    answer:"raajasthaana"
},
{
    question: "vrikka and reproduction organ of formation kisafrom occurs?",
    option:["endoderm","Mesoderm","ectoderm","ecto-mesoderm"],
    answer:"Mesoderm"
},
{
    question: "naaramena baaralaoga kisafrom relationshipita are?",
    option:["sapheda kraanti","harita kraanti","neelee kraanti","peelee kraanti"],
    answer:"harita kraanti"
},
{
    question: "maanasa fromnchuree sthita is।",
    option:["raajasthaana","asama","bihaara","gujaraata"],
    answer:"asama"
},
{
    question: "among these which-saa nimetoda tambaakoo of paudhon of jadaon ko snkramita does?",
    option:["baisilasa thurijiensisa","kraaee aai e see","melaoyadaojina thesekognitaa","(A) and (B) both"],
    answer:"melaoyadaojina thesekognitaa"
},
{
    question: "jenetika ingeneiyaringa in thistemaala pahale pratibnwealth of enzyme name is:",
    option:["EcoRI","HindIII","BamHI","among these sabhee"],
    answer:"EcoRI"
},
{
    question: "Cri-du-chat sindroma kisa chromosomeeeya aberration due to occurs?",
    option:["Inversion","Translocation","Deletion","Duplication"],
    answer:"Deletion"
},
{
    question: "kisee sperm in nucleusyukta genetic material in which is found?",
    option:["onerosoma","sira","madhya peesa","poonchha"],
    answer:"sira"
},
{
    question: "vaahitamala of primary treatment in kina krioron of use occurs?",
    option:["plaforest","chhaanana","nispndana","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "aabaadee of sthaana occurs:",
    option:["speesheeja","speesheeja of adheenastha","community of","speesheeja of baraabara"],
    answer:"speesheeja of adheenastha"
},
{
    question: "spermatogenesis of control by whom occurs?",
    option:["estarojana","LH","endrojana","none of these"],
    answer:"endrojana"
},
{
    question: "thesein which thahare hue paanee in ugakara okseejana kheencha letaa is?",
    option:["water hyacinth","Hydrilla","lotus","paddy"],
    answer:"water hyacinth"
},
{
    question: "kisee nishchita bhoo-bhaaga in hee paae jaane having organisms ko kisa snjnyaa from jaanaa jaataa is?",
    option:["endemika","vaishvika","mahaamaaree","none of these"],
    answer:"endemika"
},
{
    question: "O blood group having father and O samooha having child's geneotaaipa hogaa",
    option:["IᴬIᴬ","Iᴬi","IᴬIᴮ","ii"],
    answer:"ii"
},
{
    question: "one species for anupaata niyama is:",
    option:["T+C/G+A","A+C/T+G","G+C/A+T","A+C/C+T"],
    answer:"A+C/T+G"
},
{
    question: "gamete snlayana poorna when koar occurs",
    option:["yugmanaja (zygote) of rachanaa is","triploid/trisnlayana occurs","twoharaa fertilization occurs","uonokta sabhee ofrya are"],
    answer:"yugmanaja (zygote) of rachanaa is"
},
{
    question: "ecological pyramid are:",
    option:["two praofra of","three praofra of","four praofra of","five praofra of"],
    answer:"three praofra of"
},
{
    question: "samataapa mndala in UV radiation avashoshita does:",
    option:["O₂","O₃","SO₂","Ar"],
    answer:"O₃"
},
{
    question: "among the following which-saa golaofra (globular) protein of udaaharana is?",
    option:["maayosina","kolejana","ofraatina","hemoglobin"],
    answer:"hemoglobin"
},
{
    question: "kisee cell in highest found jaane having RNA is:",
    option:["t-RNA","r-RNA","m-RNA","hn-t-RNA"],
    answer:"r-RNA"
},
{
    question: "genetic apavaahana whose gene aavritti in onivartana laataa is?",
    option:["first peedhaee","agalee peedhaee","aprabhaavee gene","prabhaavee gene"],
    answer:"agalee peedhaee"
},
{
    question: "smallpox kisadue to occurs?",
    option:["virus","bacterium","fungus","machchhada"],
    answer:"virus"
},
{
    question: "monoklonala enteebaodeeja praapta is donen:",
    option:["one pratijana for one paitrika from","one pratijana for bhinna paitrikon from","aneka pratijanon for one paitrika from","aneka pratijanon for aneka paitrikon from"],
    answer:"one pratijana for one paitrika from"
},
{
    question: "gngaawater in shava ko pravaahita karane from koar occurs?",
    option:["ghulita okseejana in lessee","BOD in growth","bacteriumon in growth","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "reservoiron in suposhana for sabafrom prabhaavashaalee is:",
    option:["aofrbanika phaospheta","ofrbanika padaartha","algae","bacterium"],
    answer:"aofrbanika phaospheta"
},
{
    question: "shareera of baahara being having fertilization ko koar are called?",
    option:["these vitro","these veevo","both (A) and (B)","none of these"],
    answer:"these vitro"
},
{
    question: "ozone layer of kshaya among these kisadue to occurs?",
    option:["ofrbana daaioksaaida","klorophloroofrbana","paina (PAN)","none of these"],
    answer:"klorophloroofrbana"
},
{
    question: "chipako aantwolana chalaaor gaor",
    option:["madhyapradesha in","uttaraakhnda in","hariornaa in","dillee in"],
    answer:"uttaraakhnda in"
},
{
    question: "nimnalikhita vaijnyaanikon in from kisane proteinyukta snrachanaaon ko koesaraveta name dior?",
    option:["operina by","heldena by","daarvina by","these sabhee of by"],
    answer:"operina by"
},
{
    question: "kisee bhee gene of anabhivyakti among these by whom snpaadita is?",
    option:["chhotaa vyatiofree RNA (RNAi)","enteefromnsa RNA","A and B both","none of these"],
    answer:"A and B both"
},
{
    question: "organismna of chemical origin of sidpaaddyta by whom bataaor gaor?",
    option:["milara va phaoksa","operina va haaldena","milara va vaatasana","vaatasana va melvina"],
    answer:"operina va haaldena"
},
{
    question: "tambaakoo of taraha of paudhon in Polygenic heredity of adhyayana sarvafirst kisane kior thaa?",
    option:["devenaporta","nilsana-ihale","kolariyootara","gailtana"],
    answer:"kolariyootara"
},
{
    question: "land-phalanee phala is",
    option:["aaloo","moongaphalee","poarja","arateka"],
    answer:"moongaphalee"
},
{
    question: "niyo-daarvinijma by daarvinijma of theory in main onivartana kior gaor",
    option:["variation of udgama in","natural chayana of voarkhoar in","speesheeja formation of voarkhoar in","aathisoleshana of voarkhoar in"],
    answer:"variation of udgama in"
},
{
    question: "DNA in which-saa nitrogenous base anupasthita occurs?",
    option:["A","C","T","U"],
    answer:"U"
},
{
    question: "which-saa paddy of snkara variety is?",
    option:["sonaaraa","sharabatee","jaor","gngaa"],
    answer:"jaor"
},
{
    question: "ofndareeya aushadhi anusnpaddy snsthaana by which-see contraceptive pill taiorra of gaee is?",
    option:["maalaa-D","snyukta golee","sahelee","nirodha"],
    answer:"sahelee"
},
{
    question: "baayogaisa in mishrita gaison of name is:",
    option:["CH₄, H₂S, CO₂, CO","CH₄, H₂S, CO₂","CH₄, CO₂","CO, CH₄, H₂S"],
    answer:"CH₄, H₂S, CO₂"
},
{
    question: "among the following which-saa vaahana of exhaust naheen is?",
    option:["SO₂","CO₂","CO","Fly ash (raakha)"],
    answer:"Fly ash (raakha)"
},
{
    question: "nimna in parasitic animal which-saa is?",
    option:["fish","kharagosha","sooara","uonokta sabhee"],
    answer:"uonokta sabhee"
},
{
    question: "when hama dhruva from bhoomadhyarekhaa of ora badhate are taba biodiversity",
    option:["badhatee is","ghatatee is","sthira rahatee is","none of these"],
    answer:"badhatee is"
},
{
    question: "maasika dharma of aarnbha from secretionita being having haormona of krama are",
    option:["FSH, projestaraona, thistrojena","thistrojena, FSH, projestaraona","FSH, thistrojena, projestaraona","thistrojena, projestaraona, FSH"],
    answer:"FSH, thistrojena, projestaraona"
},
{
    question: "bacteria ko kisane khojaa thaa?",
    option:["kocha","lyoovenahuka","paashchara","none of these"],
    answer:"lyoovenahuka"
},
{
    question: "ushna katibndheeya foreston in kuchha species of vilupti of main ofrana is।",
    option:["forestonmoolana","vrikshaaropana","pollution","soil aondana"],
    answer:"forestonmoolana"
},
{
    question: "nimnalikhita anu pahalaa genetic material banaa:",
    option:["DNA","RNA","protein","none of the above"],
    answer:"RNA"
},
{
    question: "among these which male gamete from snyojana karaof endosperm becomes is",
    option:["anishechita egg","sahaayaka cell","enteepodalsa","secondary nucleus"],
    answer:"secondary nucleus"
},
{
    question: "taipetama of ofrya is",
    option:["surakshaa","poshana","shvasana","uonokta sabhee"],
    answer:"poshana"
},
{
    question: "ecosystem naheen is one",
    option:["khulaa tntra","bnda tntra","asthira tntra","none of these"],
    answer:"bnda tntra"
},
{
    question: "onkhanalee infant of relationship in satya is:",
    option:["female of reproductionaanga in fertilization and onkhanalee in growth","birthpoorva infant ko thesekyoobetara in rakhanaa","reproductionaangon from baahara fertilization and uterus in development","fertilization and development uterus of baahara"],
    answer:"reproductionaangon from baahara fertilization and uterus in development"
},
{
    question: "human plefromntaa occurs",
    option:["heemokoriyala","sinadesmokoriyala","peeta kosha","heemoendotheeliyala"],
    answer:"heemokoriyala"
},
{
    question: "DNA as heliksa of one chakkara occurs:",
    option:["20 Å","2 nm","20 nm","34 nm"],
    answer:"34 nm"
},
{
    question: "among the following which-see snyukta kadaee bird and reptiles between is?",
    option:["seemairior","aarkiyopteriksa","peripetasa","dipnoee"],
    answer:"aarkiyopteriksa"
},
{
    question: "which meesodarmala origin of naheen is?",
    option:["tantariof tntra","onisncharana tntra","peshee tntra","knofla tntra"],
    answer:"tantariof tntra"
},
{
    question: "RNA relationshipna of pashchaat awhich-saa enzyme onesaona khandon ko punh whichdataa is?",
    option:["RNA paoleemareja","RNA praaimesa","RNA laaigeja","RNA protieja"],
    answer:"RNA laaigeja"
},
{
    question: "estarojana and projesterona secretionita occurs",
    option:["eggaashaya","vrishana","aonaa","kidanee"],
    answer:"aonaa"
},
{
    question: "sperm formation of kriormethod ko are called:",
    option:["spermatogenesis","femalereproduction","gametereproduction","organreproduction"],
    answer:"spermatogenesis"
},
{
    question: "AIDS for skareeninga oneekshana is:",
    option:["vestarna blaota","elisaa","PCR","saratena blaota"],
    answer:"elisaa"
},
{
    question: "disease against pratirodhakataa kisa ofrana is?",
    option:["imyoonoglobyoolina","HLA protein","pratijana","histaameena"],
    answer:"imyoonoglobyoolina"
},
{
    question: "human in kisa cord by vrishana scrotal sac from judaaa occurs?",
    option:["Gubernaculum","Ligament","Spermatic cord","Spemann"],
    answer:"Gubernaculum"
},
{
    question: "tarmaale sindroma in maujooda baara-baodee of number is",
    option:["0","1","2","8"],
    answer:"0"
},
{
    question: "kisee female in blastocyst for koar correct is?",
    option:["this Implantation from pahale plaafromntaa becomes is।","ovulation of three dina baada Implanted occurs","Implantation of baada uterus of deevaara from poshaka padaartha letaa is","Implantation with trophoblast cell by Implanted occurs"],
    answer:"Implantation with trophoblast cell by Implanted occurs"
},
{
    question: "ozone layer kisa level on is found?",
    option:["staraitosphiyara","leethosphiyara","troposphiyara","hemospheeyara"],
    answer:"staraitosphiyara"
},
{
    question: "airmndala in CO₂ of concentration in growth harmful is whyki this:",
    option:["smog banaataa is","taapa avashoshita does","shvasana relationshipee disease utpanna does","tvachaa disease utpanna does"],
    answer:"taapa avashoshita does"
},
{
    question: "embryo of development of krior ko are called:",
    option:["Vivipary","paarthenojenesisa","Embryogenesis","sporojenesisa"],
    answer:"Embryogenesis"
},
{
    question: "‘goldena raathis’ in which-saa vitamin prachura amount in rahataa is?",
    option:["vitamin A","vitamin K","vitamin E","vitamin C"],
    answer:"vitamin A"
},
{
    question: "thesein which kraaee gene crop ko chhedaka from protects is?",
    option:["cry I Ac","cry II Ab","cry I Ab","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "kisee fertilization at the time of sperm of poonchha",
    option:["egg of anrate pravesha kara jaatee is","egg of baahara hee raha jaatee is","eggaa of plaajmaamembrane up to pahunchatee is","eggaa of cytoplasm up to pahunchatee is"],
    answer:"egg of baahara hee raha jaatee is"
},
{
    question: "tissue culture by badaee number in plaantaletsa praapta karane of technique kahalaatee is।",
    option:["organa kalchara","sookshama pravarwaealth","maikropropegeshana","plaantaleta kalchara"],
    answer:"sookshama pravarwaealth"
},
{
    question: "sujaaka (gonorior) disease is:",
    option:["water janita disease","havaa janita disease","yauna snfourita disease","disease naheen is"],
    answer:"yauna snfourita disease"
},
{
    question: "enaataopasa seedaanda occurs",
    option:["seedhaa","ultaa","gola","vakra"],
    answer:"ultaa"
},
{
    question: "aburdeeya virus ofraka are:",
    option:["poliyo","kshaya-disease","peelior","cancer"],
    answer:"cancer"
},
{
    question: "among these which air pradooshaka naheen is?",
    option:["CO","CO₂","SO₂","koee bhee naheen"],
    answer:"koee bhee naheen"
},
{
    question: "kisee organism of developmenteeya itihaasa is called",
    option:["ontojenee","phaailojenee","poorvajataa","fossiliof"],
    answer:"phaailojenee"
},
{
    question: "somaitika haaibridaaijeshana snpaadita kior jaa sakataa is।",
    option:["protoplaasta snlayana by","haploid pollenkosha by","cell kalchara by","toteepotensee by"],
    answer:"protoplaasta snlayana by"
},
{
    question: "Implantation of baada Parturition occurs, thisof taatoanya is",
    option:["embryo of alaga honaa","embryo of development","birth of krior","uterus of sikudana"],
    answer:"birth of krior"
},
{
    question: "Entomophily in pollination by whom occurs",
    option:["water","insect","jaanavara","air"],
    answer:"insect"
},
{
    question: "humanon in tvachaa of rnga of vnshaagati whose one udaaharana is?",
    option:["chromosome vipathana","bindu mutation","bahugeneee vnshaagati","sahaprabhaavitaa"],
    answer:"bahugeneee vnshaagati"
},
{
    question: "indala of niyama of one apavaada is",
    option:["prabhaavitaa","yugma of shuddhataa","sahalagnataa","svatntra apavyoohana"],
    answer:"sahalagnataa"
},
{
    question: "dvikhandana one praofra of",
    option:["ofyika pravardawealth is","asexual reproduction is","sexual reproduction is","none of these"],
    answer:"asexual reproduction is"
},
{
    question: "XYY on symptom rateshaataa is",
    option:["avikasita reproductionaanga, forestdhya, avikasita chhaatee","lnbaaee in more, normal reproductionaanga development and vyathataara relationshipee samasoaren","normal oonchaaee and reproductionaanga of normal development","uonyukta in from koee naheen"],
    answer:"lnbaaee in more, normal reproductionaanga development and vyathataara relationshipee samasoaren"
},
{
    question: "khaadya utpaadana in growth hetu which-see snbhaaforestaa hama socha sakate are?",
    option:["agriculture rasaayana aadhaarita agriculture","ofrbanika agriculture","genetic aadhaarita agriculture","uonokta sabhee"],
    answer:"uonokta sabhee"
},
{
    question: "cancer of ofraka is:",
    option:["onkogenesa","aburdeeya virus","both (A) and (B)","none of these"],
    answer:"both (A) and (B)"
},
{
    question: "among the following which-saa 7 pairs contrasting characters ko naheen rateshaataa is?",
    option:["paudhon of oonchaaee","pattiyon of aaofra","Pod of aaofra","Pod of rnga"],
    answer:"Pod of aaofra"
},
{
    question: "DNA of jaancha of method is:",
    option:["aayodeena testa","phyoolajena rioneshana","rolisha testa","milaonsa reeejenta"],
    answer:"phyoolajena rioneshana"
},
{
    question: "enteebaodee chemical roopa from occurs:",
    option:["protein","lipoprotein","lipida","nyookliyoprotein"],
    answer:"protein"
},
{
    question: "'kraaee-gene' baolakrimi from kisa crop ko protects is?",
    option:["cotton","mango","chaaya","wheat"],
    answer:"cotton"
},
{
    question: "praaimarsa (Primers) of use is done:",
    option:["PCR","kloninga in","DNA snsaawealth in","none of these"],
    answer:"PCR"
},
{
    question: "one dvivaleeya DNA anu in two valayon of vinoarsa occurs:",
    option:["one main aksha of fouron ora kundalee by","one-doosare of ooon kundalita by","vibhinna roopon in kundalita","protein aavarana of ooon kundalita"],
    answer:"one main aksha of fouron ora kundalee by"
},
{
    question: "poorna linofja dikhaaee padatee is",
    option:["maize in","staree in","female drosophilaa in","male drosophilaa in"],
    answer:"male drosophilaa in"
},
{
    question: "among the following which pattee of agra bhaaga by reproduction does?",
    option:["vaakinga pharna","sparaauta leepha plant","maaraofsior","maosa"],
    answer:"vaakinga pharna"
},
{
    question: "gene ko sistaraona, rikaona and myootaona as kisane onibhaashita kior thaa?",
    option:["jaiwhen and monoda","britana and devidasana","vaatasana and krika","benjara"],
    answer:"benjara"
},
{
    question: "airmndaleeya naaitrojana ko which sthireekrita does?",
    option:["saatheseobacteria","algae","virus","none of these"],
    answer:"saatheseobacteria"
},
{
    question: "human saadhaaranataor dhfaoresti teevrataa sahana kara sakataa is:",
    option:["20–30 deseebael","80–90 deseebael","120–130 deseebael","140–150 deseebael"],
    answer:"120–130 deseebael"
},
{
    question: "airmndaleeya aardarataa ko kisafrom maapaa jaataa is?",
    option:["okfaromnomeetara","haaigromeetara","photomeetara","potomeetara"],
    answer:"haaigromeetara"
},
{
    question: "Amphimixis from taatoanya is",
    option:["Antifertilizin and Fertilizin protein between pratikrior","male and female pratinucleuson of snyojana","egg by sngrahee shnku of formation","sperm by egg of chhedana"],
    answer:"male and female pratinucleuson of snyojana"
},
{
    question: "embryoaavasthaa in sabhee tissue of formation kisafrom occurs?",
    option:["Ectoderm","Mesoderm","Endoderm","Stem cells"],
    answer:"Stem cells"
},
{
    question: "kisa of RNA klovara leepha maodala occurs?",
    option:["t-RNA","r-RNA","hn-RNA","m-RNA"],
    answer:"t-RNA"
},
{
    question: "birth from lekara natural mrityu between of avasthaa ko are called:",
    option:["organismna-ofla","organismna chakra","ofyika avasthaa","sabhee"],
    answer:"organismna-ofla"
},
{
    question: "population more being from koar occurs?",
    option:["aaya in lessee","jameena in lessee","khanija padaartha of lessee","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "paudhon of jadaon in tyoomara paidaa does:",
    option:["E. coli","egrobaikteeriyama","tharmasa onevetikasa","none of these"],
    answer:"egrobaikteeriyama"
},
{
    question: "daatra cell abloodtaa in beetaa globina gene of GAG codon of kisa codon from pratisthaapana ho jaataa is?",
    option:["GUG","GCG","GGG","none of the above"],
    answer:"GUG"
},
{
    question: "DNA ko dekhane for is used:",
    option:["itheediyama bromaaida","eneeleena bloo","fromphreneena","phaasta greena"],
    answer:"itheediyama bromaaida"
},
{
    question: "three onton having snrachanaa jisaof anrate one nayee guhaa aadyntra (Archenteron) bana gayee is, kahalaatee is:",
    option:["blaastoolaa","gaistarulaa","cleavage","none of these"],
    answer:"gaistarulaa"
},
{
    question: "among these which one jaiva khaada naheen is?",
    option:["awhichtobaiktara","baisilasa thurinjiensisa","klaostaridiyama","awhichlaa"],
    answer:"baisilasa thurinjiensisa"
},
{
    question: "kolaa, chaaya va koko in found jaane having uttejaka is:",
    option:["koofna","tenina","empheetaameena","kaipheena"],
    answer:"kaipheena"
},
{
    question: "svapollination for one flower ko honaa chaahie",
    option:["alaingika","onelalingee","onelingee","dvilingee"],
    answer:"dvilingee"
},
{
    question: "mango of phala in khaane having bhaaga is –",
    option:["baahya phala wall","madhya phala wall","anth phala wall","none of these"],
    answer:"madhya phala wall"
},
{
    question: "among the following from which vilupta praanee is?",
    option:["lion","dodo","mora","among these sabhee"],
    answer:"dodo"
},
{
    question: "aavrittaseediyon in female gameteodbhid ais called",
    option:["endosperm","embryokosha","embryo","yugmanaja"],
    answer:"embryokosha"
},
{
    question: "anupravaaha snsaawealth in koar occurs?",
    option:["separation","showealth","separation and showealth","utpaadana"],
    answer:"separation and showealth"
},
{
    question: "cancer beemaaree of treatment is:",
    option:["surgical-chikitsaa","ofmotheraipee","rediyotheraipee","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "breda banaane in thistemaala occurs:",
    option:["bacterium","bekara yeesta","syoodomonaasa","none of these"],
    answer:"bekara yeesta"
},
{
    question: "if mother of blood group A and father of AB ho to infant of blood-samooha koar can be?",
    option:["AB","A or B","A, B or AB","O only"],
    answer:"A, B or AB"
},
{
    question: "genetics of father kifrom are called?",
    option:["indala","maorgana","lemaarka","di vreeja"],
    answer:"indala"
},
{
    question: "among the following biotechnology of anusnpaddy area which-saa is?",
    option:["thosenata organisms of formation karanaa","sarvottama onisthitiyon of formation karanaa","protein/ofrbanika yaugika of shuddhikarana in use karanaa","uonokta sabhee"],
    answer:"uonokta sabhee"
},
{
    question: "yookairiotsa in paae jaane having naonakodinga krama ko koar are called?",
    option:["promotara","onesona","introna","vikhndita gene"],
    answer:"introna"
},
{
    question: "RU-486 davaa experiment is done:",
    option:["pregnancynirowealth in","emniyofromntesisa","pregnancypaata ofraka as","myootaajana as"],
    answer:"pregnancypaata ofraka as"
},
{
    question: "startolee cells paayee jaatee are",
    option:["vrishana in","uterus in","eggaashaya in","yakrita in"],
    answer:"vrishana in"
},
{
    question: "bhopaala gaisa traasadee kisa gaisa of risaava from huee?",
    option:["PAN","smaoga","mithaaila aathisosaatheseeta","SO₂"],
    answer:"mithaaila aathisosaatheseeta"
},
{
    question: "maaikrosporenjiyama of aantarika wall which poshaka is, ufrom koar are called",
    option:["endotheesiyama","intaathese","taipeetama","madhya level"],
    answer:"taipeetama"
},
{
    question: "that sthaana jahaan ovule, ovulevrinta from judataa is",
    option:["Chalaza","ovuledvaara","ovuleofya","naabhiof"],
    answer:"naabhiof"
},
{
    question: "tamaatara of traansajenika variety is:",
    option:["beetee cotton","paamaphreta","phlevara fromvara","none of these"],
    answer:"phlevara fromvara"
},
{
    question: "DNA from mRNA banaane of krior ko koar are called?",
    option:["traansakripshana","ripliofshana","traansaleshana","none of these"],
    answer:"traansakripshana"
},
{
    question: "when sntati of origin onela janaka by is taba this koar is called?",
    option:["sexual reproduction (sexual reproduction)","asexual reproduction (asexual reproduction)","both (A) and (B)","aantarika fertilization (Internal fertilization)"],
    answer:"asexual reproduction (asexual reproduction)"
},
{
    question: "SO₂ pollution from prabhaavita occurs:",
    option:["maaitokaondarior","kloroplaasta","gaoljee niofya","ER"],
    answer:"kloroplaasta"
},
{
    question: "Nodes ko ‘aankha’ are called, which among the following in which naor plant banaate are?",
    option:["arateka","braayophaayalama","eloofsior","aaloo"],
    answer:"aaloo"
},
{
    question: "human in ABO blood group of nirdhaarana three alleles from occurs। thesefrom kitane genotypes snbhava are?",
    option:["3","4","6","8"],
    answer:"6"
},
{
    question: "plant culture occurs।",
    option:["putndu","punofsara","pollenkosha","punmnga"],
    answer:"pollenkosha"
},
{
    question: "jela vaidyuta of snchalana (ilektarophoresisa) of use occurs:",
    option:["DNA ko prithaka karane for","RNA ko prithaka karane for","protein ko prithaka karane for","sabhee ko prithaka karane for"],
    answer:"sabhee ko prithaka karane for"
},
{
    question: "fertilization at the time of kisee praaroopika dvicotyledonee (Polygonum) of female gametophyte are",
    option:["8-nucleuseeya 7-kosheeya","7-nucleuseeya 8-kosheeya","4-nucleuseeya 4-kosheeya","8-nucleuseeya 8-kosheeya"],
    answer:"8-nucleuseeya 7-kosheeya"
},
{
    question: "nimnalikhita gaison ko normalth greenhouse gas are called:",
    option:["CFC, CH₄, N₂O and CO₂","CFC, CO₂, NH₃ and N₂","CO₂, CO, NH₃ and NO₂","CFC, N₂, CO₂ and NH₂"],
    answer:"CFC, CH₄, N₂O and CO₂"
},
{
    question: "Polynology in whose adhyayana do",
    option:["pollen grain","bera","flower","phala"],
    answer:"pollen grain"
},
{
    question: "kolastarama in found jaane having enteebaodee of praofra is:",
    option:["IgA","IgG","IgD","IgE"],
    answer:"IgA"
},
{
    question: "cheetiyon by pollination ko koar are called",
    option:["oranithophilee","maarameekophilee","malekophilee","ofonoteerophilee"],
    answer:"maarameekophilee"
},
{
    question: "anulekhana at the time of if DNA valayaka of nucleotide krama ko ATACG by kodita is done, to mRNA in nucleotide of krama hogaa:",
    option:["UATGC","TATGC","TCTGC","UAUGC"],
    answer:"UAUGC"
},
{
    question: "yauna-snfourita disease is:",
    option:["klaimaaidior","AIDS","harpisa","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "DNA among these whose genetic material is?",
    option:["tee०ema०vee०","baikteeriyopheja","among these both of","kisee of naheen"],
    answer:"baikteeriyopheja"
},
{
    question: "pratimaajaka (Anticoagulant) hirudina paayee jaatee is:",
    option:["sarpa in","chhipakalee in","whichnka in","bichchhoo in"],
    answer:"whichnka in"
},
{
    question: "kukkuta paalana in koksidiyosisa of disease ofrana is।",
    option:["protozoa parasitic","nimaitoda parasitic","virus","pheetaakrimi"],
    answer:"protozoa parasitic"
},
{
    question: "mutation prerita kie jaa sakate are",
    option:["ethileena by","ithaaila alkohala by","gaamaa radiationon by","avablood radiationon by"],
    answer:"gaamaa radiationon by"
},
{
    question: "‘vinegaara’ of khattaa svaada kisadue to occurs?",
    option:["laiktika amla","esitika amla","byootaairika amla","phyoomerika amla"],
    answer:"esitika amla"
},
{
    question: "rhinoceros abhoarranya kisa raajya in avasthita is?",
    option:["asama","pashchima bngaala","uttara pradesha","bihaara"],
    answer:"asama"
},
{
    question: "dudhavaa national park sthita is",
    option:["lakheemapura kheeree in","mathuraa in","naineetaala in","ofshee in"],
    answer:"lakheemapura kheeree in"
},
{
    question: "kuchha enzyme apanee kriorsheelataa ko badhaaane for which-saa naona-protein padaartha experiment do?",
    option:["utpareraka","pratirodhaka","saha-enzyme","epimara"],
    answer:"saha-enzyme"
},
{
    question: "ethenaola of audyogika utpaadana in is used:",
    option:["laiktobaisilasa","ewhichbaiktara","penisiliyama","saiofromaathiseeja"],
    answer:"saiofromaathiseeja"
},
{
    question: "pregnancy of first gati and thisof sira on baalon of upasthiti praayh pregnancyaavasthaa of kisa maaha during anubhava is?",
    option:["chauthe maaha","fiveven maaha","chhathe maaha","teesare maaha"],
    answer:"fiveven maaha"
},
{
    question: "airmndaleeya naaitrojana ko among the following which sthireekrita kara sakataa is?",
    option:["ainaabeenaa","naosataoka","osiletorior","all of the above"],
    answer:"all of the above"
},
{
    question: "among the following which-saa theory development ko gene aavritti of onivartana of ofrana maanataa is?",
    option:["nava-laamaarkijma","nava-daarvinijma","synthesisaatmaka theory","daarvinijma"],
    answer:"synthesisaatmaka theory"
},
{
    question: "maasika chakra of avasthaa which 7-8 dinon on samaapta is, kahalaatee is",
    option:["rawhichdharma","lutiyala praavasthaa","andotsarga praavasthaa","putiofya praavasthaa"],
    answer:"putiofya praavasthaa"
},
{
    question: "drosophilaa (Fruit fly) of Meiocyte in of chromosome number is:",
    option:["2","4","6","8"],
    answer:"8"
},
{
    question: "transfer of process relationshipita is:",
    option:["DNA synthesis","RNA synthesis","raaibosoma synthesis","protein synthesis"],
    answer:"protein synthesis"
},
{
    question: "food chain in sarvaadhika aabaadee whose is?",
    option:["producer","primary consumer","secondary consumer","tertiary consumer"],
    answer:"producer"
},
{
    question: "India of pahalaa national park is",
    option:["kaorbeta","baandeepura","ofnhaa","periorra"],
    answer:"kaorbeta"
},
{
    question: "badae paimaane on vaanchhita protein of formation for producer by kisa paatra of use is done?",
    option:["baayorionetara","phlaaska","testa tyooba","petree pletsa"],
    answer:"baayorionetara"
},
{
    question: "one vayaska human of vrishana in sperm of formation karane having shukrareproductioneeya avasthaaon of correct krama is",
    option:["soanmetosaaita-soanmetogonior-soanmetida-sperm","soanmetida-soanmetosaaita-soanmetogonior-sperm","soanmetosaaita-soanmetida-soanmetogonior-sperm","soanmetogonior-soanmetosaaita-soanmetida-sperm"],
    answer:"soanmetogonior-soanmetosaaita-soanmetida-sperm"
},
{
    question: "frommala in by whom pollination occurs",
    option:["chamagaadada","bird","water","air"],
    answer:"chamagaadada"
},
{
    question: "one primary sperm cell is",
    option:["diploid","haploid","triploid","bahucharacterita"],
    answer:"diploid"
},
{
    question: "India in pahalaa raashtareeya park vikasita kior gaor",
    option:["gira","ofjeerngaa","jima ofrbeta","none of these"],
    answer:"jima ofrbeta"
},
{
    question: "dvifertilization of oninaama occurs:",
    option:["cotyledon","ovuleofya","endosperm","embryo"],
    answer:"endosperm"
},
{
    question: "kisa gaira-phalee plants of jada pinda in jaivika khaada maujooda is?",
    option:["ewhichtobaiktara","klaostaridiyama","phrainkior","none of these"],
    answer:"phrainkior"
},
{
    question: "pollen grain with pollennaliof pratirateshita does",
    option:["male sporophaaita","male gaimetophaaita","female sporophaaita","female gaimetophaaita"],
    answer:"male gaimetophaaita"
},
{
    question: "offspring which about one-doosare of Identical ho, with hee thoseof Parent of bhee Identical ho, kahalaatee is:",
    option:["Twins","copy banaataa is","dronsa","klona"],
    answer:"klona"
},
{
    question: "tela adhiplaava (chhalakana) of jaivopafour in saphalataapoorvaka use of heredity ingeneiyarita sookshamaorganism speesheeja whose is?",
    option:["syoodomonaasa","traaikodarmaa","jaithomonaasa","besilasa"],
    answer:"syoodomonaasa"
},
{
    question: "RNA of paairimidina in is found:",
    option:["saaitosina and thaayameena","edineena and guaaneena","saaitosina and yooraasila","thaayameena and yooraasila"],
    answer:"saaitosina and yooraasila"
},
{
    question: "daathose sindroma is",
    option:["21ven kromosoma of trisootree","21ven kromosoma of dviadhisootree","21ven kromosoma of dvinyoonasootree","uonokta in koee naheen"],
    answer:"21ven kromosoma of trisootree"
},
{
    question: "maansaahaaree organism among the following koar prarateshita does",
    option:["primary consumer","secondary va tertiary consumer","secondary consumer","primary producer"],
    answer:"secondary va tertiary consumer"
},
{
    question: "pondeeya ecosystem in badaee fish koar is?",
    option:["producer","apaghatanakartaa","primary consumer","tertiary consumer"],
    answer:"tertiary consumer"
},
{
    question: "among the following which-saa pyramid kabhee ultaa naheen hotaa?",
    option:["energy of pyramid","jaivabhaara of pyramid","number of pyramid","shushka bhaara of pyramid"],
    answer:"energy of pyramid"
},
{
    question: "aaloo of kanda in ‘aankhen’ isn:",
    option:["flower kaliofen","praroha kaliofen","kakshastha kaliofen","moola kaliofen"],
    answer:"kakshastha kaliofen"
},
{
    question: "among the following which-saa blood group human and ape in is found on monkey in naheen?",
    option:["A and O","A and B","AB and O","B and AB"],
    answer:"A and B"
},
{
    question: "anulekhana in bhaaga lene having enzyme is:",
    option:["DNA paoleemareja I","DNA paoleemareja II","RNA paoleemareja","DNA paoleemareja III"],
    answer:"RNA paoleemareja"
},
{
    question: "kisee bhee ecosystem in energy of srota occurs",
    option:["sugar of kinfaorest","praanee and paudhon of bacteriumon by apaghatana","paudhon by light synthesis","soorya-light"],
    answer:"soorya-light"
},
{
    question: "phaosphorasa among the following whose factor is?",
    option:["nyooklika amla","jaivika jhilliorn","koshiofya energy transfer pranaalee","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "nikoteena is:",
    option:["kshaareeya","amino acid","amino acid","vitamin"],
    answer:"kshaareeya"
},
{
    question: "amleeya rainfall due to are:",
    option:["N₂ and NO₃","NO₂ and SO₂","CO and CO₂","CO₂ and NO₂"],
    answer:"NO₂ and SO₂"
},
{
    question: "among the following alpaoflika anthsecretionee grnthi of ofrya does",
    option:["andaashaya","vrishana","graaphee putaka","kaorpasa lyootiyama"],
    answer:"kaorpasa lyootiyama"
},
{
    question: "onkolaojee whose adhyayana is?",
    option:["cancer","onkogenesa","both (A) and (B)","virus"],
    answer:"cancer"
},
{
    question: "among the following which Anther wall of hissaa naheen is",
    option:["Endothecium","Endothelium","Tapetum","Middle layers"],
    answer:"Endothelium"
},
{
    question: "prostaaglaindeena is",
    option:["protein","ofrbohaaidreta","lipida","asntripta"],
    answer:"asntripta"
},
{
    question: "birth control of sarvaadhika upayukta method is:",
    option:["pregnancypaata","mukheeya goliorn","veeryafromchana","bndhoarkarana"],
    answer:"bndhoarkarana"
},
{
    question: "thakoaf sphotana as use in laaor jaane having enjaaima is:",
    option:["laaipeja","emaaileja","stareptooftheseeja","proteeejeja"],
    answer:"stareptooftheseeja"
},
{
    question: "onposhee cells in vijaateeya DNA ko pravesha karaane for kinaof use is done?",
    option:["sookshama anthkshepana","gene gun","aharmful pathogen","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "which-saa utpaada aushadheeya mahattava of is?",
    option:["pethaa","kaophee","gredee phloraa","raaulphior sarpentinaa"],
    answer:"raaulphior sarpentinaa"
},
{
    question: "among the following which correct aahaara shrrinkhalaa is?",
    option:["tiddaa → ghaasa → sarpa → indhaka → baaja","ghaasa → tiddaa → indhaka → sarpa → baaja","baaja → sarpa → tiddaa → ghaasa → indhaka","indhaka → sarpa → baaja → tiddaa → baaja"],
    answer:"ghaasa → tiddaa → indhaka → sarpa → baaja"
},
{
    question: "floweringya paudhon of endosperm in kitane chromosome are",
    option:["n","2n","3n","4n"],
    answer:"3n"
},
{
    question: "Ti-plaajmida is found:",
    option:["egrobaiktiriyama tyoomeepheseeyansa in","ee. kolaaee in","bacterium bhojee in","among these sabhee in"],
    answer:"egrobaiktiriyama tyoomeepheseeyansa in"
},
{
    question: "virus aakramana from bachaava for bacterium by utpaadita occurs:",
    option:["Exonuclease","Endonuclease","DNA ligeja","gaaireja"],
    answer:"Endonuclease"
},
{
    question: "among these pashchavirus (Retrovirus) which is?",
    option:["hyoomana imyoono dephisiensee vaayarasa","hepetaaitisa vaayarasa","maaikro vaayarasa thesephlooenjee","among these sabhee"],
    answer:"hyoomana imyoono dephisiensee vaayarasa"
},
{
    question: "if kisee ecosystem from decomposeron ko nashta kara dior jaae to koar hogaa?",
    option:["energy of pravaaha ruka jaaegaa","khaniwhichn of pravaaha ruka jaaegaa","apaghatana of rate badha jaaegee","lightsynthesis of krior ruka jaaegee"],
    answer:"khaniwhichn of pravaaha ruka jaaegaa"
},
{
    question: "dugdha grnthi whose roopaantarana is?",
    option:["tela grnthi","sved agrnthi","ofuonsa grnthi","bartholinsa grnthi"],
    answer:"sved agrnthi"
},
{
    question: "‘smaoga’ kisafrom relationshipita is?",
    option:["dhuaan and kuhaasaa","aaga and water","water and dhuaan","air and water"],
    answer:"dhuaan and kuhaasaa"
},
{
    question: "klorophloroofrbana uttaradaayee is:",
    option:["amla rainfall","ozone layer ksharana for","gloforce vaarminga for","taapeeya pratilomana for"],
    answer:"ozone layer ksharana for"
},
{
    question: "Ovule of sabafrom badaee cell is",
    option:["MMC","onivartanasheela cell of aaofra","madhya cell","Antipodal"],
    answer:"madhya cell"
},
{
    question: "that vaijnyaanika of name what is jisane vnshaagati of niyama die?",
    option:["gregara indala","nyootana","puneta","none of these"],
    answer:"gregara indala"
},
{
    question: "India in jaivamandala rijarva when praarambha kior thaa?",
    option:["1984","1985","1986","1987"],
    answer:"1986"
},
{
    question: "kisafor laingika reproduction jimmedaara is?",
    option:["diploid avasthaa ko banaane hetu","Identical young ones of srijana hetu","evolutionism in koee landof naheen","haploid (Haploid) avasthaa ko banaane hetu"],
    answer:"diploid avasthaa ko banaane hetu"
},
{
    question: "onerosoma bhaaga is",
    option:["dee.ena.e. (DNA)","aara.ena.e. (RNA)","sperm of","among these sabhee of"],
    answer:"sperm of"
},
{
    question: "kisee ovule of shareera, embryo sac, micropyle and funicle if one seedha in ho to ifrom are called",
    option:["Orthotropous","Amphitropous","Anatropous","Campylotropous"],
    answer:"Orthotropous"
},
{
    question: "vnshaagati of kromosoma theory ko kisane proposed kior?",
    option:["gregara indala ne","satana and boveree ne","thaomasa maorgana ne","vaatasana and krika ne"],
    answer:"satana and boveree ne"
},
{
    question: "leechee of khaane yogya bhaaga is",
    option:["Endosperm","Mesocarp","Fleshy aril","Pericarp"],
    answer:"Fleshy aril"
},
{
    question: "first amphibians praanee as vikasita fish which aaja of indhaka and sailaamaindara of poorvaja bane",
    option:["seelaakaintha","lngaphisha","staaraphisha","none of the above"],
    answer:"lngaphisha"
},
{
    question: "indala of Segregation Law of relationship mainth kisafrom is?",
    option:["monohaaibrida kraosa","haaibrida kraosa","dvisnkara kraosa","chromosome between homologasa pairs"],
    answer:"monohaaibrida kraosa"
},
{
    question: "amleeya rainfall is:",
    option:["fossil eenwealth of dahana from","see.epha.see. from","owhichna from","none of these"],
    answer:"fossil eenwealth of dahana from"
},
{
    question: "nndanaofnana chidaiorghara jaanaa jaataa is",
    option:["neelagiri taaigara for","hippopotemasa for","sapheda taaigara for","hvela for"],
    answer:"sapheda taaigara for"
},
{
    question: "kisee on-pollination of vishishta udaaharana is",
    option:["wheat","tamaatara","aaloo","maize"],
    answer:"maize"
},
{
    question: "kisee A blood-samooha having vyakti in occurs",
    option:["enteejana A, enteebaodee B","enteejana B, enteebaodee A","enteejana A, enteebaodee B","enteejana A, enteebaodee anupasthita"],
    answer:"enteejana A, enteebaodee B"
},
{
    question: "ovule in ardhasootree vibhaajana occurs",
    option:["ovuleofya in","guruseedaanu maatri cell in","guruseedaanu in","aaroafsporiyama in"],
    answer:"guruseedaanu maatri cell in"
},
{
    question: "population more being from:",
    option:["prati vyakti aaya less ho jaaegee","prati vyakti aaya badha jaaegee","janasaadhaarana of svaasthaya achchhaa ho jaaegaa","among these sabhee"],
    answer:"prati vyakti aaya less ho jaaegee"
},
{
    question: "dapha (sanaa huaa aataa) among these kisadue to mulaayama (haloaf) occurs?",
    option:["ofrbana daayaoksaaida","mithena","okseejana","none of these"],
    answer:"ofrbana daayaoksaaida"
},
{
    question: "indala of Independent Assortment kisa kraosa from relationshipita is?",
    option:["onela haaibrida kraosa","dvisnkara haaibrida kraosa","apoorna varchasva","baika kraosa"],
    answer:"dvisnkara haaibrida kraosa"
},
{
    question: "human in sperm of sngrahana and poshana in which occurs?",
    option:["vrishana","vasa efferentia","epididaaimisa","spermatic cord"],
    answer:"epididaaimisa"
},
{
    question: "kisee Pure tall pea of plants ko pure baune plants with kraosa karaaor gaor। F1 vnshaja of saare plants tall praapta hue। thisof ofrana is",
    option:["Dominance","F1 vnshaja in baunaapana of character of cowba honaa","factoron of segregation","saamnjasya/samanvaya"],
    answer:"Dominance"
},
{
    question: "oofjaaof khanda is:",
    option:["RNA praaimarsa","leedinga starenda on RNA of chhote khanda","lejinga starenda on DNA of chhote khanda","none of these"],
    answer:"lejinga starenda on DNA of chhote khanda"
},
{
    question: "eggaashaya of anrate of tissue bhaaga which ovules with judaaa occurs, is called",
    option:["Funicle","Hilum","Placenta","Chalaza"],
    answer:"Placenta"
},
{
    question: "tee.bee. kisafrom occurs?",
    option:["gonorior from","maaikobaikteeriyama from","traiponemaa from","baisilasa from"],
    answer:"maaikobaikteeriyama from"
},
{
    question: "sperm of aksheeya filament kisafrom becomes is?",
    option:["sameepastha vartuliof","doorastha vartuliof","maaitokondrior","nucleus"],
    answer:"doorastha vartuliof"
},
{
    question: "among the following which insectbhakshee plant is?",
    option:["draofromraa","nepentheesa","both (A) and (B)","Hydrilla"],
    answer:"both (A) and (B)"
},
{
    question: "traansajenika jaanavara of udaaharana is:",
    option:["cow","choohaa","sooara","among these sabhee"],
    answer:"among these sabhee"
},
{
    question: "milara-yoore experiment in kisa gaisa of mishrana phlaaska in lior gaor thaa?",
    option:["mithena, amonior and CO₂","mithena, amonior, haaidrojana and watervaashpa","mithena, amonior and naaitrojana","CO₂, naaitrojana and watervaashpa"],
    answer:"mithena, amonior, haaidrojana and watervaashpa"
},
{
    question: "T-limphosaaita where is produced?",
    option:["thaaimasa in","mangoaashaya in","yakrita in","asthi-majjaa in"],
    answer:"asthi-majjaa in"
},
{
    question: "that which doosare due to bhojana praapta does:",
    option:["parasitic","insectaahaaree","onbhakshee","symbiotic"],
    answer:"parasitic"
},
{
    question: "kisee organism in two samaana allele hon to are called",
    option:["haaibrida","samajaata","toxinmajaata","varchasvataa"],
    answer:"samajaata"
},
{
    question: "raata in khilane having flower saadhaaranath ______।",
    option:["haloaf are","chhote are","chamaofle rngon having are","gachchhon in khilate are"],
    answer:"haloaf are"
},
{
    question: "geneticsya abhiorntriof in prayukta aanvika kainchee is:",
    option:["DNA laaigeja","DNA paoleemareja","heliofja","ristarikshana endonyookliaija"],
    answer:"ristarikshana endonyookliaija"
},
{
    question: "Gonorrhoea and Syphilis where highest is found?",
    option:["aphreekana deshon in","yooropiyana deshon in","poore vishva in","eshiyana deshon in"],
    answer:"poore vishva in"
},
{
    question: "organisms in reproduction of krior is",
    option:["organisms of number in growth for","prithvee on organismna of nirntarataa banaaye rakhane for","apanee species of organisms ko banaaye rakhanaa","(A), (B) and (C) threeon"],
    answer:"(A), (B) and (C) threeon"
},
{
    question: "endosperm in kitane chromosome are (floweringya paudhon in)",
    option:["n","2n","3n","(A) and (C) both"],
    answer:"3n"
},
{
    question: "pollen grain Embryo sac from jisa praofra relationshipita is, thatee praofra",
    option:["sperm egg from","male gametophyte female gametophyte from","male gametophyte egg from","sperm female gametophyte from"],
    answer:"male gametophyte female gametophyte from"
},
{
    question: "shalka knda (Bulb) of udaaharana is:",
    option:["arateka","dooba ghaasa","poarja","aaloo"],
    answer:"poarja"
},
{
    question: "kisee anishechita eggja from seed of development ko are called:",
    option:["viviperasa","paarthenokopee","epogemee","eposporee"],
    answer:"paarthenokopee"
},
{
    question: "spermatogenesis of control by whom occurs?",
    option:["endrojana","estarojana","L.H.","none of these"],
    answer:"endrojana"
},
{
    question: "one badae areaeeya, bhaumika iofee ko vishaala forestspati praofra and relationshipita phaunaa by jaanaa jaataa is:",
    option:["laindasoafpa","baayoma","paaritntra","community"],
    answer:"baayoma"
},
{
    question: "daayanaasora kisa yuga during upasthita the?",
    option:["peliyowhichika","preekaimbariyana","seenowhichika","mesowhichika"],
    answer:"mesowhichika"
},
{
    question: "peneesilina pratijaivika is produced:",
    option:["plants","virus","P. notatum","krimi"],
    answer:"P. notatum"
},
{
    question: "one praaroopika aavrittaseedee embryokosha praayh is",
    option:["one-koshiofya","two-koshiofya","five-koshiofya","seven-koshiofya"],
    answer:"seven-koshiofya"
},
{
    question: "asamajaata chromosomes of khnda of aadaana-pradaana is called",
    option:["kraosinga ovara","Inversion","Duplication","Translocation"],
    answer:"Translocation"
},
{
    question: "that animal which apane shareera of one tihaaee bhaara of baraabara water of lessee sahana kara sakataa is:",
    option:["nektayoorasa","oonta","chhipakalee","ofitona"],
    answer:"oonta"
},
{
    question: "if DNA in 10 valaya hon, to DNA of lnbaaee hogee:",
    option:["34 Å","340 Å","640 Å","64 Å"],
    answer:"340 Å"
},
{
    question: "among the following in which oestrus cycle naheen occurs?",
    option:["cow","bheda","monkey","dog"],
    answer:"monkey"
},
{
    question: "birth rate 100 pratishata is and death rate 10 is। samashti community in 1000 vyakti special are। natural growth rate kitanaa pratishata hogaa?",
    option:["0.09%","9.0%","0.9%","90%"],
    answer:"9.0%"
},
{
    question: "puneta varga vikasita kior",
    option:["indala ne","vaatasana and satana ne","regeneelda puneta ne","boveree ne"],
    answer:"regeneelda puneta ne"
},
{
    question: "pollenkosha wall in among these which-saa naheen occurs",
    option:["endothisiyama","madhya onten","taipeetama","integuinta"],
    answer:"integuinta"
},
{
    question: "egge of organismna-ofla is",
    option:["48 ghnte","12 ghnte","24 ghnte","8 ghnte"],
    answer:"24 ghnte"
},
{
    question: "ecosystem in control karane having ofraka occurs",
    option:["soil namee","bhojana","shiofra karanaa","taapa"],
    answer:"shiofra karanaa"
},
{
    question: "oniendosperm (Perisperm) whose bachaa huaa bhaaga is",
    option:["seedaandaofya (nucellus)","endosperm (embryo)","endosperm (endosperm)","adhoarvarana (integument)"],
    answer:"seedaandaofya (nucellus)"
},
{
    question: "air by sthaanaantarita soil is:",
    option:["ailuviyala","glaisiyala","koluviyala","iyolina"],
    answer:"iyolina"
},
{
    question: "Bt cotton pratirodhee is:",
    option:["insect of","khara-patavaaranaashee of","lavana of","sookhaa of"],
    answer:"insect of"
},
{
    question: "EcoRI of enzyme srota is:",
    option:["BamHI","E. coli","BamHI and E. coli both","HindIII"],
    answer:"E. coli"
},

];

// --- Helper: Shuffle questions ---
const shuffleQuestions = (questions) => {
  const shuffled = [...questions];
  for (let i = shuffled.length - 1; i > 0; i--) {
    const j = Math.floor(Math.random() * (i + 1));
    [shuffled[i], shuffled[j]] = [shuffled[j], shuffled[i]];
  }
  return shuffled;
};

// --- Component ---
export default function Biology12thQuiz() {
  const [started, setStarted] = useState(false);
  const [submitted, setSubmitted] = useState(false);
  const [timer, setTimer] = useState(3600); // 60 minutes = 3600 seconds
  const [language, setLanguage] = useState('hi');
  const [questions, setQuestions] = useState([]);
  const [current, setCurrent] = useState(0);
  const [answers, setAnswers] = useState({});
  const [score, setScore] = useState(0);
  const [resultDetails, setResultDetails] = useState([]);
  const [showTimerWarning, setShowTimerWarning] = useState(false);
  const resultRef = useRef(null);

  useEffect(() => {
    if (started && !submitted && timer > 0) {
      const t = setInterval(() => {
        setTimer((p) => {
          if (p <= 60) setShowTimerWarning(true);
          return p - 1;
        });
      }, 1000);
      return () => clearInterval(t);
    }
    if (timer === 0 && started && !submitted) {
      submitExam();
    }
  }, [started, submitted, timer]);

  const startExam = () => {
    const questionBank = language === 'hi' ? biologyHindi : biologyEnglish;
    // Select only 100 questions (all of them)
    const selectedQuestions = shuffleQuestions(questionBank).slice(0, 100);
    setQuestions(selectedQuestions);
    setStarted(true);
    setTimer(3600);
    setAnswers({});
    setCurrent(0);
    setShowTimerWarning(false);
  };

  const submitExam = () => {
    let s = 0;
    const details = questions.map((q, i) => {
      const isCorrect = answers[i] === q.answer;
      if (isCorrect) s++;
      return {
        question: q.question,
        option: q.option,
        correctAnswer: q.answer,
        userAnswer: answers[i] || (language === 'hi' ? "प्रयास नहीं किया" : "Not Attempted"),
        isCorrect: isCorrect,
        isAttempted: answers[i] !== undefined,
      };
    });
    setScore(s);
    setResultDetails(details);
    setSubmitted(true);
  };

  const toggleLanguage = () => {
    if (!started) {
      setLanguage(language === 'hi' ? 'en' : 'hi');
    }
  };

  const downloadResult = () => {
    if (resultRef.current) {
      const printWindow = window.open('', '_blank');
      if (printWindow) {
        const content = resultRef.current.innerHTML;
        printWindow.document.write(`
          <html>
            <head>
              <title>${language === 'hi' ? 'जीव विज्ञान 12वीं परिणाम' : 'Biology 12th Result'}</title>
              <style>
                body { font-family: Arial, sans-serif; padding: 20px; }
                .result-container { max-width: 800px; margin: 0 auto; }
                .header { text-align: center; padding: 20px; background: linear-gradient(135deg, #1a237e, #3f51b5); color: white; border-radius: 10px; margin-bottom: 20px; }
                .score-card { text-align: center; padding: 20px; border: 2px solid #1a237e; border-radius: 10px; margin-bottom: 20px; }
                .score { font-size: 40px; font-weight: bold; color: #1a237e; }
                .status { font-size: 20px; margin: 10px 0; }
                .pass { color: #28a745; }
                .fail { color: #dc3545; }
                .question-item { padding: 15px; margin: 10px 0; border-radius: 8px; border-left: 4px solid #48bb78; background: #f8f9fa; }
                .question-item.wrong { border-left-color: #dc3545; background: #fff5f5; }
                .question-item .q { font-weight: bold; font-size: 14px; }
                .question-item .your-answer { margin-top: 5px; font-size: 13px; }
                .question-item .correct-answer { margin-top: 3px; font-size: 13px; color: #28a745; font-weight: bold; }
                .wrong-answer { color: #dc3545; }
                .correct-answer-text { color: #28a745; }
                .not-attempted { color: #ffc107; }
                .footer { text-align: center; margin-top: 20px; padding: 10px; color: #666; font-size: 12px; border-top: 1px solid #ddd; }
              </style>
            </head>
            <body>
              <div class="result-container">
                ${content}
              </div>
            </body>
          </html>
        `);
        printWindow.document.close();
        printWindow.print();
      }
    }
  };

  const getText = (key) => {
    const texts = {
      'title': { hi: '🧬 जीव विज्ञान 12वीं', en: '🧬 Biology 12th' },
      'subtitle': { hi: 'कक्षा 12 जीव विज्ञान प्रश्नोत्तरी', en: 'Class 12 Biology Science Quiz' },
      'questions': { hi: '📝 प्रश्न', en: '📝 Questions' },
      'time': { hi: '⏱️ समय', en: '⏱️ Time' },
      'instructions': { hi: '📋 निर्देश:', en: '📋 Instructions:' },
      'compulsory': { hi: 'सभी प्रश्न अनिवार्य हैं', en: 'All questions are compulsory' },
      'marks': { hi: 'प्रत्येक प्रश्न 1 अंक का है', en: 'Each question carries 1 mark' },
      'negative': { hi: 'कोई नकारात्मक अंकन नहीं', en: 'No negative marking' },
      'start': { hi: '🚀 क्विज़ शुरू करें', en: '🚀 Start Quiz' },
      'answered': { hi: 'उत्तर दिए:', en: 'Answered:' },
      'prev': { hi: '⬅ पिछला', en: '⬅ Prev' },
      'next': { hi: 'अगला ➡', en: 'Next ➡' },
      'submit': { hi: '📤 जमा करें', en: '📤 Submit' },
      'navigator': { hi: 'प्रश्न नेविगेटर', en: 'Question Navigator' },
      'answered_status': { hi: '🟢 उत्तर दिया', en: '🟢 Answered' },
      'current_status': { hi: '🔵 वर्तमान', en: '🔵 Current' },
      'unanswered_status': { hi: '⚪ अनुत्तरित', en: '⚪ Unanswered' },
      'congrats': { hi: '🎉 शानदार प्रदर्शन!', en: '🎉 Excellent Performance!' },
      'practice': { hi: '📖 सीखते रहें!', en: '📖 Keep Learning!' },
      'passed': { hi: '✔️ उत्तीर्ण', en: '✔️ Passed' },
      'failed': { hi: '❌ सुधार की आवश्यकता', en: '❌ Needs Improvement' },
      'review': { hi: '📋 उत्तर समीक्षा', en: '📋 Answer Review' },
      'your_answer': { hi: 'आपका उत्तर:', en: 'Your Answer:' },
      'correct_answer': { hi: 'सही उत्तर:', en: 'Correct Answer:' },
      'new_quiz': { hi: '🔄 नई क्विज़ लें', en: '🔄 Take New Quiz' },
      'warning': { hi: '⚠️ 1 मिनट से कम समय शेष!', en: '⚠️ Less than 1 minute remaining!' },
      'download': { hi: '📥 परिणाम डाउनलोड करें', en: '📥 Download Result' },
      'status': { hi: 'स्थिति', en: 'Status' },
      'correct': { hi: 'सही', en: 'Correct' },
      'wrong': { hi: 'गलत', en: 'Wrong' },
      'not_attempted': { hi: 'प्रयास नहीं किया', en: 'Not Attempted' },
    };
    return texts[key]?.[language] || texts[key]?.['en'] || key;
  };

  // Home Page
  if (!started) {
    return (
      <div style={{
        minHeight: "100vh",
        display: "flex",
        justifyContent: "center",
        alignItems: "center",
        background: "linear-gradient(135deg, #1a237e 0%, #283593 50%, #3f51b5 100%)",
        fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif",
        padding: "20px"
      }}>
        <div style={{
          backgroundColor: "white",
          padding: "25px 20px",
          borderRadius: "16px",
          boxShadow: "0 20px 60px rgba(0,0,0,0.6)",
          textAlign: "center",
          maxWidth: "500px",
          width: "100%",
          animation: "fadeInUp 0.6s ease"
        }}>
          <div style={{ fontSize: "48px", marginBottom: "5px" }}>🧬</div>
          <h1 style={{ 
            color: "#1a237e", 
            marginBottom: "3px", 
            fontSize: "22px",
            fontWeight: "700"
          }}>
            {getText('title')}
          </h1>
          <p style={{ color: "#666", fontSize: "12px", marginBottom: "15px" }}>
            {getText('subtitle')}
          </p>
          <div style={{
            height: "3px",
            background: "linear-gradient(90deg, #1a237e, #3f51b5)",
            margin: "10px auto",
            width: "60px"
          }}></div>

          {/* Language Toggle */}
          <div style={{
            display: "flex",
            justifyContent: "center",
            alignItems: "center",
            gap: "12px",
            marginTop: "15px",
            marginBottom: "15px"
          }}>
            <span style={{ 
              fontSize: "14px", 
              fontWeight: language === 'hi' ? "700" : "400",
              color: language === 'hi' ? "#1a237e" : "#999"
            }}>हिन्दी</span>
            <button
              onClick={toggleLanguage}
              style={{
                width: "50px",
                height: "26px",
                borderRadius: "13px",
                background: language === 'hi' ? "#3f51b5" : "#4a90d9",
                border: "none",
                cursor: "pointer",
                position: "relative",
                transition: "all 0.3s ease"
              }}
            >
              <div style={{
                width: "20px",
                height: "20px",
                borderRadius: "50%",
                background: "white",
                position: "absolute",
                top: "3px",
                left: language === 'hi' ? "3px" : "27px",
                transition: "all 0.3s ease",
                boxShadow: "0 2px 4px rgba(0,0,0,0.2)"
              }}></div>
            </button>
            <span style={{ 
              fontSize: "14px", 
              fontWeight: language === 'en' ? "700" : "400",
              color: language === 'en' ? "#1a237e" : "#999"
            }}>English</span>
          </div>

          <div style={{
            display: "grid",
            gridTemplateColumns: "1fr 1fr",
            gap: "10px",
            marginTop: "10px"
          }}>
            <div style={{ 
              backgroundColor: "#e8f0fe", 
              padding: "12px", 
              borderRadius: "10px"
            }}>
              <div style={{ fontSize: "11px", color: "#666" }}>{getText('questions')}</div>
              <div style={{ fontSize: "22px", fontWeight: "bold", color: "#1a237e" }}>100</div>
            </div>
            <div style={{ 
              backgroundColor: "#e8f0fe", 
              padding: "12px", 
              borderRadius: "10px"
            }}>
              <div style={{ fontSize: "11px", color: "#666" }}>{getText('time')}</div>
              <div style={{ fontSize: "22px", fontWeight: "bold", color: "#1a237e" }}>60 Mins</div>
            </div>
          </div>

          <div style={{
            backgroundColor: "#e8f0fe",
            padding: "10px",
            borderRadius: "10px",
            marginTop: "10px",
            fontSize: "12px",
            color: "#1a237e"
          }}>
            💡 {language === 'hi' ? 'कक्षा 12 जीव विज्ञान के सभी अध्यायों की व्यापक कवरेज' : 'Comprehensive coverage of all Class 12 Biology chapters'}
          </div>

          <div style={{
            backgroundColor: "#f8f9fa",
            padding: "10px",
            borderRadius: "10px",
            marginTop: "10px",
            fontSize: "12px",
            color: "#555",
            textAlign: "left"
          }}>
            <strong>{getText('instructions')}</strong>
            <ul style={{ margin: "5px 0 0 0", paddingLeft: "18px" }}>
              <li>{getText('compulsory')}</li>
              <li>{getText('marks')}</li>
              <li>{getText('negative')}</li>
            </ul>
          </div>

          <button
            onClick={startExam}
            style={{
              padding: "14px 40px",
              fontSize: "18px",
              fontWeight: "bold",
              background: "linear-gradient(135deg, #1a237e 0%, #3f51b5 100%)",
              color: "white",
              border: "none",
              borderRadius: "50px",
              cursor: "pointer",
              marginTop: "20px",
              width: "100%",
              transition: "transform 0.3s, box-shadow 0.3s",
              boxShadow: "0 4px 15px rgba(63, 81, 181, 0.4)"
            }}
            onMouseEnter={(e) => e.target.style.transform = "scale(1.02)"}
            onMouseLeave={(e) => e.target.style.transform = "scale(1)"}
          >
            {getText('start')}
          </button>
        </div>
      </div>
    );
  }

  // Result Page
  if (submitted) {
    const percentage = ((score / questions.length) * 100).toFixed(2);
    const isPassed = percentage >= 60;
    return (
      <div style={{
        minHeight: "100vh",
        background: "#f5f7fa",
        padding: "15px",
        fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif"
      }}>
        <div style={{
          maxWidth: "800px",
          margin: "0 auto"
        }}>
          {/* Result Card - For Download */}
          <div ref={resultRef} style={{
            backgroundColor: "white",
            borderRadius: "16px",
            padding: "25px 20px",
            boxShadow: "0 10px 40px rgba(0,0,0,0.1)",
            textAlign: "center",
            marginBottom: "20px",
            animation: "slideIn 0.5s ease"
          }}>
            <div className="header" style={{
              background: "linear-gradient(135deg, #1a237e, #3f51b5)",
              color: "white",
              padding: "15px",
              borderRadius: "10px",
              marginBottom: "15px"
            }}>
              <h1 style={{ margin: "0", fontSize: "22px" }}>{getText('title')}</h1>
              <p style={{ margin: "5px 0 0", fontSize: "12px", opacity: 0.9 }}>
                {language === 'hi' ? 'कक्षा 12 जीव विज्ञान क्विज़' : 'Class 12 Biology Quiz'}
              </p>
            </div>
            
            <h2 style={{ 
              fontSize: "20px", 
              marginBottom: "5px",
              color: "#2d3748"
            }}>
              {isPassed ? getText('congrats') : getText('practice')}
            </h2>
            <div style={{
              width: "80px",
              height: "80px",
              borderRadius: "50%",
              background: isPassed ? "#d4edda" : "#f8d7da",
              display: "flex",
              alignItems: "center",
              justifyContent: "center",
              margin: "15px auto",
              fontSize: "32px"
            }}>
              {isPassed ? "✅" : "📝"}
            </div>
            <div style={{ fontSize: "40px", fontWeight: "bold", color: "#1a237e" }}>
              {score} <span style={{ fontSize: "20px", color: "#888" }}>/ {questions.length}</span>
            </div>
            <div style={{ 
              fontSize: "18px", 
              color: isPassed ? "#28a745" : "#dc3545", 
              marginTop: "5px",
              fontWeight: "600"
            }}>
              {percentage}% {isPassed ? getText('passed') : getText('failed')}
            </div>
            <div style={{
              marginTop: "10px",
              fontSize: "13px",
              color: "#718096"
            }}>
              {language === 'hi' ? "भाषा: हिन्दी" : "Language: English"} • {getText('negative')}
            </div>

            <div style={{
              marginTop: "15px",
              display: "grid",
              gridTemplateColumns: "1fr 1fr 1fr",
              gap: "10px",
              fontSize: "13px"
            }}>
              <div style={{ backgroundColor: "#d4edda", padding: "8px", borderRadius: "8px", color: "#155724" }}>
                ✅ {getText('correct')}: {resultDetails.filter(r => r.isCorrect).length}
              </div>
              <div style={{ backgroundColor: "#f8d7da", padding: "8px", borderRadius: "8px", color: "#721c24" }}>
                ❌ {getText('wrong')}: {resultDetails.filter(r => !r.isCorrect && r.isAttempted).length}
              </div>
              <div style={{ backgroundColor: "#fff3cd", padding: "8px", borderRadius: "8px", color: "#856404" }}>
                ⚪ {getText('not_attempted')}: {resultDetails.filter(r => !r.isAttempted).length}
              </div>
            </div>
          </div>

          {/* Download Button */}
          <div style={{ textAlign: "center", marginBottom: "20px" }}>
            <button
              onClick={downloadResult}
              style={{
                padding: "12px 30px",
                fontSize: "15px",
                fontWeight: "bold",
                background: "linear-gradient(135deg, #48bb78 0%, #38a169 100%)",
                color: "white",
                border: "none",
                borderRadius: "50px",
                cursor: "pointer",
                boxShadow: "0 4px 15px rgba(72, 187, 120, 0.4)",
                transition: "all 0.3s ease"
              }}
              onMouseEnter={(e) => e.target.style.transform = "scale(1.02)"}
              onMouseLeave={(e) => e.target.style.transform = "scale(1)"}
            >
              {getText('download')}
            </button>
          </div>

          {/* Answer Review */}
          <div style={{
            backgroundColor: "white",
            borderRadius: "16px",
            padding: "20px 15px",
            boxShadow: "0 10px 40px rgba(0,0,0,0.1)"
          }}>
            <h2 style={{ 
              borderBottom: "2px solid #eee", 
              paddingBottom: "12px", 
              marginBottom: "15px",
              fontSize: "18px",
              color: "#2d3748"
            }}>
              {getText('review')}
            </h2>
            {resultDetails.map((item, index) => (
              <div
                key={index}
                className={item.isCorrect ? '' : 'wrong'}
                style={{
                  backgroundColor: item.isCorrect ? "#f0fff4" : 
                                   item.isAttempted ? "#fff5f5" : "#fff3cd",
                  borderLeft: `4px solid ${item.isCorrect ? "#48bb78" : 
                              item.isAttempted ? "#fc8181" : "#ffc107"}`,
                  padding: "12px 15px",
                  marginBottom: "12px",
                  borderRadius: "8px",
                  animation: `fadeIn 0.3s ease ${index * 0.05}s`
                }}
              >
                <div style={{ display: "flex", justifyContent: "space-between", alignItems: "flex-start" }}>
                  <h4 style={{ 
                    margin: "0", 
                    fontSize: "14px", 
                    color: "#2d3748",
                    flex: 1,
                    marginRight: "10px"
                  }}>
                    Q{index + 1}. {item.question}
                  </h4>
                  <span style={{ fontSize: "18px", flexShrink: 0 }}>
                    {item.isCorrect ? "✅" : item.isAttempted ? "❌" : "⚪"}
                  </span>
                </div>
                <div style={{ marginTop: "8px", marginLeft: "5px", fontSize: "13px" }}>
                  <p style={{ margin: "3px 0" }}>
                    <strong>{getText('your_answer')}</strong>{" "}
                    <span style={{ 
                      color: item.isCorrect ? "#48bb78" : 
                             item.isAttempted ? "#dc3545" : "#ffc107",
                      fontWeight: item.isAttempted ? "bold" : "normal"
                    }}>
                      {item.userAnswer}
                    </span>
                    {!item.isAttempted && (
                      <span style={{ color: "#ffc107", marginLeft: "5px" }}>
                        ({getText('not_attempted')})
                      </span>
                    )}
                  </p>
                  {!item.isCorrect && (
                    <p style={{ margin: "3px 0" }}>
                      <strong>{getText('correct_answer')}</strong>{" "}
                      <span style={{ color: "#48bb78", fontWeight: "bold" }}>{item.correctAnswer}</span>
                    </p>
                  )}
                </div>
              </div>
            ))}
          </div>

          <div style={{ textAlign: "center", marginTop: "20px" }}>
            <button
              onClick={() => {
                setStarted(false);
                setSubmitted(false);
                setAnswers({});
                setResultDetails([]);
                setTimer(3600);
                setShowTimerWarning(false);
                setQuestions([]);
              }}
              style={{
                padding: "14px 35px",
                fontSize: "16px",
                fontWeight: "bold",
                background: "linear-gradient(135deg, #1a237e 0%, #3f51b5 100%)",
                color: "white",
                border: "none",
                borderRadius: "50px",
                cursor: "pointer",
                width: "100%",
                maxWidth: "300px",
                boxShadow: "0 4px 15px rgba(63, 81, 181, 0.4)",
                transition: "transform 0.3s ease"
              }}
              onMouseEnter={(e) => e.target.style.transform = "scale(1.02)"}
              onMouseLeave={(e) => e.target.style.transform = "scale(1)"}
            >
              {getText('new_quiz')}
            </button>
          </div>
        </div>
      </div>
    );
  }

  // Exam Page
  const q = questions[current] || { question: "", option: [], answer: "" };
  const answeredCount = Object.keys(answers).length;

  return (
    <div style={{
      minHeight: "100vh",
      background: "#f5f7fa",
      padding: "10px",
      fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif"
    }}>
      <div style={{
        maxWidth: "800px",
        margin: "0 auto"
      }}>
        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "10px 14px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginBottom: "10px",
          display: "flex",
          justifyContent: "space-between",
          alignItems: "center"
        }}>
          <div style={{ flex: 1 }}>
            <p style={{ 
              margin: "0", 
              fontSize: "11px", 
              color: "#718096"
            }}>
              Q{current + 1}/{questions.length}
            </p>
            <p style={{ 
              margin: "2px 0 0", 
              fontSize: "10px", 
              color: "#a0aec0"
            }}>
              {getText('answered')} {answeredCount}/{questions.length}
            </p>
          </div>
          <div style={{
            fontSize: "20px",
            fontWeight: "bold",
            color: timer < 60 ? "#fc8181" : "#1a237e",
            display: "flex",
            alignItems: "center",
            gap: "6px"
          }}>
            <span style={{ fontSize: "16px" }}>⏱️</span>
            <span>{Math.floor(timer / 60)}:{String(timer % 60).padStart(2, "0")}</span>
          </div>
        </div>

        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "16px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginBottom: "10px",
          animation: "fadeIn 0.3s ease"
        }}>
          <div style={{
            display: "inline-block",
            backgroundColor: "#e8f0fe",
            padding: "2px 10px",
            borderRadius: "12px",
            fontSize: "11px",
            color: "#1a237e",
            marginBottom: "12px"
          }}>
            📌 {language === 'hi' ? 'जीव विज्ञान 12वीं' : 'Biology 12th'}
          </div>
          <h3 style={{
            fontSize: "16px",
            color: "#1a237e",
            marginBottom: "16px",
            fontWeight: "600",
            lineHeight: "1.5"
          }}>
            {q.question}
          </h3>

          <div style={{ marginTop: "5px" }}>
            {q.option && q.option.map((op, idx) => (
              <div
                key={idx}
                style={{
                  padding: "10px 12px",
                  margin: "5px 0",
                  backgroundColor: answers[current] === op ? "#ebf8ff" : "#f7fafc",
                  border: answers[current] === op ? "2px solid #3f51b5" : "2px solid transparent",
                  borderRadius: "8px",
                  cursor: "pointer",
                  transition: "all 0.3s ease",
                  display: "flex",
                  alignItems: "center",
                  transform: answers[current] === op ? "scale(1.01)" : "scale(1)"
                }}
                onClick={() => setAnswers({ ...answers, [current]: op })}
                onMouseEnter={(e) => {
                  if (answers[current] !== op) {
                    e.currentTarget.style.backgroundColor = "#f0f0f0";
                    e.currentTarget.style.transform = "scale(1.005)";
                  }
                }}
                onMouseLeave={(e) => {
                  if (answers[current] !== op) {
                    e.currentTarget.style.backgroundColor = "#f7fafc";
                    e.currentTarget.style.transform = "scale(1)";
                  }
                }}
              >
                <input
                  type="radio"
                  id={`q${current}-opt${idx}`}
                  name={`question-${current}`}
                  checked={answers[current] === op}
                  onChange={() => {}}
                  style={{ marginRight: "10px", width: "16px", height: "16px", flexShrink: 0 }}
                />
                <label
                  htmlFor={`q${current}-opt${idx}`}
                  style={{
                    fontSize: "14px",
                    cursor: "pointer",
                    flex: 1,
                    margin: "0",
                    color: "#2d3748"
                  }}
                >
                  {op}
                </label>
              </div>
            ))}
          </div>
        </div>

        <div style={{
          display: "flex",
          gap: "8px",
          flexWrap: "wrap",
          justifyContent: "space-between"
        }}>
          <div style={{ display: "flex", gap: "8px" }}>
            <button
              onClick={() => setCurrent(Math.max(0, current - 1))}
              disabled={current === 0}
              style={{
                padding: "8px 14px",
                fontSize: "13px",
                backgroundColor: current === 0 ? "#e2e8f0" : "#3f51b5",
                color: current === 0 ? "#a0aec0" : "white",
                border: "none",
                borderRadius: "8px",
                cursor: current === 0 ? "not-allowed" : "pointer",
                fontWeight: "600",
                transition: "all 0.3s ease"
              }}
              onMouseEnter={(e) => {
                if (current !== 0) {
                  e.target.style.transform = "scale(1.05)";
                  e.target.style.boxShadow = "0 4px 12px rgba(63, 81, 181, 0.3)";
                }
              }}
              onMouseLeave={(e) => {
                e.target.style.transform = "scale(1)";
                e.target.style.boxShadow = "none";
              }}
            >
              {getText('prev')}
            </button>
            <button
              onClick={() => setCurrent(Math.min(questions.length - 1, current + 1))}
              disabled={current === questions.length - 1}
              style={{
                padding: "8px 14px",
                fontSize: "13px",
                backgroundColor: current === questions.length - 1 ? "#e2e8f0" : "#3f51b5",
                color: current === questions.length - 1 ? "#a0aec0" : "white",
                border: "none",
                borderRadius: "8px",
                cursor: current === questions.length - 1 ? "not-allowed" : "pointer",
                fontWeight: "600",
                transition: "all 0.3s ease"
              }}
              onMouseEnter={(e) => {
                if (current !== questions.length - 1) {
                  e.target.style.transform = "scale(1.05)";
                  e.target.style.boxShadow = "0 4px 12px rgba(63, 81, 181, 0.3)";
                }
              }}
              onMouseLeave={(e) => {
                e.target.style.transform = "scale(1)";
                e.target.style.boxShadow = "none";
              }}
            >
              {getText('next')}
            </button>
          </div>

          <button
            onClick={submitExam}
            style={{
              padding: "8px 18px",
              fontSize: "13px",
              backgroundColor: "#48bb78",
              color: "white",
              border: "none",
              borderRadius: "8px",
              cursor: "pointer",
              fontWeight: "600",
              transition: "all 0.3s ease",
              boxShadow: "0 2px 8px rgba(72, 187, 120, 0.3)"
            }}
            onMouseEnter={(e) => {
              e.target.style.transform = "scale(1.05)";
              e.target.style.boxShadow = "0 4px 15px rgba(72, 187, 120, 0.5)";
            }}
            onMouseLeave={(e) => {
              e.target.style.transform = "scale(1)";
              e.target.style.boxShadow = "0 2px 8px rgba(72, 187, 120, 0.3)";
            }}
          >
            {getText('submit')}
          </button>
        </div>

        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "12px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginTop: "10px"
        }}>
          <p style={{ 
            margin: "0 0 8px 0", 
            color: "#718096", 
            fontSize: "11px", 
            fontWeight: "600" 
          }}>
            {getText('navigator')}
          </p>
          <div style={{
            display: "flex",
            flexWrap: "wrap",
            gap: "5px"
          }}>
            {questions.map((_, idx) => (
              <button
                key={idx}
                onClick={() => setCurrent(idx)}
                style={{
                  width: "32px",
                  height: "32px",
                  fontSize: "11px",
                  backgroundColor: answers[idx] ? "#48bb78" : 
                                   current === idx ? "#3f51b5" : "#e2e8f0",
                  color: answers[idx] ? "white" :
                         current === idx ? "white" : "#4a5568",
                  border: current === idx ? "2px solid #3f51b5" : "none",
                  borderRadius: "6px",
                  cursor: "pointer",
                  fontWeight: "bold",
                  transition: "all 0.3s ease",
                  transform: answers[idx] ? "scale(1.05)" : "scale(1)"
                }}
                onMouseEnter={(e) => {
                  e.target.style.transform = "scale(1.1)";
                }}
                onMouseLeave={(e) => {
                  e.target.style.transform = answers[idx] ? "scale(1.05)" : "scale(1)";
                }}
              >
                {idx + 1}
              </button>
            ))}
          </div>
          <div style={{
            display: "flex",
            gap: "12px",
            marginTop: "8px",
            fontSize: "10px",
            color: "#4a5568",
            flexWrap: "wrap"
          }}>
            <span>{getText('answered_status')}</span>
            <span>{getText('current_status')}</span>
            <span>{getText('unanswered_status')}</span>
          </div>
        </div>

        {showTimerWarning && (
          <div style={{
            position: "fixed",
            bottom: "15px",
            right: "15px",
            left: "15px",
            backgroundColor: "#fc8181",
            color: "white",
            padding: "12px 18px",
            borderRadius: "10px",
            boxShadow: "0 4px 15px rgba(252, 129, 129, 0.4)",
            textAlign: "center",
            fontSize: "14px",
            fontWeight: "600",
            animation: "pulse 1.5s ease-in-out infinite",
            maxWidth: "400px",
            margin: "0 auto"
          }}>
            {getText('warning')}
          </div>
        )}
      </div>
      <style>
        {`
          @keyframes pulse {
            0% { opacity: 1; transform: scale(1); }
            50% { opacity: 0.6; transform: scale(0.98); }
            100% { opacity: 1; transform: scale(1); }
          }
          @keyframes fadeInUp {
            from { opacity: 0; transform: translateY(20px); }
            to { opacity: 1; transform: translateY(0); }
          }
          @keyframes fadeIn {
            from { opacity: 0; transform: translateX(-10px); }
            to { opacity: 1; transform: translateX(0); }
          }
          @keyframes slideIn {
            from { opacity: 0; transform: translateY(-30px); }
            to { opacity: 1; transform: translateY(0); }
          }
        `}
      </style>
    </div>
  );
}