// Hindi12thQuiz.jsx
import React, { useState, useEffect, useRef } from "react";

// --- 12th Hindi Question Bank (100 questions) ---

const hindiQuestions = [
  {
    question: "उदय प्रकाश ने किस विश्वविद्यालय से एम०ए० किया?",
    option: [
        "जोधपुर विश्वविद्यालय, राजस्थान",
        "इलाहाबाद विश्वविद्यालय, उत्तरप्रदेश",
        "सागर विश्वविद्यालय, सागर",
        "दिल्ली विश्वविद्यालय, दिल्ली"
    ],
    answer: "सागर विश्वविद्यालय, सागर"
},

{
    question: "‘गाँव का घर’ किस कविता-संग्रह से लिया गया है?",
    option: [
        "‘आँख हाथ बनते हुए’ से",
        "‘गंगातट’ से",
        "‘कवि ने कहा’ से",
        "‘संशयात्मा’ से"
    ],
    answer: "‘संशयात्मा’ से"
},

{
    question: "चेख्यकोव ने जनरल को किस प्रकार की माफी दी?",
    option: [
        "औपचारिक",
        "व्यक्तिगत",
        "सतही",
        "असंतोषजनक"
    ],
    answer: "व्यक्तिगत"
},

{
    question: "रघुवीर सहाय ने एम.ए. किस विश्वविद्यालय से किया था?",
    option: [
        "दिल्ली विश्वविद्यालय, दिल्ली",
        "लखनऊ विश्वविद्यालय, लखनऊ",
        "इलाहाबाद विश्वविद्यालय, इलाहाबाद",
        "कानपुर विश्वविद्यालय, कानपुर"
    ],
    answer: "लखनऊ विश्वविद्यालय, लखनऊ"
},

{
    question: "जर्मन ‘लेफ्टन’ को किसने मार गिराया ?",
    option: [
        "सूबेदार ने",
        "बोधा सिंह ने",
        "लहना सिंह ने",
        "वजीरा सिंह ने"
    ],
    answer: "लहना सिंह ने"
},

{
    question: "‘प्रगीत और समाज’ के लेखक हैं",
    option: [
        "बालकृष्ण भट्ट",
        "जयप्रकाश नारायण",
        "नामवर सिंह",
        "उदय प्रकाश"
    ],
    answer: "नामवर सिंह"
},

{
    question: "‘दलित साहित्य सौंदर्यशास्त्र’ के रचनाकार कौन हैं?",
    option: [
        "प्रेमचंद",
        "सुदर्शन",
        "जगजीवन राम",
        "ओमप्रकाश वाल्मीकि"
    ],
    answer: "ओमप्रकाश वाल्मीकि"
},

{
    question: "“उत्तर प्रियदर्शी’ नाटक के नाटककार हैं ?",
    option: [
        "जगदीशचन्द्र माथुर",
        "‘अज्ञेय’",
        "जयशंकर प्रसाद",
        "हरेकृष्ण ‘प्रेमी’"
    ],
    answer: "‘अज्ञेय’"
},

{
    question: "‘पेशगी’ कहानी में कारमेन की आर्थिक स्थिति का क्या संकेत मिलता है?",
    option: [
        "विपन्नता",
        "सम्पन्नता",
        "मध्यम",
        "अस्थिर"
    ],
    answer: "विपन्नता"
},

{
    question: "'उषा' शीर्षक कविता के कवि हैं",
    option: [
        "पंत",
        "निराला",
        "ज्ञानदत्तपति",
        "शमशेर बहादुर सिंह"
    ],
    answer: "शमशेर बहादुर सिंह"
},

{
    question: "जय प्रकाश नारायण किस मित्रता को ठोस मानते थे ?",
    option: [
        "पुराने जमाने की",
        "नये जमाने की",
        "अंडरग्राउंड जमाने की",
        "इनमें से कोई नहीं"
    ],
    answer: "अंडरग्राउंड जमाने की"
},

{
    question: "किसके न होने से सृष्टि गूंगी प्रतीत होती है?",
    option: [
        "श्रवणशक्ति",
        "वाक्शक्ति",
        "दृश्यशक्ति",
        "स्मरणशक्ति"
    ],
    answer: "वाक्शक्ति"
},

{
    question: "जयशंकर प्रसाद की सफलतम नाट्यकृति है",
    option: [
        "स्कंदगुप्त",
        "एक घूँट",
        "ध्रुवस्वामिनी",
        "विशाख"
    ],
    answer: "ध्रुवस्वामिनी"
},

{
    question: "मलयज ने ‘जख्म पर फूल’ नामक कविता कब लिखी?",
    option: [
        "1970 ई० में",
        "1971 ई० में",
        "1972 ई० में",
        "1973 ई० में"
    ],
    answer: "1971 ई० में"
},

{
    question: "जयप्रकाश नारायण को किसका दलाल कहा गया ?",
    option: [
        "रूस",
        "ब्रिटेन",
        "जापान",
        "अमेरिका"
    ],
    answer: "अमेरिका"
},

{
    question: "'लिरिक' का पर्याय है",
    option: [
        "प्रगीत",
        "कथा",
        "जीवनी",
        "कल्पना"
    ],
    answer: "प्रगीत"
},

{
    question: "चेख्यकोव की पत्नी ने किस तरह की प्रतिक्रिया दी?",
    option: [
        "गुस्से में",
        "चिंता में",
        "उदासीनता से",
        "प्यार से"
    ],
    answer: "उदासीनता से"
},

{
    question: "संर्पूण क्रांति का नारा किसने दिया था ?",
    option: [
        "दिनकर",
        "जयप्रकाश नारायण",
        "मोरारजी देसाई",
        "ईश्वर अय्यर"
    ],
    answer: "जयप्रकाश नारायण"
},

{
    question: "मानक बिरहनी से दूध की जगह क्या माँगता है?",
    option: [
        "पानी",
        "मिठाई",
        "चाय",
        "खाना"
    ],
    answer: "पानी"
},

{
    question: "रघुवीर सहाय स्मृति पुरस्कार विनोद कुमार शुक्ल को कब प्रदान किया गया?",
    option: [
        "1988 ई० में",
        "1990 ई. में",
        "1992 ई० में",
        "1994 ई० में"
    ],
    answer: "1990 ई. में"
},

{
    question: "जयशंकर प्रसाद ने कौन-सी कविता लिखी है?",
    option: [
        "पुत्र वियोग",
        "तुमुल कोलाहल कलह में",
        "उषा",
        "हार जीत"
    ],
    answer: "तुमुल कोलाहल कलह में"
},

{
    question: "देवी प्रसाद साहू जयशंकर प्रसाद के कौन थे?",
    option: [
        "पितामह",
        "प्रतिपितामह",
        "पिता",
        "इनमें से कोई नहीं"
    ],
    answer: "पिता"
},

{
    question: "जनरल ब्रिजालोव ने चेख्यकोव से कैसे व्यवहार किया?",
    option: [
        "प्यार से",
        "उदासीनता से",
        "गुस्से में",
        "असंवेदनशीलता से"
    ],
    answer: "उदासीनता से"
},

{
    question: "‘ध्रुवस्वामिनी’ कैसी कृति है?",
    option: [
        "महाकाव्य",
        "गीतिनाट्य",
        "गीतिकाव्य",
        "नाटक"
    ],
    answer: "नाटक"
},

{
    question: "लीडर किसमें ‘विश्व शिक्षक’ का रूप देखते थे?",
    option: [
        "राधाकृष्णन में",
        "राजेन्द्र प्रसाद में",
        "गाँधी में",
        "जे. कृष्णमूर्ति में"
    ],
    answer: "गाँधी में"
},

{
    question: "सुभद्रा कुमारी चौहान का जन्म कब हुआ?",
    option: [
        "16 अगस्त, 1904 को",
        "20 जुलाई, 1920 को",
        "18 मई, 1930 को",
        "12 अगस्त, 1905 को"
    ],
    answer: "16 अगस्त, 1904 को"
},

{
    question: "पेड़ किसलिए काटे जा रहे हैं?",
    option: [
        "बेचने के लिए",
        "ईंधन के लिए",
        "घर बनाने के लिए",
        "इनमें से कोई नहीं"
    ],
    answer: "ईंधन के लिए"
},

{
    question: "बालकृष्ण भट्ट ने किस पत्रिका का सम्पादन किया?",
    option: [
        "आवर्तित",
        "हँकार",
        "हिन्दी प्रदीप",
        "पंजाब केसरी"
    ],
    answer: "हिन्दी प्रदीप"
},

{
    question: "‘कविता के नए प्रतिमान’ के लेखक हैं",
    option: [
        "लक्ष्मीकांत वर्मा",
        "सर्वेश्वरदयाल सक्सेना",
        "शिवदान सिंह चौहान",
        "नामवर सिंह"
    ],
    answer: "नामवर सिंह"
},

{
    question: "अज्ञेयजी की पहली कहानी किस पत्रिका में प्रकाशित हुई ?",
    option: [
        "प्रभा में",
        "ज्योति में",
        "पत्रिका ‘सेवा’",
        "इनमें कोई नहीं"
    ],
    answer: "पत्रिका ‘सेवा’"
},

{
    question: "कौन-सी कृति ‘अज्ञेय’ की है?",
    option: [
        "‘रसवती’",
        "‘नदी के द्वीप’",
        "‘मंगलसूत्र’",
        "‘कंकाल’"
    ],
    answer: "‘नदी के द्वीप’"
},

{
    question: "‘संयोगिता स्वयंवर’ रचना है",
    option: [
        "बालकृष्ण भट्ट की",
        "प्रतापनारायण मिश्र की",
        "श्रीनिवास दास की",
        "मैथिलीशरण गुप्त की"
    ],
    answer: "श्रीनिवास दास की"
},

{
    question: "विनोद कुमार शुक्ल का जन्म कब हुआ था?",
    option: [
        "1 जनवरी, 1937 को",
        "12 फरवरी, 1937 को",
        "20 मई, 1934 को",
        "12 जुलाई, 1944 को"
    ],
    answer: "1 जनवरी, 1937 को"
},

{
    question: "ज्ञानेंद्रपति को किस कृति पर साहित्य अकादमी पुरस्कार प्राप्त हुआ?",
    option: [
        "कवि ने कहा’ पर",
        "भिनसार’ पर",
        "‘संशयात्मा’ पर",
        "‘शब्द लिखने के लिए ही यह कागज बना है’ पर"
    ],
    answer: "‘संशयात्मा’ पर"
},

{
    question: "रॉबिन्सन क्रूसो को कब तक मनुष्य का मुख देखने को नहीं मिला?",
    option: [
        "10 वर्ष तक",
        "12 वर्ष तक",
        "16 वर्ष तक",
        "18 वर्ष तक"
    ],
    answer: "16 वर्ष तक"
},

{
    question: "कौन-सी पुस्तक नामवर सिंह की है?",
    option: [
        "पीली छतरीवाली लड़की",
        "‘पृथ्वीराज रासो की भाषा’",
        "अंतराल",
        "न आदमी न कल"
    ],
    answer: "‘पृथ्वीराज रासो की भाषा’"
},

{
    question: "चेख्यकोव ने अपने घर जाकर क्या किया?",
    option: [
        "खाना खाया",
        "सोफे पर लेट गया",
        "घर की सफाई की",
        "बाहर गया"
    ],
    answer: "सोफे पर लेट गया"
},

{
    question: "‘द फर्स्ट एंड लास्ट फ्रीडम’ किसकी कृति है ?",
    option: [
        "अब्दुल कलाम आजाद",
        "पण्डित सीतारमैया",
        "जे. कृष्णमूर्ति",
        "जवाहर हुसैन"
    ],
    answer: "जे. कृष्णमूर्ति"
},

{
    question: "'सुकून की तलाश' किसकी रचना है?",
    option: [
        "दुष्यंत कुमार की",
        "गालिब की",
        "इकबाल की",
        "शमशेर बहादुर सिंह की"
    ],
    answer: "शमशेर बहादुर सिंह की"
},

{
    question: "चेख्यकोव की पत्नी ने उसकी समस्याओं को कैसे देखा?",
    option: [
        "गंभीरता से",
        "उपेक्षा से",
        "चिंता के साथ",
        "सहानुभूति से"
    ],
    answer: "उपेक्षा से"
},

{
    question: "दिनकर किस युग के कवि हैं?",
    option: [
        "भारतेन्दु युग",
        "छायावादी युग",
        "छायावादोत्तर युग",
        "नाट्यकाव्यांदोलन युग"
    ],
    answer: "छायावादोत्तर युग"
},

{
    question: "‘पेशगी’ कहानी में घर की मालकिन किस कार्य में व्यस्त रहती है?",
    option: [
        "मनोरंजन",
        "शिक्षा",
        "चिकित्सा",
        "सामाजिक कार्य"
    ],
    answer: "मनोरंजन"
},

{
    question: "रघुवीर सहाय किस के प्रधान संपादक थे?",
    option: [
        "रविवार के",
        "दिनमान के",
        "साप्ताहिक हिन्दुस्तान के",
        "धर्मयुग के"
    ],
    answer: "दिनमान के"
},

{
    question: "‘संस्कृति के चार अध्याय’ किसकी कृति है?",
    option: [
        "गुलाब दास",
        "हजारी प्रसाद द्विवेदी",
        "आचार्य सीताराम चतुर्वेदी",
        "रामधारी सिंह ‘दिनकर’"
    ],
    answer: "रामधारी सिंह ‘दिनकर’"
},

{
    question: "‘पेशगी’ कहानी में फर्डिनैंड किस प्रकार का व्यक्ति है?",
    option: [
        "चौकीदार",
        "डॉक्टर",
        "मित्र",
        "परिवार का सदस्य"
    ],
    answer: "चौकीदार"
},

{
    question: "‘रोज’ कहानी की नायिका है ?",
    option: [
        "मधुमालती",
        "मालती",
        "मालविका",
        "माधवी"
    ],
    answer: "मालती"
},

{
    question: "चेख्यकोव की मौत के बाद किस प्रकार की स्थिति का वर्णन है?",
    option: [
        "मानसिक शांति",
        "शारीरिक आराम",
        "दुःख और असंतोष",
        "आत्मिक संतोष"
    ],
    answer: "दुःख और असंतोष"
},

{
    question: "‘जूठन’ किस चेतना की रचना है?",
    option: [
        "सांस्कृतिक चेतना की",
        "राजनीतिक चेतना की",
        "धार्मिक चेतना की",
        "दलित चेतना की"
    ],
    answer: "दलित चेतना की"
},

{
    question: "रघुवीर सहाय किस काल के कवि हैं?",
    option: [
        "आधुनिक काल",
        "रीतिकाल",
        "आदिकाल",
        "छायावाद"
    ],
    answer: "आधुनिक काल"
},

{
    question: "'चुका भी नहीं हूँ मैं' के रचयिता कौन हैं?",
    option: [
        "त्रिलोचन",
        "नागार्जुन",
        "शमशेर बहादुर सिंह",
        "मुक्तिबोध"
    ],
    answer: "शमशेर बहादुर सिंह"
},

{
    question: "कौन तुलसीदास के मित्र नहीं थे?",
    option: [
        "महाराजा मान सिंह",
        "टोडरमल",
        "सूरदास",
        "नाभादास"
    ],
    answer: "सूरदास"
},

{
    question: "जायसी ने रत्नसेन तथा पद्मावती की कथा को किस प्रकार जोड़ा",
    option: [
        "प्रेम द्वारा",
        "भक्ति द्वारा",
        "रक्त रूप लेई द्वारा",
        "इनमें से कोई नहीं"
    ],
    answer: "रक्त रूप लेई द्वारा"
},

{
    question: "'उषा' कविता में प्रातः काल को किसके समान बताया गया है?",
    option: [
        "लाल कमल के समान",
        "नीले शंख के समान",
        "नीली चादर के समान",
        "नीले सागर के समान"
    ],
    answer: "नीले शंख के समान"
},

{
    question: "‘तिरिछ’ कहानी की केंद्रीय घटना का संबंध किससे है?",
    option: [
        "कहानीकार से",
        "कहानीकार की माँ से",
        "कहानीकार के पिता से",
        "कहानीकार के मित्र से"
    ],
    answer: "कहानीकार के पिता से"
},

{
    question: "जायसी ने रत्नसेन एवं पद्मावती की कथा को किसके द्वारा सींचा?",
    option: [
        "अपने आँसुओं से",
        "गंगाजल से",
        "जल से",
        "इनमें से किसी से नहीं"
    ],
    answer: "अपने आँसुओं से"
},

{
    question: "लेखक को किसने तीन-तीन सौ के तीन नोट दिए?",
    option: [
        "राम औतार ने",
        "डॉक्टर पंत ने",
        "कैंसर विशेषज्ञ ने",
        "सरदार सतनाम सिंह ने"
    ],
    answer: "डॉक्टर पंत ने"
},

{
    question: "नाभादास किसके शिष्य थे?",
    option: [
        "तुलसीदास के",
        "रामानंद के",
        "स्वामी अग्रदास के",
        "महादास के"
    ],
    answer: "स्वामी अग्रदास के"
},

{
    question: "'लोग भूल गए हैं' किसकी रचना है?",
    option: [
        "ज्ञानेंद्रपति",
        "भूषण",
        "सूरदास",
        "रघुवीर सहाय"
    ],
    answer: "रघुवीर सहाय"
},

{
    question: "सुभद्रा कुमारी चौहान के पति का नाम क्या था?",
    option: [
        "ठाकुर लक्ष्मण सिंह",
        "ठाकुर दीनदयाल सिंह",
        "ठाकुर रामेश्वर सिंह",
        "ठाकुर रामप्रति सिंह"
    ],
    answer: "ठाकुर लक्ष्मण सिंह"
},

{
    question: "‘तमचर’ का अर्थ होता है",
    option: [
        "उल्लू",
        "कौवा",
        "तोता",
        "मुर्गी"
    ],
    answer: "मुर्गी"
},

{
    question: "होशेकम को किस महीने के अंत में बिस्तर पकड़ना पड़ा?",
    option: [
        "नवंबर",
        "दिसंबर",
        "जनवरी",
        "फरवरी"
    ],
    answer: "दिसंबर"
},

{
    question: "प्रसादजी का प्रथम संग्रह है",
    option: [
        "चित्राधार",
        "झरना",
        "लहर",
        "आँसू"
    ],
    answer: "चित्राधार"
},

{
    question: "सूचना केन्द्र में लेखक को आकर्षित करनेवाला अधेड़ व्यक्ति कौन था?",
    option: [
        "बलभद्र मिश्र",
        "बलभद्र ठाकुर",
        "बलभद्र शर्मा",
        "बलभद्र वर्मा"
    ],
    answer: "बलभद्र ठाकुर"
},

{
    question: "मालकिन ने कारमेन को क्या निर्देश दिया था?",
    option: [
        "तंग न करने",
        "मदद करने",
        "समय पर आने",
        "बच्चों की देखभाल करने"
    ],
    answer: "तंग न करने"
},

{
    question: "चेख्यकोव ने किससे व्यक्तिगत रूप से माफी मांगी?",
    option: [
        "जनरल ब्रिजालोव",
        "पत्नी",
        "मित्र",
        "सहकर्मी"
    ],
    answer: "जनरल ब्रिजालोव"
},

{
    question: "चेख्यकोव की पत्नी ने कितनी गंभीरता से घटना को लिया?",
    option: [
        "बहुत गंभीरता से",
        "थोड़ी गंभीरता से",
        "बिलकुल गंभीरता से नहीं",
        "उचित गंभीरता से"
    ],
    answer: "बिलकुल गंभीरता से नहीं"
},

{
    question: "छत्रसाल दशक में छंद हैं-",
    option: [
        "एक सौ दस",
        "दो सौ दस",
        "तीन सौ दस",
        "दस"
    ],
    answer: "दस"
},

{
    question: "मलिक मुहम्मद जायसी का जन्म कब हुआ था?",
    option: [
        "1450 ई. में",
        "1485 ई. में",
        "1492 ई. में",
        "1496 ई. में"
    ],
    answer: "1492 ई. में"
},

{
    question: "इनमें से कौन-सी रचना तुलसी की है ?",
    option: [
        "लग्नपत्रिका",
        "प्रणयपत्रिका",
        "सीता स्वयंवर",
        "विनयपत्रिका"
    ],
    answer: "विनयपत्रिका"
},

{
    question: "‘राम की शक्तिपूजा’ किसकी कृति है ?",
    option: [
        "प्रसाद की",
        "निराला की",
        "पंत की",
        "रामविलास शर्मा की"
    ],
    answer: "निराला की"
},

{
    question: "रघुवीर सहाय के पिताजी का क्या नाम था?",
    option: [
        "रघुवंश सहाय",
        "हरदेव सहाय",
        "मणिशंकर सहाय",
        "रघुनंदन सहाय"
    ],
    answer: "हरदेव सहाय"
},

{
    question: "मुन्‍नी डाक गाड़ी के पीछे क्यों जाती है?",
    option: [
        "राशन के लिए",
        "पैसे के लिए",
        "चिट्ठी के लिए",
        "किसी अन्य कार्य के लिए"
    ],
    answer: "चिट्ठी के लिए"
},

{
    question: "‘पेशगी’ कहानी में मालकिन के गुस्से का शिकार कौन होता है?",
    option: [
        "नौकर",
        "बच्चे",
        "पति",
        "मित्र"
    ],
    answer: "नौकर"
},

{
    question: "‘तिरिछ’ कैसी कहानी है?",
    option: [
        "मिथकीय",
        "मनोरंजक",
        "सांस्कृतिक",
        "प्रतीकात्मक"
    ],
    answer: "प्रतीकात्मक"
},

{
    question: "‘लिरिक’ का पर्याय है",
    option: [
        "प्रगीत",
        "कथा",
        "जीवनी",
        "कल्पना"
    ],
    answer: "प्रगीत"
},

{
    question: "‘पेशगी’ कहानी में मैडम की आदतों का प्रभाव किस पर था?",
    option: [
        "नौकरों पर",
        "परिवार पर",
        "मित्रों पर",
        "खुद पर"
    ],
    answer: "नौकरों पर"
},

{
    question: "रचने और भोगने का रिश्ता कैसा होता है?",
    option: [
        "द्वंद्वात्मक",
        "सहयोगात्मक",
        "नकारात्मक",
        "निषेधात्मक"
    ],
    answer: "द्वंद्वात्मक"
},

{
    question: "‘सुखमय जीवन’ किसकी रचना है ?",
    option: [
        "चंद्रधर शर्मा ‘गुलेरी’",
        "देवकीनंदन खत्री",
        "गोपाल राम गहमरी",
        "बालकृष्ण भट्ट"
    ],
    answer: "चंद्रधर शर्मा ‘गुलेरी’"
},

{
    question: "'पर किसने यह, सातो सागर के पार एकाकीपन से ही मानो-हार' यह किस कवि के कविता का अंश है?",
    option: [
        "शमशेर बहादुर सिंह",
        "मुक्तिबोध",
        "नागार्जुन",
        "त्रिलोचन"
    ],
    answer: "शमशेर बहादुर सिंह"
},

{
    question: "मलयज ने एम०ए० किस विश्वविद्यालय से किया?",
    option: [
        "बनारस हिन्दू विश्वविद्यालय",
        "जोधपुर विश्वविद्यालय",
        "इलाहाबाद विश्वविद्यालय",
        "पटना विश्वविद्यालय"
    ],
    answer: "इलाहाबाद विश्वविद्यालय"
},

{
    question: "अज्ञेय का जन्म हआ था ?",
    option: [
        "7 मार्च, 1911 को",
        "18 मार्च, 1912 को",
        "23 अप्रैल, 1911 को",
        "25 मई, 1913 को"
    ],
    answer: "7 मार्च, 1911 को"
},

{
    question: "'ध्रुवस्वामिनी' कैसी कृति है ?",
    option: [
        "महाकाव्य",
        "गीति नाट्य",
        "गीतिकाव्य",
        "नाटक"
    ],
    answer: "नाटक"
},

{
    question: "मनुष्य का शरीर क्यों थक जाता है?",
    option: [
        "मन की चंचलता से",
        "अधिक निद्रा से",
        "अधिक काम से",
        "इनमें से कोई नहीं"
    ],
    answer: "मन की चंचलता से"
},

{
    question: "'बाज की दाद में आदमी का खून लग चुका है।' यह किस कविता की पंक्ति है ?",
    option: [
        "हिमालय",
        "गरम हथेली",
        "आह! तुम्हारा सौंदर्य",
        "तय तो यही था"
    ],
    answer: "तय तो यही था"
},

{
    question: "सरकार ने सूबेदार को जमीन कहाँ दी है?",
    option: [
        "संजापुर में",
        "अलावापुर में",
        "जलालपुर में",
        "लायालपुर में"
    ],
    answer: "लायालपुर में"
},

{
    question: "बालकृष्ण भट्ट किस युग के निबंधकार थे?",
    option: [
        "प्रसाद युग",
        "भारतेंदु युग",
        "द्विवेदी युग",
        "स्वातंत्र्योत्तर युग"
    ],
    answer: "भारतेंदु युग"
},

{
    question: "मनुष्य की बातचीत का उत्तम तरीका क्या है?",
    option: [
        "विद्वत्तापूर्ण बात करना",
        "तर्कपूर्ण बात करना",
        "भीड़ से बात करना",
        "अवाक होकर अपने से बातचीत करना"
    ],
    answer: "अवाक होकर अपने से बातचीत करना"
},

{
    question: "दिनकर जी की पहली कविता कब प्रकाशित हुई?",
    option: [
        "1920 में",
        "1925 में",
        "1930 में",
        "1935 में"
    ],
    answer: "1925 में"
},

{
    question: "जे. कृष्णमूर्ति के अनुसार, सम्पूर्ण विश्व किस ओर अग्रसर है?",
    option: [
        "विकास की ओर",
        "नाश की ओर",
        "प्रतिस्पर्धा की ओर",
        "इनमें से कोई नहीं"
    ],
    answer: "नाश की ओर"
},

{
    question: "नाभादास किसके समकालीन थे?",
    option: [
        "कबीरदास",
        "सूरदास",
        "तुलसीदास",
        "इनमें से कोई नहीं"
    ],
    answer: "तुलसीदास"
},

{
    question: "चेख्यकोव ने जनरल से कितनी बार माफी मांगी?",
    option: [
        "एक बार",
        "दो बार",
        "तीन बार",
        "कई बार"
    ],
    answer: "दो बार"
},

{
    question: "प्रगीत कैसा काव्य है?",
    option: [
        "गीति काव्य",
        "आत्मपरक काव्य",
        "प्रबन्ध काव्य",
        "इनमें से कोई नहीं"
    ],
    answer: "प्रबन्ध काव्य"
},

{
    question: "चेख्यकोव ने किस वर्दी में जनरल से माफी मांगी?",
    option: [
        "नई वर्दी",
        "पुरानी वर्दी",
        "काम की वर्दी",
        "खेल की वर्दी"
    ],
    answer: "नई वर्दी"
},

{
    question: "'ओ सदानीरा' के लेखक हैं",
    option: [
        "जगदीशचन्द्र माथुर",
        "लक्ष्मीनारायण लाल",
        "लक्ष्मीनारायण मिश्र",
        "जयशंकर प्रसाद"
    ],
    answer: "जगदीशचन्द्र माथुर"
},

{
    question: "‘थरन’ शब्द किस शब्द से विकसित है?",
    option: [
        "थल",
        "थार",
        "स्थल",
        "स्थान"
    ],
    answer: "थार"
},

{
    question: "‘गाँव का घर’ कविता के कवि हैं",
    option: [
        "अशोक वाजपेयी",
        "ज्ञानेंद्रपति",
        "रघुवीर सहाय",
        "शमशेर बहादुर सिंह"
    ],
    answer: "ज्ञानेंद्रपति"
},

{
    question: "कौन-सी कृति ‘अज्ञेय’ की नहीं है?",
    option: [
        "‘पल्लव’",
        "‘कितनी नावों में कितनी बार’",
        "‘सदानीरा’",
        "‘हरी घास पर क्षणभर’"
    ],
    answer: "‘पल्लव’"
},

{
    question: "देवी प्रसाद साहू जयशंकर प्रसाद के कौन थे?",
    option: [
        "पितामह",
        "प्रतिपितामह",
        "पिता",
        "इनमें से कोई नहीं"
    ],
    answer: "पिता"
},

{
    question: "चेख्यकोव ने जनरल के सामने किस प्रकार का व्यवहार किया?",
    option: [
        "विनम्र",
        "आक्रामक",
        "तटस्थ",
        "हृदयहीन"
    ],
    answer: "विनम्र"
},

{
    question: "किसने बटुआ खोने की सूचना दी?",
    option: [
        "बाजार के लोग",
        "पुलिस",
        "नगर के अधिकारी",
        "नगाड़ा पीटने वाले"
    ],
    answer: "नगाड़ा पीटने वाले"
},

{
    question: "कौन-सी रचना बालकृष्ण भट्ट द्वारा रचित नहीं है?",
    option: [
        "पयावती",
        "वेणी संहार",
        "मेघदूतम्",
        "मेघनाथ वध"
    ],
    answer: "मेघदूतम्"
},

{
    question: "‘पेशगी’ कहानी में घर की मालकिन किस काम में व्यस्त थी?",
    option: [
        "ब्रिज खेलना",
        "दवा देना",
        "पढ़ाई करना",
        "खाना पकाना"
    ],
    answer: "ब्रिज खेलना"
},

{
    question: "चेख्यकोव की आत्महत्या का मुख्य कारण क्या था?",
    option: [
        "मानसिक अपमान",
        "शारीरिक दर्द",
        "सामाजिक चिंता",
        "व्यक्तिगत असफलता"
    ],
    answer: "मानसिक अपमान"
},

{
    question: "लोगों ने होशेकम पर क्या इल्जाम लगाया?",
    option: [
        "बटुआ चुराने का",
        "झूठ बोलने का",
        "चोरी करवाने का",
        "पैसे छिपाने का"
    ],
    answer: "चोरी करवाने का"
},

{
    question: "सूरदास की कौन सी रचना है?",
    option: [
        "पुत्र वियोग",
        "कड़बक",
        "छप्पय",
        "पद"
    ],
    answer: "पद"
},

{
    question: "‘तिरिछ’ कहानी की केंद्रीय घटना का संबंध किससे है?",
    option: [
        "कहानीकार से",
        "कहानीकार की माँ से",
        "कहानीकार के पिता से",
        "कहानीकार के मित्र से"
    ],
    answer: "कहानीकार के पिता से"
},

{
    question: "गौतम बुद्ध का आविर्भाव कब हुआ था?",
    option: [
        "दो हजार वर्ष पहले",
        "ढाई हजार वर्ष पहले",
        "तीन हजार वर्ष पहले",
        "पाँच सौ वर्ष पहले"
    ],
    answer: "ढाई हजार वर्ष पहले"
},

{
    question: "महंत के मठ में गाँधीजी को कहाँ शरण दी?",
    option: [
        "एक आम के पेड़ के नीचे",
        "अपने मठ में",
        "एक झोपड़ी में",
        "एक महुए के पेड़ के नीचे"
    ],
    answer: "एक महुए के पेड़ के नीचे"
},

{
    question: "प्रसाद जी की किस कृति में आधुनिक मानव सभ्यता की मार्मिक समीक्षा की गयी है?",
    option: [
        "विशाख",
        "स्कंदगुप्त",
        "इन्द्रजाल",
        "कामायनी"
    ],
    answer: "कामायनी"
},

{
    question: "‘प्यारे नन्हें बेटे को’ कविता किस शैली में लिखी गयी है?",
    option: [
        "व्यंग्यात्मक शैली",
        "वार्तालाप शैली",
        "प्रतीकात्मक शैली",
        "इनमें से कोई नहीं"
    ],
    answer: "वार्तालाप शैली"
},

{
    question: "भूषण के प्रिय नायक हैं-",
    option: [
        "छत्रपति शिवाजी और छत्रसाल",
        "राणा प्रताप और राणा साँगा",
        "अकबर और मानसिंह",
        "इनमें से कोई नहीं"
    ],
    answer: "छत्रपति शिवाजी और छत्रसाल"
},

{
    question: "सूरदास के संकलित पदों में कौन रस है?",
    option: [
        "श्रृंगार रस",
        "वात्सल्य रस",
        "हास्य रस",
        "रौद्र रस"
    ],
    answer: "वात्सल्य रस"
},

{
    question: "नामवर सिंह ने बी०ए० तथा एम०ए० की शिक्षा कहाँ से प्राप्त की?",
    option: [
        "जे०एन०यू०",
        "डी० यू०",
        "बी०एच०यू०",
        "इनमें से कोई नहीं"
    ],
    answer: "बी०एच०यू०"
},

{
    question: "‘कामायनी’ के कवि हैं",
    option: [
        "पंत",
        "प्रसाद",
        "महादेवी वर्मा",
        "निराला"
    ],
    answer: "प्रसाद"
},

{
    question: "मोहन राकेश की एकांकी का शीर्षक है—",
    option: [
        "‘रोज’",
        "‘सिपाही की माँ’",
        "‘जुड़ना’",
        "‘शिक्षा’"
    ],
    answer: "‘सिपाही की माँ’"
},

{
    question: "नामवर सिंह ने बी.ए. तथा एम.ए. की शिक्षा कहाँ से प्राप्त की?",
    option: [
        "जे.एन.यू.",
        "डी.यू.",
        "बी.एच.यू.",
        "इनमें से कोई नहीं"
    ],
    answer: "बी.एच.यू."
},

{
    question: "जयप्रकाश नारायण ने ‘संपूर्ण क्रांति’ वाला ऐतिहासिक भाषण कहाँ और कब दिया था ?",
    option: [
        "इलाहाबाद में 5 जून 1977 को",
        "राँची में 5 जून 1975 को",
        "जमशेदपुर में 5 जून 1973 को",
        "पटना में 5 जून 1974 को"
    ],
    answer: "पटना में 5 जून 1974 को"
},

{
    question: "सुभद्रा कुमारी चौहान को किस पार्टी का एम०एल०ए० चुना गया था?",
    option: [
        "समाजवादी पार्टी",
        "भारतीय कम्युनिस्ट पार्टी",
        "भारतीय जनता पार्टी",
        "कांग्रेस"
    ],
    answer: "कांग्रेस"
},

{
    question: "मलयज ने किस मंत्रालय में नौकरी की?",
    option: [
        "कृषि मंत्रालय",
        "रेल मंत्रालय",
        "वित्त मंत्रालय",
        "शिक्षा मंत्रालय"
    ],
    answer: "कृषि मंत्रालय"
},

{
    question: "'राम की शक्तिपूजा' किसकी कविता है?",
    option: [
        "पंत",
        "दिनकर",
        "महादेवी वर्मा",
        "निराला"
    ],
    answer: "निराला"
},

{
    question: "चेख्यकोव ने जनरल को किस प्रकार की माफी दी?",
    option: [
        "औपचारिक",
        "व्यक्तिगत",
        "सतही",
        "असंतोषजनक"
    ],
    answer: "व्यक्तिगत"
},

{
    question: "भूषण की कविता निम्न में से कौन है?",
    option: [
        "हार-जीत",
        "कवित्त",
        "उषा",
        "छप्पय"
    ],
    answer: "कवित्त"
},

{
    question: "सूरदास किस मार्ग में दीक्षित हुए?",
    option: [
        "अष्टछाप",
        "संतमार्ग",
        "पुष्टिमार्ग",
        "इनमें कोई नहीं"
    ],
    answer: "पुष्टिमार्ग"
},

{
    question: "‘संवाद’ में सबसे महत्वपूर्ण क्या है?",
    option: [
        "तर्क",
        "जिज्ञासा",
        "आत्मीयता",
        "प्रवाहपूर्ण भाषा"
    ],
    answer: "आत्मीयता"
},

{
    question: "चेख्यकोव की पत्नी की प्रतिक्रिया पर जनरल की प्रतिक्रिया क्या थी?",
    option: [
        "तटस्थ",
        "उदासीन",
        "गुस्से में",
        "सहानुभूति से"
    ],
    answer: "उदासीन"
},

{
    question: "नाभादास का जन्म कब हुआ था?",
    option: [
        "1550 ई. में",
        "1570 ई. में",
        "1560 ई. में",
        "1565 ई. में"
    ],
    answer: "1570 ई. में"
},

{
    question: "'उषा' शीर्षक कविता के कवि हैं",
    option: [
        "पंत",
        "निराला",
        "ज्ञानदत्तपति",
        "शमशेर बहादुर सिंह"
    ],
    answer: "शमशेर बहादुर सिंह"
},

{
    question: "‘पेशगी’ कहानी में घर की मालकिन का प्रमुख गतिविधि क्या है?",
    option: [
        "ब्रिज खेलना",
        "खाना बनाना",
        "बच्चों की देखभाल",
        "चिकित्सा"
    ],
    answer: "ब्रिज खेलना"
},

{
    question: "‘सहर्ष स्वीकारा है’ कविता के रचयिता कौन हैं?",
    option: [
        "नागार्जुन",
        "मुक्तिबोध",
        "केदारनाथ सिंह",
        "त्रिलोचन"
    ],
    answer: "मुक्तिबोध"
},

{
    question: "विनोद कुमार शुक्ल का पहला कविता संग्रह ‘लगभग जयहिंद’ पहचान सीरीज के अन्तर्गत कब प्रकाशित हुआ?",
    option: [
        "1971 ई० में",
        "1972 ई० में",
        "1973 ई० में",
        "1974 ई० में"
    ],
    answer: "1971 ई० में"
},

{
    question: "कौन-सी कृति उदय प्रकाश की नहीं है?",
    option: [
        "पीली छतरीवाली लड़की",
        "पॉल गोमरा का स्कूटर",
        "टूटा हुआ पुल",
        "और अंत में प्रार्थना"
    ],
    answer: "टूटा हुआ पुल"
},

{
    question: "‘सूरसागर’ किसकी रचना है?",
    option: [
        "रेदास",
        "सूरदास",
        "नंददास",
        "तुलसीदास"
    ],
    answer: "सूरदास"
},

{
    question: "निम्नलिखित में कौन-सी रचना जगदीशचन्द्र माथुर की है?",
    option: [
        "सिपाही की माँ",
        "जूठन",
        "ओ सदानीरा",
        "तिरिछ"
    ],
    answer: "ओ सदानीरा"
},

{
    question: "मलिक मुहम्मद जायसी किस परंपरा के कवि हैं ?",
    option: [
        "सगुण कृष्णभक्ति परंपरा",
        "सगुण रामभक्ति परंपरा",
        "प्रेमाख्यानक काव्य-परंपरा",
        "संस्कृत काव्य-परंपरा"
    ],
    answer: "प्रेमाख्यानक काव्य-परंपरा"
},

{
    question: "नाटक के प्रारम्भ में होनेवाले मंगल पाठ को क्या कहा जाता है?",
    option: [
        "भजन",
        "नांदी पाठ",
        "मंगलाचरण",
        "आरती"
    ],
    answer: "नांदी पाठ"
},

{
    question: "हेनरी लोपेज के लेखन का मुख्य विषय क्या है?",
    option: [
        "सामाजिक विषमता",
        "प्रेम",
        "युद्ध",
        "खेल"
    ],
    answer: "सामाजिक विषमता"
},

{
    question: "जयशंकर प्रसाद ने कौन-सी कविता लिखी है?",
    option: [
        "पुत्र वियोग",
        "तुमुल कोलाहल कलह में",
        "उषा",
        "हार जीत"
    ],
    answer: "तुमुल कोलाहल कलह में"
},

{
    question: "इनमें से कौन-सी पुस्तक प्रसादजी की है?",
    option: [
        "झरना",
        "चित्राधारा",
        "सूरजमुखी अँधेरे के",
        "चित्रकोटि"
    ],
    answer: "झरना"
},

{
    question: "कौन-सी कृति तुलसीदास द्वारा रचित नहीं है ?",
    option: [
        "‘वैराग्य संदीपिनी’",
        "‘पंचवटी’",
        "‘बरवैरामायण’",
        "‘जानकी मंगल’"
    ],
    answer: "‘पंचवटी’"
},

{
    question: "किसका जादू टूटता है?",
    option: [
        "उषा का",
        "संध्या का",
        "रजनी का",
        "नायिका के सौंदर्य का"
    ],
    answer: "उषा का"
},

{
    question: "शमशेर बहादुर सिंह ने कौन-सी कविता लिखी है?",
    option: [
        "पुत्र वियोग",
        "उषा",
        "हार-जीत",
        "अधिनायक"
    ],
    answer: "उषा"
},

{
    question: "पाठ्यपुस्तक में संकलित कड़बक कहाँ से लिए गए हैं ?",
    option: [
        "आखिरी कलाम",
        "अखरावट",
        "मधुमालती",
        "पद्मावत"
    ],
    answer: "पद्मावत"
},

{
    question: "पिताजी की मृत्यु कैसे होती है?",
    option: [
        "तिरिछ के काटने से",
        "धतूरे के जहर से",
        "दुर्घटना से",
        "मानसिक सदमे और अधिक रक्तस्राव से"
    ],
    answer: "मानसिक सदमे और अधिक रक्तस्राव से"
},

{
    question: "सूरदास किस भक्ति के कवि हैं?",
    option: [
        "रामभक्ति",
        "कृष्णभक्ति",
        "मातृभक्ति",
        "देशभक्ति"
    ],
    answer: "कृष्णभक्ति"
},

{
    question: "बालकृष्ण भट्ट किस युग के साहित्यकार हैं?",
    option: [
        "द्विवेदी युग के",
        "भारतेंदु युग के",
        "प्रेमचंद युग के",
        "छायावाद युग के"
    ],
    answer: "प्रेमचंद युग के"
},

{
    question: "उदय प्रकाश जी ने किस अंग्रेजी पत्रिका का सम्पादन किया?",
    option: [
        "इंडिया टुडे",
        "ब्लिट्ज",
        "एपिमैग्ज",
        "इनमें से कोई नहीं"
    ],
    answer: "एपिमैग्ज"
},

{
    question: "जयशंकर प्रसाद कितनी वर्ष की अवस्था में पितृविहीन हुए थे?",
    option: [
        "8 वर्ष",
        "12 वर्ष",
        "16 वर्ष",
        "20 वर्ष"
    ],
    answer: "12 वर्ष"
},

{
    question: "जायसी रचित ‘पद्मावत’ की भाषा क्या है ?",
    option: [
        "अवधी",
        "ब्रज",
        "खड़ीबोली",
        "मैथिली"
    ],
    answer: "अवधी"
},

{
    question: "भट्टजी को किसने अंग्रेजी साहित्य के एडिसन और स्टील की श्रेणी में रखा है?",
    option: [
        "हजारी प्रसाद द्विवेदी",
        "डॉ. नागेन्द्र",
        "रामचंद्र शुक्ल",
        "रामविलास शर्मा"
    ],
    answer: "रामचंद्र शुक्ल"
},

{
    question: "तुलसीदास ने प्रथम पद में अपना परिचय किस रूप में दिया है?",
    option: [
        "रामभक्त के रूप में",
        "महाकवि के रूप में",
        "दीन के दुखिया के रूप में",
        "सीता के दास के रूप में"
    ],
    answer: "सीता के दास के रूप में"
},

{
    question: "जे. कृष्णमूर्ति के अनुसार मानव के विचारों को, उसके सम्बन्धों तथा उसके प्रेम को कौन नष्ट कर देता है?",
    option: [
        "उत्साह",
        "नाराजगी",
        "खुशी",
        "भय"
    ],
    answer: "भय"
},

{
    question: "‘सिपाही की माँ’ एकांकी की बिरहनी चारपाई के पास मोड़े पर बैठी क्या करती दिखाई देती है?",
    option: [
        "सूत्र कातती",
        "स्वेटर बुनती",
        "चटाई बुनती",
        "चावल चुनती"
    ],
    answer: "सूत्र कातती"
},

{
    question: "सुभद्रा कुमारी चौहान का प्रतिनिधि कविता संग्रह कौन है?",
    option: [
        "त्रिधारा",
        "मुकुल",
        "अनामिका",
        "गीतिका"
    ],
    answer: "मुकुल"
},

{
    question: "‘पेशगी’ कहानी में बच्ची की स्थिति कैसी थी?",
    option: [
        "अज्ञात",
        "सुखद",
        "खराब",
        "अस्थिर"
    ],
    answer: "खराब"
},

{
    question: "ईसाई लड़कियाँ बिरहनी के घर आकर क्या माँगती हैं?",
    option: [
        "रुपये",
        "चावल-दाल",
        "कपड़े",
        "इनमें से कोई नहीं"
    ],
    answer: "चावल-दाल"
},

{
    question: "रॉबिन्सन क्रूसो को कब तक मनुष्य का मुख देखने को नहीं मिला?",
    option: [
        "10 वर्ष तक",
        "12 वर्ष तक",
        "16 वर्ष तक",
        "18 वर्ष तक"
    ],
    answer: "16 वर्ष तक"
},

{
    question: "‘पेशगी’ कहानी का कौन सा तत्व सामाजिक विषमता को दर्शाता है?",
    option: [
        "सम्पन्नता और विपन्नता",
        "शिक्षा और बेरोज़गारी",
        "प्रेम और द्वेष",
        "धर्म और संस्कृति"
    ],
    answer: "सम्पन्नता और विपन्नता"
},

{
    question: "शमशेर बहादुर सिंह की कौन-सी रचना है?",
    option: [
        "इन्द्रजाल",
        "मुकुल",
        "उदिता",
        "इनमें से कोई नहीं"
    ],
    answer: "उदिता"
},

{
    question: "‘कछुआ धर्म’ किसकी कृति है ?",
    option: [
        "प्रताप नारायण मिश्र",
        "बालकृष्ण भट्ट",
        "रामचंद्र शुक्ल",
        "चंद्रधर शर्मा ‘गुलेरी’"
    ],
    answer: "चंद्रधर शर्मा ‘गुलेरी’"
},

{
    question: "चेख्यकोव ने किससे व्यक्तिगत रूप से माफी मांगी?",
    option: [
        "जनरल ब्रिजालोव",
        "पत्नी",
        "मित्र",
        "सहकर्मी"
    ],
    answer: "जनरल ब्रिजालोव"
},

{
    question: "‘सिपाही की माँ’ एकांकी की कथावस्तु है—",
    option: [
        "निम्न मध्यम वर्ग की",
        "उच्च वर्ग की",
        "उच्च मध्यम वर्ग की",
        "निम्न वर्ग की"
    ],
    answer: "निम्न मध्यम वर्ग की"
},

{
    question: "सेब बेचने वाली लड़की की आयु कितनी थी?",
    option: [
        "सात-आठ साल",
        "दस-बारह साल",
        "पन्द्रह-सोलह साल",
        "इक्कीस-बाईस साल"
    ],
    answer: "सात-आठ साल"
},

{
    question: "इनमें से कौन-सी पुस्तक प्रसादजी की है?",
    option: [
        "झरना",
        "चित्राधारा",
        "सूरजमुखी अँधेरे के",
        "चित्रकोटि"
    ],
    answer: "झरना"
},

{
    question: "'छत्रसाल दशक' किसकी कृति है?",
    option: [
        "द्विजदेव की",
        "जयदेव की",
        "भूषण की",
        "मतिराम की"
    ],
    answer: "भूषण की"
},

{
    question: "'लिरिक' का पर्याय है",
    option: [
        "प्रगीत",
        "कथा",
        "जीवनी",
        "कल्पना"
    ],
    answer: "प्रगीत"
},

{
    question: "कौन-सी रचना तुलसी दास की है?",
    option: [
        "सूरसागर",
        "विनय पत्रिका",
        "प्रायश्चित",
        "पद्मावत"
    ],
    answer: "विनय पत्रिका"
},

{
    question: "कौन-सा निबंध गुलेरी रचित नहीं है?",
    option: [
        "देवानामप्रिय",
        "मजदूरी और प्रेम",
        "पुरानी हिन्दी",
        "मारिस मोहि कुठाँव"
    ],
    answer: "मजदूरी और प्रेम"
},

{
    question: "चेख्यकोव की माफी के बावजूद जनरल की प्रतिक्रिया क्या थी?",
    option: [
        "समझदारी",
        "तटस्थता",
        "उपेक्षा",
        "हर्ष"
    ],
    answer: "उपेक्षा"
},

{
    question: "रघुवीर सहाय ने कौन-सी कविता लिखी है?",
    option: [
        "पुनर्वियोग",
        "गाँव का घर",
        "अधिनायक",
        "जन-जन का चेहरा"
    ],
    answer: "अधिनायक"
},

{
    question: "'सूर कवित्त सुनि कौन कवि' में कौन-सा अलंकार है?",
    option: [
        "यमक",
        "रूपक",
        "उपमा",
        "अनुप्रास"
    ],
    answer: "अनुप्रास"
},

{
    question: "निम्नलिखित में कौन 'प्रत्यय की छाया' के कवि हैं?",
    option: [
        "निराला",
        "पंत",
        "जयशंकर प्रसाद",
        "रामकुमार वर्मा"
    ],
    answer: "जयशंकर प्रसाद"
},

{
    question: "दिनकर जी को किसके घर पर दिल का दौरा था ?",
    option: [
        "रामनाथ जी गोयनका के",
        "गंगा बाबू के",
        "जयप्रकाश नारायण के",
        "ईश्वर अय्यर के"
    ],
    answer: "रामनाथ जी गोयनका के"
},

{
    question: "‘क्लर्क की मौत’ कहानी में चेख्यकोव की आत्महत्या का मुख्य कारण क्या था?",
    option: [
        "मानसिक तनाव",
        "शारीरिक बीमारी",
        "सामाजिक अपमान",
        "व्यक्तिगत असफलता"
    ],
    answer: "सामाजिक अपमान"
},

{
    question: "कारमेन को किस वजह से खलल डालने का डर था?",
    option: [
        "फटकार सुनने के डर से",
        "नौकरी खोने के डर से",
        "लोगों की नाराजगी के डर से",
        "परिवार की शिकायत के डर से"
    ],
    answer: "फटकार सुनने के डर से"
},

{
    question: "‘तिरिछ’ को कैसी कहानी माना जाता है?",
    option: [
        "आदर्शवादी कहानी",
        "आदर्शोन्मुख कहानी",
        "‘जादुई यथार्थ’ की कहानी",
        "द्विआत्मक कहानी"
    ],
    answer: "‘जादुई यथार्थ’ की कहानी"
},

{
    question: "‘गुलामी का नशा’ किसकी रचना है?",
    option: [
        "सुभद्रा कुमारी चौहान की",
        "ठाकुर रामनाथ सिंह की",
        "ठाकुर लक्ष्मण सिंह की",
        "इनमें से किसी की नहीं"
    ],
    answer: "ठाकुर रामनाथ सिंह की"
},

{
    question: "नामवर सिंह प्रधान संपादक थे",
    option: [
        "‘हंस’ के",
        "‘सरस्वती’ के",
        "‘वागर्थ’ के",
        "‘आलोचना (त्रैमासिक)’ के"
    ],
    answer: "‘आलोचना (त्रैमासिक)’ के"
},

{
    question: "'लिखने का कारण' शीर्षक निबंध किस लेखक की रचना है? [2022 A, I.Sc.]",
    option: [
        "ज्ञानेंद्रपति",
        "अशोक वाजपेयी",
        "जयशंकर प्रसाद",
        "रघुवीर सहाय"
    ],
    answer: "रघुवीर सहाय"
},

{
    question: "गैंग्रीन इनमें किससे संबद्ध है ?",
    option: [
        "पशु",
        "देश",
        "वनस्पति",
        "बीमारी"
    ],
    answer: "बीमारी"
},

{
    question: "‘सूरसागर’ किस भाषा में रचित है?",
    option: [
        "भोजपुरी में",
        "संस्कृत में",
        "ब्रजभाषा में",
        "अवधी में"
    ],
    answer: "ब्रजभाषा में"
},

{
    question: "सूरदास किस भाषा के प्रसिद्ध कवि हैं?",
    option: [
        "अवधी",
        "खड़ी बोली",
        "ब्रजभाषा",
        "मैथिली"
    ],
    answer: "ब्रजभाषा"
},

{
    question: "‘पद्मावत’ किसकी रचना है ?",
    option: [
        "मुल्ला दाऊद की",
        "कुतुबन की",
        "जायसी की",
        "मंझन की"
    ],
    answer: "जायसी की"
},

{
    question: "चेख्यकोव ने जनरल से माफी क्यों मांगी?",
    option: [
        "मानसिक तनाव",
        "सामाजिक अपराध",
        "व्यक्तिगत अपराध",
        "पेशेवर गलती"
    ],
    answer: "व्यक्तिगत अपराध"
},

{
    question: "कौन-सी कृति तुलसीदास द्वारा रचित नहीं है?",
    option: [
        "‘वैराग्य संदीपिनी’",
        "‘पंचवटी’",
        "‘बरवैरामायण’",
        "‘जानकी मंगल’"
    ],
    answer: "‘पंचवटी’"
},

{
    question: "चेख्यकोव की माफी का जनरल की प्रतिक्रिया क्या थी?",
    option: [
        "सकारात्मक",
        "तटस्थ",
        "नकारात्मक",
        "उपेक्षात्मक"
    ],
    answer: "तटस्थ"
},

{
    question: "होशेकम ने जमीन पर किस वस्तु को पाया था?",
    option: [
        "बटुआ",
        "लकड़ी का टुकड़ा",
        "रस्सी का टुकड़ा",
        "सिक्का"
    ],
    answer: "रस्सी का टुकड़ा"
},

{
    question: "‘अरेखा-प्रेखा’ उदय प्रकाश की कैसी कृति है?",
    option: [
        "उपन्यास",
        "कहानी-संग्रह",
        "कविता-संग्रह",
        "इनमें कोई नहीं"
    ],
    answer: "कहानी-संग्रह"
},

{
    question: "ओमप्रकाश वाल्मीकि को प्यार से मंशी जी कौन कहता था?",
    option: [
        "हेडमास्टर",
        "मित्र",
        "पिताजी",
        "माँ"
    ],
    answer: "पिताजी"
},

{
    question: "तन गई रीढ़ किसकी कविता है?",
    option: [
        "मुक्तिबोध",
        "त्रिलोचन",
        "नागार्जुन",
        "निराला"
    ],
    answer: "नागार्जुन"
},

{
    question: "‘अंडे के छिलके’ के रचनाकार का नाम क्या है?",
    option: [
        "मोहन राकेश",
        "मलयज",
        "ओमप्रकाश वाल्मीकि",
        "नामवर सिंह नाम था?"
    ],
    answer: "मोहन राकेश"
},

{
    question: "निम्नलिखित में कौन-सी रचना दिनकर जी की नहीं है?",
    option: [
        "उर्वशी",
        "रश्मिरथी",
        "जूठान",
        "कुरुक्षेत्र"
    ],
    answer: "जूठान"
},

{
    question: "सुभद्रा कुमारी चौहान की कौन सी कृति है?",
    option: [
        "झरना",
        "पश्चवती",
        "काठ का सपना",
        "सभा के खेल"
    ],
    answer: "सभा के खेल"
},

{
    question: "अंतोन चेखव का जन्म वर्ष क्या था?",
    option: [
        "1860",
        "1870",
        "1880",
        "1890"
    ],
    answer: "1860"
},

{
    question: "चेख्यकोव का आंतरिक भावनात्मक स्थिति कैसी थी?",
    option: [
        "खुश",
        "उदास",
        "संतुष्ट",
        "यंत्रचालित"
    ],
    answer: "यंत्रचालित"
},

{
    question: "'ओ सदानीरा' शीर्षक पाठ किस विधा के अन्तर्गत आता है?",
    option: [
        "निबन्ध",
        "कहानी",
        "कविता",
        "नाटक"
    ],
    answer: "निबन्ध"
},

{
    question: "'शिवाबावनी' में किसकी वीरता का बखान है?",
    option: [
        "शिवाजी की",
        "शिवाजी की",
        "महाराणा प्रताप की",
        "इनमें से कोई नहीं"
    ],
    answer: "शिवाजी की"
},

{
    question: "कहानीकार तिरिछ की लाश को जलाने जंगल में किसके साथ गया था?",
    option: [
        "शानू",
        "भानू",
        "धनू",
        "कृष्ण"
    ],
    answer: "धनू"
},

{
    question: "भूषण रीति काल की किस धारा के कवि हैं?",
    option: [
        "निर्गुण धारा के",
        "रीतियुक्त धारा के",
        "सगुण धारा के",
        "रीति युक्त धारा के"
    ],
    answer: "रीति युक्त धारा के"
},

{
    question: "प्रसाद जी की किस कृति में आधुनिक मानव सभ्यता की मार्मिक समीक्षा की गयी है?",
    option: [
        "विशाख",
        "स्कंदगुप्त",
        "इन्द्रजाल",
        "कामायनी"
    ],
    answer: "कामायनी"
},

{
    question: "कौन सी रचना नाभादास की है?",
    option: [
        "सूरसागर",
        "भक्तमाल",
        "बिहारी सतसई",
        "बीजक"
    ],
    answer: "भक्तमाल"
},

{
    question: "‘सिपाही की माँ’ एकांकी के अनुसार लड़ाई कहाँ हो रही है?",
    option: [
        "लाहौर में",
        "बर्मा में",
        "बंगाल में",
        "जापान में"
    ],
    answer: "बर्मा में"
},

{
    question: "प्रसादजी के पिता का नाम था",
    option: [
        "रविन्द्र प्रसाद साहू",
        "देवी प्रसाद साहू",
        "कालिका प्रसाद साहू",
        "चंडीका प्रसाद साहू"
    ],
    answer: "देवी प्रसाद साहू"
},

{
    question: "होशेकम पर बटुआ वापस लौटवाने का आरोप क्यों लगाया गया?",
    option: [
        "उसकी सच्चाई का खुलासा हो गया था",
        "उसने चोरी की थी",
        "उसने बटुआ बेचा था",
        "उसने बटुआ खोया था"
    ],
    answer: "उसकी सच्चाई का खुलासा हो गया था"
},

{
    question: "नामवर सिंह को 'कविता के नए प्रतिमान' पर साहित्य अकादमी पुरस्कार कब मिला?",
    option: [
        "1970 ई. में",
        "1971 ई. में",
        "1972 ई. में",
        "1973 ई. में"
    ],
    answer: "1971 ई. में"
},

{
    question: "प्रसादजी का जन्म कहाँ हुआ था?",
    option: [
        "इलाहाबाद में",
        "पटना में",
        "वाराणसी में",
        "लखनऊ में"
    ],
    answer: "वाराणसी में"
},

{
    question: "चेख्यकोव की कहानी का अंत किस तरह हुआ?",
    option: [
        "सुखद",
        "दुखद",
        "आशाजनक",
        "उत्साहजनक"
    ],
    answer: "दुखद"
},

{
    question: "कौन-सी कृति विनोद कुमार शुक्ल की है?",
    option: [
        "दीवार में एक खिड़की रहती थी",
        "कुछ पते कुछ चिट्ठियाँ",
        "हारे को हरिनाम",
        "मौत मुस्कुराई-"
    ],
    answer: "दीवार में एक खिड़की रहती थी"
},

{
    question: "‘सजल जलपात’ में कौन-सा अलंकार है?",
    option: [
        "रूपक",
        "यमक",
        "उपमा",
        "श्लेष"
    ],
    answer: "रूपक"
},

{
    question: "'मैं तुम लोगों से दूर हूँ' किसकी कविता है?",
    option: [
        "मुक्तिबोध",
        "हजारी प्रसाद द्विवेदी",
        "पंत",
        "अज्ञेय"
    ],
    answer: "मुक्तिबोध"
},

{
    question: "जयप्रकाश नारायण किसको भाई कहते थे ?",
    option: [
        "दिनकर जी को",
        "जवाहरलाल जी को",
        "रामनाथ गोयनका को",
        "गंगाबाबू को"
    ],
    answer: "जवाहरलाल जी को"
},

{
    question: "चेख्यकोव की मौत के बाद उसकी स्थिति कैसी थी?",
    option: [
        "आरामदायक",
        "दर्दनाक",
        "अज्ञात",
        "राहत भरी"
    ],
    answer: "दर्दनाक"
},

{
    question: "‘दिनकर’ को किस कृति पर भारतीय ज्ञानपीठ पुरस्कार प्राप्त हुआ?",
    option: [
        "अर्द्धनारीश्वर",
        "उर्वशी",
        "हुंकार",
        "कुरुक्षेत्र"
    ],
    answer: "उर्वशी"
},

{
    question: "मिस्टर रैडक्लिफ के जमादार लहना सिंह का नम्बर क्या था ?",
    option: [
        "77",
        "105",
        "1805",
        "72"
    ],
    answer: "77"
},

{
    question: "‘बिखरे मोती’ क्या है?",
    option: [
        "उपन्यास",
        "काव्य संकलन",
        "निबंध संकलन",
        "कहानी संग्रह"
    ],
    answer: "कहानी संग्रह"
},

{
    question: "तुलसीदास का जन्म कहाँ हुआ था?",
    option: [
        "राजापुर (बाँदा, उत्तर प्रदेश)",
        "अयोध्या में",
        "हाजीपुर में",
        "प्रयाग में"
    ],
    answer: "राजापुर (बाँदा, उत्तर प्रदेश)"
},

{
    question: "होशेकम पर जो आरोप लगाए गए, उन्होंने किसे आहत किया?",
    option: [
        "उसकी सेहत को",
        "उसकी आत्मा को",
        "उसके परिवार को",
        "उसके दुश्मनों को"
    ],
    answer: "उसकी आत्मा को"
},

{
    question: "लेखक के पिताजी को बचपन में किस रोग की शिकायत थी?",
    option: [
        "पीलिया",
        "एपॉडाइसाइटिस",
        "एप्नेमिया",
        "धसजरा"
    ],
    answer: "एपॉडाइसाइटिस"
},

{
    question: "किसने अपने जीवन के अन्तिम दिनों में नारित्व की साधना की थी?",
    option: [
        "गाँधी जी ने",
        "रवीन्द्रनाथ ने",
        "दिनकर जी ने",
        "उदयप्रकाश ने"
    ],
    answer: "गाँधी जी ने"
},

{
    question: "राजा हरिसिंह देव को किसका मुकाबला करना पड़ा था?",
    option: [
        "गयासुद्दीन तुगलक का",
        "नादिरशाह का",
        "अहमदशाह का",
        "बाबर का"
    ],
    answer: "नादिरशाह का"
},

{
    question: "कौन-सी रचना ज्ञानेंद्रपति की नहीं है?",
    option: [
        "संशयात्मा",
        "भिनसार",
        "कवि ने कहा",
        "थोड़ी सी जगह"
    ],
    answer: "थोड़ी सी जगह"
},

{
    question: "जायसी ने किस दोष से युक्त होते हुए भी गुणवान हैं?",
    option: [
        "जिह्वा दोष",
        "नेत्र दोष",
        "सरोवर",
        "श्रवण दोष"
    ],
    answer: "नेत्र दोष"
},

{
    question: "बोलने से ही मनुष्य के रूप का साक्षात्कार होता है। यह किसने कहा?",
    option: [
        "एडीसन",
        "बेन जॉनसन",
        "स्पेंसर",
        "मिल्टन"
    ],
    answer: "बेन जॉनसन"
},

{
    question: "चेख्यकोव ने जनरल से कितनी बार माफी मांगी?",
    option: [
        "एक बार",
        "दो बार",
        "तीन बार",
        "चार बार"
    ],
    answer: "दो बार"
},

{
    question: "ज्ञानेंद्रपति सरकारी सेवा में क्या थे?",
    option: [
        "कारा अधीक्षक",
        "दंडाधिकारी",
        "अभियंता",
        "चिकित्सक"
    ],
    answer: "कारा अधीक्षक"
},

{
    question: "होशेकम को किस बात पर शर्म आई?",
    option: [
        "रस्सी उठाने पर",
        "बटुआ खोने पर",
        "बाजार में जाने पर",
        "दुश्मन को देखने पर"
    ],
    answer: "रस्सी उठाने पर"
},

{
    question: "‘तुमुल कोलाहल कलह में’ प्रसाद जी की किस रचना से ली गयी है?",
    option: [
        "इंद्रजाल",
        "झरना",
        "कामायनी",
        "ध्रुवस्वामिनी"
    ],
    answer: "कामायनी"
},

{
    question: "भूषण के पिता का नाम था-",
    option: [
        "रत्नाकर त्रिपाठी",
        "नंदन त्रिपाठी",
        "भगवंतदत्त त्रिपाठी",
        "शत्रुघ्न त्रिपाठी"
    ],
    answer: "रत्नाकर त्रिपाठी"
},

{
    question: "मलयज के अनुसार, किस कर्म के बिना मानवचेतना अधूरी है?",
    option: [
        "रचनात्मक कर्म",
        "आत्मपरक कर्म",
        "श्रेयकर्म",
        "इनमें कोई नहीं"
    ],
    answer: "रचनात्मक कर्म"
},

{
    question: "कौन-सा उपन्यास विनोद कुमार शुक्ल द्वारा लिखित है?",
    option: [
        "नौकर की कमीज",
        "कंकाल",
        "इरावती",
        "इनमें से कोई नहीं"
    ],
    answer: "नौकर की कमीज"
},

{
    question: "कौन-सी पुस्तक नामवर सिंह की नहीं है?",
    option: [
        "बकलम खुद",
        "इतिहास और आलोचना",
        "तिरिछ",
        "दूसरी परंपरा की खोज"
    ],
    answer: "तिरिछ"
},

{
    question: "कौन-सी कृति शमशेर बहादुर सिंह की नहीं है?",
    option: [
        "इतने पास अपने",
        "उदिता",
        "टूटी हुई बिखरी हुई",
        "भारत : इतिहास और संस्कृति"
    ],
    answer: "भारत : इतिहास और संस्कृति"
},

{
    question: "चातकी किसके लिए तरसती है?",
    option: [
        "चालक के लिए",
        "प्रसाद जी की कविता के लिए",
        "स्वाति नक्षत्र की पहली बूंद के लिए",
        "इनमें से कोई नहीं"
    ],
    answer: "स्वाति नक्षत्र की पहली बूंद के लिए"
},

{
    question: "दिनकर जी के अनुसार यदि पति विचार है तो पत्नी क्या है?",
    option: [
        "बुद्धि",
        "समझ",
        "भावना",
        "इनमें कोई नहीं"
    ],
    answer: "भावना"
},

{
    question: "वल्लभाचार्य से मिलने के पूर्व सूर किस भाव के पद गाते थे?",
    option: [
        "प्रेम",
        "विरक्ति",
        "दैन्य",
        "अवसाद"
    ],
    answer: "दैन्य"
},

{
    question: "‘बाज की दाढ़ में आदमी का खून लग चुका है।’ यह किस कविता की पंक्ति है?",
    option: [
        "हिमालय",
        "गरम हथेली",
        "आह! तुम्हारा सौंदर्य",
        "‘तय तो यही था’"
    ],
    answer: "‘तय तो यही था’"
},

{
    question: "दिनकर जी की पहली कविता किस पत्रिका में प्रकाशित हुई?",
    option: [
        "छात्र सहोदर",
        "छात्र पत्रिका",
        "छात्र मित्र",
        "इनमें से कोई नहीं"
    ],
    answer: "छात्र सहोदर"
},

{
    question: "चेख्यकोव की कहानी का अंत किस तरह हुआ?",
    option: [
        "सुखद",
        "दुखद",
        "आशाजनक",
        "उत्साहजनक"
    ],
    answer: "दुखद"
},

{
    question: "कवित्त के द्वितीय पद में किस रस की अभिव्यंजना हुई है?",
    option: [
        "करुण रस",
        "शृंगार रस",
        "वीर रस",
        "वीभत्स रस"
    ],
    answer: "वीभत्स रस"
},

{
    question: "जयशंकर प्रसाद किस वाद के कवि थे?",
    option: [
        "छायावाद",
        "प्रगतिवाद",
        "प्रयोगवाद",
        "अतियथार्थवाद"
    ],
    answer: "छायावाद"
},

{
    question: "'अधिनायक' शीर्षक कविता किस पर व्यंग्य है?",
    option: [
        "समकालीन राजनीति पर",
        "समकालीन राजनीतिक व्यवस्था पर",
        "सरकारी तंत्र पर",
        "इनमें से कोई नहीं"
    ],
    answer: "समकालीन राजनीति पर"
},

{
    question: "शमशेर बहादुर सिंह की पत्नी का नाम क्या है?",
    option: [
        "कर्मा देवी",
        "धर्म देवी",
        "रीता देवी",
        "इनमें कोई नहीं"
    ],
    answer: "धर्म देवी"
},

{
    question: "‘तिरिछ’ कहानी की केंद्रीय घटना का संबंध किससे है?",
    option: [
        "कहानीकार से",
        "कहानीकार की माँ से",
        "कहानीकार के पिता से",
        "कहानीकार के मित्र से"
    ],
    answer: "कहानीकार के पिता से"
},

{
    question: "“रोज’ कहानी की नायिका है ?",
    option: [
        "सालवती",
        "लीलावती",
        "मालती",
        "चंपा"
    ],
    answer: "मालती"
},

{
    question: "जयप्रकाश नारायण के पिताजी का क्या नाम था ?",
    option: [
        "दीनदयाल",
        "हरसूदयाल",
        "रामदयाल",
        "सर्वेशदयाल"
    ],
    answer: "हरसूदयाल"
},

{
    question: "‘तुलसीदास’ के रचयिता कौन हैं ?",
    option: [
        "तुलसीदास",
        "भवानीप्रसाद गुप्त",
        "सुमित्रानंदन पंत",
        "सूर्यकांत त्रिपाठी ‘निराला’"
    ],
    answer: "सूर्यकांत त्रिपाठी ‘निराला’"
},

{
    question: "'नाभादास' का काव्य रचना क्षेत्र था-",
    option: [
        "हरिद्वार",
        "काशी",
        "वृन्दावन",
        "मथुरा"
    ],
    answer: "वृन्दावन"
},

{
    question: "'अधिनायक' कैसी कविता है?",
    option: [
        "गद्य कविता",
        "व्यंग्य कविता",
        "पद्य कविता",
        "छायावादी कविता"
    ],
    answer: "व्यंग्य कविता"
},

{
    question: "ज्ञानेंद्रपति बीसवीं शती के किस दशक में उदित हुए?",
    option: [
        "पाँचवें दशक में",
        "छठे दशक में",
        "आठवें दशक में",
        "अन्तिम दशक में"
    ],
    answer: "आठवें दशक में"
},

{
    question: "‘पेशगी’ कहानी में कारमेन को किस कारण से खलल डालने का डर था?",
    option: [
        "फटकार के डर से",
        "नौकरी की सुरक्षा के डर से",
        "समाज की प्रतिक्रिया के डर से",
        "परिवार की नाराजगी के डर से"
    ],
    answer: "फटकार के डर से"
},

{
    question: "नाटक के प्रारम्भ में होनेवाले मंगल पाठ को क्या कहा जाता है?",
    option: [
        "भजन",
        "नांदी पाठ",
        "मंगलाचरण",
        "आरती"
    ],
    answer: "नांदी पाठ"
},

{
    question: "‘पेशगी’ कहानी में कारमेन की सामाजिक स्थिति कैसी है?",
    option: [
        "विपन्न",
        "सम्पन्न",
        "मध्यम",
        "असमान"
    ],
    answer: "विपन्न"
},

{
    question: "किसने देखा कि होशेकम ने रस्सी का टुकड़ा उठाया?",
    option: [
        "मैत्र मलांदे",
        "मैत्र ब्रेतों",
        "मारियस पोमेल",
        "मैत्र हुलब्रेक"
    ],
    answer: "मैत्र मलांदे"
},

{
    question: "इनमें से कौन-सी रचना तुलसी की नहीं है?",
    option: [
        "कवितावली",
        "बरवैरामायण",
        "गीतावली",
        "राधा-स्तुति"
    ],
    answer: "राधा-स्तुति"
},

{
    question: "शमशेर बहादुर सिंह को हिन्दी साहित्य में क्या कहा जाता है?",
    option: [
        "कवि शिरोमणि",
        "कवि रत्न",
        "कवियों के कवि",
        "इनमें से कोई नहीं"
    ],
    answer: "कवियों के कवि"
},

{
    question: "कवितावली के रचनाकार है",
    option: [
        "जायसी",
        "तुलसीदास",
        "कबीर",
        "सूरदास"
    ],
    answer: "तुलसीदास"
},

{
    question: "लेखक के पिताजी शहर क्यों गए थे?",
    option: [
        "इलाज करवाने के लिए",
        "सामान खरीदने के लिए",
        "किसी से मिलने के लिए",
        "अदालत में पेशी के लिए"
    ],
    answer: "अदालत में पेशी के लिए"
},

{
    question: "जे. कृष्णमूर्ति के संबंध में कौन-सा तथ्य सही है?",
    option: [
        "वे प्रायः लिखते थे",
        "वे उपन्यासकार थे",
        "वे प्रसिद्ध नाटककार थे।",
        "वे प्रायः बोलते थे, संभाषण करते थे"
    ],
    answer: "वे प्रसिद्ध नाटककार थे।"
},

{
    question: "किसकी माँ पागल हो गयी है?",
    option: [
        "मानक की",
        "सिपाही की",
        "चौधरी की",
        "दीनू की"
    ],
    answer: "सिपाही की"
},

{
    question: "सूरदास के गुरु का क्या नाम था?",
    option: [
        "नरहरिदास",
        "विट्ठलनाथ",
        "वल्लभाचार्य",
        "आनंददास"
    ],
    answer: "वल्लभाचार्य"
},

{
    question: "उदय प्रकाश का जन्म हुआ था-",
    option: [
        "जनवरी 1952 को",
        "20 फरवरी 1948 को",
        "18 जून 1944 को",
        "12 जुलाई 1944 को"
    ],
    answer: "जनवरी 1952 को"
},

{
    question: "कौन-सी पुस्तक नामवर सिंह की है ?",
    option: [
        "पीली छतरीवाली लड़की",
        "‘पृथ्वीराज रासो की भाषा’",
        "अंतराल",
        "न आदमी न कल"
    ],
    answer: "‘पृथ्वीराज रासो की भाषा’"
},

{
    question: "जगदीशचन्द्र माथुर का जन्म हुआ था",
    option: [
        "16 जुलाई 1917 को",
        "16 जुलाई 1918 को",
        "17 अगस्त 1917 को",
        "20 सितम्बर 1917 को"
    ],
    answer: "16 जुलाई 1917 को"
},

{
    question: "‘ओ मेरे सपनों’ क्या है?",
    option: [
        "उपन्यास",
        "कहानी",
        "खंडकाव्य",
        "नाटक"
    ],
    answer: "नाटक"
},

{
    question: "‘तिरिछ’ कहानी के ‘पिताजी’ का नाम क्या है?",
    option: [
        "रामनिहाल प्रसाद",
        "रामस्वास्थ्य प्रसाद",
        "रामकिशोर प्रसाद",
        "रामबली प्रसाद"
    ],
    answer: "रामस्वास्थ्य प्रसाद"
},

{
    question: "किसे अंततः दोषी ठहराया गया?",
    option: [
        "होशेकम",
        "मलांदे",
        "मारियस पोमेल",
        "मैत्र ब्रेतों"
    ],
    answer: "होशेकम"
},

{
    question: "चेख्यकोव ने किसके साथ अंतिम बार संपर्क किया?",
    option: [
        "पत्नी",
        "मित्र",
        "जनरल ब्रिजालोव",
        "सहकर्मी"
    ],
    answer: "जनरल ब्रिजालोव"
},

{
    question: "‘क्लर्क की मौत’ कहानी का मुख्य पात्र कौन है?",
    option: [
        "इवान दमित्रिच चेख्यकोव",
        "जनरल ब्रिजालोव",
        "अंतोन चेखव",
        "क्लर्क"
    ],
    answer: "इवान दमित्रिच चेख्यकोव"
},

{
    question: "निम्नलिखित में कौन 'प्रत्यय की छाया' के कवि हैं ?",
    option: [
        "निराला",
        "पंत",
        "जयशंकर प्रसाद",
        "रामकुमार वर्मा"
    ],
    answer: "जयशंकर प्रसाद"
},

{
    question: "देवी प्रसाद साहू जयशंकर प्रसाद के कौन थे?",
    option: [
        "पितामह",
        "प्रतिपितामह",
        "पिता",
        "इनमें से कोई नहीं"
    ],
    answer: "पिता"
},

{
    question: "किसका जादू टूटता है?",
    option: [
        "उषा का",
        "संध्या का",
        "रजनी का",
        "नायिका के सौंदर्य का"
    ],
    answer: "उषा का"
},

{
    question: "चेख्यकोव की पत्नी ने किस प्रकार की प्रतिक्रिया व्यक्त की?",
    option: [
        "गुस्से में",
        "उदासीनता",
        "चिंता के साथ",
        "सहानुभूति के साथ"
    ],
    answer: "उदासीनता"
},

{
    question: "कहानी ‘रस्सी का टुकड़ा’ का अंत कैसा है?",
    option: [
        "सुखद",
        "दुखद",
        "हास्यपूर्ण",
        "सामान्य"
    ],
    answer: "दुखद"
},

{
    question: "ज्ञानेंद्रपति ने हिन्दी में एम० ए० किस विश्वविद्यालय से किया?",
    option: [
        "दिल्ली विश्वविद्यालय, दिल्ली",
        "कानपुर विश्वविद्यालय, कानपुर",
        "पटना विश्वविद्यालय, पटना",
        "बिहार विश्वविद्यालय, मुजफ्फरपुर"
    ],
    answer: "बिहार विश्वविद्यालय, मुजफ्फरपुर"
},

{
    question: "‘बोलने से ही मनुष्य के रूप का साक्षात्कार होता है।’ यह किसने कहा?",
    option: [
        "एडीसन",
        "बेन जॉनसन",
        "स्पेंसर",
        "मिल्टन"
    ],
    answer: "बेन जॉनसन"
},

{
    question: "ज्ञानेंद्रपति बी० ए० तथा अंग्रेजी में एम० ए० किस विश्वविद्यालय से किए?",
    option: [
        "बिहार विश्वविद्यालय, मुजफ्फरपुर",
        "मगध विश्वविद्यालय, बोधगया",
        "पटना विश्वविद्यालय, पटना",
        "इलाहाबाद विश्वविद्यालय, इलाहाबाद"
    ],
    answer: "पटना विश्वविद्यालय, पटना"
},

{
    question: "उदय प्रकाश जी ने किस अंग्रेजी पत्रिका का सम्पादन किया?",
    option: [
        "इंडिया टुडे",
        "ब्लिट्ज",
        "एपीमर्स",
        "इनमें से कोई नहीं"
    ],
    answer: "एपीमर्स"
},

{
    question: "दिनकर को किस कृति पर भारतीय ज्ञानपीठ पुरस्कार प्राप्त हुआ?",
    option: [
        "अर्द्धनारीश्वर",
        "उर्वशी",
        "हुंकार",
        "कुरुक्षेत्र"
    ],
    answer: "उर्वशी"
},

{
    question: "चेख्यकोव ने जनरल के बारे में क्या सोचा?",
    option: [
        "उदासीन",
        "नकारात्मक",
        "सकारात्मक",
        "चिंतित"
    ],
    answer: "नकारात्मक"
},

{
    question: "‘रामचरितमानस’ की भाषा है",
    option: [
        "मैथिली",
        "संस्कृत",
        "अवधी",
        "ब्रजभाषा"
    ],
    answer: "अवधी"
},

{
    question: "ज्ञानेंद्रपति का काव्य नाटक है",
    option: [
        "पढ़ते-पढ़ते",
        "भिनसार",
        "गंगातट",
        "एकचक्रानगरी"
    ],
    answer: "एकचक्रानगरी"
},

{
    question: "‘सरोज स्मृति’ किसकी रचना है?",
    option: [
        "पंत",
        "निराला",
        "महादेवी वर्मा",
        "सुभद्रा कुमारी चौहान"
    ],
    answer: "निराला"
},

{
    question: "शमशेर बहादुर सिंह का सम्बन्ध किस विश्वविद्यालय से रहा है?",
    option: [
        "इलाहाबाद विश्वविद्यालय, इलाहाबाद",
        "गढ़वाल विश्वविद्यालय, उत्तराखंड",
        "विक्रम विश्वविद्यालय, उज्जैन",
        "इनमें से कोई नहीं"
    ],
    answer: "विक्रम विश्वविद्यालय, उज्जैन"
},

{
    question: "ज्ञानेंद्रपति का काव्य नाटक है",
    option: [
        "पढ़ते-पढ़ते",
        "भिनसार",
        "गंगातट",
        "एकचक्रानगरी"
    ],
    answer: "एकचक्रानगरी"
},

{
    question: "‘कुली प्रथा’ किसकी कृति है?",
    option: [
        "ठाकुर लक्ष्मण सिंह की",
        "मुल्कराज आनंद की",
        "प्रेमचंद की",
        "ममता कालिया की"
    ],
    answer: "ठाकुर लक्ष्मण सिंह की"
},

{
    question: "जयशंकर प्रसाद ने किस भाषा में काव्य रचना की है?",
    option: [
        "अवधी",
        "खड़ी बोली",
        "ब्रज",
        "इनमें से कोई नहीं"
    ],
    answer: "खड़ी बोली"
},

{
    question: "‘प्यारे नन्हें बेटे को’ कविता में लोहा किसका प्रतीक है ?",
    option: [
        "बंदूक का",
        "मशीन का",
        "कर्म का",
        "धर्म का"
    ],
    answer: "कर्म का"
},

{
    question: "रंगून कहाँ है?",
    option: [
        "नेपाल में",
        "बर्मा में",
        "जापान में",
        "चीन में"
    ],
    answer: "बर्मा में"
},

{
    question: "रघुवीर सहाय किस समाचार साप्ताहिक के प्रधान संपादक थे?",
    option: [
        "दिनमान",
        "रविवार",
        "आज",
        "अमर उजाला"
    ],
    answer: "दिनमान"
},

{
    question: "नामवर सिंह के गुरु कौन थे?",
    option: [
        "रामचन्द्र शुक्ल",
        "हजारी प्रसाद द्विवेदी",
        "महावीर प्रसाद द्विवेदी",
        "इनमें से कोई नहीं"
    ],
    answer: "हजारी प्रसाद द्विवेदी"
},

{
    question: "‘तुमुल कोलाहल कलह में’ शीर्षक कविता के रचयिता कौन हैं?",
    option: [
        "सूर्यकांत त्रिपाठी ‘निराला’",
        "जयशंकर प्रसाद",
        "महादेवी वर्मा",
        "पंत"
    ],
    answer: "जयशंकर प्रसाद"
},

{
    question: "‘अज्ञेय’ को ज्ञानपीठ पुरस्कार किस रचना पर प्राप्त हुआ ?",
    option: [
        "कितनी नावों में कितनी बार",
        "बाबरा अहेरी",
        "ऑगन के पार द्वार",
        "शेखर : एक जीवनी"
    ],
    answer: "कितनी नावों में कितनी बार"
},

{
    question: "चेख्यकोव ने जनरल के पास जाकर क्या कहा?",
    option: [
        "“मुझे खेद है।”",
        "“मुझे माफ करें।”",
        "“मैं जान-बूझकर नहीं छींका।”",
        "“मैं आपके पास क्यों आया हूँ?”"
    ],
    answer: "“मुझे माफ करें।”"
},

{
    question: "कौन-सी कहानी चंद्रधर शर्मा गुलेरी की लिखी हुई नहीं है",
    option: [
        "‘सुखमय जीवन’",
        "‘बुद्ध का काँटा’",
        "‘उसने कहा था’",
        "‘कफन’"
    ],
    answer: "‘कफन’"
},

{
    question: "ओमप्रकाश वाल्मीकि की रचना कौन-सी है?",
    option: [
        "बलीराम",
        "जूठन",
        "प्रगीत और समाज",
        "रोज"
    ],
    answer: "जूठन"
},

{
    question: "कौन-सी रचना बालकृष्ण भट्ट की है?",
    option: [
        "रेल का विकट खेल",
        "कुरुक्षेत्र",
        "रेणुका",
        "प्राच्यविद्या"
    ],
    answer: "रेल का विकट खेल"
},

{
    question: "चेख्यकोव ने किस खेल का आनंद लिया?",
    option: [
        "फुटबॉल",
        "क्रिकेट",
        "टेनिस",
        "बास्केटबॉल"
    ],
    answer: "क्रिकेट"
},

{
    question: "देवी प्रसाद साहू जयशंकर प्रसाद के कौन थे?",
    option: [
        "पितामह",
        "प्रतिपितामह",
        "पिता",
        "इनमें से कोई नहीं"
    ],
    answer: "पिता"
},

{
    question: "‘पेशगी’ कहानी में कारमेन के बेटे की मृत्यु का कारण क्या था?",
    option: [
        "दवा की कमी",
        "चिकित्सा की कमी",
        "सामाजिक असहयोग",
        "गरीब स्थिति"
    ],
    answer: "दवा की कमी"
},

{
    question: "‘पेशगी’ कहानी में घर की मालकिन किस स्थिति का प्रतिनिधित्व करती है?",
    option: [
        "सम्पन्नता",
        "विपन्नता",
        "शिक्षा",
        "उद्योग"
    ],
    answer: "सम्पन्नता"
},

{
    question: "सुभद्रा कुमारी चौहान का जीवन सूना-सूना क्यों हो रहा है?",
    option: [
        "पति के दूर जाने के कारण",
        "जेल जाने के कारण",
        "पुत्र के असमय निधन के कारण",
        "इनमें से कोई नहीं"
    ],
    answer: "पुत्र के असमय निधन के कारण"
},

{
    question: "ओमप्रकाश ने किस नाट्यशाला की स्थापना की?",
    option: [
        "‘मेघदूत’",
        "‘रंगशाला’",
        "‘प्रेमचंद मंच’",
        "इनमें से कोई नहीं"
    ],
    answer: "‘मेघदूत’"
},

{
    question: "शमशेर बहादुर सिंह ने किस कोश का सम्पादन किया?",
    option: [
        "हिन्दी-अंग्रेजी कोश",
        "उर्दू-अंग्रेजी कोश",
        "उर्दू-हिन्दी कोश",
        "इनमें से कोई नहीं"
    ],
    answer: "उर्दू-हिन्दी कोश"
},

{
    question: "लेखक के पिताजी ट्रैक्टर से कहाँ उतरते थे?",
    option: [
        "स्टेट बैंक के पास",
        "मिनर्वा टॉकीज के पास",
        "थाने के पास",
        "डाक के पास"
    ],
    answer: "मिनर्वा टॉकीज के पास"
},

{
    question: "कहानी में होशेकम का किसके साथ दुश्मनी थी?",
    option: [
        "मैत्र मलांदे",
        "मैत्र ब्रेतों",
        "मैत्र हुलब्रेक",
        "मारियस पोमेल"
    ],
    answer: "मैत्र मलांदे"
},

{
    question: "हेनरी लोपेज का जन्म किस देश में हुआ था?",
    option: [
        "कांगो",
        "भारत",
        "अमेरिका",
        "ब्रिटेन"
    ],
    answer: "कांगो"
},

{
    question: "‘कामायनी’ के रचयिता कौन हैं?",
    option: [
        "जयशंकर प्रसाद",
        "सुमित्रानंदन पंत",
        "महादेवी वर्मा",
        "सूर्यकांत त्रिपाठी ‘निराला’"
    ],
    answer: "जयशंकर प्रसाद"
},

{
    question: "'ओ मेरे सपनों' क्या है?",
    option: [
        "उपन्यास",
        "कहानी",
        "खंडकाव्य",
        "नाटक"
    ],
    answer: "नाटक"
},

{
    question: "फर्डिनांड के अनुसार, मैडम अपना गुस्सा किस पर उतारती थी?",
    option: [
        "पति",
        "बच्चों",
        "नौकरों",
        "मित्रों"
    ],
    answer: "नौकरों"
},

{
    question: "‘पेशगी’ कहानी में अंतोन ने किस का चित्रण किया है?",
    option: [
        "सामाजिक विषमता",
        "खेल",
        "विज्ञान",
        "कला"
    ],
    answer: "सामाजिक विषमता"
},

{
    question: "कौन-सी रचना जयशंकर प्रसाद की है?",
    option: [
        "पद्मावत",
        "जानकी मंगल",
        "कंकाल",
        "शिवराज भूषण"
    ],
    answer: "कंकाल"
},

{
    question: "कहानी के अंत में होशेकम की मौत किस स्थिति में होती है?",
    option: [
        "आहत होकर",
        "बेगुनाही का दावा करते हुए",
        "दोषी साबित होकर",
        "अकेले रहकर"
    ],
    answer: "बेगुनाही का दावा करते हुए"
},

{
    question: "जायसी का जन्म स्थान कहाँ था?",
    option: [
        "इलाहाबाद",
        "बनारस",
        "कानपुर",
        "अमेठी"
    ],
    answer: "अमेठी"
},

{
    question: "पत्नी बिटिया को क्या करती है?",
    option: [
        "डाँटती है",
        "पढ़ाती है",
        "सुलाती है",
        "समझाती है"
    ],
    answer: "समझाती है"
},

{
    question: "होशेकम पर किस वस्तु को उठाने का आरोप लगा था?",
    option: [
        "बटुआ",
        "रस्सी",
        "सिक्का",
        "जूता"
    ],
    answer: "बटुआ"
},

{
    question: "‘कवितावली’ के रचनाकार हैं",
    option: [
        "जायसी",
        "तुलसीदास",
        "कबीरदास",
        "सूरदास"
    ],
    answer: "तुलसीदास"
},

{
    question: "होशेकम की मृत्यु के समय वह किस मानसिक स्थिति में था?",
    option: [
        "सन्निपात",
        "बेहोशी",
        "सामान्य",
        "उत्साह"
    ],
    answer: "सन्निपात"
},

{
    question: "किसने होशेकम को एक घूँसा मारा?",
    option: [
        "बाजार के लोगों में से किसी ने",
        "पुलिस ने",
        "मारियस पोमेल ने",
        "मैत्र हुलब्रेक ने"
    ],
    answer: "बाजार के लोगों में से किसी ने"
},

{
    question: "‘गरीबनिवाज’ कैसा शब्द है?",
    option: [
        "तत्सम",
        "विदेशज",
        "तद्भव",
        "देशज"
    ],
    answer: "विदेशज"
},

{
    question: "चातकी किसके लिए तरसती है?",
    option: [
        "चालक के लिए",
        "प्रसाद जी की कविता के लिए",
        "स्वाति नक्षत्र की पहली बूंद के लिए",
        "इनमें से कोई नहीं"
    ],
    answer: "स्वाति नक्षत्र की पहली बूंद के लिए"
},

{
    question: "कौन-सी कृति माथुरजी की नहीं है।",
    option: [
        "मेरी बाँसुरी",
        "बंदी",
        "रेशमी-टाई",
        "कोणार्क"
    ],
    answer: "रेशमी-टाई"
},

{
    question: "‘पुत्र वियोग’ शीर्षक कविता किस काव्य-संग्रह से ली गई है?",
    option: [
        "‘चित्राधार’ से",
        "‘नहर’ से",
        "‘मुकुल’ से",
        "‘दीपशिखा’ से"
    ],
    answer: "‘मुकुल’ से"
},

{
    question: "फणीश्वरनाथ ‘रेणु’ की पुस्तक है. –",
    option: [
        "सत्यकाम",
        "कुरुक्षेत्र",
        "उस जनपद का कवि हूँ",
        "मैला आँचल"
    ],
    answer: "मैला आँचल"
},

{
    question: "नाभादास की कौन-सी रचना है?",
    option: [
        "कड़वक",
        "कवित्त",
        "उषा",
        "छप्पय"
    ],
    answer: "छप्पय"
},

{
    question: "‘पेशगी’ कहानी किस सामाजिक वर्ग की विपन्नता को चित्रित करती है?",
    option: [
        "नौकरानी",
        "उद्योगपति",
        "किसान",
        "शिक्षक"
    ],
    answer: "नौकरानी"
},

{
    question: "'ओ सदानीरा' के लेखक हैं",
    option: [
        "जगदीशचन्द्र माथुर",
        "लक्ष्मीनारायण लाल",
        "लक्ष्मीनारायण मिश्र",
        "जयशंकर प्रसाद"
    ],
    answer: "जगदीशचन्द्र माथुर"
},

{
    question: "इनमें से कौन-सी रचना तुलसी की नहीं है ?",
    option: [
        "कवितावली",
        "बरवैरामायण",
        "गीतावली",
        "राधा-स्तुति"
    ],
    answer: "राधा-स्तुति"
},

{
    question: "जयशंकर प्रसाद के पितामह कौन थे?",
    option: [
        "शिवरतन साहू",
        "शिवजतन साहू",
        "शिवप्रसन्न साहू",
        "इनमें से कोई नहीं"
    ],
    answer: "शिवरतन साहू"
},

{
    question: "इनमें कौन-सी कृति मोहन राकेश की है?",
    option: [
        "जिंदगी मुर्दाबाद",
        "जानवर और जानवर",
        "कोठरी का घटवार",
        "बहती गंगा"
    ],
    answer: "जानवर और जानवर"
},

{
    question: "चेख्यकोव की कहानी में मृत्यु का कारण क्या था?",
    option: [
        "मानसिक तनाव",
        "शारीरिक बीमारी",
        "सामाजिक अपमान",
        "आत्महत्या"
    ],
    answer: "आत्महत्या"
},

{
    question: "‘हँसते हुए मेरा अकेलापन’ के लेखक हैं",
    option: [
        "मोहन राकेश",
        "मलयज",
        "उदय प्रकाश",
        "अज्ञेय"
    ],
    answer: "मलयज"
},

{
    question: "‘पेशगी’ कहानी में घर की मालकिन का कौन सा व्यवहार दिखाया गया है?",
    option: [
        "श्रेष्ठता",
        "विनम्रता",
        "उदासीनता",
        "असंवेदनशीलता"
    ],
    answer: "श्रेष्ठता"
},

{
    question: "'राम की शक्ति पूजा' किसकी कृति है ?",
    option: [
        "प्रसाद की",
        "निराला की",
        "पंत की",
        "रामविलास शर्मा की"
    ],
    answer: "निराला की"
},

{
    question: "‘तिरिछ’ कहानी के कहानीकार हैं",
    option: [
        "उदय प्रकाश",
        "बाल कृष्ण भट्ट",
        "चंद्रधर शर्मा गुलेरी",
        "सच्चिदानंद हीरानंद वात्स्यायन ‘अज्ञेय’"
    ],
    answer: "उदय प्रकाश"
},

{
    question: "'प्रगीत और समाज' के लेखक हैं",
    option: [
        "बालकृष्ण भट्ट",
        "जयप्रकाश नारायण",
        "नामवर सिंह",
        "उदय प्रकाश"
    ],
    answer: "नामवर सिंह"
},

{
    question: "‘सम्पूर्ण क्रांति’ क्या है ?",
    option: [
        "निबन्ध",
        "भाषण",
        "कहानी",
        "इनमें से कोई नहीं"
    ],
    answer: "भाषण"
},

{
    question: "आमापाली (अम्रपाली) ने तथागत को क्या सौंपा था?",
    option: [
        "कपिलवन",
        "आम्रवन",
        "दस हजार स्वर्ण मुद्राएँ",
        "अपना भवन"
    ],
    answer: "आम्रवन"
},

{
    question: "होशेकम का अंतिम दावा क्या था?",
    option: [
        "वह निर्दोष है",
        "उसने चोरी की थी",
        "उसने झूठ बोला",
        "उसने बटुआ लिया था"
    ],
    answer: "वह निर्दोष है"
},

{
    question: "चेख्यकोव ने ब्रिजालोव के पास क्यों जाकर माफी मांगी?",
    option: [
        "सामाजिक दबाव",
        "व्यक्तिगत अपराधबोध",
        "कार्य की जिम्मेदारी",
        "बौद्धिक उत्सुकता"
    ],
    answer: "व्यक्तिगत अपराधबोध"
},

{
    question: "सुरक्षा कहाँ हो सकती है?",
    option: [
        "घर के भीतर",
        "अँधेरे में",
        "पलायन में",
        "चुनौती को झेलने में"
    ],
    answer: "चुनौती को झेलने में"
},

{
    question: "‘सूरसागर’ किसकी रचना है?",
    option: [
        "रेदास",
        "सूरदास",
        "नंददास",
        "तुलसीदास"
    ],
    answer: "सूरदास"
},

{
    question: "निम्नलिखित में से कौन-सा नाटक जगदीशचन्द्र माथुर रचित है?",
    option: [
        "दीपक",
        "आधे-अधूरे",
        "कोणार्क",
        "ओ मेरे मन"
    ],
    answer: "कोणार्क"
},

{
    question: "प्रसाद की सफलतम नाट्यकृति है",
    option: [
        "स्कंदगुप्त",
        "एक घूँट",
        "ध्रुवस्वामिनी",
        "विशाख"
    ],
    answer: "ध्रुवस्वामिनी"
},

{
    question: "चेख्यकोव ने जनरल ब्रिजालोव से क्यों माफी मांगी?",
    option: [
        "व्यक्तिगत गलती",
        "पेशेवर तनाव",
        "सामाजिक दबाव",
        "मानसिक चिंता"
    ],
    answer: "व्यक्तिगत गलती"
},

{
    question: "विनोद कुमार शुक्ल का जन्म कब हुआ था?",
    option: [
        "1 जनवरी, 1937 को",
        "12 फरवरी, 1937 को",
        "20 मई, 1934 को",
        "12 जुलाई, 1944 को"
    ],
    answer: "1 जनवरी, 1937 को"
},

{
    question: "‘ध्रुवस्वामिनी’ कैसी कृति है?",
    option: [
        "महाकाव्य",
        "गीतिनाट्य",
        "गीतिकाव्य",
        "नाटक"
    ],
    answer: "नाटक"
},

{
    question: "‘नौकर की कमीज’ क्या है?",
    option: [
        "कहानी",
        "प्रबंधकाव्य",
        "संस्मरण",
        "उपन्यास"
    ],
    answer: "उपन्यास"
},

{
    question: "होशेकम पर किसका बटुआ उठाने का आरोप लगा था?",
    option: [
        "मैत्र मलांदे का",
        "किसी अज्ञात व्यक्ति का",
        "मैत्र ब्रेतों का",
        "होशेकम का"
    ],
    answer: "किसी अज्ञात व्यक्ति का"
},

{
    question: "उदय प्रकाश जी किस पत्रिका के सहायक सम्पादक थे?",
    option: [
        "न्यूज ट्रैक",
        "संडेमेल (नई दिल्ली)",
        "इंडिया टुडे",
        "धर्मयुग"
    ],
    answer: "संडेमेल (नई दिल्ली)"
},

{
    question: "जनरल ने चेख्यकोव की माफी के लिए क्या कहा?",
    option: [
        "“मुझे कोई फर्क नहीं पड़ता।”",
        "“तुम मुझसे मजाक कर रहे हो।”",
        "“यह महत्वपूर्ण है।”",
        "“मुझे कोई आपत्ति नहीं है।”"
    ],
    answer: "“तुम मुझसे मजाक कर रहे हो।”"
},

{
    question: "उदय प्रकाश के अनुसार, दशहरे के दिन किस चिड़िया को जरूर देखना चाहिए?",
    option: [
        "कौआ",
        "तोता",
        "नीलकंठ",
        "कबूतर"
    ],
    answer: "नीलकंठ"
},

{
    question: "मालती-महेश्वर की संतान का क्या नाम है ?",
    option: [
        "टुट्ट",
        "टिटी",
        "टट्ट",
        "डुड्डू"
    ],
    answer: "टिटी"
},

{
    question: "उदय प्रकाश की कहानी कौन-सी है?",
    option: [
        "जीवन",
        "तिरिछ",
        "रोज",
        "घुसपैठिए"
    ],
    answer: "तिरिछ"
},

{
    question: "‘कामायनी’ प्रसाद जी की किस प्रकार की कृति है?",
    option: [
        "खंड काव्य",
        "प्रबंध काव्य",
        "गद्य काव्य",
        "इनमें से कोई नहीं"
    ],
    answer: "प्रबंध काव्य"
},

{
    question: "नामवर सिंह को किस कृति पर साहित्य अकादमी पुरस्कार प्राप्त हुआ?",
    option: [
        "कविता के नए प्रतिमान' पर",
        "कहानी : नई कहानी' पर",
        "'पृथ्वीराजरासो की भाषा' पर",
        "इतिहास और आलोचना' पर"
    ],
    answer: "कविता के नए प्रतिमान' पर"
},

{
    question: "'छप्पय' शीर्षक के रचयिता कौन हैं?",
    option: [
        "सूरदास",
        "कबीरदास",
        "नाभादास",
        "तुलसीदास"
    ],
    answer: "नाभादास"
},

{
    question: "'प्रगीत और समाज' के लेखक हैं",
    option: [
        "बालकृष्ण भट्ट",
        "जयप्रकाश नारायण",
        "नामवर सिंह",
        "उदय प्रकाश"
    ],
    answer: "नामवर सिंह"
},

{
    question: "बिहार के प्रमुख सांस्कृतिक उत्सव ‘वैशाली महोत्सव’ का बीजारोपण किसने किया?",
    option: [
        "जॉर्ज जियरसन ने",
        "सच्चिदानन्द सिन्हा ने",
        "जगदीशचन्द्र माथुर ने",
        "डॉ. राजेन्द्र प्रसाद ने"
    ],
    answer: "जगदीशचन्द्र माथुर ने"
},

{
    question: "बालकृष्ण भट्ट का निवास स्थान कौन-सा है?",
    option: [
        "लखनऊ, उत्तरप्रदेश",
        "इलाहाबाद, उत्तरप्रदेश",
        "मथुरा, उत्तरप्रदेश",
        "वाराणसी, उत्तरप्रदेश"
    ],
    answer: "इलाहाबाद, उत्तरप्रदेश"
},

{
    question: "चेख्यकोव की मौत का कारण क्या था?",
    option: [
        "बीमारी",
        "आत्महत्या",
        "दिल का दौरा",
        "प्राकृतिक कारण"
    ],
    answer: "आत्महत्या"
},

{
    question: "कहानी ‘रस्सी का टुकड़ा’ में कौन सा दिन हाट का था?",
    option: [
        "रविवार",
        "सोमवार",
        "साप्ताहिक",
        "गुरुवार"
    ],
    answer: "साप्ताहिक"
},

{
    question: "सूरदास की रचनाओं की भाषा क्या है?",
    option: [
        "अवधी",
        "ब्रजभाषा",
        "खड़ीबोली",
        "मैथिली"
    ],
    answer: "ब्रजभाषा"
},

{
    question: "सुभद्रा कुमारी चौहान की लिखी कविता कौन-सी है?",
    option: [
        "प्यारे नन्हे बेटे को",
        "पुत्र वियोग",
        "हार-जीत",
        "गाँव का घर"
    ],
    answer: "पुत्र वियोग"
},

{
    question: "लेखक के पिताजी शहर क्यों गए थे?",
    option: [
        "इलाज करवाने के लिए",
        "सामान खरीदने के लिए",
        "किसी से मिलने के लिए",
        "अदालत में पेशी के लिए"
    ],
    answer: "अदालत में पेशी के लिए"
},

{
    question: "चेख्यकोव ने जनरल के सामने किस प्रकार का व्यवहार किया?",
    option: [
        "विनम्र",
        "आक्रामक",
        "तटस्थ",
        "हृदयहीन"
    ],
    answer: "विनम्र"
},

{
    question: "पंडित राम औतार क्या थे?",
    option: [
        "ज्योतिषी",
        "वैद्य",
        "राजनेता",
        "ज्योतिषी और वैद्य"
    ],
    answer: "ज्योतिषी और वैद्य"
},

{
    question: "‘दिनकर’ को किस कृति पर भारतीय ज्ञानपीठ पुरस्कार प्राप्त हुआ था?",
    option: [
        "‘संस्कृति के चार अध्याय’ पर",
        "‘मिट्टी की ओर’ पर",
        "‘नीलकुसुम’ पर",
        "‘उर्वशी’ पर"
    ],
    answer: "‘उर्वशी’ पर"
},

{
    question: "जयप्रकाश नारायण के बचपन का क्या नाम था ?",
    option: [
        "बिटु",
        "किटू",
        "बाउल",
        "मोनू"
    ],
    answer: "बाउल"
},

{
    question: "‘तेज तम अंस पर कान्ह जिमि कंस पर त्यों म्लेच्छन पर सेर सिवराज है’ यह पंक्ति किस शीर्षक कविता की है?",
    option: [
        "कवित्त",
        "पद (तुलसीदास)",
        "छप्पय",
        "पद (सूरदास)"
    ],
    answer: "कवित्त"
},

{
    question: "निम्नलिखित में कौन-सी रचना दिनकर जी की है?",
    option: [
        "सदियों का संताप",
        "परशुराम की प्रतीक्षा",
        "दुराई घोड़ा",
        "दस साल यात्रा"
    ],
    answer: "परशुराम की प्रतीक्षा"
},

{
    question: "दिनकर जी का जन्म बिहार के किस जिले में हुआ था?",
    option: [
        "समस्तीपुर",
        "बेगूसराय",
        "पटना",
        "भोजपुर"
    ],
    answer: "बेगूसराय"
},

{
    question: "‘राम की शक्तिपूजा’ किसकी कविता है?",
    option: [
        "पंत",
        "दिनकर",
        "महादेवी वर्मा",
        "निराला"
    ],
    answer: "निराला"
},

{
    question: "रघुवीर सहाय के पिता क्या थे?",
    option: [
        "वकील",
        "जज",
        "शिक्षक",
        "पुलिस अधिकारी"
    ],
    answer: "शिक्षक"
},

{
    question: "‘द फर्स्ट एंड लास्ट फ्रीडम’ किसकी कृति है?",
    option: [
        "अब्दुल कलाम आजाद",
        "पण्डित सीतारमैया",
        "जे. कृष्णमूर्ति",
        "जवाहर हुसैन"
    ],
    answer: "जे. कृष्णमूर्ति"
},

{
    question: "कौन-सी कृति उदय प्रकाश की है?",
    option: [
        "रीछ",
        "दरियाई घोड़ा",
        "लिहाफ",
        "नीली झील"
    ],
    answer: "दरियाई घोड़ा"
},

{
    question: "चेख्यकोव ने जनरल से माफी क्यों मांगी?",
    option: [
        "छींक के कारण",
        "काम के कारण",
        "खेल के कारण",
        "व्यक्तिगत कारण"
    ],
    answer: "छींक के कारण"
},

{
    question: "अज्ञेय जी पहली कहानी कब प्रकाशित हुई ?",
    option: [
        "1920 में",
        "1924 में",
        "1928 में",
        "1932 में"
    ],
    answer: "1924 में"
},

{
    question: "‘प्रसाद’ रचित महाकाव्य का नाम है",
    option: [
        "साकेत",
        "कामायनी",
        "प्रियप्रवास",
        "अरुण रामायण"
    ],
    answer: "कामायनी"
},

{
    question: "‘गाँव का घर’ किस कविता-संग्रह से लिया गया है? …",
    option: [
        "‘आँख हाथ बनते हुए’ से",
        "‘गंगातट’ से।",
        "‘कवि ने कहा’ से।",
        "‘संशयात्मा’ से"
    ],
    answer: "‘संशयात्मा’ से"
},

{
    question: "जयशंकर प्रसाद किस वाद के कवि थे?",
    option: [
        "छायावाद",
        "प्रगतिवाद",
        "प्रयोगवाद",
        "अतियथार्थवाद"
    ],
    answer: "छायावाद"
},

{
    question: "ज्ञानेंद्रपति को ‘साहित्य अकादमी पुरस्कार’ किस कृति पर मिला था?",
    option: [
        "आँख हाथ बनते हुए",
        "संशयात्मा",
        "गंगातट",
        "पढ़ते-पढ़ते"
    ],
    answer: "संशयात्मा"
},

{
    question: "चेख्यकोव ने जनरल को माफी क्यों मांगी?",
    option: [
        "किसी दंड के लिए",
        "छींक के कारण",
        "पैसे की मांग के लिए",
        "खेल में हार के लिए"
    ],
    answer: "छींक के कारण"
},

{
    question: "कौन-सी कृति उदय प्रकाश की नहीं है?",
    option: [
        "पीली छतरीवाली लड़की",
        "पॉल गोमरा का स्कूटर",
        "टूटा हुआ पुल",
        "और अंत में प्रार्थना"
    ],
    answer: "टूटा हुआ पुल"
},

{
    question: "कौन-सी पुस्तक नामवर सिंह की है?",
    option: [
        "पीली छतरीवाली लड़की",
        "'पृथ्वीराज रासो की भाषा'",
        "अंतराल",
        "न अनमोलवा कल"
    ],
    answer: "'पृथ्वीराज रासो की भाषा'"
},

{
    question: "जयशंकर प्रसाद की कौन-सी कृति अपूर्ण है?",
    option: [
        "तितली",
        "लहर",
        "इरावती",
        "ध्रुवस्वामिनी"
    ],
    answer: "इरावती"
},

{
    question: "जे. कृष्णमूर्ति का जन्म कब हुआ था?",
    option: [
        "12 मई 1895 को",
        "12 मई 1996 को",
        "18 मई 1902 को",
        "18 जून 1904 को"
    ],
    answer: "12 मई 1895 को"
},

{
    question: "कौन-सी रचना, अज्ञेय की नहीं है ?",
    option: [
        "अपने-अपने अजनबी",
        "भग्नदूत",
        "एक बूंद सहसा उछली",
        "तिरिछ"
    ],
    answer: "तिरिछ"
},

{
    question: "बराज कहाँ बन रहा था?",
    option: [
        "बेलगाँव में",
        "भितिहरवा में",
        "अमोलवा में",
        "भैंसालोटन में"
    ],
    answer: "भैंसालोटन में"
},

{
    question: "गुलेरीजी का जन्म हुआ था",
    option: [
        "हरियाणा में",
        "जयपुर (राजस्थान में)",
        "कांगड़ा (हिमाचल प्रदेश में)",
        "गुजरात में"
    ],
    answer: "जयपुर (राजस्थान में)"
},

{
    question: "सुरेन्द्र सिंह किसका पोता था?",
    option: [
        "सुखदेव सिंह त्यागी",
        "रामदेवी त्यागी",
        "गणपति त्यागी",
        "हरेराम त्यागी"
    ],
    answer: "सुखदेव सिंह त्यागी"
},

{
    question: "‘पद्मावत’ की भाषा क्या है ?",
    option: [
        "अवधी",
        "ब्रजभाषा",
        "खड़ी बोली",
        "फारसी"
    ],
    answer: "अवधी"
},

{
    question: "उषा की ज्योति में कौन-सा अलंकार है?",
    option: [
        "श्लेष",
        "अनुप्रास",
        "उपमा",
        "यमक"
    ],
    answer: "अनुप्रास"
},

{
    question: "कौन-सी रचना बालकृष्ण भट्ट की नहीं है?",
    option: [
        "मृत्यु ब्रह्मचारी",
        "सो अजान एक सुजान",
        "सदाव का अभाव",
        "परीक्षा गुरु"
    ],
    answer: "परीक्षा गुरु"
},

{
    question: "'एक तटबंध' के रचनाकार कौन हैं?",
    option: [
        "रामवृक्ष बेनीपुरी",
        "जगदीशचन्द्र माथुर",
        "देवेन्द्र सत्यार्थी",
        "महादेवी वर्मा"
    ],
    answer: "जगदीशचन्द्र माथुर"
},

{
    question: "मोहन राकेश किस आंदोलन के प्रमुख हस्ताक्षर थे?",
    option: [
        "नई कहानी आंदोलन के",
        "कविता आंदोलन के",
        "स्वाधीनता आंदोलन के",
        "समाज सुधार आंदोलन के"
    ],
    answer: "नई कहानी आंदोलन के"
},

{
    question: "आचार्य रामचन्द्र शुक्ल के काव्य सिद्धान्त का आदर्श कौन-सा काव्य है?",
    option: [
        "गीति काव्य",
        "मुक्तक काव्य",
        "प्रबंध काव्य",
        "इनमें से कोई नहीं"
    ],
    answer: "प्रबंध काव्य"
},

{
    question: "नाभादास किस काल के कवि थे?",
    option: [
        "भक्तिकाल के",
        "रीतिकाल के",
        "वीरगाथा काल के",
        "भारतेंदु काल के"
    ],
    answer: "भक्तिकाल के"
},

{
    question: "‘प्यारे नन्हें बेटे को’ कविता किस संकलन से ली गई है?",
    option: [
        "वह आदमी नया गरम कोट पहनकर चला गया विचार की तरह से",
        "‘सब कुछ होना बचा रहेगा’ से",
        "‘लगभग जयहिंद’ से",
        "‘हिमकिरीटिनी’ से"
    ],
    answer: "वह आदमी नया गरम कोट पहनकर चला गया विचार की तरह से"
},

{
    question: "'भक्तमाल' के रचयिता कौन हैं?",
    option: [
        "कबीरदास",
        "गुरु नानक",
        "सूरदास",
        "नाभादास"
    ],
    answer: "नाभादास"
},

{
    question: "बाजार में कौन-कौन से लोग मौजूद थे?",
    option: [
        "किसान और उनकी पत्नियाँ",
        "व्यापारी",
        "बच्चे",
        "सभी"
    ],
    answer: "किसान और उनकी पत्नियाँ"
},

{
    question: "‘जूठन’ क्या है?",
    option: [
        "रेखाचित्र",
        "शब्द-चित्र",
        "कहानी",
        "आत्मकथा"
    ],
    answer: "कहानी"
},

{
    question: "'सुकून की तलाश' क्या है?",
    option: [
        "गजलों का संग्रह",
        "उपन्यास",
        "कहानी",
        "निबंध संग्रह"
    ],
    answer: "गजलों का संग्रह"
},

{
    question: "उदय प्रकाश ने किस पत्रिका के सम्पादन विभाग में काम किया?",
    option: [
        "दिनमान",
        "इंडिया टुडे",
        "प्रदीप",
        "धर्मयुग"
    ],
    answer: "दिनमान"
},

{
    question: "जे. कृष्णमूर्ति की ‘शिक्षा’ कृति क्या है?",
    option: [
        "संभाषण",
        "निबंध",
        "संस्मरण",
        "एकांकी"
    ],
    answer: "संभाषण"
},

{
    question: "‘क्लर्क की मौत’ कहानी में चेख्यकोव की आत्महत्या का मुख्य कारण क्या था?",
    option: [
        "मानसिक तनाव",
        "शारीरिक बीमारी",
        "सामाजिक अपमान",
        "व्यक्तिगत असफलता"
    ],
    answer: "सामाजिक अपमान"
},

{
    question: "विनोद कुमार शुक्ल का जन्म कहाँ हुआ था?",
    option: [
        "उत्तर प्रदेश",
        "बिहार",
        "मध्य प्रदेश",
        "छत्तीसगढ़"
    ],
    answer: "छत्तीसगढ़"
},

{
    question: "‘ध्रुवस्वामिनी’ कैसी कृति है?",
    option: [
        "महाकाव्य",
        "गीतिनाट्य",
        "गीतिकाव्य",
        "नाटक"
    ],
    answer: "नाटक"
},

{
    question: "‘शिक्षा’ पाठ के रचयिता कौन है ?",
    option: [
        "महात्मा गाँधी",
        "विनोबा भावे",
        "जगदीशचन्द्र माथुर",
        "जे. कृष्णमूर्ति"
    ],
    answer: "जे. कृष्णमूर्ति"
},

{
    question: "लेखक कितने वर्षों बाद मालती से मिलने आया था ?",
    option: [
        "दो वर्ष",
        "चार वर्ष",
        "पाँच वर्ष",
        "आठ वर्ष"
    ],
    answer: "चार वर्ष"
},

{
    question: "बालकृष्ण भट्ट का निवास स्थान कौन-सा है?",
    option: [
        "लखनऊ, उत्तरप्रदेश",
        "इलाहाबाद, उत्तरप्रदेश",
        "मथुरा, उत्तरप्रदेश",
        "वाराणसी, उत्तरप्रदेश"
    ],
    answer: "इलाहाबाद, उत्तरप्रदेश"
},

{
    question: "‘पेशगी’ कहानी में बच्ची को कैसे सुलाया जाता था?",
    option: [
        "लोरी गाकर",
        "कहानी सुनाकर",
        "खेल खिलाकर",
        "पढ़ाई करके"
    ],
    answer: "लोरी गाकर"
},

{
    question: "चेख्यकोव ने अपनी मौत के बाद क्या किया?",
    option: [
        "आराम किया",
        "कुछ खाया",
        "सोफे पर लेट गया",
        "घर से बाहर गया"
    ],
    answer: "सोफे पर लेट गया"
},

{
    question: "कौन-सी पुस्तक नामवर सिंह की नहीं है?",
    option: [
        "बकलम खुद",
        "इतिहास और आलोचना",
        "तिरिछ",
        "दूसरी परंपरा की खोज"
    ],
    answer: "तिरिछ"
},

{
    question: "निम्नलिखित में कौन-सी रचना रघुवीर सहाय की है?",
    option: [
        "काठ का सपना",
        "टूटी हुई बिखरी हुई",
        "वे लोग भूल गए हैं",
        "ध्रुवस्वामिनी"
    ],
    answer: "वे लोग भूल गए हैं"
},

{
    question: "कबीरदास किस शाखा के कवि हैं?",
    option: [
        "सगुण शाखा के",
        "निर्गुण शाखा के",
        "सर्वगुण शाखा के",
        "इनमें से कोई नहीं"
    ],
    answer: "निर्गुण शाखा के"
},

{
    question: "गाइ-डि मोपासाँ किस देश के लेखक थे?",
    option: [
        "जर्मनी",
        "फ्रांस",
        "इटली",
        "स्पेन"
    ],
    answer: "फ्रांस"
},

{
    question: "कामायनी प्रसाद जी की किस प्रकार की कृति है?",
    option: [
        "खण्ड काव्य",
        "प्रबंध काव्य",
        "गद्य काव्य",
        "इनमें से कोई नहीं"
    ],
    answer: "प्रबंध काव्य"
},

{
    question: "सूरदास किस मार्ग में दीक्षित हुए?",
    option: [
        "अष्टछाप",
        "संतमार्ग",
        "पुष्टिमार्ग",
        "इनमें से कोई नहीं"
    ],
    answer: "पुष्टिमार्ग"
},

{
    question: "कृष्ण कहाँ बैठकर भोजन कर रहे हैं?",
    option: [
        "नंद की गोद में",
        "यशोदा की गोद में",
        "यमुना के किनारे",
        "कदम्ब के पेड़ पर"
    ],
    answer: "नंद की गोद में"
},

{
    question: "सूरदास की अनुमानित जन्म तिथि क्या है?",
    option: [
        "1475 ई०",
        "1475 ई०",
        "1480 ई०",
        "1482 ई०"
    ],
    answer: "1475 ई०"
},

{
    question: "इनमें से कौन-सी पुस्तक प्रसादजी की नहीं है?",
    option: [
        "आँसू",
        "इंद्रजाल",
        "आँधी",
        "शिवाजी का महत्त्व"
    ],
    answer: "शिवाजी का महत्त्व"
},

{
    question: "काशी में कितने वर्षों तक रहकर तुलसीदास ने शिक्षा प्राप्त की?",
    option: [
        "दस वर्षों तक",
        "पंद्रह वर्षों तक",
        "बीस वर्षों तक",
        "पच्चीस वर्षों तक"
    ],
    answer: "दस वर्षों तक"
},

{
    question: "कौन-सी कहानी उदय प्रकाश जी की नहीं है?",
    option: [
        "वारिस",
        "दरियाई घोड़ा",
        "पीली छतरीवाली लड़की",
        "मैंगोसिल"
    ],
    answer: "वारिस"
},

{
    question: "जायसी ने अपनी आँख की उपमा किससे दी है ?",
    option: [
        "कमल",
        "कुमुद",
        "सरोवर",
        "दर्पण"
    ],
    answer: "दर्पण"
},

{
    question: "बातचीत के माध्यम से बालकृष्ण भट्ट क्या बतलाना चाहते हैं?",
    option: [
        "बातचीत की शैली",
        "भाषण की शैली",
        "संवाद की शैली",
        "इनमें कोई नहीं"
    ],
    answer: "बातचीत की शैली"
},

{
    question: "1974 में, छात्र, आन्दोलन का नेतृत्व किसने किया ?",
    option: [
        "जॉर्ज फर्नान्डीस",
        "देवीलाल",
        "कर्पूरी ठाकुर",
        "जयप्रकाश नारायण"
    ],
    answer: "जयप्रकाश नारायण"
},

{
    question: "चेख्यकोव ने जनरल से माफी क्यों मांगी?",
    option: [
        "मानसिक तनाव",
        "सामाजिक अपराध",
        "व्यक्तिगत अपराध",
        "पेशेवर गलती"
    ],
    answer: "व्यक्तिगत अपराध"
},

{
    question: "गाँव में अब किसकी धुनें सुनाई नहीं पड़ती है?",
    option: [
        "फिल्मी गीत की",
        "शोक गीत की",
        "लोकगीत",
        "इनमें से कोई नहीं"
    ],
    answer: "लोकगीत"
},

{
    question: "हेडमास्टर कलीराम ने किसे मैदान में झाड़ू लगाने के लिए कहा?",
    option: [
        "ओमप्रकाश को",
        "ओमप्रकाश वाल्मीकि को",
        "ओमप्रकाश वाल्मीकि के पिता को",
        "इनमें से किसी को नहीं"
    ],
    answer: "ओमप्रकाश वाल्मीकि को"
},

{
    question: "जयप्रकाश नारायण का जन्म कहाँ हुआ था ?",
    option: [
        "राघोपुर दियारा",
        "सिताब दियारा",
        "बलिया",
        "छपरा"
    ],
    answer: "सिताब दियारा"
},

{
    question: "‘कछुआ धर्म’ किसका निबंध है?",
    option: [
        "गुलाब राय का",
        "शांतिप्रिय द्विवेदी का",
        "महावीर प्रसाद द्विवेदी का",
        "चंद्रधर शर्मा गुलेरी का"
    ],
    answer: "चंद्रधर शर्मा गुलेरी का"
},

{
    question: "'राम की शक्तिपूजा' किसकी कविता है ?",
    option: [
        "पंत",
        "दिनकर",
        "महादेवी वर्मा",
        "निराला"
    ],
    answer: "निराला"
},

{
    question: "कौन सी रचना जयशंकर प्रसाद की नहीं है?",
    option: [
        "प्रायश्चित",
        "सूसागर",
        "ध्रुवस्वामिनी",
        "कामना"
    ],
    answer: "सूसागर"
},

{
    question: "विनोद कुमार शुक्ल बीसवीं शती के किस दशक में एक कवि के रूप में सामने आए थे?",
    option: [
        "पाँचवे-छठे दशक में",
        "छठे-सातवें दशक में",
        "सातवें-आठवें दशक में",
        "आठवें-नौवें दशक में"
    ],
    answer: "सातवें-आठवें दशक में"
},

{
    question: "मलयज की माँ का नाम क्या था?",
    option: [
        "प्रभामती",
        "कलावती",
        "हीरावती",
        "इनमें से कोई नहीं"
    ],
    answer: "प्रभामती"
},

{
    question: "“नदी के द्वीप’ किसकी रचना है ?",
    option: [
        "उदयप्रकाश",
        "’अज्ञेय’",
        "मलयज",
        "मणिमधुकर"
    ],
    answer: "’अज्ञेय’"
},

{
    question: "जे. कृष्णमूर्ति का जन्म कब हुआ था?",
    option: [
        "12 मई 1895 को",
        "18 जून 1892 को",
        "23 मई 1898 को",
        "15 अगस्त 1902 को"
    ],
    answer: "12 मई 1895 को"
},

{
    question: "ज्ञानेंद्रपति का जन्म कब हुआ था?",
    option: [
        "1 जनवरी, 1950 को",
        "10 जनवरी, 1949 को",
        "18 फरवरी, 1952 को",
        "25 जनवरी, 1948 को"
    ],
    answer: "1 जनवरी, 1950 को"
},

{
    question: "विनोद कुमार शुक्ल की किस कृति पर मणिकौल ने फिल्म बनाई थी?",
    option: [
        "दीवार में एक खिड़की रहती थी",
        "पेड़ पर कमरा",
        "नौकर की कमीज",
        "खिलेगा तो देखेंगे"
    ],
    answer: "नौकर की कमीज"
},

{
    question: "निम्नलिखित में कौन-सी रचना भूषण की है?",
    option: [
        "साकेत",
        "कामायनी",
        "भक्तमाल",
        "शिवराज भूषण"
    ],
    answer: "शिवराज भूषण"
},

{
    question: "कौन-सी कृति उदय प्रकाश की नहीं है?",
    option: [
        "पीली छतरीवाली लड़की",
        "पॉल गोमरा का स्कूटर",
        "टूटा हुआ पुल",
        "और अंत में प्रार्थना"
    ],
    answer: "टूटा हुआ पुल"
},

{
    question: "बालकृष्ण भट्ट किस युग के निबंधकार थे?",
    option: [
        "प्रसाद युग",
        "भारतेंदु युग",
        "द्विवेदी युग",
        "स्वातंत्र्योत्तर युग"
    ],
    answer: "भारतेंदु युग"
},

{
    question: "‘हनुमानबाहुक’ को तुलसीदास की किस कृति का एक अंग माना जाता है ?",
    option: [
        "जानकीमंगल",
        "कवितावली",
        "गीतावली",
        "श्रीकृष्ण गीतावली"
    ],
    answer: "कवितावली"
},

{
    question: "चेख्यकोव की अंतिम स्थिति कैसी थी?",
    option: [
        "आरामदायक",
        "दुखी",
        "उत्साही",
        "यंत्रचालित"
    ],
    answer: "यंत्रचालित"
},

{
    question: "प्रेमचंद थे",
    option: [
        "गीतकार",
        "कथाकार",
        "फिल्मकार",
        "संगीतकार"
    ],
    answer: "कथाकार"
},

{
    question: "‘तिरिछ’ के लेखक हैं",
    option: [
        "मलयज",
        "मोहन राकेश",
        "उदय प्रकाश",
        "भगत सिंह"
    ],
    answer: "उदय प्रकाश"
},

{
    question: "सुखदेव सिंह त्यागी की लड़की की शादी में उनके घर के सफाई का काम किसने किया?",
    option: [
        "लेखक ने",
        "लेखक के पिता ने",
        "लेखक की माँ ने",
        "लेखक के भाई ने"
    ],
    answer: "लेखक की माँ ने"
},

{
    question: "बराज कहाँ बन रहा था?",
    option: [
        "बेलगाँव",
        "भितिहरवा में",
        "अमोलवा में",
        "भैंसालोटन में"
    ],
    answer: "भैंसालोटन में"
},

{
    question: "बचपन में किस वातावरण में रहना आवश्यक है?",
    option: [
        "स्वतंत्र",
        "अनुशासित",
        "दायित्वपूर्ण",
        "इनमें से कोई नहीं"
    ],
    answer: "स्वतंत्र"
},

{
    question: "'कविता के नए प्रतिमान' के लेखक हैं",
    option: [
        "लक्ष्मीकांत वर्मा",
        "सर्वेश्वरदयाल सक्सेना",
        "शिवदान सिंह चौहान",
        "नामवर सिंह"
    ],
    answer: "नामवर सिंह"
},

{
    question: "पाठ्यपुस्तक में संकलित तुलसी के पद तुलसीदास की किस कृति से लिए गए हैं ?",
    option: [
        "‘दोहावली’ से",
        "‘रामलला नहछू’ से",
        "‘कवितावली’ से",
        "‘विनय के पद’ से"
    ],
    answer: "‘विनय के पद’ से"
},

{
    question: "‘परमात्मा आपको सुखी रखें’—यह कथन किसका है?",
    option: [
        "आगन्तुक लड़की",
        "पुरोहित",
        "चौधरी",
        "कुंती"
    ],
    answer: "कुंती"
},

{
    question: "शमशेर बहादुर सिंह की पत्नी का नाम क्या है?",
    option: [
        "कर्मा देवी",
        "धर्म देवी",
        "रीता देवी",
        "इनमें से कोई नहीं"
    ],
    answer: "धर्म देवी"
},

{
    question: "कौन-सी पुस्तक नामवर सिंह की है ?",
    option: [
        "पीली छतरीवाली लड़की",
        "'पृथ्वीराज रासो की भाषा'",
        "अंतराल",
        "न अनमोलवा कल"
    ],
    answer: "'पृथ्वीराज रासो की भाषा'"
},

{
    question: "तिरिछ के लेखक हैं",
    option: [
        "मलयज",
        "मोहन राकेश",
        "उदय प्रकाश",
        "भगत सिंह"
    ],
    answer: "उदय प्रकाश"
},

{
    question: "विनोद कुमार शुक्ल निराला सृजनपीठ में जून 1994 से जून 1996 तक किस पद पर रहे?",
    option: [
        "मुख्य साहित्यकार",
        "अतिथि साहित्यकार",
        "मुख्य संयोजक",
        "मुख्य सलाहकार"
    ],
    answer: "अतिथि साहित्यकार"
},

{
    question: "‘रस्सी का टुकड़ा’ कहानी का संदेश किस समस्या पर आधारित है?",
    option: [
        "सामाजिक न्याय",
        "अविश्वास",
        "धार्मिक संघर्ष",
        "आर्थिक असमानता"
    ],
    answer: "अविश्वास"
},

{
    question: "‘पेशगी’ कहानी में मैडम का पति किसके साथ हिंसात्मक व्यवहार करता था?",
    option: [
        "कारमेन",
        "खुद",
        "बच्चों",
        "दोस्तों"
    ],
    answer: "कारमेन"
},

{
    question: "‘दलित साहित्य का सौंदर्यशास्त्र’ के रचनाकार कौन हैं?",
    option: [
        "प्रेमचंद",
        "सुदर्शन",
        "जगजीवन राम",
        "ओमप्रकाश वाल्मीकि"
    ],
    answer: "ओमप्रकाश वाल्मीकि"
},

{
    question: "दिनकरजी किसलिए प्रसिद्ध है ?",
    option: [
        "साहित्यिक रचना के लिए",
        "संगीत के लिए",
        "मूर्ति-निर्माण के लिए",
        "उपन्यास-लेखन के लिए"
    ],
    answer: "साहित्यिक रचना के लिए"
},

{
    question: "नाभादास किस धारा के कवि थे?",
    option: [
        "निर्गुण धारा",
        "सद्गुणोपासक रामभक्त धारा",
        "सगुणधारा",
        "इनमें से कोई नहीं"
    ],
    answer: "सद्गुणोपासक रामभक्त धारा"
},

{
    question: "‘बातचीत’ शीर्षक निबंध के निबंधकार हैं",
    option: [
        "जयप्रकाश नारायण",
        "मोहन राकेश",
        "नामवर सिंह",
        "बालकृष्ण भट्ट"
    ],
    answer: "बालकृष्ण भट्ट"
},

{
    question: "जे. कृष्णमूर्ति का जन्म किस राज्य में हुआ था?",
    option: [
        "आंध्र प्रदेश में",
        "उत्तर प्रदेश में",
        "राजस्थान में",
        "उड़ीसा में"
    ],
    answer: "आंध्र प्रदेश में"
},

{
    question: "‘प्रसाद’ रचित महाकाव्य का नाम है-",
    option: [
        "साकेत",
        "कामायनी",
        "प्रियप्रवास",
        "अरुण रामायण"
    ],
    answer: "कामायनी"
},

{
    question: "सच्चे अर्थों में प्रगीतात्मकता का आधार क्या है?",
    option: [
        "समाज से अलग व्यक्ति",
        "समाज के साथ व्यक्ति",
        "समाज के विरुद्ध व्यक्ति",
        "इनमें से कोई नहीं"
    ],
    answer: "समाज के विरुद्ध व्यक्ति"
},

{
    question: "‘पेशगी’ कहानी में किसके बीच की दूरी को दिखाया गया है?",
    option: [
        "सम्पन्न और विपन्न",
        "शिक्षित और अशिक्षित",
        "ग्रामीण और शहरी",
        "धनी और गरीब"
    ],
    answer: "सम्पन्न और विपन्न"
},

{
    question: "उदय प्रकाश का जन्म हुआ था",
    option: [
        "1 जनवरी 1952 को",
        "20 फरवरी 1948 से",
        "18 जून 1944 को",
        "12 जुलाई 1944 को"
    ],
    answer: "1 जनवरी 1952 को"
},

{
    question: "लेखक के अनुसार कुछ परीक्षाएँ उत्तीर्ण कर लेने से कहीं ज्यादा कठिन क्या है?",
    option: [
        "जीवन में उन्नति करना",
        "जीवन खुशी पूर्वक व्यतीत करना",
        "जीवन को समझना",
        "इनमें से कोई नहीं"
    ],
    answer: "जीवन को समझना"
},

{
    question: "1999 में विनोद कुमार शुक्ल को कौन-सा पुरस्कार प्रदान किया गया?",
    option: [
        "रघुवीर सहाय स्मृति पुरस्कार",
        "दयावती मोदी कवि शेखर सम्मान",
        "साहित्य अकादमी पुरस्कार",
        "इनमें से कोई नहीं"
    ],
    answer: "साहित्य अकादमी पुरस्कार"
},

{
    question: "सूबेदार हजारा सिंह के लड़के का नाम था",
    option: [
        "बोधा सिंह",
        "महा सिंह",
        "कीरत सिंह",
        "जगाधरी सिंह"
    ],
    answer: "बोधा सिंह"
},

{
    question: "प्रसादजी के पिता का नाम था",
    option: [
        "रविन्द्र प्रसाद साहू",
        "देवी प्रसाद साहू",
        "कालिका प्रसाद साहू",
        "चंडीका प्रसाद साहू"
    ],
    answer: "देवी प्रसाद साहू"
},

{
    question: "तिरिछ कैसी कहानी है?",
    option: [
        "मिथकीय",
        "मनोरंजक",
        "सांस्कृतिक",
        "प्रतीकात्मक"
    ],
    answer: "प्रतीकात्मक"
},

{
    question: "अंग्रेज अधिकारियों ने किस चीज की खेती का विस्तार किया?",
    option: [
        "दालहन",
        "भील",
        "गेहूँ",
        "तिलहन"
    ],
    answer: "भील"
},

{
    question: "इनमें से कौन-सी पुस्तक प्रसाद जी की नहीं है?",
    option: [
        "आँसू",
        "इंद्रजाल",
        "आँधी",
        "शिवाजी का महत्व"
    ],
    answer: "शिवाजी का महत्व"
},

{
    question: "‘कनियाँ’ का क्या अर्थ होता है?",
    option: [
        "स्त्री",
        "वधू",
        "पत्नी",
        "गौद"
    ],
    answer: "गौद"
},

{
    question: "सच्चे अर्थों में प्रगतिशीलता का आधार क्या है?",
    option: [
        "समाज से अलग व्यक्ति",
        "समाज के साथ व्यक्ति",
        "समाज के विरुद्ध व्यक्ति",
        "इनमें से कोई नहीं"
    ],
    answer: "समाज के विरुद्ध व्यक्ति"
},

{
    question: "ज्ञानेंद्रपति को ‘साहित्य अकादमी पुरस्कार’ किस कृति पर मिला था?",
    option: [
        "आँख हाथ बनते हुए",
        "संशयात्मा",
        "गंगातट",
        "पढ़ते-पढ़ते"
    ],
    answer: "संशयात्मा"
},

{
    question: "‘दूसरी परम्परा की खोज’ किसकी रचना है?",
    option: [
        "दिनकर जी",
        "नामवर सिंह",
        "उदय प्रकाश",
        "बालकृष्ण भट्ट"
    ],
    answer: "नामवर सिंह"
},

{
    question: "‘सूरसागर’ के रचयिता कौन हैं?",
    option: [
        "सूरदास",
        "तुलसीदास",
        "नंददास",
        "नरत्तमदास"
    ],
    answer: "सूरदास"
},

{
    question: "जगदीशचन्द्र माथुर मूलतः क्या थे?",
    option: [
        "निबन्धकार",
        "कहानीकार",
        "नाटककार",
        "उपन्यासकार"
    ],
    answer: "नाटककार"
},

{
    question: "जायसी हिन्दी साहित्य की किस काव्य धारा से जुड़े थे?",
    option: [
        "ज्ञानमार्गी शाखा",
        "प्रेममार्गी शाखा",
        "कृष्णमार्गी शाखा",
        "सगुण भक्ति काव्य"
    ],
    answer: "प्रेममार्गी शाखा"
},

{
    question: "स्कूल के हेडमास्टर का क्या नाम था?",
    option: [
        "बलीराम",
        "कलीराम",
        "दीनूराम",
        "धनीराम"
    ],
    answer: "कलीराम"
},

{
    question: "राजा हरिसिंह देव को किसका मुकाबला करना पड़ा था?",
    option: [
        "गयासुद्दीन तुगलक का",
        "नादिरशाह का",
        "अहमदशाह का",
        "बाबर का"
    ],
    answer: "गयासुद्दीन तुगलक का"
},

{
    question: "अधिनायक कौन हैं?",
    option: [
        "विपक्षी दल",
        "सरकारी सेवक",
        "सत्ताधारी वर्ग",
        "इनमें से कोई नहीं"
    ],
    answer: "सत्ताधारी वर्ग"
},

{
    question: "'मैं तुम लोगों से दूर हूँ' किसकी कविता है ?",
    option: [
        "मुक्तिबोध",
        "हजारी प्रसाद द्विवेदी",
        "पंत",
        "अज्ञेय"
    ],
    answer: "मुक्तिबोध"
},

{
    question: "कौन-सी कृति रामधारी सिंह ‘दिनकर’ की लिखी हुई है?",
    option: [
        "शुद्ध कविता की खोज",
        "पुनर्नवा",
        "स्मृति की रेखाएँ",
        "कविता के नए प्रतिमान"
    ],
    answer: "शुद्ध कविता की खोज"
},

{
    question: "भूषण के द्वितीय छंद में किस रस की अभिव्यंजना हुई है?",
    option: [
        "वीर रस",
        "रौद्र रस",
        "भक्ति रस",
        "इनमें से कोई नहीं"
    ],
    answer: "भक्ति रस"
},

{
    question: "महेश्वर की पत्नी का नाम क्या है ?",
    option: [
        "मालती",
        "लालती",
        "प्रभावती",
        "कलावती"
    ],
    answer: "मालती"
},

{
    question: "चेख्यकोव ने जनरल ब्रिजालोव से क्यों माफी मांगी?",
    option: [
        "व्यक्तिगत गलती",
        "पेशेवर तनाव",
        "सामाजिक दबाव",
        "मानसिक चिंता"
    ],
    answer: "व्यक्तिगत गलती"
},

{
    question: "राष्ट्रीय त्योहार के दिन हरचरना क्या पहने हुए है?",
    option: [
        "फटा कुर्ता",
        "फटा पाजामा",
        "फटी धोती",
        "फटा सूटन्ना"
    ],
    answer: "फटा सूटन्ना"
},

{
    question: "गांधारी थी",
    option: [
        "दुर्योधन की माँ",
        "कृष्ण की माँ",
        "अर्जुन की माँ",
        "बलराम की माँ"
    ],
    answer: "दुर्योधन की माँ"
},

{
    question: "बालकृष्ण भट्ट का जन्म हुआ था",
    option: [
        "23 जून, 1884 को",
        "23 जून, 1844 को",
        "20 जुलाई, 1902 को",
        "18 दिसम्बर, 1834 को"
    ],
    answer: "23 जून, 1844 को"
},

{
    question: "‘माटी की मूरते । रचना किसकी है ?",
    option: [
        "रामधारी सिंह ‘दिनकर’",
        "रामवृक्ष बेनीपुरी",
        "गजानन माधव मुक्तिबोध",
        "आरसी प्रसाद सिंह"
    ],
    answer: "रामवृक्ष बेनीपुरी"
},

{
    question: "खतरनाक सपनों में लेखक का सबसे बड़ा अस्त्र क्या था?",
    option: [
        "बंदूक",
        "तलवार",
        "आवाज",
        "खाँसी"
    ],
    answer: "आवाज"
},

{
    question: "जयशंकर प्रसाद के पितामह कौन थे?",
    option: [
        "शिवरतन साहू",
        "शिवरतन साहू",
        "शिवप्रसन्न साहू",
        "इनमें से कोई नहीं"
    ],
    answer: "शिवरतन साहू"
},

{
    question: "‘मैं तुम लोगों से दूर हूँ’ किसकी कविता है ?",
    option: [
        "मुक्तिबोध",
        "हजारी प्रसाद द्विवेदी",
        "पंत",
        "अज्ञेय"
    ],
    answer: "मुक्तिबोध"
},

{
    question: "कौन सी रचना सूरदास की है?",
    option: [
        "सतसई",
        "दोहावली",
        "सूरसागर",
        "गीतावली"
    ],
    answer: "सूरसागर"
},

{
    question: "नामवर सिंह को ‘कविता के नए प्रतिमान’ पर साहित्य अकादमी पुरस्कार कब मिला?",
    option: [
        "1970 ई० में",
        "1971 ई० में",
        "1972 ई० में",
        "1973 ई० में"
    ],
    answer: "1971 ई० में"
},

{
    question: "होशेकम ने खुद को कैसे निर्दोष साबित करने की कोशिश की?",
    option: [
        "रस्सी का टुकड़ा दिखाकर",
        "गवाही लेकर",
        "पुलिस को बुलाकर",
        "चुप रहकर"
    ],
    answer: "रस्सी का टुकड़ा दिखाकर"
},

{
    question: "बातचीत से मन किस प्रकार का हो जाता है?",
    option: [
        "क्रोधपूर्ण",
        "भारी और बोझिल",
        "दो",
        "इनमें से कोई नहीं"
    ],
    answer: "दो"
},

{
    question: "‘प्रसाद’ रचित महाकाव्य का नाम है",
    option: [
        "साकेत",
        "कामायनी",
        "प्रियप्रवास",
        "अरुण रामायण"
    ],
    answer: "कामायनी"
},

{
    question: "चेख्यकोव की आत्महत्या के बाद की स्थिति कैसी थी?",
    option: [
        "शांति",
        "तनाव",
        "दर्द",
        "यंत्रचालित"
    ],
    answer: "यंत्रचालित"
},

{
    question: "तुलसीदास का मूल नाम क्या था?",
    option: [
        "बमभोला",
        "रामबोला",
        "हरिबोला",
        "इनमें से कोई नहीं"
    ],
    answer: "रामबोला"
},

{
    question: "चेख्यकोव की माफी के बावजूद जनरल की प्रतिक्रिया क्या थी?",
    option: [
        "समझदारी",
        "तटस्थता",
        "उपेक्षा",
        "हर्ष"
    ],
    answer: "उपेक्षा"
},

{
    question: "नामवर सिंह द्वारा लिखित 'प्रगीत और समाज' क्या है ?",
    option: [
        "आलोचना",
        "निबंध",
        "एकांकी",
        "आत्मकथा"
    ],
    answer: "निबंध"
},

{
    question: "बातचीत के माध्यम से बालकृष्ण भट्ट क्या बतलाना चाहते हैं?",
    option: [
        "बातचीत की शैली",
        "भाषण की शैली",
        "संवाद की शैली",
        "इनमें से कोई नहीं"
    ],
    answer: "संवाद की शैली"
},

{
    question: "ज्ञानेंद्रपति के पति का नाम क्या था?",
    option: [
        "देवेंद्र प्रसाद चौबे",
        "नरेन्द्र प्रसाद चौबे",
        "हरेंद्र प्रसाद चौबे",
        "इनमें से कोई नहीं"
    ],
    answer: "देवेंद्र प्रसाद चौबे"
},

{
    question: "कहानी में हेनरी लोपेज किस देश से संबंधित हैं?",
    option: [
        "कांगो",
        "भारत",
        "फ्रांस",
        "अमेरिका"
    ],
    answer: "कांगो"
},

{
    question: "जायसी थे-",
    option: [
        "धनवान",
        "फकीर",
        "फकीर",
        "इनमें से कोई नहीं"
    ],
    answer: "फकीर"
},

{
    question: "पाठयपुस्तक में संकलित तुलसी के पद तुलसीदास की किस कृति से लिए गए है?",
    option: [
        "‘दोहावली’ से",
        "‘रामलला नहछू’ से",
        "‘कवितावली’ से",
        "‘विनय के पद’ से"
    ],
    answer: "‘विनय के पद’ से"
},

{
    question: "चेख्यकोव ने अपनी मौत के बाद क्या किया?",
    option: [
        "आराम किया",
        "कुछ खाया",
        "सोफे पर लेट गया",
        "घर से बाहर गया"
    ],
    answer: "सोफे पर लेट गया"
},

{
    question: "छत्रसाल की तलवार ने कौन-सा रूप धारण कर रखा है?",
    option: [
        "रौद्र रूप",
        "भयंकर रूप",
        "मधुर रूप",
        "इनमें से कोई नहीं"
    ],
    answer: "रौद्र रूप"
},

{
    question: "फ्री प्रेस के मालिक कौन थे ?",
    option: [
        "आत्मानंदजी",
        "शिवानंद गोस्वामी",
        "सदानंद जी",
        "शारदानंद गुप्त"
    ],
    answer: "सदानंद जी"
},

{
    question: "कौन-सी कृति रामधारी सिंह ‘दिनकर’ की लिखी हुई है?",
    option: [
        "शुद्ध कविता की खोज",
        "पुनर्नवा",
        "स्मृति की रेखाएँ",
        "कविता के नए प्रतिमान"
    ],
    answer: "शुद्ध कविता की खोज"
},

{
    question: "‘पेशगी’ कहानी के लेखक कौन हैं?",
    option: [
        "हेनरी लोपेज",
        "शेक्सपियर",
        "चेखव",
        "टैगोर"
    ],
    answer: "हेनरी लोपेज"
},

{
    question: "दूध-डूबे अँगूठे के छाप किनके हैं?",
    option: [
        "दादी के",
        "माँ के",
        "बूढ़े ग्वाल दादा के",
        "इनमें किसी के नहीं"
    ],
    answer: "बूढ़े ग्वाल दादा के"
},

{
    question: "चेख्यकोव ने अपनी पत्नी को किस बारे में बताया?",
    option: [
        "खेल के बारे में",
        "माफी के बारे में",
        "ब्रिजालोव की प्रतिक्रिया",
        "घरेलू समस्याएँ"
    ],
    answer: "ब्रिजालोव की प्रतिक्रिया"
},

{
    question: "प्रसादजी का जन्म कहाँ हुआ था?",
    option: [
        "इलाहाबाद में",
        "पटना में",
        "वाराणसी में",
        "लखनऊ में"
    ],
    answer: "वाराणसी में"
},

{
    question: "‘तुलसीदास’ के रचयिता कौन हैं?",
    option: [
        "तुलसीदास",
        "भवानीप्रसाद गुप्त",
        "सुमित्रानंदन पंत",
        "सूर्यकांत त्रिपाठी ‘निराला’"
    ],
    answer: "सूर्यकांत त्रिपाठी ‘निराला’"
},

{
    question: "नामवर सिंह प्रधान संपादक थे",
    option: [
        "‘हंस’ के",
        "‘सरस्वती’ के",
        "‘वागर्थ’ के",
        "‘आलोचना (त्रैमासिक)’ के"
    ],
    answer: "‘आलोचना (त्रैमासिक)’ के"
},

{
    question: "बोधा कौन था?",
    option: [
        "हजारा सिंह का भाई",
        "लहना सिंह का भाई",
        "वजीरा सिंह का भाई",
        "सूबेदार हजारा सिंह का बेटा"
    ],
    answer: "सूबेदार हजारा सिंह का बेटा"
},

{
    question: "सुभद्रा कुमारी चौहान किस वर्ग की कवयित्री मानी जाती हैं?",
    option: [
        "कटु यथार्थवादी धारा",
        "राष्ट्रीय भाव धारा",
        "भक्ति भाव धारा",
        "इनमें से कोई नहीं"
    ],
    answer: "राष्ट्रीय भाव धारा"
},

{
    question: "चेख्यकोव ने जनरल से माफी क्यों मांगी?",
    option: [
        "छींक के कारण",
        "काम के कारण",
        "खेल के कारण",
        "व्यक्तिगत कारण"
    ],
    answer: "छींक के कारण"
},

{
    question: "‘प्यारे नन्हें बेटे को’ कविता में लोहा किसका प्रतीक है?",
    option: [
        "बंदूक का",
        "मशीन का",
        "कर्म का",
        "धर्म का"
    ],
    answer: "कर्म का"
},

{
    question: "मालती के पति किस बीमारी का ऑपरेशन करके आये थे ?",
    option: [
        "पथरी",
        "कैंसर",
        "गैंग्रीन",
        "इनमें से कोई नहीं"
    ],
    answer: "गैंग्रीन"
},

{
    question: "अर्द्धनारीश्वर शंकर और पार्वती का किस प्रकार का रूप है?",
    option: [
        "यथार्थ",
        "कल्पित",
        "आदर्श",
        "वास्तविक"
    ],
    answer: "कल्पित"
},

{
    question: "उदय प्रकाश का जन्म हुआ था",
    option: [
        "1 जनवरी 1952 को",
        "20 फरवरी 1948 से",
        "18 जून 1944 को",
        "12 जुलाई 1944 को"
    ],
    answer: "1 जनवरी 1952 को"
},

{
    question: "जायसी रचित ‘पद्मावत’ की भाषा क्या है?",
    option: [
        "अवधी",
        "ब्रज",
        "खड़ीबोली",
        "मैथिली"
    ],
    answer: "अवधी"
},

{
    question: "'चुका भी नहीं हूँ मैं' के रचयिता कौन हैं?",
    option: [
        "त्रिलोचन",
        "नागार्जुन",
        "शमशेर बहादुर सिंह",
        "मुक्तिबोध"
    ],
    answer: "शमशेर बहादुर सिंह"
},

{
    question: "आत्मकथा लेखक की माँ किसके यहाँ काम करती थी?",
    option: [
        "सोमदत्त तगा के घर",
        "यज्ञदत्त तगा के घर",
        "ब्रह्मदेव तगा के घर",
        "ज्ञानदेव तगा के घर"
    ],
    answer: "ब्रह्मदेव तगा के घर"
},

{
    question: "मलयज का मूल नाम था",
    option: [
        "रमेश श्रीवास्तव",
        "भरतजी श्रीवास्तव",
        "सुधाकर श्रीवास्तव",
        "रामेश्वर श्रीवास्तव"
    ],
    answer: "भरतजी श्रीवास्तव"
},

{
    question: "‘दिनकर’ किस युग के कवि हैं?",
    option: [
        "छायावादी युग के",
        "छायावादोत्तर युग के",
        "द्विवेदी युग के",
        "भारतेन्दु युग के"
    ],
    answer: "छायावादोत्तर युग के"
},

{
    question: "‘रोज’ इनमें से क्या है?",
    option: [
        "निबंध",
        "कहानी",
        "उपन्यास का अंश",
        "आलोचना का अंश"
    ],
    answer: "कहानी"
},

{
    question: "कहानी में किस तरह की सामाजिक समस्या दिखाई गई है?",
    option: [
        "अविश्वास",
        "न्याय",
        "प्रेम",
        "धर्म"
    ],
    answer: "अविश्वास"
},

{
    question: "उषा का जादू कब टूटता है?",
    option: [
        "मध्याह्न होने पर",
        "विस्मृति में",
        "सूर्योदय होने पर",
        "ध्यान में"
    ],
    answer: "सूर्योदय होने पर"
},

{
    question: "जनरल ने चेख्यकोव को किस प्रकार से भेजा?",
    option: [
        "आदर के साथ",
        "गुस्से में",
        "प्यार से",
        "गंभीरता से"
    ],
    answer: "गुस्से में"
},

{
    question: "‘रोज’ कहानी घंटे की किस खड़कन के साथ समाप्त होती है?",
    option: [
        "चार",
        "तीन",
        "दो",
        "ग्यारह"
    ],
    answer: "ग्यारह"
},

{
    question: "‘पेशगी’ कहानी में मालकिन की कौन सी आदत समस्या पैदा करती है?",
    option: [
        "बच्ची के साथ बात करने का तरीका",
        "गुस्सा दिखाना",
        "ब्रिज खेलना",
        "शॉपिंग करना"
    ],
    answer: "बच्ची के साथ बात करने का तरीका"
},

{
    question: "‘नौकर की कमीज’ क्या है?",
    option: [
        "कहानी",
        "प्रबंधकाव्य",
        "संस्मरण",
        "उपन्यास"
    ],
    answer: "उपन्यास"
},

{
    question: "मेरठ के महंत ने गाँधीजी को कहाँ शरण दी?",
    option: [
        "एक आम के पेड़ के नीचे",
        "अपने मठ में",
        "एक झोपड़ी में",
        "एक महुए के पेड़ के नीचे"
    ],
    answer: "एक महुए के पेड़ के नीचे"
},

{
    question: "दिनकर जी की पहली काव्य पुस्तक कौन-सी है?",
    option: [
        "कुरुक्षेत्र",
        "हुंकार",
        "रसवंती",
        "प्रणभंग"
    ],
    answer: "प्रणभंग"
},

{
    question: "‘प्यारे नन्हें बेटे को’ के रचयिता हैं",
    option: [
        "नीरज",
        "बच्चन",
        "विनोद कुमार शुक्ल",
        "अशोक वाजपेयी"
    ],
    answer: "विनोद कुमार शुक्ल"
},

{
    question: "जयशंकर प्रसाद ने कौन-सी कविता लिखी है?",
    option: [
        "पुत्र वियोग",
        "तुमुल कोलाहल कलह में",
        "उषा",
        "हार जीत"
    ],
    answer: "तुमुल कोलाहल कलह में"
},

{
    question: "लीडर किसमें ‘विश्व शिक्षक’ के रूप देखते थे?",
    option: [
        "राधाकृष्णन में",
        "राजेन्द्र प्रसाद में",
        "गाँधी में",
        "जे. कृष्णमूर्ति में"
    ],
    answer: "जे. कृष्णमूर्ति में"
},

{
    question: "पिताजी की मृत्यु कैसे होती है?",
    option: [
        "तिरिछ के काटने से",
        "धतूरे के जहर से",
        "दुर्घटना से",
        "मानसिक सदमे और अधिक रक्तस्राव से"
    ],
    answer: "मानसिक सदमे और अधिक रक्तस्राव से"
},

{
    question: "शमशेर बहादुर सिंह ने किस स्थान से बी० ए० किया?",
    option: [
        "इलाहाबाद",
        "दिल्ली",
        "बनारस",
        "कानपुर"
    ],
    answer: "इलाहाबाद"
},

{
    question: "पत्नी बिटिया को क्या करती है?",
    option: [
        "डाँटती है",
        "पढ़ाती है",
        "सुलाती है",
        "समझाती है"
    ],
    answer: "समझाती है"
},

{
    question: "‘तिरिछ’ को कैसी कहानी माना जाता है?",
    option: [
        "आदिवासी कहानी",
        "आदर्शोन्मुख कहानी",
        "‘जादुई यथार्थ’ की कहानी",
        "विवादात्मक कहानी"
    ],
    answer: "‘जादुई यथार्थ’ की कहानी"
},

{
    question: "सम्पूर्ण भक्तमाल में किस छंद की व्यंजना है?",
    option: [
        "चौपाई",
        "दोहा",
        "छप्पय",
        "कवित्त"
    ],
    answer: "छप्पय"
},

{
    question: "पुलिस के बड़े उच्चाधिकारी ने किससे मुँह से सुना था कि ‘जय प्रकाशू नारायण नहीं होते तो बिहार जल गया होता ?” ।",
    option: [
        "दिनकर जी के",
        "बेनीपुरी जी के",
        "गोयना जी के",
        "दीक्षित जी के"
    ],
    answer: "दीक्षित जी के"
},

{
    question: "तुलसीदास के शिक्षा गुरु थे",
    option: [
        "नरहरिदास",
        "रविदास",
        "शेष सनातन",
        "मधुसूदन सरस्वती"
    ],
    answer: "शेष सनातन"
},

{
    question: "कौन-सी कृति विनोद कुमार शुक्ल की है ?",
    option: [
        "दीवार में एक खिड़की रहती थी",
        "नौकर की कमीज",
        "असाध्य वीणा",
        "खिलेगा तो देखेंगे"
    ],
    answer: "नौकर की कमीज"
},

{
    question: "‘रामचरितमानस’ की भाषा है",
    option: [
        "मैथिली",
        "संस्कृत",
        "अवधी",
        "ब्रजभाषा"
    ],
    answer: "अवधी"
},

{
    question: "‘कड़माई’ का क्या अर्थ होता है ?",
    option: [
        "मँगनी",
        "विवाह",
        "कड़ी बात",
        "दहेज"
    ],
    answer: "मँगनी"
},

{
    question: "प्रसादजी की कौन-सी कृति अपूर्ण है?",
    option: [
        "तितली",
        "लहर",
        "इरावती",
        "ध्रुवस्वामिनी"
    ],
    answer: "इरावती"
},

{
    question: "जयशंकर प्रसाद की कौन-सी कृति नहीं है?",
    option: [
        "महाराणा प्रताप का महत्त्व",
        "प्रेमपथिक",
        "महाराजा मानसिंह",
        "इरावती"
    ],
    answer: "महाराजा मानसिंह"
},

{
    question: "सूरदास किस चीज की भूख है?",
    option: [
        "कृष्ण की झूठी की",
        "प्रेम की",
        "काव्य रचना की",
        "इनमें से कोई नहीं"
    ],
    answer: "कृष्ण की झूठी की"
},

{
    question: "जयशंकर प्रसाद ने किस भाषा में काव्य रचना की है?",
    option: [
        "अवधी",
        "खड़ी बोली",
        "ब्रज",
        "इनमें से कोई नहीं"
    ],
    answer: "खड़ी बोली"
},

{
    question: "महेश्वर कौन-सा फल लेकर आया था ?",
    option: [
        "आम",
        "केला",
        "सेव",
        "संतरा"
    ],
    answer: "आम"
},

{
    question: "राजा हरिसिंह देव को गयासुद्दीन तुगलक का सामना कब करना पड़ा?",
    option: [
        "1225 ई. में",
        "1250 ई. में",
        "1325 ई. में",
        "1350 ई. में"
    ],
    answer: "1325 ई. में"
},

{
    question: "‘बोलते क्षण’ किस साहित्यिक विधा की कृति है?",
    option: [
        "निबंध",
        "कहानी",
        "संस्मरण",
        "आलोचना"
    ],
    answer: "निबंध"
},

{
    question: "बारहवीं सदी के लगभग तीन सौ वर्ष तक किस वंश का शासन था?",
    option: [
        "मौर्य वंश",
        "चालुक्य वंश",
        "गुप्त वंश",
        "कर्णाट वंश"
    ],
    answer: "कर्णाट वंश"
},

{
    question: "मलयज छात्र जीवन में किस रोग से ग्रसित थे?",
    option: [
        "मधुमेह",
        "कैंसर",
        "क्षयरोग",
        "हैजा"
    ],
    answer: "क्षयरोग"
},

{
    question: "कविता-संग्रह है",
    option: [
        "‘जख्म पर धूल’",
        "‘रामचंद्र शुक्ल’",
        "‘हँसते हुए मेरा अकेलापन’",
        "‘कविता से साक्षात्कार’"
    ],
    answer: "‘जख्म पर धूल’"
},

{
    question: "चेख्यकोव ने जनरल को माफी क्यों मांगी?",
    option: [
        "किसी दंड के लिए",
        "छींक के कारण",
        "पैसे की मांग के लिए",
        "खेल में हार के लिए"
    ],
    answer: "छींक के कारण"
},

{
    question: "सिपाही की माँ कौन है?",
    option: [
        "चुप्पेदई",
        "बिरहनीदेई",
        "लखनेदेई",
        "हरखदेई"
    ],
    answer: "बिरहनीदेई"
},

{
    question: "‘उसने कहा था’ कहानी कब प्रकाशित हुई ?",
    option: [
        "1913 में",
        "1912 में",
        "1915 में",
        "1900 में"
    ],
    answer: "1915 में"
},

{
    question: "चेख्यकोव ने जनरल के पास जाकर क्या कहा?",
    option: [
        "“मुझे खेद है।”",
        "“मुझे माफ करें।”",
        "“मैं जान-बूझकर नहीं छींका।”",
        "“मैं आपके पास क्यों आया हूँ?”"
    ],
    answer: "“मुझे माफ करें।”"
},

{
    question: "ओमप्रकाश वाल्मीकि को कौन-सा पुरस्कार नहीं मिला?",
    option: [
        "परिवेश सम्मान",
        "जयश्री सम्मान",
        "परिवेश सम्मान",
        "भारत-रत्न"
    ],
    answer: "भारत-रत्न"
},

{
    question: "‘मेघदूत’ नामक नाट्यशाला कहाँ स्थापित हुई?",
    option: [
        "उत्तर प्रदेश में",
        "बिहार में",
        "हरियाणा में",
        "महाराष्ट्र में"
    ],
    answer: "महाराष्ट्र में"
},

{
    question: "प्रसाद की सफलतम नाट्यकृति है",
    option: [
        "स्कंदगुप्त",
        "एक घूँट",
        "ध्रुवस्वामिनी",
        "विशाख"
    ],
    answer: "ध्रुवस्वामिनी"
},

{
    question: "भट्टजी को किसने अंग्रेजी साहित्य के एडिसन और स्टील की श्रेणी में रखा है?",
    option: [
        "हजारी प्रसाद द्विवेदी",
        "डॉ० नगेंद्र",
        "रामचंद्र शुक्ल",
        "रामविलास शर्मा"
    ],
    answer: "रामचंद्र शुक्ल"
},

{
    question: "‘रस्सी का टुकड़ा’ कहानी किस घटना पर आधारित है?",
    option: [
        "बटुआ खोने",
        "चोरी",
        "ईमानदारी पर संदेह",
        "शोषण"
    ],
    answer: "ईमानदारी पर संदेह"
},

{
    question: "ज्ञानेंद्रपति का जन्म कहाँ हुआ था?",
    option: [
        "उत्तर प्रदेश में",
        "राजस्थान में",
        "झारखंड में",
        "हरियाणा में"
    ],
    answer: "झारखंड में"
},

{
    question: "प्रभातकालीन आकाश कैसा है?",
    option: [
        "कमल के रंग जैसा",
        "नीले शंख जैसा",
        "काली सिल के जैसा",
        "उजली सीप के जैसा"
    ],
    answer: "नीले शंख जैसा"
},

{
    question: "जायसी ने अपनी आँख की उपमा किससे की है?",
    option: [
        "कमल",
        "कुमुद",
        "सरोवर",
        "दर्पण"
    ],
    answer: "दर्पण"
},

{
    question: "कहानीकार को सपने में बोलने और चीखने की आदत है-यह किसने बताया?",
    option: [
        "कहानीकार के पिता ने",
        "कहानीकार की माँ ने",
        "कहानीकार के भैया ने",
        "कहानीकार के चाचा ने"
    ],
    answer: "कहानीकार की माँ ने"
},

{
    question: "अज्ञेय मूलतः क्या है ?",
    option: [
        "निबन्धकार",
        "उपन्यासकार",
        "कहानीकार",
        "व्यंग्यकार"
    ],
    answer: "कहानीकार"
},

{
    question: "जयशंकर प्रसाद किस वाद के कवि थे?",
    option: [
        "छायावाद",
        "प्रगतिवाद",
        "प्रयोगवाद",
        "अतियथार्थवाद"
    ],
    answer: "छायावाद"
},

{
    question: "कहानी में किस बात की चिंता मुख्य रूप से दिखाई गई है?",
    option: [
        "सच्चाई की",
        "चोरी की",
        "धन की",
        "ईमानदारी की"
    ],
    answer: "ईमानदारी की"
},

{
    question: "होशेकम किस बात को बार-बार दोहराता रहा?",
    option: [
        "“मैं निर्दोष हूँ”",
        "“रस्सी का एक टुकड़ा”",
        "“मैंने बटुआ नहीं लिया”",
        "“मैंने कुछ नहीं किया”"
    ],
    answer: "“रस्सी का एक टुकड़ा”"
},

{
    question: "'शिवाबावनी' में कितने मुक्तक हैं?",
    option: [
        "पचास",
        "बावन",
        "छप्पन",
        "साठ"
    ],
    answer: "बावन"
},

{
    question: "प्रस्तुत प्रथम पद में कृष्ण को किसकी सूचना दी जाती है?",
    option: [
        "रात्रि होने की",
        "दोपहर होने की",
        "भोर होने की",
        "इनमें किसी की नहीं"
    ],
    answer: "भोर होने की"
},

{
    question: "जयशंकर प्रसाद के पितामह कौन थे?",
    option: [
        "शिवरतन साहू",
        "शिवजतन साहू",
        "शिवप्रसन्न साहू",
        "इनमें से कोई नहीं"
    ],
    answer: "शिवरतन साहू"
},

{
    question: "कौन सी रचना जयशंकर प्रसाद की नहीं है?",
    option: [
        "प्रायश्चित",
        "सूरसागर",
        "ध्रुवस्वामिनी",
        "कामना"
    ],
    answer: "सूरसागर"
},

{
    question: "भगवान श्रीकृष्ण किस कवि के पूज्य थे?",
    option: [
        "तुलसीदास के",
        "जायसी के",
        "कबीरदास के",
        "सूरदास के"
    ],
    answer: "सूरदास के"
},

{
    question: "प्रकृति वर्णन से सम्बन्धित कविता है-",
    option: [
        "गाँव का घर",
        "उषा",
        "साकेत",
        "हार-जीत"
    ],
    answer: "उषा"
},

{
    question: "‘जूठन’ क्या है?",
    option: [
        "कहानी",
        "आत्मकथा",
        "उपन्यास",
        "निबंध"
    ],
    answer: "आत्मकथा"
},

{
    question: "कौन सी कृति भूषण की है?",
    option: [
        "अध्यात्म",
        "शिवा बावनी",
        "साहित्यलहरी",
        "चित्ररेखा"
    ],
    answer: "शिवा बावनी"
},

{
    question: "मनुष्य की बातचीत का उत्तम तरीका क्या है?",
    option: [
        "विद्वत्तापूर्ण बात करना",
        "तर्कपूर्ण बात करना",
        "भीड़ से बात करना",
        "अवाक होकर अपने से बातचीत करना"
    ],
    answer: "अवाक होकर अपने से बातचीत करना"
},

{
    question: "‘पुत्र वियोग’ शीर्षक कविता में कवयित्री का खिलौना क्या है?",
    option: [
        "उनका पुत्र",
        "उनका नेता",
        "उनका छोटा भाई",
        "इनमें से कोई नहीं"
    ],
    answer: "उनका पुत्र"
},

{
    question: "कहानीकार को सपने में बोलने और चीखने की आदत है-यह किसने बताया है?",
    option: [
        "कहानीकार के पिता ने",
        "कहानीकार की माँ ने",
        "कहानीकार के भैया ने",
        "कहानीकार के चाचा ने"
    ],
    answer: "कहानीकार की माँ ने"
},

{
    question: "बालकृष्ण भट्ट ने कौन-सा मासिक पत्र निकाला था?",
    option: [
        "प्रताप नामक",
        "कर्मवीर नामक",
        "हिन्दी प्रदीप नामक",
        "ज्योत्स्ना नामक"
    ],
    answer: "हिन्दी प्रदीप नामक"
},

{
    question: "मोहन राकेश का जन्म-स्थान कहाँ है?",
    option: [
        "शाहजहाँपुर, उत्तर प्रदेश",
        "कुशीनगर, उत्तर प्रदेश",
        "अमृतसर, पंजाब",
        "आजमगढ़, उत्तर प्रदेश"
    ],
    answer: "अमृतसर, पंजाब"
},

{
    question: "'आत्महत्या के विरुद्ध' क्या है?",
    option: [
        "कहानी",
        "कहानी",
        "कविता",
        "आलोचना"
    ],
    answer: "कविता"
},

{
    question: "नामवर सिंह को किस कृति पर साहित्य अकादमी पुरस्कार प्राप्त हुआ?",
    option: [
        "कविता के नए प्रतिमान’ पर",
        "कहानी : नई कहानी’ पर",
        "‘पृथ्वीराजरासो की भाषा’ पर",
        "इतिहास और आलोचना’ पर"
    ],
    answer: "कविता के नए प्रतिमान’ पर"
},

{
    question: "रघुवीर सहाय का जन्म कहाँ हुआ था?",
    option: [
        "आगरा, उत्तर प्रदेश",
        "इलाहाबाद, उत्तर प्रदेश",
        "कानपुर, उत्तर प्रदेश",
        "लखनऊ, उत्तर प्रदेश"
    ],
    answer: "लखनऊ, उत्तर प्रदेश"
},

{
    question: "‘पेशगी’ कहानी में बच्ची के साथ किस प्रकार से बात की जाती है?",
    option: [
        "वयस्क की तरह",
        "बच्चे की तरह",
        "शिक्षात्मक",
        "दयालु"
    ],
    answer: "वयस्क की तरह"
},

{
    question: "चेख्यकोव ने ब्रिजालोव से क्या कहा?",
    option: [
        "“मैं क्षमाप्रार्थी हूँ।”",
        "“मुझे माफ कर दें।”",
        "“मैं जान-बूझकर नहीं छींका।”",
        "“क्या आप मुझे क्षमा करेंगे?”"
    ],
    answer: "“मैं जान-बूझकर नहीं छींका।”"
},

{
    question: "जयप्रकाश जी को किसका भाषण सुनकर अमेरिका जाने की प्रेरणा मिली ?",
    option: [
        "स्वामी रामतीर्थ",
        "स्वामी सत्यदेव",
        "स्वामी विवेकानंद",
        "स्वामी सहजानंद"
    ],
    answer: "स्वामी सत्यदेव"
},

{
    question: "‘रस्सी का टुकड़ा’ कहानी का लेखक किस देश से है?",
    option: [
        "इटली",
        "फ्रांस",
        "जर्मनी",
        "स्पेन"
    ],
    answer: "फ्रांस"
},

{
    question: "पई नदी कहाँ तक जाती है?",
    option: [
        "भिखनाझौरी",
        "बगहा",
        "रामनगर",
        "भितिहरवा"
    ],
    answer: "भिखनाझौरी"
},

{
    question: "कौन-सी कहानी उदय प्रकाश जी की नहीं है?",
    option: [
        "वारिस",
        "दरियाई घोड़ा",
        "पीली छतरीवाली लड़की",
        "मैगामिल"
    ],
    answer: "वारिस"
},

{
    question: "रॉबिन्सन क्रूसो ने 16 वर्ष के उपरांत किसके मुख से एक बात सुनी?",
    option: [
        "फ्राइडे के",
        "सन्डे के",
        "एडीसन के",
        "स्टील के"
    ],
    answer: "फ्राइडे के"
},

{
    question: "चेख्यकोव की मृत्यु के बाद की स्थिति कैसी थी?",
    option: [
        "आरामदायक",
        "दुखी",
        "यंत्रचालित",
        "खुश"
    ],
    answer: "यंत्रचालित"
},

{
    question: "प्रसादजी का जन्म कहाँ हुआ था?",
    option: [
        "इलाहाबाद में",
        "पटना में",
        "वाराणसी में",
        "लखनऊ में"
    ],
    answer: "वाराणसी में"
},

{
    question: "कौन-सी रचना सूरदास की नहीं है?",
    option: [
        "सूरसागर",
        "साहित्यलहरी",
        "सूरसारावली",
        "सतसई"
    ],
    answer: "सतसई"
},

{
    question: "ज्ञानेंद्रपति किस काल के कवि हैं?",
    option: [
        "भक्तिकाल",
        "रीतिकाल",
        "आधुनिक काल",
        "प्रेमचन्द काल"
    ],
    answer: "आधुनिक काल"
},

{
    question: "रघुवीर सहाय किस सप्तक में एक कवि के रूप में शामिल हुए?",
    option: [
        "पहला सप्तक",
        "दूसरा सप्तक",
        "तीसरा सप्तक",
        "चौथा सप्तक"
    ],
    answer: "दूसरा सप्तक"
},

{
    question: "किस अस्पताल में ‘दिनकर’ का निधन हुआ था ?",
    option: [
        "अपोलो अस्पताल",
        "श्रीराम नर्सिंग होम",
        "पी०एम०सी०एच०, पटना",
        "विलिंगडन नर्सिंग होम"
    ],
    answer: "विलिंगडन नर्सिंग होम"
},

{
    question: "कौन-सी कृति रामधारी सिंह ‘दिनकर’ द्वारा लिखी गई है?",
    option: [
        "‘रश्मि’",
        "‘हारे को हरिनाम’",
        "‘साकेत’",
        "‘उर्मिला’"
    ],
    answer: "‘हारे को हरिनाम’"
},

{
    question: "‘सम्पूर्ण क्रांति’ की शुरूआत कब हुई थी ?",
    option: [
        "1974 में",
        "1975 में",
        "1976 में",
        "1977 में"
    ],
    answer: "1974 में"
},

{
    question: "किस वस्तु के खो जाने की सूचना दी गई थी?",
    option: [
        "घड़ी",
        "काला चमड़े का बटुआ",
        "पर्स",
        "कपड़े"
    ],
    answer: "काला चमड़े का बटुआ"
},

{
    question: "कौन-सी रचना ओमप्रकाश वाल्मीकि की नहीं है?",
    option: [
        "सदियों का संताप",
        "अब और नहीं",
        "प्रायश्चित",
        "सलाम"
    ],
    answer: "प्रायश्चित"
},

{
    question: "रघुवीर सहाय किस कृति के रचनाकार हैं?",
    option: [
        "'तितली' के",
        "'इरावती' के",
        "'चित्रकोटावरी' के",
        "कुछ पते कुछ चिट्ठियों के"
    ],
    answer: "कुछ पते कुछ चिट्ठियों के"
},

{
    question: "मुन्‍नी की उम्र कितनी हो गयी है?",
    option: [
        "10 वर्ष",
        "12 वर्ष",
        "14 वर्ष",
        "16 वर्ष"
    ],
    answer: "14 वर्ष"
},

{
    question: "होशेकम की मृत्यु किस महीने के आरंभ में हुई?",
    option: [
        "फरवरी",
        "जनवरी",
        "मार्च",
        "अप्रैल"
    ],
    answer: "जनवरी"
},

{
    question: "प्रसादजी के पिता का नाम था",
    option: [
        "रविन्द्र प्रसाद साहू",
        "देवी प्रसाद साहू",
        "कालिका प्रसाद साहू",
        "चंडीका प्रसाद साहू"
    ],
    answer: "देवी प्रसाद साहू"
},

{
    question: "बालकृष्ण भट्ट का जन्म हुआ था",
    option: [
        "23 जून, 1884 को",
        "23 जून, 1844 को",
        "20 जुलाई, 1902 को",
        "18 सितम्बर, 1834 को"
    ],
    answer: "23 जून, 1884 को"
},

{
    question: "‘जूठन’ किस चेतना की रचना है?",
    option: [
        "सांस्कृतिक चेतना की",
        "राजनीतिक चेतना की",
        "धार्मिक चेतना की",
        "दलित चेतना की"
    ],
    answer: "दलित चेतना की"
},

{
    question: "किस पाठ में यह उदाहरण आया है? ‘फौजी वहाँ लड़ने के लिए हैं ये भाग नहीं सकते। जो काँट छोड़कर भागता है, उसे गोली मार दी जाती है।’",
    option: [
        "हँसते हुए मेरा अकेलापन",
        "एग्जीटी और समाज",
        "सिपाही की माँ",
        "ओ सदानीरा"
    ],
    answer: "सिपाही की माँ"
},

{
    question: "मालती का पति क्या है ?",
    option: [
        "डॉक्टर",
        "वकील",
        "प्राध्यापक",
        "अभियंता"
    ],
    answer: "डॉक्टर"
},

{
    question: "कौन-सा मास्टर है वो, जो मेरे लड़के से झाड़ू लगवावे है ?”—यह किसका कथन है?",
    option: [
        "लेखक की माँ का",
        "लेखक के चाचा का",
        "लेखक के पिताजी का",
        "लेखक की बड़ी भाभी का"
    ],
    answer: "लेखक के पिताजी का"
},

{
    question: "‘कामायनी’ प्रसाद जी की किस प्रकार की कृति है?",
    option: [
        "खंड काव्य",
        "प्रबंध काव्य",
        "गद्य काव्य",
        "इनमें से कोई नहीं"
    ],
    answer: "प्रबंध काव्य"
},

{
    question: "युद्ध और शांति की समस्या पर लिखी गई काव्यकृति है",
    option: [
        "नील कुसुम",
        "कुरुक्षेत्र",
        "द्वंद्वगीत",
        "रश्मिरथी"
    ],
    answer: "कुरुक्षेत्र"
},

{
    question: "कहानीकार को सपने में बोलने और चीखने की आदत है-यह किसने बताया है?",
    option: [
        "कहानीकार के पिता ने",
        "कहानीकार की माँ ने",
        "कहानीकार के भैया ने",
        "कहानीकार के चाचा ने"
    ],
    answer: "कहानीकार की माँ ने"
},

{
    question: "‘तिरिछ’ क्या होता है?",
    option: [
        "जंगली साँप",
        "दरियाई घोड़ा",
        "भेड़िया",
        "विषधर (जहरीला जिवाई)"
    ],
    answer: "विषधर (जहरीला जिवाई)"
},

{
    question: "‘हँसते हुए मेरा अकेलापन’ किस विधा में लिखित है?",
    option: [
        "पत्र विधा में",
        "डायरी विधा में",
        "कथा विधा में",
        "जीवनी विधा में"
    ],
    answer: "डायरी विधा में"
},

{
    question: "चंपारण में धाँगड़ कहाँ से आए?",
    option: [
        "राँची",
        "जमशेदपुर",
        "छोटानागपुर",
        "आंध्र प्रदेश"
    ],
    answer: "छोटानागपुर"
},

{
    question: "चेख्यकोव की आत्महत्या का मुख्य कारण क्या था?",
    option: [
        "मानसिक अपमान",
        "शारीरिक दर्द",
        "सामाजिक चिंता",
        "व्यक्तिगत असफलता"
    ],
    answer: "मानसिक अपमान"
},

{
    question: "‘रस्सी का टुकड़ा’ कहानी में किस चीज की गंध पूरे वातावरण में फैली थी?",
    option: [
        "फूलों की",
        "मवेशियों की",
        "पसीने की",
        "गोबर और भूसे की"
    ],
    answer: "गोबर और भूसे की"
},

{
    question: "लहना सिंह के गाँव का क्या नाम है?",
    option: [
        "मझरे",
        "माँझे",
        "कड़रा",
        "तेलघरिया"
    ],
    answer: "माँझे"
},

{
    question: "कौन-सी कृति शमशेर बहादुर सिंह की है?",
    option: [
        "गुलामी का नशा",
        "मुकुल",
        "काल तुझसे होड़ है मेरी",
        "विशाख"
    ],
    answer: "काल तुझसे होड़ है मेरी"
},

{
    question: "माथुर जी किस राज्य के शिक्षा सचिव नियुक्त हुए?",
    option: [
        "मध्य प्रदेश",
        "आंध्रप्रदेश",
        "बिहार",
        "उत्तर प्रदेश"
    ],
    answer: "मध्य प्रदेश"
},

{
    question: "कौन-सी कृति विनोद कुमार शुक्ल की नहीं है?",
    option: [
        "सब कुछ होना बचा रहेगा",
        "वह आदमी नया गरम कोट पहनकर चला गया विचार की तरह",
        "नौकर की कमीज",
        "असाध्य वीणा"
    ],
    answer: "असाध्य वीणा"
},

{
    question: "‘रस्सी का टुकड़ा’ कहानी के लेखक कौन हैं?",
    option: [
        "मोपासाँ",
        "होशेकम",
        "ब्रेतों",
        "मलांदे"
    ],
    answer: "मोपासाँ"
},

{
    question: "‘तिरिछ’ कहानी के पिताजी का नाम क्या है?",
    option: [
        "रामनिहाल प्रसाद",
        "रामस्वार्थ प्रसाद",
        "रामकिशोर प्रसाद",
        "रामबली प्रसाद"
    ],
    answer: "रामस्वार्थ प्रसाद"
},

{
    question: "चेख्यकोव ने जनरल से कितनी बार माफी मांगी?",
    option: [
        "एक बार",
        "दो बार",
        "तीन बार",
        "चार बार"
    ],
    answer: "दो बार"
},

{
    question: "मलिक मुहम्मद जायसी किस परंपरा के कवि हैं?",
    option: [
        "सगुण कृष्णभक्ति परंपरा",
        "सगुण रामभक्ति परंपरा",
        "प्रेमाख्यानक काव्य-परंपरा",
        "संस्कृत काव्य-परंपरा"
    ],
    answer: "प्रेमाख्यानक काव्य-परंपरा"
},

{
    question: "जयप्रकाश नारायण ने बिहार विद्यापीठ में कौन-सी परीक्षा दी ?",
    option: [
        "मैट्रिक की हार का",
        "आई०एस०सी० की ‘",
        "बी०ए०की",
        "इनमें कोई नहीं"
    ],
    answer: "आई०एस०सी० की ‘"
},

{
    question: "उषा की ज्योति में कौन-सा अलंकार है?",
    option: [
        "श्लेष",
        "अनुप्रास",
        "उपमा",
        "यमक"
    ],
    answer: "अनुप्रास"
},

{
    question: "‘शिवा बावनी’ में कितने मुक्तक हैं?",
    option: [
        "पचपन",
        "एक सौ बावन",
        "बावन",
        "दो सौ बावन"
    ],
    answer: "बावन"
},

{
    question: "बटुआ खोने की सूचना किस समय दी गई?",
    option: [
        "सुबह 9-10 बजे",
        "दोपहर 1-2 बजे",
        "शाम 4-5 बजे",
        "रात 8-9 बजे"
    ],
    answer: "सुबह 9-10 बजे"
},

{
    question: "मैडम की किस आदत ने कहानी में विशेष प्रभाव डाला?",
    option: [
        "बच्ची के साथ बात करने का तरीका",
        "गुस्सा दिखाना",
        "ब्रिज खेलना",
        "भोजन पकाना"
    ],
    answer: "बच्ची के साथ बात करने का तरीका"
},

{
    question: "‘दिनकर’ को किस कृति पर भारतीय ज्ञानपीठ पुरस्कार प्राप्त हुआ था?",
    option: [
        "‘संस्कृति के चार अध्याय’ पर",
        "‘मिट्टी की ओर’ पर",
        "‘नीलकुसुम’ पर",
        "‘उर्वशी’ पर"
    ],
    answer: "‘उर्वशी’ पर"
},

{
    question: "कौन-सी रचना जयशंकर प्रसाद की है?",
    option: [
        "पद्मावत",
        "जानकी मंगल",
        "कंकाल",
        "शिवराज भूषण"
    ],
    answer: "कंकाल"
},

{
    question: "कड़बक के रचयिता हैं",
    option: [
        "सूरदास",
        "कबीरदास",
        "जायसी",
        "तुलसीदास"
    ],
    answer: "जायसी"
},

{
    question: "अर्द्धनारीश्वर में किस गुण का समन्वय है?",
    option: [
        "नारी के",
        "पुरुष के",
        "नारी और पुरुष दोनों के",
        "इनमें कोई नहीं"
    ],
    answer: "नारी और पुरुष दोनों के"
},

{
    question: "जनरल ने चेख्यकोव को किस प्रकार से भेजा?",
    option: [
        "आदर के साथ",
        "गुस्से में",
        "प्यार से",
        "गंभीरता से"
    ],
    answer: "गुस्से में"
},

{
    question: "'कवित्त' शीर्षक कविता के कवि कौन हैं?",
    option: [
        "कबीर",
        "भूषण",
        "तुलसीदास",
        "सूरदास"
    ],
    answer: "भूषण"
},

{
    question: "कहानी में होशेकम का चरित्र किस बात को दर्शाता है?",
    option: [
        "ईमानदारी",
        "चालाकी",
        "मासूमियत",
        "शक्ति"
    ],
    answer: "ईमानदारी"
},

{
    question: "‘तिरिछ’ कहानी के कहानीकार हैं",
    option: [
        "उदय प्रकाश",
        "बाल कृष्ण भट्ट",
        "चंद्रधर शर्मा गुलेरी",
        "सच्चिदानंद हीरानंद वात्स्यायन ‘अज्ञेय’"
    ],
    answer: "उदय प्रकाश"
},

{
    question: "‘सिपाही की माँ’ एकांकी के लेखक कौन हैं? या, सिपाही की माँ के रचनाकार हैं—",
    option: [
        "रामधारी सिंह दिनकर",
        "मोहन राकेश",
        "नामवर सिंह",
        "उदय प्रकाश"
    ],
    answer: "मोहन राकेश"
},

{
    question: "‘जूठन’ में चित्रण हुआ है",
    option: [
        "राजनीतिक विडंबना का",
        "सामाजिक विषमता का",
        "ऐतिहासिक चेतना का",
        "शैक्षिक परिवेश का"
    ],
    answer: "सामाजिक विषमता का"
},

{
    question: "सूरदास की कृति है",
    option: [
        "‘प्रणभंग’",
        "‘जयद्रथ वध’",
        "‘साहित्यलहरी’",
        "‘बरवै रामायण’"
    ],
    answer: "‘साहित्यलहरी’"
},

{
    question: "इनमें से कौन-सी पुस्तक प्रसाद जी की नहीं है?",
    option: [
        "आँसू",
        "इंद्रजाल",
        "आँधी",
        "शिवाजी का महत्त्व"
    ],
    answer: "शिवाजी का महत्त्व"
},

{
    question: "द्वितीय पद में किस खाद्यपदार्थ का उल्लेख नहीं हुआ है?",
    option: [
        "दही",
        "माखन",
        "मिसरी",
        "अमूप"
    ],
    answer: "अमूप"
},

{
    question: "कहानी ‘रस्सी का टुकड़ा’ का केंद्रीय भाव क्या है?",
    option: [
        "सामाजिक न्याय",
        "ईमानदारी",
        "अविश्वास",
        "मित्रता"
    ],
    answer: "अविश्वास"
},

{
    question: "‘कामायनी’ के रचयिता कौन हैं?",
    option: [
        "जयशंकर प्रसाद",
        "सुमित्रानंदन पंत",
        "महादेवी वर्मा",
        "सूर्यकांत त्रिपाठी ‘निराला’"
    ],
    answer: "जयशंकर प्रसाद"
},

{
    question: "‘अब और नहीं’ वाल्मीकि की कैसी कृति है?",
    option: [
        "कहानी",
        "कविता",
        "उपन्यास",
        "निबंध"
    ],
    answer: "कविता"
},

{
    question: "इनमें से कौन-सी पुस्तक प्रसादजी की नहीं है?",
    option: [
        "आँसू",
        "इंद्रजाल",
        "आँधी",
        "शिवाजी का महत्त्व"
    ],
    answer: "शिवाजी का महत्त्व"
},

{
    question: "चेख्यकोव की पत्नी ने कितनी गंभीरता से घटना को लिया?",
    option: [
        "बहुत गंभीरता से",
        "थोड़ी गंभीरता से",
        "बिलकुल गंभीरता से नहीं",
        "उचित गंभीरता से"
    ],
    answer: "बिलकुल गंभीरता से नहीं"
},

{
    question: "जयशंकर प्रसाद किस वाद के कवि थे?",
    option: [
        "छायावाद",
        "प्रगतिवाद",
        "प्रयोगवाद",
        "अतियथार्थवाद"
    ],
    answer: "छायावाद"
},

{
    question: "तुलसीदास का जन्म किस प्रदेश में हुआ था?",
    option: [
        "हिमाचल प्रदेश",
        "आन्ध्रप्रदेश",
        "उत्तर प्रदेश",
        "मध्यप्रदेश"
    ],
    answer: "उत्तर प्रदेश"
},

{
    question: "चेख्यकोव की कहानी में मृत्यु का कारण क्या था?",
    option: [
        "मानसिक तनाव",
        "शारीरिक बीमारी",
        "सामाजिक अपमान",
        "आत्महत्या"
    ],
    answer: "आत्महत्या"
},

{
    question: "तुलसीदास किस काल के कवि थे?",
    option: [
        "आदिकाल के",
        "रीतिकाल के",
        "आधुनिक काल के",
        "भक्तिकाल के"
    ],
    answer: "भक्तिकाल के"
},

{
    question: "तुलसीदास ने प्रथम पद में किसकी स्तुति की है?",
    option: [
        "गणेश जी की",
        "भगवान शिव की",
        "सीता जी की",
        "इनमें से कोई नहीं"
    ],
    answer: "सीता जी की"
},

{
    question: "चेख्यकोव की माफी का जनरल की प्रतिक्रिया क्या थी?",
    option: [
        "सकारात्मक",
        "तटस्थ",
        "नकारात्मक",
        "उपेक्षात्मक"
    ],
    answer: "तटस्थ"
},

{
    question: "चेख्यकोव की पत्नी ने उसकी समस्याओं को कैसे देखा?",
    option: [
        "गंभीरता से",
        "उपेक्षा से",
        "चिंता के साथ",
        "सहानुभूति से"
    ],
    answer: "उपेक्षा से"
},

{
    question: "उदय प्रकाश जी किस पत्रिका के सहायक सम्पादक थे?",
    option: [
        "न्यूज ट्रैक",
        "संडे मेल (नई दिल्ली)",
        "इंडिया टुडे",
        "दिनमान"
    ],
    answer: "संडे मेल (नई दिल्ली)"
},

{
    question: "कौन-सी कृति माथुरजी की है?",
    option: [
        "जानवर और जानवर",
        "कहानी : नई कहानी",
        "यायावर रहेगा याद",
        "भोर का तारा"
    ],
    answer: "भोर का तारा"
},

{
    question: "‘बाज की दाढ़ में आदमी का खून लग चुका है।’ यह किस कविता की पंक्ति है ?",
    option: [
        "हिमालय",
        "गरम हथेली",
        "आह ! तुम्हारा सौंदर्य",
        "‘तय तो यही था’"
    ],
    answer: "‘तय तो यही था’"
},

{
    question: "प्रसादजी की कौन-सी कृति अपूर्ण है?",
    option: [
        "तितली",
        "लहर",
        "इरावती",
        "ध्रुवस्वामिनी"
    ],
    answer: "इरावती"
},

{
    question: "जयशंकर प्रसाद कितनी वर्ष की अवस्था में पितृविहीन हुए थे?",
    option: [
        "8 वर्ष",
        "12 वर्ष",
        "16 वर्ष",
        "20 वर्ष"
    ],
    answer: "12 वर्ष"
},

{
    question: "तिरिछ कहानी के कहानीकार",
    option: [
        "उदय प्रकाश",
        "बाल कृष्ण भट्ट",
        "चंद्रधर शर्मा गुलेरी",
        "सच्चिदानंद हीरानंद वात्स्यायन ‘अज्ञेय’"
    ],
    answer: "उदय प्रकाश"
},

{
    question: "‘पिताजी’ की मृत्यु कैसे होती है?",
    option: [
        "तिरिछ के काटने से",
        "धतूरे के जहर से",
        "दुर्घटना से",
        "मानसिक सदमे और अधिक रक्तस्राव से"
    ],
    answer: "मानसिक सदमे और अधिक रक्तस्राव से"
},

{
    question: "'दूसरा सप्तक' के सात कवियों में कौन शामिल हैं?",
    option: [
        "जयशंकर प्रसाद",
        "रघुवीर सहाय",
        "भुक्तिभोगी",
        "इनमें से कोई नहीं"
    ],
    answer: "रघुवीर सहाय"
},

{
    question: "तिरिछ कैसी कहानी है?",
    option: [
        "मिथकीय",
        "मनोज्ञानिक",
        "सांस्कृतिक",
        "प्रतीकात्मक"
    ],
    answer: "प्रतीकात्मक"
},

{
    question: "माथुर जी को भितिहरवा पहुँचने पर कौन मिले?",
    option: [
        "गाँधी जी",
        "गोखले जी",
        "पुंडलीक जी",
        "इनमें कोई नहीं"
    ],
    answer: "पुंडलीक जी"
},

{
    question: "जयशंकर प्रसाद का जन्म कब हुआ था?",
    option: [
        "1980 में",
        "1985 में",
        "1989 में",
        "1990 में"
    ],
    answer: "1989 में"
},

{
    question: "'हँसो हँसो जल्दी हँसो' के कवि हैं-",
    option: [
        "रघुवीर सहाय",
        "मलयज",
        "सर्वेश्वर दयाल सक्सेना",
        "भूमिल"
    ],
    answer: "रघुवीर सहाय"
},

{
    question: "‘कविता के नए प्रतिमान’ के लेखक हैं",
    option: [
        "लक्ष्मीकांत वर्मा",
        "सर्वेश्वरदयाल सक्सेना",
        "शिवदान सिंह चौहान",
        "नामवर सिंह"
    ],
    answer: "नामवर सिंह"
},

{
    question: "‘ध्रुवस्वामिनी’ कैसी कृति है?",
    option: [
        "महाकाव्य",
        "गीतिनाट्य",
        "गीतिकाव्य",
        "नाटक"
    ],
    answer: "नाटक"
},

{
    question: "ज्ञानेंद्रपति की रचना एकचक्रानगरी क्या है?",
    option: [
        "कहानी",
        "काव्य नाटक",
        "उपन्यास",
        "शोक गीत"
    ],
    answer: "काव्य नाटक"
},

{
    question: "जे. कृष्णमूर्ति का जन्म किस राज्य में हुआ था?",
    option: [
        "आंध्र प्रदेश में",
        "उत्तर प्रदेश में",
        "राजस्थान में",
        "उड़ीसा में"
    ],
    answer: "आंध्र प्रदेश में"
},

{
    question: "‘सिपाही की माँ’ एकांकी में कुंती कौन है?",
    option: [
        "बिरहनीदेई की बहन",
        "सिपाही की माँ",
        "पड़ोसिन",
        "मुन्‍नी की मौसी"
    ],
    answer: "पड़ोसिन"
},

{
    question: "'ध्रुवस्वामिनी' कैसी कृति है?",
    option: [
        "महाकाव्य",
        "गीति नाट्य",
        "गीतिकाव्य",
        "नाटक"
    ],
    answer: "नाटक"
},

{
    question: "कौन-सी कृति उदय प्रकाश की है?",
    option: [
        "रोश",
        "दरियाई घोड़ा",
        "लिहाफ",
        "नीली झील"
    ],
    answer: "दरियाई घोड़ा"
},

{
    question: "चेख्यकोव ने किस खेल का आनंद लिया?",
    option: [
        "फुटबॉल",
        "क्रिकेट",
        "टेनिस",
        "बास्केटबॉल"
    ],
    answer: "क्रिकेट"
},

{
    question: "प्रसादजी का जन्म कहाँ हुआ था ?",
    option: [
        "इलाहाबाद में",
        "पटना में",
        "वाराणसी में",
        "लखनऊ में"
    ],
    answer: "वाराणसी में"
},

{
    question: "खतरनाक सपनों में लेखक का सबसे बड़ा अस्त्र क्या था?",
    option: [
        "बंदूक",
        "तलवार",
        "आवाज",
        "खाँसना"
    ],
    answer: "आवाज"
},

{
    question: "पुत्र वियोग किसकी रचना है?",
    option: [
        "सुभद्रा कुमारी चौहान",
        "रघुवीर सहाय",
        "अज्ञेय",
        "मुक्तिबोध"
    ],
    answer: "सुभद्रा कुमारी चौहान"
},

{
    question: "‘राम की शक्तिपूजा’ किसकी कविता है ?",
    option: [
        "पंत",
        "दिनकर",
        "महादेवी वर्मा",
        "निराला"
    ],
    answer: "महादेवी वर्मा"
},

{
    question: "चेख्यकोव ने अपनी पत्नी को किस बारे में बताया?",
    option: [
        "खेल के बारे में",
        "माफी के बारे में",
        "ब्रिजालोव की प्रतिक्रिया",
        "घरेलू समस्याएँ"
    ],
    answer: "ब्रिजालोव की प्रतिक्रिया"
},

{
    question: "प्रसाद की सफलतम नाट्यकृति है",
    option: [
        "स्कंदगुप्त",
        "एक घूँट",
        "ध्रुवस्वामिनी",
        "विशाख"
    ],
    answer: "ध्रुवस्वामिनी"
},

{
    question: "ज्ञानेंद्रपति को किस कृति पर साहित्य अकादमी पुरस्कार प्राप्त",
    option: [
        "‘कवि ने कहा’ पर",
        "‘भिनसार’ पर",
        "‘संशयात्मा’ पर",
        "‘शब्द लिखने के लिए ही यह कागज बना है’ पर"
    ],
    answer: "‘संशयात्मा’ पर"
},

{
    question: "रघुवीर सहाय किस शती के रचनाकार हैं?",
    option: [
        "अठारहवीं शती के",
        "बीसवीं शती के",
        "उन्नीसवीं शती के",
        "इक्कीसवीं शती के"
    ],
    answer: "बीसवीं शती के"
},

{
    question: "जे. कृष्णमूर्ति की इनमें से कौन-सी रचना है?",
    option: [
        "रोज",
        "सम्पूर्ण क्रान्ति",
        "बातचीत",
        "शिक्षा"
    ],
    answer: "शिक्षा"
},

{
    question: "मैत्र होशेकम किस जगह से गोदरविल जा रहा था?",
    option: [
        "बेजेविल",
        "यीमानविल",
        "पेरिस",
        "बर्लिन"
    ],
    answer: "बेजेविल"
},

{
    question: "पाठ में संकलित कड़बक कहाँ से लिए गए हैं?",
    option: [
        "चंद्रयान से",
        "‘पद्मावत’ से",
        "आखिरी कलाम से",
        "‘अखरावट’ से"
    ],
    answer: "‘पद्मावत’ से"
},

{
    question: "तिरिछ क्या होता है?",
    option: [
        "जंगली साँप",
        "दरियाई घोड़ा",
        "भेड़िया",
        "विषधर (जहरीला जिवाई)"
    ],
    answer: "विषधर (जहरीला जिवाई)"
},

{
    question: "उषा का जादू कब टूट जाता है?",
    option: [
        "सूर्योदय होने पर",
        "दोपहर होने पर",
        "अँधेरा होने पर",
        "इनमें से कोई नहीं"
    ],
    answer: "सूर्योदय होने पर"
},

{
    question: "जगदीशचन्द्र माथुर का जन्म कब हुआ था?",
    option: [
        "16 जुलाई 1917 को",
        "16 जुलाई 1918 को",
        "17 अगस्त 1919 को",
        "20 सितम्बर 1917 को"
    ],
    answer: "16 जुलाई 1917 को"
},

{
    question: "‘प्रगीत और समाज’ के लेखक हैं",
    option: [
        "बालकृष्ण भट्ट",
        "जयप्रकाश नारायण",
        "नामवर सिंह",
        "उदय प्रकाश"
    ],
    answer: "नामवर सिंह"
},

{
    question: "‘कंकाल’ क्या है?",
    option: [
        "महाकाव्य",
        "कहानी",
        "उपन्यास",
        "प्रबंधकाव्य"
    ],
    answer: "उपन्यास"
},

{
    question: "‘बिखरे मोती’ क्या है?",
    option: [
        "उपन्यास",
        "काव्य संकलन",
        "निबंध संकलन",
        "कहानी संग्रह"
    ],
    answer: "कहानी संग्रह"
},

{
    question: "नामवर सिंह का जन्म कब हुआ था ?",
    option: [
        "28 जुलाई 1927 को",
        "20 जून 1925 को",
        "27 मई 1926 को",
        "22 मई 1925 को"
    ],
    answer: "28 जुलाई 1927 को"
},

{
    question: "प्रगीत कैसा काव्य है?",
    option: [
        "गीति काव्य",
        "आत्मपरक काव्य",
        "प्रबंध काव्य",
        "इनमें से कोई नहीं"
    ],
    answer: "प्रबंध काव्य"
},

{
    question: "'तुमुल कोलाहल कलह में' शीर्षक कविता के रचयिता कौन हैं?",
    option: [
        "सूर्यकांत त्रिपाठी 'निराला'",
        "जयशंकर प्रसाद",
        "महादेवी वर्मा",
        "पंत"
    ],
    answer: "जयशंकर प्रसाद"
},

{
    question: "भारतीय सिपाहियों का किसके साथ संघर्ष हुआ था?",
    option: [
        "फ्रांसिसियों के साथ",
        "तुर्कों के साथ",
        "अंग्रेजों के साथ",
        "जर्मनी के साथ"
    ],
    answer: "जर्मनी के साथ"
},

{
    question: "नामवर सिंह प्रधान संपादक थे",
    option: [
        "'हंस' के",
        "'सरस्वती' के",
        "'वागर्थ' के",
        "'आलोचना (त्रैमासिक)' के"
    ],
    answer: "'आलोचना (त्रैमासिक)' के"
},

{
    question: "निम्नलिखित में बिरहनी की पड़ोसिन कौन है?",
    option: [
        "आभा",
        "विमला",
        "कुंती",
        "माधुरी"
    ],
    answer: "कुंती"
},

{
    question: "बालकृष्ण भट्ट ने ‘हिन्दी प्रदीप’ नामक मासिक पत्रिका निकालना कब प्रारम्भ किया?",
    option: [
        "1877",
        "1888",
        "1890",
        "1894"
    ],
    answer: "1877"
},

{
    question: "‘दुनिया को हाथ की तरह गर्म और सुन्दर होना चाहिए।’ यह किस कवि की कविता का अंश है?",
    option: [
        "केदारनाथ सिंह",
        "जयशंकर प्रसाद",
        "सुभद्रा कुमारी चौहान",
        "शमशेर बहादुर सिंह"
    ],
    answer: "केदारनाथ सिंह"
},

{
    question: "जयशंकर प्रसाद का जन्म कब हुआ था?",
    option: [
        "1980 में",
        "1985 में",
        "1989 में",
        "1990 में"
    ],
    answer: "1989 में"
},

{
    question: "अज्ञेय के पिता का नाम था ?",
    option: [
        "दयानंद शास्त्री",
        "डॉ० हीरानंद शास्त्री",
        "डॉ० अभयानंद शास्त्री",
        "डॉ० अच्युतानंद शास्त्री"
    ],
    answer: "डॉ० हीरानंद शास्त्री"
},

{
    question: "नाभादास जी किस धारा के संत थे?",
    option: [
        "शैव दर्शन के",
        "बौद्ध दर्शन के",
        "वैष्णव दर्शन के",
        "जैन दर्शन के"
    ],
    answer: "वैष्णव दर्शन के"
},

{
    question: "‘बातचीत’ शीर्षक निबंध के निबंधकार हैं",
    option: [
        "जयप्रकाश नारायण",
        "मोहन राकेश",
        "नामवर सिंह",
        "बालकृष्ण भट्ट"
    ],
    answer: "बालकृष्ण भट्ट"
},

{
    question: "नामवर सिंह का जन्म कब हुआ था?",
    option: [
        "28 जुलाई 1927 को",
        "20 जून 1925 को",
        "27 मई 1926 को",
        "22 मई 1925 को"
    ],
    answer: "28 जुलाई 1927 को"
},

{
    question: "क्राइस्टचर्च गल्र्स स्कूल में सुभद्रा कुमारी चौहान की प्रिय मित्र कौन थी?",
    option: [
        "महादेवी वर्मा",
        "मन्नू भंडारी",
        "ममता कालिया",
        "इनमें से कोई नहीं"
    ],
    answer: "महादेवी वर्मा"
},

{
    question: "‘कामायनी’ के रचयिता कौन हैं?",
    option: [
        "जयशंकर प्रसाद",
        "सुमित्रानंदन पंत",
        "महादेवी वर्मा",
        "सूर्यकांत त्रिपाठी ‘निराला’"
    ],
    answer: "जयशंकर प्रसाद"
},

{
    question: "चेख्यकोव की पत्नी की प्रतिक्रिया कैसी थी?",
    option: [
        "चिंता भरी",
        "उपेक्षा वाली",
        "गुस्से भरी",
        "सहायता भरी"
    ],
    answer: "उपेक्षा वाली"
},

{
    question: "जयशंकर प्रसाद हिन्दी साहित्य के किस काल के कवि थे?",
    option: [
        "रीतिकाल",
        "आदिकाल",
        "आधुनिक काल",
        "भक्तिकाल"
    ],
    answer: "आधुनिक काल"
},

{
    question: "लेखक को किसने बताया कि तिरिछ में काले नाग से सौ गुना ज्यादा जहर होता है?",
    option: [
        "धनू",
        "पंडित राम औतार",
        "नंदलाल",
        "रामकिशोर"
    ],
    answer: "धनू"
},

{
    question: "होशेकम ने किस वस्तु की कहानी सुनाई?",
    option: [
        "बटुआ",
        "रस्सी का टुकड़ा",
        "मवेशी",
        "गोबर"
    ],
    answer: "रस्सी का टुकड़ा"
},

{
    question: "सुभद्रा कुमारी चौहान के पिता का नाम क्या था?",
    option: [
        "ठाकुर राजनाथ सिंह",
        "ठाकुर हिरनाय सिंह",
        "ठाकुर रामनाथ सिंह",
        "ठाकुर जगमोहन सिंह"
    ],
    answer: "ठाकुर रामनाथ सिंह"
},

{
    question: "विनोद कुमार शुक्ल का पहला कविता संग्रह कौन-सा है?",
    option: [
        "वह आदमी नया गरम कोट पहनकर चला गया विचार की तरह",
        "सबकुछ होना बचा रहेगा",
        "अतिरिक्त नहीं",
        "लगभग जयहिंद"
    ],
    answer: "लगभग जयहिंद"
},

{
    question: "‘कौन-सा मास्टर है वो, जो मेरे लड़के से झाड़ू लगवावे है?’—यह किसका कथन है?",
    option: [
        "लेखक की माँ का",
        "लेखक के चाचा का",
        "लेखक के पिताजी का",
        "लेखक की बड़ी भाभी का"
    ],
    answer: "लेखक के पिताजी का"
},

{
    question: "लेखक के अनुसार सच्ची शिक्षा हमें क्या देती है?",
    option: [
        "रोजगार",
        "प्रसिद्धि",
        "व्यापकता",
        "इनमें कोई नहीं"
    ],
    answer: "व्यापकता"
},

{
    question: "तुलसीदास के दोनों पदों में किस रस की व्यंजना हुई है?",
    option: [
        "वात्सल्य रस",
        "भक्ति रस",
        "रौद्र रस",
        "शृंगार रस"
    ],
    answer: "भक्ति रस"
},

{
    question: "प्रेमचंद के अनुसार नारी जब पुरुष के गुण सीखती है तब वह क्या हो जाती है?",
    option: [
        "आत्मविश्वासी",
        "साहसी",
        "कोमल",
        "राक्षसी"
    ],
    answer: "राक्षसी"
},

{
    question: "‘असल बातचीत सिर्फ दो व्यक्तियों में ही हो सकती है।’ यह किसका मत है?",
    option: [
        "एडीसन",
        "बेन जॉनसन",
        "मिल्टन",
        "स्पेंसर"
    ],
    answer: "एडीसन"
},

{
    question: "नामवर सिंह 1970 में किस विश्वविद्यालय में हिन्दी विभाग के अध्यक्ष पद पर प्रोफेसर के रूप में नियुक्त हुए?",
    option: [
        "बनारस हिन्दू विश्वविद्यालय",
        "इलाहाबाद विश्वविद्यालय",
        "दिल्ली विश्वविद्यालय",
        "जोधपुर विश्वविद्यालय"
    ],
    answer: "जोधपुर विश्वविद्यालय"
},

{
    question: "हरचरना किस कविता का पात्र है?",
    option: [
        "हार-जीत",
        "गाँव का घर",
        "अधिनायक",
        "उषा"
    ],
    answer: "अधिनायक"
},

{
    question: "‘रस्सी का टुकड़ा’ कहानी में किसका दामन साफ था?",
    option: [
        "मैत्र मलांदे",
        "मैत्र ब्रेतों",
        "होशेकम",
        "पुलिस"
    ],
    answer: "होशेकम"
},

{
    question: "चेख्यकोव की मौत के बाद किस प्रकार की स्थिति का वर्णन है?",
    option: [
        "मानसिक शांति",
        "शारीरिक आराम",
        "दुःख और असंतोष",
        "आत्मिक संतोष"
    ],
    answer: "दुःख और असंतोष"
},

{
    question: "‘पेशगी’ कहानी में कारमेन का बेटा किस कारण से बीमार था?",
    option: [
        "दवा की कमी",
        "भोजन की कमी",
        "शिक्षा की कमी",
        "चिकित्सा की कमी"
    ],
    answer: "दवा की कमी"
},

{
    question: "चेख्यकोव की पत्नी ने किस तरह की प्रतिक्रिया दी?",
    option: [
        "गुस्से में",
        "चिंता में",
        "उदासीनता से",
        "प्यार से"
    ],
    answer: "उदासीनता से"
},

{
    question: "'कविता के नए प्रतिमान' के लेखक हैं",
    option: [
        "लक्ष्मीकांत वर्मा",
        "सर्वेश्वरदयाल सक्सेना",
        "शिवदान सिंह चौहान",
        "नामवर सिंह"
    ],
    answer: "नामवर सिंह"
},

{
    question: "गौतम बुद्ध का आविर्भाव कब हुआ था?",
    option: [
        "दो हजार वर्ष पहले",
        "ढाई हजार वर्ष पहले",
        "तीन हजार वर्ष पहले",
        "पाँच सौ वर्ष पहले"
    ],
    answer: "ढाई हजार वर्ष पहले"
},

{
    question: "कौन-सा उपन्यास बालकृष्ण भट्ट द्वारा रचित है?",
    option: [
        "मैला आँचल",
        "गोदान",
        "सो अजान एक सुजान",
        "अंतराल"
    ],
    answer: "सो अजान एक सुजान"
},

{
    question: "‘पेशगी’ कहानी में सामाजिक विषमता किस रूप में प्रस्तुत की गई है?",
    option: [
        "सम्पन्नता और विपन्नता के बीच",
        "धर्म के बीच",
        "शिक्षा के बीच",
        "जाति के बीच"
    ],
    answer: "सम्पन्नता और विपन्नता के बीच"
},

{
    question: "पंडित राम औतार क्या थे?",
    option: [
        "ज्योतिषी",
        "वैद्य",
        "राजनेता",
        "ज्योतिषी और वैद्य"
    ],
    answer: "ज्योतिषी और वैद्य"
},

{
    question: "निम्नलिखित में से कौन-सी उपाधि माथुर जी को मिली?",
    option: [
        "विद्या प्रदक्षिणा",
        "विद्या वारिधि",
        "विद्या कामिनी",
        "इनमें से कोई नहीं"
    ],
    answer: "विद्या वारिधि"
},

{
    question: "उदय प्रकाश का जन्म हुआ था-",
    option: [
        "जनवरी 1952 को",
        "20 फरवरी 1948 को",
        "18 जून 1944 को",
        "12 जुलाई 1944 को"
    ],
    answer: "जनवरी 1952 को"
},

{
    question: "‘सलाम’ कहानी-संग्रह के कहानीकार हैं",
    option: [
        "जयशंकर प्रसाद",
        "ओमप्रकाश वाल्मीकि",
        "कृष्णा सोबती",
        "कमलेश्वर"
    ],
    answer: "ओमप्रकाश वाल्मीकि"
},

{
    question: "'सुकून की तलाश' किसकी रचना है?",
    option: [
        "दुष्यंत कुमार की",
        "गालिब की",
        "इकबाल की",
        "शमशेर बहादुर सिंह की"
    ],
    answer: "इकबाल की"
},

{
    question: "कौन-सी रचना जयशंकर प्रसाद की है?",
    option: [
        "पश्चात",
        "ज्ञानोदय मंगल",
        "कंकाल",
        "शिवराज भूषण"
    ],
    answer: "कंकाल"
},

{
    question: "कारमेन के बेटे को दवा क्यों नहीं दी जा सकी?",
    option: [
        "पैसे के अभाव में",
        "दवा उपलब्ध न होने के कारण",
        "डॉक्टर की अनुपस्थिति में",
        "परिवार की अनदेखी के कारण"
    ],
    answer: "पैसे के अभाव में"
},

{
    question: "सूरदास की रचनाओं की भाषा क्या है?",
    option: [
        "अवधी",
        "ब्रजभाषा",
        "खड़ीबोली",
        "मैथिली"
    ],
    answer: "ब्रजभाषा"
},

{
    question: "‘लिरिक’ का पर्याय है",
    option: [
        "प्रगीत",
        "कथा",
        "जीवनी",
        "कल्पना"
    ],
    answer: "प्रगीत"
},

{
    question: "दूध-डूबे अँगूठे के छापे किनके हैं?",
    option: [
        "दादी के",
        "माँ के",
        "बूढ़े ग्वाल दादा के",
        "इनमें किसी के नहीं"
    ],
    answer: "बूढ़े ग्वाल दादा के"
},

{
    question: "हरचरना कौन है?",
    option: [
        "घर का नौकर",
        "एक आम आदमी",
        "एक चरवाहा",
        "इनमें से कोई नहीं"
    ],
    answer: "घर का नौकर"
},

{
    question: "‘पद्मावत’ किसकी रचना है?",
    option: [
        "मुल्ला दाऊद की",
        "कुतुबन की",
        "जायसी की",
        "मंझन की"
    ],
    answer: "जायसी की"
},

{
    question: "‘अर्द्धनारीश्वर’ पाठ के लेखक कौन हैं? या, ‘अर्द्धनारीश्वर’ किसकी रचना है?",
    option: [
        "नामवर सिंह",
        "रामधारी सिंह ‘दिनकर’",
        "हजारी प्रसाद द्विवेदी",
        "रामचन्द्र शुक्ल"
    ],
    answer: "रामधारी सिंह ‘दिनकर’"
},

{
    question: "'तुलसीदास' के रचयिता कौन हैं ?",
    option: [
        "तुलसीदास",
        "मैथिलीशरण गुप्त",
        "सुमित्रानंदन पंत",
        "सूर्यकांत त्रिपाठी 'निराला'"
    ],
    answer: "सूर्यकांत त्रिपाठी 'निराला'"
},

{
    question: "‘सलाम’ कहानी-संग्रह के कहानीकार हैं",
    option: [
        "जयशंकर प्रसाद",
        "ओमप्रकाश वाल्मीकि",
        "कृष्णा सोबती",
        "कमलेश्वर"
    ],
    answer: "ओमप्रकाश वाल्मीकि"
},

{
    question: "जायसी के पिता का नाम क्या था?",
    option: [
        "शेख मुहम्मद",
        "शेख यमरूख",
        "शेख परवेज",
        "इनमें से कोई नहीं"
    ],
    answer: "शेख यमरूख"
},

{
    question: "‘तिरिछ’ के लेखक हैं",
    option: [
        "मलयज",
        "मोहन राकेश",
        "उदय प्रकाश",
        "भगत सिंह"
    ],
    answer: "उदय प्रकाश"
},

{
    question: "कौन-सी कृति रघुवीर सहाय की है?",
    option: [
        "अतीरिक्त नहीं",
        "मुद्देवार",
        "जहाज का पंछी",
        "सीढ़ियों"
    ],
    answer: "सीढ़ियों"
},

{
    question: "‘क्लर्क की मौत’ कहानी का मुख्य पात्र कौन है?",
    option: [
        "इवान दमित्रिच चेख्यकोव",
        "जनरल ब्रिजालोव",
        "अंतोन चेखव",
        "क्लर्क"
    ],
    answer: "इवान दमित्रिच चेख्यकोव"
},

{
    question: "नामवर सिंह द्वारा लिखित ‘प्रगीत और समाज’ क्या है ?",
    option: [
        "आलोचना",
        "निबंध",
        "एकांकी",
        "आत्मकथा"
    ],
    answer: "निबंध"
},

{
    question: "इनमें ‘अज्ञेय’ का नाटक कौन है ?",
    option: [
        "कर्बला",
        "बकरी",
        "उत्तर प्रियदर्शी",
        "सिपाही की माँ"
    ],
    answer: "उत्तर प्रियदर्शी"
},

{
    question: "‘तिरिछ’ के लेखक हैं",
    option: [
        "मलयज",
        "मोहन राकेश",
        "उदय प्रकाश",
        "भगत सिंह"
    ],
    answer: "उदय प्रकाश"
},

{
    question: "मुन्‍नी किस दिन मानक की चिट्ठी के आने की भविष्यवाणी करती है?",
    option: [
        "बुधवार को",
        "बृहस्पतिवार को",
        "सोमवार को",
        "मंगलवार को"
    ],
    answer: "मंगलवार को"
},

{
    question: "‘रेख्स’ क्या होता है?",
    option: [
        "रेशमी चादर",
        "ऊनी चादर",
        "मोटे सूत की बुनी चादर",
        "कंबल"
    ],
    answer: "मोटे सूत की बुनी चादर"
},

{
    question: "विनोद कुमार शुक्ल की रचना ‘महाविद्यालय’ साहित्य की किस विद्या का संग्रह है?",
    option: [
        "नाटक संग्रह",
        "कहानी संग्रह",
        "कविता संग्रह",
        "इनमें से कोई नहीं"
    ],
    answer: "कहानी संग्रह"
},

{
    question: "बालकृष्ण भट्ट की रचना बातचीत क्या है?",
    option: [
        "एकांकी",
        "कहानी",
        "यात्रा संस्मरण",
        "ललित निबंध"
    ],
    answer: "ललित निबंध"
},

{
    question: "लेखक को किसने तीन-तीन से तीन नोट दिए?",
    option: [
        "राम औतार ने",
        "डॉक्टर पंत ने",
        "कैशियर अग्निहोत्री ने",
        "सरदार सतनाम सिंह ने"
    ],
    answer: "डॉक्टर पंत ने"
},

{
    question: "प्रजा सोशलिस्ट पार्टी का गठन कब हुआ ?",
    option: [
        "1952 में",
        "1949 में",
        "1947 में",
        "1962 में"
    ],
    answer: "1952 में"
},

{
    question: "जयप्रकाश नारायण रचित पाठ का नाम क्या है ?",
    option: [
        "उसने कहा था",
        "जूठन",
        "सम्पूर्ण क्रांति",
        "शिक्षा"
    ],
    answer: "सम्पूर्ण क्रांति"
},

{
    question: "प्रस्तुत कविता 'अधिनायक' में रचना किसका प्रतिनिधि है?",
    option: [
        "आम आदमी",
        "सत्ताधारी दल का",
        "विपक्षी दल का",
        "इनमें से कोई नहीं"
    ],
    answer: "आम आदमी"
},

{
    question: "‘जूठन’ क्या है?",
    option: [
        "कहानी",
        "उपन्यास",
        "रिपोर्ताज",
        "आत्मकथा"
    ],
    answer: "आत्मकथा"
},

{
    question: "पंडित रामऔतार क्या थे?",
    option: [
        "ज्योतिषी",
        "वैद्य",
        "राजनेता",
        "ज्योतिषी और वैद्य"
    ],
    answer: "ज्योतिषी और वैद्य"
},

{
    question: "चेख्यकोव ने अपने घर जाकर क्या किया?",
    option: [
        "खाना खाया",
        "सोफे पर लेट गया",
        "घर की सफाई की",
        "बाहर गया"
    ],
    answer: "सोफे पर लेट गया"
},

{
    question: "‘कँवल कुसुम फूले’, ‘नर नारी’, ‘सूर-स्याम’ में कौन सा अलंकार",
    option: [
        "उपमा",
        "अनुप्रास",
        "रूपक",
        "यमक"
    ],
    answer: "अनुप्रास"
},

{
    question: "जनरल ब्रिजालोव ने चेख्यकोव की माफी को कैसे लिया?",
    option: [
        "नाराजगी के साथ",
        "indiferently",
        "ध्यान नहीं दिया",
        "गुस्से में"
    ],
    answer: "ध्यान नहीं दिया"
},

{
    question: "चेख्यकोव ने जनरल के साथ अपनी बातचीत को कैसे देखा?",
    option: [
        "सकारात्मक",
        "निराशाजनक",
        "संजीवनी",
        "चिंताजनक"
    ],
    answer: "निराशाजनक"
},

{
    question: "निम्नलिखित में कौन ‘प्रत्यय की छाया’ के कवि हैं ?",
    option: [
        "निराला",
        "पंत",
        "जयशंकर प्रसाद",
        "रामकुमार वर्मा"
    ],
    answer: "जयशंकर प्रसाद"
},

{
    question: "माँ की मृत्यु के समय जे. कृष्णमूर्ति कितने वर्ष के थे?",
    option: [
        "10 वर्ष",
        "12 वर्ष",
        "15 वर्ष",
        "20 वर्ष"
    ],
    answer: "10 वर्ष"
},

{
    question: "द्वितीय पद में किस खाद्य पदार्थ का उल्लेख नहीं हुआ है?",
    option: [
        "दही",
        "माखन",
        "मिसरी",
        "अमूप"
    ],
    answer: "अमूप"
},

{
    question: "मानक किस युद्ध में सिपाही के रूप में लड़ने गया है?",
    option: [
        "प्रथम विश्व युद्ध",
        "द्वितीय विश्व युद्ध",
        "कारगिल का युद्ध",
        "इनमें से कोई नहीं"
    ],
    answer: "द्वितीय विश्व युद्ध"
},

{
    question: "कौन-सी रचना बालकृष्ण भट्ट की नहीं है?",
    option: [
        "मृत्यु ब्रह्मचारी",
        "सो अजान एक सुजान",
        "सदाव का अभाव",
        "परीक्षा गुरु"
    ],
    answer: "परीक्षा गुरु"
},

{
    question: "जयप्रकाश नारायण की पत्नी का नाम था-",
    option: [
        "लीलावती देवी",
        "अमरावती प्रभा",
        "प्रभावती देवी",
        "प्रभा सिन्हा"
    ],
    answer: "प्रभावती देवी"
},

{
    question: "‘भाभी जी, आप के हाथ का खाना तो बहुत जायकेदार है।’ यह किसने कहा?",
    option: [
        "सुरेन्द्र सिंह",
        "सुखदेव सिंह",
        "जसवीर",
        "इनमें से कोई नहीं"
    ],
    answer: "सुरेन्द्र सिंह"
},

{
    question: "ज्ञानेंद्रपति के अनुसार, पंचायती राज में क्या खेत गया है?",
    option: [
        "मुखिया",
        "सरपंच",
        "पंच परमेश्वर",
        "इनमें से कोई नहीं"
    ],
    answer: "पंच परमेश्वर"
},

{
    question: "लेखक के पिताजी को बचपन में किस रोग की शिकायत थी?",
    option: [
        "पीलिया",
        "एपॉन्डिसाइटिस",
        "एनीमिया",
        "ध्वज रोग"
    ],
    answer: "एपॉन्डिसाइटिस"
},

{
    question: "'तुमुल कोलाहल कलह में' शीर्षक कविता के रचयिता कौन हैं?",
    option: [
        "सूर्यकांत त्रिपाठी 'निराला'",
        "जयशंकर प्रसाद",
        "महादेवी वर्मा",
        "पंत"
    ],
    answer: "जयशंकर प्रसाद"
},

{
    question: "प्रसादजी के पिता का नाम था",
    option: [
        "रविन्द्र प्रसाद साहू",
        "देवी प्रसाद साहू",
        "कालिका प्रसाद साहू",
        "चंडीका प्रसाद साहू"
    ],
    answer: "देवी प्रसाद साहू"
},

{
    question: "'कामायनी' के रचयिता कौन हैं ?",
    option: [
        "जयशंकर प्रसाद",
        "सुमित्रानंदन पंत",
        "महादेवी वर्मा",
        "सूर्यकांत त्रिपाठी 'निराला'"
    ],
    answer: "जयशंकर प्रसाद"
},

{
    question: "कौन-सी कृति विनोद कुमार शुक्ल की नहीं है?",
    option: [
        "महाविद्यालय",
        "पेड़ पर कमरा",
        "दीवार में एक खिड़की रहती थी",
        "इन्द्रजाल"
    ],
    answer: "इन्द्रजाल"
},

{
    question: "प्रसादजी की कौन-सी कृति अपूर्ण है?",
    option: [
        "तितली",
        "लहर",
        "इरावती",
        "ध्रुवस्वामिनी"
    ],
    answer: "इरावती"
},

{
    question: "बालकृष्ण भट्ट ने ‘हिन्दी प्रदीप’ नामक मासिक पत्रिका निकालना कब प्रारम्भ किया?",
    option: [
        "1877",
        "1888",
        "1890",
        "1894"
    ],
    answer: "1877"
},

{
    question: "‘हँसते हुए मेरा अकेलापन’ किसकी रचना है?",
    option: [
        "जे. कृष्णमूर्ति की",
        "उदय प्रकाश की",
        "मलयज की",
        "नामवर सिंह की"
    ],
    answer: "मलयज की"
},

{
    question: "अज्ञेय द्वारा सम्पादित 'दूसरा सप्तक' में एक कवि के रूप सामने आए थे? इनमें कौन",
    option: [
        "अशोक वाजपेयी",
        "मुक्तिबोध",
        "रघुवीर सहाय",
        "ज्ञानेंद्रपति"
    ],
    answer: "रघुवीर सहाय"
},

{
    question: "सुरेन्द्र सिंह किसका पोता था?",
    option: [
        "सुखदेव सिंह त्यागी",
        "रामदेव त्यागी",
        "गणपति त्यागी",
        "हरेराम त्यागी"
    ],
    answer: "सुखदेव सिंह त्यागी"
},

{
    question: "‘मैं तुम लोगों से दूर हूँ’ किसकी कविता है?",
    option: [
        "मुक्तिबोध",
        "हजारी प्रसाद द्विवेदी",
        "पंत",
        "अज्ञेय"
    ],
    answer: "मुक्तिबोध"
},

{
    question: "भारतीय ज्ञानपीठ द्वारा अज्ञेय जी को कौन-सा पुरस्कार मिला था ?",
    option: [
        "पदमश्री",
        "पदमविभूषण",
        "भारतीय ज्ञानपीठ पुरस्कार",
        "इनमें से कोई नहीं"
    ],
    answer: "भारतीय ज्ञानपीठ पुरस्कार"
},

{
    question: "निम्नलिखित में कौन ‘प्रत्यय की छाया’ के कवि हैं?",
    option: [
        "निराला",
        "पंत",
        "जयशंकर प्रसाद",
        "रामकुमार वर्मा"
    ],
    answer: "जयशंकर प्रसाद"
},

{
    question: "जनरल ब्रिजालोव ने चेख्यकोव से कैसे व्यवहार किया?",
    option: [
        "प्यार से",
        "उदासीनता से",
        "गुस्से में",
        "असंवेदनशीलता से"
    ],
    answer: "उदासीनता से"
},

{
    question: "निम्नलिखित में से कौन-सा कवि अष्टछाप का नहीं है?",
    option: [
        "सूरदास",
        "कृष्णदास",
        "जायसी",
        "कुंभनदास"
    ],
    answer: "जायसी"
},

{
    question: "‘तुमुल कोलाहल कलह में’ शीर्षक कविता के रचयिता कौन हैं?",
    option: [
        "सूर्यकांत त्रिपाठी ‘निराला’",
        "जयशंकर प्रसाद",
        "महादेवी वर्मा",
        "पंत"
    ],
    answer: "जयशंकर प्रसाद"
},

{
    question: "किसने कहा था – अभी ना जाने कितने मिलो इस देश की जनता को जाना है ?",
    option: [
        "महात्मा गांधी",
        "डॉ राजेंद्र प्रसाद",
        "जवाहरलाल नेहरू",
        "लाल बहादुर शास्त्री"
    ],
    answer: "जवाहरलाल नेहरू"
},

{
    question: "चेख्यकोव को छींक आने पर किस व्यक्ति ने असुविधा अनुभव की?",
    option: [
        "जनरल ब्रिजालोव",
        "क्लर्क",
        "पत्नी",
        "मित्र"
    ],
    answer: "जनरल ब्रिजालोव"
},

{
    question: "कौन-सी रचना मलयज की है?",
    option: [
        "रसात्मक यात्रा",
        "हूँकर",
        "जख्म पर फूल",
        "सदियों का संताप"
    ],
    answer: "जख्म पर फूल"
},

{
    question: "‘कंकाल’ क्या है?",
    option: [
        "महाकाव्य",
        "कहानी",
        "उपन्यास",
        "प्रबंधकाव्य"
    ],
    answer: "उपन्यास"
},

{
    question: "सूरदास की कृति है",
    option: [
        "प्रणभंग",
        "‘जयद्रथ वध’",
        "साहित्यलहरी",
        "बरवै रामायण"
    ],
    answer: "साहित्यलहरी"
},

{
    question: "उदय प्रकाश की कहानी कौन सी है?",
    option: [
        "जीवन",
        "तिरिछ",
        "रोज",
        "घुसपैठिए"
    ],
    answer: "तिरिछ"
},

{
    question: "सूरदास के संकलित पदों में कौन रस है?",
    option: [
        "श्रृंगार रस",
        "वात्सल्य रस",
        "हास्य रस",
        "रौद्र रस"
    ],
    answer: "वात्सल्य रस"
},

{
    question: "कोणार्क के नाटककार कौन हैं?",
    option: [
        "जयशंकर प्रसाद",
        "जगदीशचन्द्र माथुर",
        "हेतुकेश्वर प्रेमी",
        "मैथिलीशरण गुप्त"
    ],
    answer: "जगदीशचन्द्र माथुर"
},

{
    question: "कहानीकार तिरिछ की लाश को जलाने जंगल में किसके साथ गया था?",
    option: [
        "शानू",
        "भानू",
        "धनू",
        "कृष्ण"
    ],
    answer: "धनू"
},

{
    question: "चेख्यकोव ने अपनी मौत के बाद किस स्थिति का सामना किया?",
    option: [
        "शांति",
        "दुःख",
        "तटस्थता",
        "यंत्रचालितता"
    ],
    answer: "यंत्रचालितता"
},

{
    question: "लेखक के पिताजी ट्रैक्टर से कहाँ उतरें थे?",
    option: [
        "स्टेट बैंक के पास",
        "मिनर्वा टॉकीज के पास",
        "थाने के पास",
        "ढाबे के पास"
    ],
    answer: "मिनर्वा टॉकीज के पास"
},

{
    question: "‘दिनकर’ किस युग के कवि हैं?",
    option: [
        "भारतेन्दु युग",
        "छायावाद युग",
        "छायावादोत्तर युग",
        "नाट्यकाव्यांदोलन"
    ],
    answer: "छायावादोत्तर युग"
},

{
    question: "मलयज का मूल नाम क्या था?",
    option: [
        "सच्चिदानंद श्रीवास्तव",
        "रामजी श्रीवास्तव",
        "अमिताभ श्रीवास्तव",
        "भरतजी श्रीवास्तव"
    ],
    answer: "भरतजी श्रीवास्तव"
},

{
    question: "‘पिताजी’ की मृत्यु कैसे होती है?",
    option: [
        "तिरिछ के काटने से",
        "धतूरे के जहर से",
        "दुर्घटना से",
        "मानसिक सदमे और अधिक रक्तस्राव से"
    ],
    answer: "मानसिक सदमे और अधिक रक्तस्राव से"
},

{
    question: "‘कंकाल’ क्या है?",
    option: [
        "महाकाव्य",
        "कहानी",
        "उपन्यास",
        "प्रबंधकाव्य"
    ],
    answer: "उपन्यास"
},

{
    question: "लेखक को सपने में क्या करने की आदत थी?",
    option: [
        "चलने की",
        "रोने की",
        "हँसने की",
        "बोलने और चीखने की"
    ],
    answer: "बोलने और चीखने की"
},

{
    question: "लेखक को सपने में क्या करने की आदत थी?",
    option: [
        "चलने की",
        "रोने की",
        "हँसने की",
        "बोलने और चीखने की"
    ],
    answer: "बोलने और चीखने की"
},

{
    question: "‘पेशगी’ कहानी में बच्ची को किस तरह से सुलाया जाता था?",
    option: [
        "लोरी गाकर",
        "कहानियाँ सुनाकर",
        "खेल खिलाकर",
        "सोने के लिए कहकर"
    ],
    answer: "लोरी गाकर"
},

{
    question: "‘तिरिछ’ कहानी की केंद्रीय घटना का संबंध किससे है?",
    option: [
        "कहानीकार से",
        "कहानीकार की माँ से",
        "कहानीकार के पिता से",
        "कहानीकार के मित्र से"
    ],
    answer: "कहानीकार के पिता से"
},

{
    question: "आमापाली (अम्रपाली) ने तथागत को क्या सौंपा था?",
    option: [
        "कपिलवन",
        "आम्रवन",
        "दस हजार स्वर्णमुद्राएँ",
        "अपना भवन"
    ],
    answer: "आम्रवन"
},

{
    question: "मोहन राकेश के बचपन का क्या था?",
    option: [
        "मदन मोहन मुगलानी",
        "कृष्णमोहन मुगलानी",
        "राधाकृष्ण मुगलानी",
        "रामकृष्ण मुगलानी"
    ],
    answer: "मदन मोहन मुगलानी"
},

{
    question: "'सुकून की तलाश' क्या है?",
    option: [
        "उपन्यास",
        "कहानी",
        "गजले",
        "इनमें से कोई नहीं"
    ],
    answer: "गजले"
},

{
    question: "'डरा हुआ मन बेचैन जिसका, बाजा रोज बजाता है।' यह पंक्ति किस शीर्षक कविता की है?",
    option: [
        "छप्पय",
        "अधिनायक",
        "हार-जीत",
        "गाँव का घर"
    ],
    answer: "अधिनायक"
},

{
    question: "'अधिनायक' शीर्षक कविता किस पुस्तक से ली गयी है?",
    option: [
        "लोग भूल गए",
        "आत्महत्या के विरुद्ध",
        "हँसो हँसो जल्दी हँसो",
        "मुक्तिबोध रचनावली हैं"
    ],
    answer: "आत्महत्या के विरुद्ध"
},

{
    question: "‘आँख हाथ बनते हुए’ कविता किस कवि की रचना है?",
    option: [
        "ज्ञानेंद्रपति",
        "मुक्तिबोध",
        "रघुवीर सहाय",
        "अशोक वाजपेयी"
    ],
    answer: "ज्ञानेंद्रपति"
},

{
    question: "‘रोज’ कहानी में अतिथि बनकर आता है ?",
    option: [
        "मालती का चाचा",
        "मालती का मामा",
        "मालती के दूर के रिश्ते का भाई",
        "मालती का पिता"
    ],
    answer: "मालती के दूर के रिश्ते का भाई"
},

{
    question: "जयशंकर प्रसाद हिन्दी साहित्य के किस काल के कवि थे?",
    option: [
        "रीतिकाल",
        "आदिकाल",
        "आधुनिक काल",
        "भक्तिकाल"
    ],
    answer: "आधुनिक काल"
},

{
    question: "‘राम की शक्तिपूजा’ किसकी कविता है?",
    option: [
        "पंत",
        "दिनकर",
        "महादेवी वर्मा",
        "निराला"
    ],
    answer: "निराला"
},

{
    question: "कौन-सी कृति रामधारी सिंह ‘दिनकर’ की नहीं है?",
    option: [
        "‘उर्वशी’",
        "‘नीलकुसुम’",
        "‘परशुराम की प्रतीक्षा’",
        "‘प्रियप्रवास’"
    ],
    answer: "‘प्रियप्रवास’"
},

{
    question: "‘मानस’ (‘रामचरितमानस’) का रचना समय क्या है?",
    option: [
        "संवत 1631",
        "संवत 1622",
        "संवत 1480",
        "संवत 1632"
    ],
    answer: "संवत 1631"
},

{
    question: "‘कड़बक’ कहाँ से लिया गया है?",
    option: [
        "आखिरी कलाम",
        "अखरावट",
        "मधुमालती",
        "पद्मावत"
    ],
    answer: "पद्मावत"
},

{
    question: "होशेकम को किस चीज़ ने सबसे ज्यादा आहत किया?",
    option: [
        "आरोप",
        "सच्चाई",
        "मित्रता",
        "धन"
    ],
    answer: "आरोप"
},

{
    question: "‘सिपाही की माँ’ शीर्षक पाठ में, हड्डियों का चलता-फिरता ढाँचा कौन है?",
    option: [
        "पलटू राम",
        "दीनू कुम्हार",
        "सियाराम मोची",
        "पंडित दीनानाथ"
    ],
    answer: "दीनू कुम्हार"
},

{
    question: "जयप्रकाश नारायण ने किस साल छात्र आंदोलन का नेतृत्व किया था ?",
    option: [
        "1973 ई. में",
        "1976 ई. में",
        "1974 ई. में",
        "1977 ई. में"
    ],
    answer: "1974 ई. में"
},

{
    question: "जयशंकर प्रसाद कितनी वर्ष की अवस्था में पितृहीन हुए थे?",
    option: [
        "8 वर्ष",
        "12 वर्ष",
        "16 वर्ष",
        "20 वर्ष"
    ],
    answer: "12 वर्ष"
},

{
    question: "‘हनुमानबाहुक’ को तुलसीदास की किस कृति का एक अंग माना जाता है?",
    option: [
        "जानकीमंगल",
        "कवितावली",
        "गीतावली",
        "श्रीकृष्ण गीतावली"
    ],
    answer: "कवितावली"
},

{
    question: "‘कनियाँ’ का क्या अर्थ होता है?",
    option: [
        "स्त्री",
        "वधू",
        "पत्नी",
        "गौद"
    ],
    answer: "गौद"
},

{
    question: "पिता बिटिया को क्या करता है?",
    option: [
        "घुमाता है",
        "खिलाता है",
        "सिखलाता है",
        "मारता है"
    ],
    answer: "सिखलाता है"
},

{
    question: "‘अर्द्धनारीश्वर’ (अर्द्धनारीश्वर) शीर्षक निबंध के निबंधकार कौन हैं?",
    option: [
        "रामचंद्र शुक्ल",
        "हजारी प्रसाद द्विवेदी",
        "रामधारी सिंह ‘दिनकर’",
        "जगदीशचन्द्र माथुर"
    ],
    answer: "रामधारी सिंह ‘दिनकर’"
},

{
    question: "‘दलित साहित्य का सौंदर्यशास्त्र’ के लेखक हैं",
    option: [
        "मुक्तिबोध",
        "डॉ. नामवर सिंह",
        "ओमप्रकाश वाल्मीकि",
        "डॉ. नगेन्द्र"
    ],
    answer: "ओमप्रकाश वाल्मीकि"
},

{
    question: "‘पुरानी हिन्दी’ रचना है",
    option: [
        "रामचंद्र शुक्ल की",
        "हजारी प्रसाद द्विवेदी की",
        "नामवर सिंह की",
        "चंद्रधर शर्मा ‘गुलेरी’ की"
    ],
    answer: "चंद्रधर शर्मा ‘गुलेरी’ की"
},

{
    question: "‘पेशगी’ कहानी में मालकिन किस वर्ग का प्रतिनिधित्व करती है?",
    option: [
        "सम्पन्न",
        "विपन्न",
        "गरीब",
        "मध्यम वर्ग"
    ],
    answer: "सम्पन्न"
},

{
    question: "दूसरे पद में तुलसी ने अपना परिचय किस रूप में दिया है?",
    option: [
        "निर्बल के रूप में",
        "दाता के रूप में",
        "भिखारी के रूप में",
        "इनमें से कोई नहीं"
    ],
    answer: "भिखारी के रूप में"
},

{
    question: "चेख्यकोव का आंतरिक भावनात्मक स्थिति कैसी थी?",
    option: [
        "खुश",
        "उदास",
        "संतुष्ट",
        "यंत्रचालित"
    ],
    answer: "यंत्रचालित"
},

{
    question: "सूर के कवित्त को सुनकर सभी क्या करते हैं?",
    option: [
        "सिर हिलाते हैं",
        "भाव विभोर होते हैं",
        "दुःखी हो जाते हैं",
        "इनमें से कोई नहीं"
    ],
    answer: "सिर हिलाते हैं"
},

{
    question: "चेख्यकोव ने जनरल के बारे में क्या सोचा?",
    option: [
        "उदासीन",
        "नकारात्मक",
        "सकारात्मक",
        "चिंतित"
    ],
    answer: "नकारात्मक"
},

{
    question: "नामवर सिंह के गुरु कौन थे?",
    option: [
        "रामचन्द्र शुक्ल",
        "हजारी प्रसाद द्विवेदी",
        "महावीर प्रसाद द्विवेदी",
        "इनमें से कोई नहीं"
    ],
    answer: "हजारी प्रसाद द्विवेदी"
},

{
    question: "‘प्यारे नन्हें बेटे को’ कविता का नायक कहाँ का रहने वाला है?",
    option: [
        "छत्तीसगढ़",
        "उत्तराखण्ड",
        "मध्यप्रदेश",
        "हिमाचल प्रदेश"
    ],
    answer: "उत्तराखण्ड"
},

{
    question: "तुलसीदास के पठित पद किस भाषा में है?",
    option: [
        "मैथिली",
        "बज्रभाषा",
        "खड़ी-बोली",
        "अवधी"
    ],
    answer: "अवधी"
},

{
    question: "कौन-सी रचना ज्ञानेंद्रपति की है?",
    option: [
        "सबकुछ बचा रहेगा",
        "मुकुल",
        "गंगातट",
        "आँसू"
    ],
    answer: "गंगातट"
},

{
    question: "क्राइस्टचर्च गल्र्स स्कूल में सुभद्रा कुमारी चौहान की प्रिय मित्र कौन थी?",
    option: [
        "महादेवी वर्मा",
        "मन्नू भंडारी",
        "ममता कालिया",
        "इनमें से कोई नहीं"
    ],
    answer: "महादेवी वर्मा"
},

{
    question: "शमशेर बहादुर सिंह का जन्म कहाँ हुआ था?",
    option: [
        "देहरादून में",
        "पटना में",
        "लखनऊ में",
        "दिल्ली में"
    ],
    answer: "देहरादून में"
},

{
    question: "नाभादास का उदय हिन्दी साहित्य के किस काल में हुआ?",
    option: [
        "आधुनिक काल",
        "आदिकाल",
        "भक्तिकाल",
        "रीतिकाल"
    ],
    answer: "भक्तिकाल"
},

{
    question: "लेखक को विद्यालय में झाड़ू लगाते हुए किसने देख लिया?",
    option: [
        "भाई ने",
        "पिताजी ने",
        "माँ ने",
        "भाभी ने"
    ],
    answer: "पिताजी ने"
},

{
    question: "हेनरी लोपेज का लेखन किसकी रचनात्मक साक्ष्यता प्रदान करता है?",
    option: [
        "अफ्रीका की पीड़ा",
        "पश्चिमी संस्कृति",
        "भारतीय समाज",
        "आधुनिक विज्ञान"
    ],
    answer: "अफ्रीका की पीड़ा"
},

{
    question: "दूसरा सप्तक का प्रकाशन वर्ष है",
    option: [
        "1950 ई०",
        "1957 ई०",
        "1952 ई०",
        "1954 ई०"
    ],
    answer: "1957 ई०"
},

{
    question: "तिरिछ को कैसी कहानी माना जाता है?",
    option: [
        "आदर्शवादी कहानी",
        "आदर्शोन्मुख कहानी",
        "‘जादुई यथार्थ’ की कहानी",
        "द्विआत्मक कहानी"
    ],
    answer: "‘जादुई यथार्थ’ की कहानी"
},

{
    question: "‘दिनकर’ का जन्म कब हुआ था?",
    option: [
        "23 सितम्बर, 1908 को",
        "22 दिसम्बर, 1912 को",
        "28 सितम्बर, 1911 को",
        "25 सितम्बर, 1913 को"
    ],
    answer: "23 सितम्बर, 1908 को"
},

{
    question: "मानक की माँ का नाम क्या है?",
    option: [
        "कुंती",
        "मुन्‍नी",
        "बिरहनी",
        "इनमें से कोई नहीं"
    ],
    answer: "बिरहनी"
},

{
    question: "सुभद्रा कुमारी चौहान का जन्म कब हुआ?",
    option: [
        "16 अगस्त, 1904 को",
        "20 जुलाई, 1920 को",
        "18 मई, 1930 को",
        "12 अगस्त, 1905 को"
    ],
    answer: "16 अगस्त, 1904 को"
},

{
    question: "‘तिरिछ’ कैसी कहानी है?",
    option: [
        "मिथकीय",
        "मनोज्ञानिक",
        "सांस्कृतिक",
        "प्रतीकात्मक"
    ],
    answer: "प्रतीकात्मक"
},

{
    question: "कौन-सी रचना बालकृष्ण भट्ट की है?",
    option: [
        "रेल का विकट खेल",
        "कुरुक्षेत्र",
        "रेणुका",
        "प्राच्यविद्या"
    ],
    answer: "रेल का विकट खेल"
},

{
    question: "चेख्यकोव की मौत के बाद उसकी स्थिति कैसी थी?",
    option: [
        "आरामदायक",
        "दर्दनाक",
        "अज्ञात",
        "राहत भरी"
    ],
    answer: "दर्दनाक"
},

{
    question: "'दुनिया को हाथ की तरह गर्म और सुन्दर होना चाहिए।' यह किस कवि की कविता का अंश है?",
    option: [
        "केदारनाथ सिंह",
        "जयशंकर प्रसाद",
        "सुभद्रा कुमारी चौहान",
        "शमशेर बहादुर सिंह"
    ],
    answer: "केदारनाथ सिंह"
},

{
    question: "'दूसरी परंपरा की खोज' किसकी रचना है?",
    option: [
        "दिनकर जी",
        "नामवर सिंह",
        "उदय प्रकाश",
        "बालकृष्ण भट्ट"
    ],
    answer: "नामवर सिंह"
},

{
    question: "किसकी कविता को सुनकर कवि नाभादास सिर हिला लेते हैं?",
    option: [
        "सूरदास की",
        "कबीरदास की",
        "तुलसीदास की",
        "इनमें से कोई नहीं"
    ],
    answer: "सूरदास की"
},

{
    question: "‘सूरसागर’ किस भाषा में रचित है?",
    option: [
        "भोजपुरी में",
        "संस्कृत में",
        "ब्रजभाषा में",
        "अवधी में"
    ],
    answer: "ब्रजभाषा में"
},

{
    question: "‘मेघदूत’ नामक नाट्यशाला कहाँ स्थापित हुई?",
    option: [
        "उत्तर प्रदेश में",
        "बिहार में",
        "हरियाणा में",
        "महाराष्ट्र में"
    ],
    answer: "महाराष्ट्र में"
},

{
    question: "'कामायनी' के कवि हैं",
    option: [
        "पंत",
        "प्रसाद",
        "महादेवी वर्मा",
        "निराला"
    ],
    answer: "प्रसाद"
},

{
    question: "सुभद्रा कुमारी चौहान का जन्म कहाँ हुआ था?",
    option: [
        "वाराणसी",
        "कानपुर",
        "इलाहाबाद",
        "फैजाबाद"
    ],
    answer: "इलाहाबाद"
},

{
    question: "प्रसादजी की कौन-सी कृति अपूर्ण है?",
    option: [
        "तितली",
        "लहर",
        "इरावती",
        "ध्रुवस्वामिनी"
    ],
    answer: "इरावती"
},

{
    question: "‘अरेखा-परेखा’ उदय प्रकाश की कैसी कृति है?",
    option: [
        "उपन्यास",
        "कहानी-संग्रह",
        "कविता-संग्रह",
        "इनमें से कोई नहीं"
    ],
    answer: "कहानी-संग्रह"
},

{
    question: "‘हर आदमी उस संसार को रचता है जिसमें वह जीता है और भोगता है।’ यह कथन किसका है?",
    option: [
        "जयशंकर प्रसाद का",
        "‘अज्ञेय’ का",
        "मलयज का",
        "प्रेमचंद का"
    ],
    answer: "मलयज का"
},

{
    question: "जायसी का जन्म किस प्रदेश में हुआ था?",
    option: [
        "उत्तर प्रदेश",
        "मध्य प्रदेश",
        "आन्ध्र प्रदेश",
        "इनमें से कोई नहीं"
    ],
    answer: "उत्तर प्रदेश"
},

{
    question: "शमशेर बहादुर सिंह का जन्म कब हुआ था?",
    option: [
        "13 जनवरी, 1911 को",
        "23 फरवरी, 1911 को",
        "13 मार्च, 1911 को",
        "22 अप्रैल, 1911 को"
    ],
    answer: "13 जनवरी, 1911 को"
},

{
    question: "चेख्यकोव ने ब्रिजालोव से क्या कहा?",
    option: [
        "“मैं क्षमाप्रार्थी हूँ।”",
        "“मुझे माफ कर दें।”",
        "“मैं जान-बूझकर नहीं छींका।”",
        "“क्या आप मुझे क्षमा करेंगे?”"
    ],
    answer: "“मैं जान-बूझकर नहीं छींका।”"
},

{
    question: "कहानीकार तिरिछ की लाश को जलाने जंगल में किसके साथ गया था?",
    option: [
        "शानू",
        "भानू",
        "धनू",
        "कृष्णू"
    ],
    answer: "धनू"
},

{
    question: "हेनरी लोपेज का लेखन किस बात को दर्शाता है?",
    option: [
        "अफ्रीका और विकासशील देशों के बीच की दूरी",
        "धार्मिक भिन्नता",
        "ऐतिहासिक घटनाएँ",
        "खेलों की दुनिया"
    ],
    answer: "अफ्रीका और विकासशील देशों के बीच की दूरी"
},

{
    question: "अज्ञेय जी ने घर में किस हस्तलिखित पत्रिका का सम्पादन किया ?",
    option: [
        "लोकबंधु",
        "आनन्दबधु",
        "देशबंधु",
        "इनमें से कोई नहीं"
    ],
    answer: "आनन्दबधु"
},

{
    question: "चेख्यकोव ने जनरल से कितनी बार माफी मांगी?",
    option: [
        "एक बार",
        "दो बार",
        "तीन बार",
        "कई बार"
    ],
    answer: "दो बार"
},

{
    question: "कर्णाट वंश के राजा हरिसिंह को किसका मुकाबला करना पड़ा?",
    option: [
        "गयासुद्दीन तुगलक",
        "नादिरशाह",
        "अलाउद्दीन खिलजी",
        "कुतुबुद्दीन ऐबक"
    ],
    answer: "गयासुद्दीन तुगलक"
},

{
    question: "‘अरेखा-परेखा’ उदय प्रकाश की कैसी कृति है?",
    option: [
        "उपन्यास",
        "कहानी-संग्रह",
        "कविता-संग्रह",
        "इनमें कोई नहीं"
    ],
    answer: "कहानी-संग्रह"
},

{
    question: "‘दीवार में एक खिड़की रहती थी’ के रचनाकार हैं",
    option: [
        "विनोद कुमार शुक्ल",
        "मोहन राकेश",
        "ज्ञानरंजन",
        "कमलेश्वर"
    ],
    answer: "विनोद कुमार शुक्ल"
},

{
    question: "सूरदास के गुरु का नाम क्या था?",
    option: [
        "नरहरिदास",
        "विट्ठलनाथ",
        "वल्लभाचार्य",
        "आनंददास"
    ],
    answer: "वल्लभाचार्य"
},

{
    question: "अज्ञेय जी ने कितनी वर्ष की उम्र में कविता लिखना शुरू किया ?",
    option: [
        "दस वर्ष",
        "बारह वर्ष",
        "पन्द्रह वर्ष",
        "बीस वर्ष"
    ],
    answer: "दस वर्ष"
},

{
    question: "‘तुमुल कोलाहल कलह में’ प्रसाद जी की किस रचना से ली गयी है?",
    option: [
        "इंद्रजाल",
        "झरना",
        "कामायनी",
        "ध्रुवस्वामिनी"
    ],
    answer: "कामायनी"
},

{
    question: "कौन-सी कृति विनोद कुमार शुक्ल की है?",
    option: [
        "गंगातट",
        "घास में दुबका आकाश",
        "सबकुछ बचा रहेगा",
        "आँसू"
    ],
    answer: "सबकुछ बचा रहेगा"
},

{
    question: "कहानी में कारमेन किसके साथ कार्यरत थी?",
    option: [
        "घर की मालकिन",
        "पड़ोसी",
        "मित्र",
        "शिक्षक"
    ],
    answer: "घर की मालकिन"
},

{
    question: "उदय प्रकाश के अनुसार, दशहरे के दिन किस चिड़िया को जरूर देखना चाहिए?",
    option: [
        "कौआ",
        "तोता",
        "नीलकंठ",
        "कबूतर"
    ],
    answer: "नीलकंठ"
},

{
    question: "तिरिछ कहानी के कहानीकार",
    option: [
        "उदय प्रकाश",
        "बाल कृष्ण भट्ट",
        "चंद्रधर शर्मा गुलेरी",
        "सच्चिदानंद हीरानंद वात्स्यायन ‘अज्ञेय’"
    ],
    answer: "उदय प्रकाश"
},

{
    question: "उदय प्रकाश ने किस पत्रिका के सम्पादन विभाग में काम किया?",
    option: [
        "दिनमान",
        "इंडिया टुडे",
        "प्रदीप",
        "धर्मयुग"
    ],
    answer: "दिनमान"
},

{
    question: "शमशेर बहादुर सिंह की 'प्रतिनिधि कविताएँ' नामक काव्य कृति का सम्पादन किसने किया है?",
    option: [
        "डॉ० काशीनाथ सिंह",
        "डॉ० दूधनाथ सिंह",
        "डॉ० नामवर सिंह",
        "इनमें से कोई नहीं"
    ],
    answer: "डॉ० नामवर सिंह"
},

{
    question: "मुन्‍नी और मानक की माँ का नाम है—",
    option: [
        "कृष्णा",
        "किशोरी",
        "बिरहनी",
        "विमली"
    ],
    answer: "बिरहनी"
},

{
    question: "होशेकम की मृत्यु कब हुई?",
    option: [
        "दिसंबर",
        "जनवरी",
        "फरवरी",
        "मार्च"
    ],
    answer: "जनवरी"
},

{
    question: "शमशेर बहादुर सिंह ने 1978 में किस देश की यात्रा की?",
    option: [
        "संयुक्त राज्य अमेरिका",
        "सोवियत रूस",
        "फ्रांस",
        "नेपाल"
    ],
    answer: "सोवियत रूस"
},

{
    question: "तिरिछ को कैसी कहानी माना जाता है?",
    option: [
        "आदिवासी कहानी",
        "आदर्शोन्मुख कहानी",
        "‘जादुई यथार्थ’ की कहानी",
        "विवादात्मक कहानी"
    ],
    answer: "‘जादुई यथार्थ’ की कहानी"
},

{
    question: "‘गाँव का घर’ कविता के कवि हैं",
    option: [
        "अशोक वाजपेयी",
        "ज्ञानेंद्रपति",
        "रघुवीर सहाय",
        "शमशेर बहादुर सिंह"
    ],
    answer: "ज्ञानेंद्रपति"
},

{
    question: "आत्मकथा लेखक की माँ किसके यहाँ काम करती थी?",
    option: [
        "सोमदत्त तगा के घर",
        "यज्ञदत्त तगा के घर",
        "ब्रह्मदेव तगा के घर",
        "ज्ञानदेव तगा के घर"
    ],
    answer: "ब्रह्मदेव तगा के घर"
},

{
    question: "भूषण के प्रथम छंद में कौन-सा रस है?",
    option: [
        "शृंगार रस",
        "भक्ति रस",
        "वीर रस",
        "इनमें से कोई नहीं"
    ],
    answer: "वीर रस"
},

{
    question: "इनमें से कौन-सी रचना तुलसी की है?",
    option: [
        "लग्नपत्रिका",
        "प्रणयपत्रिका",
        "सीता स्वयंवर",
        "विनयपत्रिका"
    ],
    answer: "विनयपत्रिका"
},

{
    question: "चेख्यकोव ने किसके साथ अंतिम बार संपर्क किया?",
    option: [
        "पत्नी",
        "मित्र",
        "जनरल ब्रिजालोव",
        "सहकर्मी"
    ],
    answer: "जनरल ब्रिजालोव"
},

{
    question: "चंद्रधर शर्मा गुलेरी की कहानी कौन-सी है?",
    option: [
        "‘जूनून’",
        "‘रोज’",
        "‘उसने कहा था’",
        "‘तिरिछ’"
    ],
    answer: "‘उसने कहा था’"
},

{
    question: "नाभादास के दीक्षा गुरु हैं-",
    option: [
        "स्वामी अग्रदास (अग्रअली)",
        "स्वामी शुद्धानंद",
        "स्वामी चतुर्भुजदास",
        "स्वामी नरहरिदास"
    ],
    answer: "स्वामी अग्रदास (अग्रअली)"
},

{
    question: "‘रोज’ कहानी का कौन-सा पात्र डॉक्टरी पेशा से जुड़ा था ?",
    option: [
        "मालती",
        "महेश्वर",
        "मालती के रिश्ते का भाई",
        "इनमें से कोई नहीं"
    ],
    answer: "महेश्वर"
},

{
    question: "जनरल ब्रिजालोव ने चेख्यकोव की माफी को कैसे लिया?",
    option: [
        "नाराजगी के साथ",
        "indiferently",
        "ध्यान नहीं दिया",
        "गुस्से में"
    ],
    answer: "ध्यान नहीं दिया"
},

{
    question: "पलटन का विदूषक कौन था ?",
    option: [
        "हजारा सिंह",
        "मुख्तार सिंह",
        "वजीरा सिंह",
        "कुलदीप सिंह"
    ],
    answer: "वजीरा सिंह"
},

{
    question: "‘शेखर : एक जीवनी’ किस विधा की कृति है?",
    option: [
        "निबंध",
        "आलोचना",
        "उपन्यास",
        "जीवनी"
    ],
    answer: "उपन्यास"
},

{
    question: "विनोद कुमार शुक्ल विश्वविद्यालय में एसोशिएट प्रोफेसर रहे हैं?",
    option: [
        "राजेन्द्र प्रसाद कृषि विश्वविद्यालय",
        "चन्द्रशेखर आजाद कृषि विश्वविद्यालय",
        "इंदिरा गाँधी कृषि विश्वविद्यालय",
        "नरेन्द्र देव कृषि विश्वविद्यालय"
    ],
    answer: "इंदिरा गाँधी कृषि विश्वविद्यालय"
},

{
    question: "‘साहित्य लहरी’ किनकी रचना है?",
    option: [
        "जायसी",
        "सूरदास",
        "कबीर",
        "तुलसीदास"
    ],
    answer: "सूरदास"
},

{
    question: "आचार्य रामचन्द्र शुक्ल के काव्य सिद्धान्त का आदर्श कौन-सा काव्य है?",
    option: [
        "गीति काव्य",
        "मुक्तक काव्य",
        "प्रबन्ध काव्य",
        "इनमें से कोई नहीं"
    ],
    answer: "प्रबन्ध काव्य"
},

{
    question: "बटुआ लौटाने वाला कौन था?",
    option: [
        "मैत्र मलांदे",
        "मारियस पोमेल",
        "मैत्र हुलब्रेक",
        "मैत्र ब्रेतों"
    ],
    answer: "मारियस पोमेल"
},

{
    question: "चेख्यकोव की मृत्यु के बाद की स्थिति कैसी थी?",
    option: [
        "आरामदायक",
        "दुखी",
        "यंत्रचालित",
        "खुश"
    ],
    answer: "यंत्रचालित"
},

{
    question: "‘द फर्स्ट एंड लास्ट फ्रीडम’ के रचनाकार कौन हैं?",
    option: [
        "गाँधी",
        "रवीन्द्रनाथ ठाकुर",
        "जे. कृष्णमूर्ति",
        "जवाहर हुसैन"
    ],
    answer: "जे. कृष्णमूर्ति"
},

{
    question: "कौन-सा कथन सही है?",
    option: [
        "रचा हुआ यथार्थ भोगे हुए यथार्थ से अलग है",
        "मुरझा अगर कहीं हो सकती है तो बाहर सूरज की रोशनी में नहीं",
        "दस्तावेज रचना का कच्चा माल नहीं हो सकता",
        "आदमी होने की शर्त बचा जाता, भोगा जाता संसार नहीं है"
    ],
    answer: "रचा हुआ यथार्थ भोगे हुए यथार्थ से अलग है"
},

{
    question: "'प्रसाद' रचित महाकाव्य का नाम है",
    option: [
        "साकेत",
        "कामायनी",
        "प्रियप्रवास",
        "अरुण रामायण"
    ],
    answer: "कामायनी"
},

{
    question: "शमशेर बहादुर सिंह की रचना किस सप्तक में आनी शुरू हुई?",
    option: [
        "पहला सप्तक",
        "दूसरा सप्तक",
        "तीसरा सप्तक",
        "इनमें से कोई नहीं"
    ],
    answer: "दूसरा सप्तक"
},

{
    question: "‘उसने कहा था’ कहानी में किस शहर का चित्रण है?",
    option: [
        "अमृतसर",
        "लुधियाना",
        "जयपुर",
        "लखनऊ"
    ],
    answer: "अमृतसर"
},

{
    question: "नामवर सिंह को किस कृति पर साहित्य अकादमी पुरस्कार प्राप्त हुआ?",
    option: [
        "'कविता के नए प्रतिमान' पर",
        "'कहानी: नई कहानी' पर",
        "'पृथ्वीराजरासो की भाषा' पर",
        "'इतिहास और आलोचना' पर"
    ],
    answer: "'कविता के नए प्रतिमान' पर"
},

{
    question: "प्रसादजी का प्रथम संग्रह है",
    option: [
        "चित्राधार",
        "झरना",
        "लहर",
        "आँसू"
    ],
    answer: "चित्राधार"
},

{
    question: "कहानीकार तिरिछ की लाश को जलाने जंगल में किसके साथ गया था?",
    option: [
        "शानू",
        "भानू",
        "धनू",
        "कृष्णू"
    ],
    answer: "धनू"
},

{
    question: "चंपारण क्षेत्र में बाढ़ का मुख्य कारण क्या है?",
    option: [
        "जंगलों का कटना",
        "नदियों की अधिकता",
        "नदियों की तीव्रता",
        "इनमें से कोई नहीं"
    ],
    answer: "जंगलों का कटना"
},

{
    question: "‘कंकाल’ क्या है?",
    option: [
        "महाकाव्य",
        "कहानी",
        "उपन्यास",
        "प्रबंधकाव्य"
    ],
    answer: "उपन्यास"
},

{
    question: "रघुवीर सहाय का जन्म कब हुआ था?",
    option: [
        "9 दिसंबर, 1929 को",
        "19 दिसंबर, 1930 को",
        "29 सितंबर, 1931 को",
        "19 दिसंबर, 1928 को"
    ],
    answer: "9 दिसंबर, 1929 को"
},

{
    question: "‘सुमेर’ का पर्याय है",
    option: [
        "नीलगिरि",
        "कंचनगिरि",
        "मलयगिरि",
        "हिमालय"
    ],
    answer: "कंचनगिरि"
},

{
    question: "जायसी किस तरह के कवि हैं?",
    option: [
        "भक्त कवि",
        "सूफी कवि",
        "श्रृंगारिक कवि",
        "इनमें से कोई नहीं"
    ],
    answer: "सूफी कवि"
},

{
    question: "चेख्यकोव ने घर पहुँचकर किस तरह की गतिविधियाँ की?",
    option: [
        "परिवार के साथ समय बिताया",
        "आराम किया",
        "सोफे पर लेट गया",
        "बाहरी गतिविधियों में शामिल हुआ"
    ],
    answer: "सोफे पर लेट गया"
},

{
    question: "बालकृष्ण भट्ट ने कौन-सा मासिक पत्र निकाला था?",
    option: [
        "प्रताप",
        "कर्मवीर",
        "हिन्दी प्रदीप",
        "ज्योत्स्ना"
    ],
    answer: "हिन्दी प्रदीप"
},

{
    question: "‘रामचरितमानस’ किसकी रचना है?",
    option: [
        "सूरदास",
        "तुलसीदास",
        "कबीरदास",
        "नाभादास"
    ],
    answer: "तुलसीदास"
},

{
    question: "भूषण किस काल के कवि थे?",
    option: [
        "भक्तिकाल के",
        "आधुनिक काल के",
        "रीतिकाल के",
        "वीरगाथा काल के"
    ],
    answer: "रीतिकाल के"
},

{
    question: "मलयज के पिता का क्या नाम था?",
    option: [
        "रामनाथ वर्मा",
        "त्रिलोकी नाथ वर्मा",
        "दीनानाथ वर्मा",
        "इनमें से कोई नहीं"
    ],
    answer: "त्रिलोकी नाथ वर्मा"
},

{
    question: "‘सिपाही की माँ’ किस एकांकी संग्रह से लिया गया है?",
    option: [
        "फूसर",
        "भोर का तारा",
        "रेशमी टाई",
        "अंडे के छिलके तथा अन्य एकांकी"
    ],
    answer: "अंडे के छिलके तथा अन्य एकांकी"
},

{
    question: "‘संशयात्मा’ किसकी कृति है?",
    option: [
        "ज्ञानेंद्रपति",
        "मुक्तिबोध",
        "अशोक वाजपेयी",
        "रघुवीर सहाय"
    ],
    answer: "ज्ञानेंद्रपति"
},

{
    question: "कौन सी रचना जयशंकर प्रसाद की नहीं है?",
    option: [
        "प्रायश्चित",
        "सूरसागर",
        "ध्रुवस्वामिनी",
        "कामना"
    ],
    answer: "सूरसागर"
},

{
    question: "'बाज की दाद में आदमी का खून लग चुका है।' यह किस कविता की पंक्ति है?",
    option: [
        "हिमालय",
        "गरम हथेली",
        "आह! तुम्हारा सौंदर्य",
        "तय तो यही था"
    ],
    answer: "तय तो यही था"
},

{
    question: "नागार्जुन के काव्य संसार के प्रगीत नायक का व्यक्तित्व किस प्रकार का है?",
    option: [
        "गम्भीर",
        "मनमौजी",
        "निष्कपट पक्खड़",
        "कपटी"
    ],
    answer: "निष्कपट पक्खड़"
},

{
    question: "जयशंकर प्रसाद हिन्दी साहित्य के किस काल के कवि थे?",
    option: [
        "रीतिकाल",
        "आदिकाल",
        "आधुनिक काल",
        "भक्तिकाल"
    ],
    answer: "आधुनिक काल"
},

{
    question: "‘संस्कृति के चार अध्याय’ किसकी कृति है?",
    option: [
        "गुलाब दास",
        "हजारी प्रसाद द्विवेदी",
        "आचार्य सीताराम चतुर्वेदी",
        "रामधारी सिंह ‘दिनकर’"
    ],
    answer: "रामधारी सिंह ‘दिनकर’"
},

{
    question: "रामधारी सिंह ‘दिनकर’ की रचना कौन-सी है?",
    option: [
        "उसने कहा था",
        "जूठान",
        "तिरिछ",
        "अर्द्धनारीश्वर"
    ],
    answer: "अर्द्धनारीश्वर"
},

{
    question: "‘शिक्षा’ पाठ के रचयिता कौन है?",
    option: [
        "महात्मा गाँधी",
        "विनोबा भावे",
        "जगदीशचन्द्र माथुर",
        "जे. कृष्णमूर्ति"
    ],
    answer: "जे. कृष्णमूर्ति"
},

{
    question: "वैशाली महोत्सव का बीजारोपण किया",
    option: [
        "अज्ञेय ने",
        "जगदीशचन्द्र माथुर ने",
        "श्री कृष्ण सिंह ने",
        "अशोक वाजपेयी ने"
    ],
    answer: "जगदीशचन्द्र माथुर ने"
},

{
    question: "कौन-सी कृति शमशेर बहादुर सिंह की है?",
    option: [
        "गुलामी का नशा",
        "मुकुल",
        "काल तुझसे होड़ है मेरी",
        "विशाख"
    ],
    answer: "काल तुझसे होड़ है मेरी"
},

{
    question: "मलयज का जन्म कहाँ हुआ था?",
    option: [
        "इलाहाबाद",
        "अलीगढ़",
        "आजमगढ़",
        "रामगढ़"
    ],
    answer: "आजमगढ़"
},

{
    question: "‘सम्पूर्ण क्रांति’ किसूकी देन है ?",
    option: [
        "राम मनोहर लोहिया",
        "डॉ० अम्बेडकर",
        "कर्पूरी ठाकुर",
        "जयप्रकाश नारायण"
    ],
    answer: "जयप्रकाश नारायण"
},

{
    question: "मलयज की कौन-सी रचना है?",
    option: [
        "तीरीक्ष",
        "जूठन",
        "सिपाही की माँ",
        "हँसते हुए मेरा अकेलापन"
    ],
    answer: "हँसते हुए मेरा अकेलापन"
},

{
    question: "‘सजल जलपात’ में कौन-सा अलंकार है?",
    option: [
        "रूपक",
        "यमक",
        "उपमा",
        "श्लेष"
    ],
    answer: "रूपक"
},

{
    question: "कड़बक के कवि कौन हैं?",
    option: [
        "कबीर दास",
        "सूरदास",
        "मलिक मुहम्मद जायसी",
        "नामदास"
    ],
    answer: "मलिक मुहम्मद जायसी"
},

{
    question: "‘पेशगी’ कहानी में घर की मालकिन की आदतें किसके साथ जुड़ी हैं?",
    option: [
        "बच्चे",
        "पति",
        "नौकर",
        "मित्र"
    ],
    answer: "बच्चे"
},

{
    question: "तुमुल कोलाहल कलह में प्रसाद जी की किस रचना से ली गयी",
    option: [
        "इन्द्रजाल",
        "झरना",
        "कामायनी",
        "ध्रुवस्वामिनी"
    ],
    answer: "कामायनी"
},

{
    question: "जयशंकर प्रसाद की सफलतम नाट्यकृति है",
    option: [
        "स्कंदगुप्त",
        "एक घूँट",
        "ध्रुवस्वामिनी",
        "विशाख"
    ],
    answer: "ध्रुवस्वामिनी"
},

{
    question: "अर्द्धनारीश्वर कल्पित रूप है",
    option: [
        "शिव और पार्वती का",
        "राम और सीता का",
        "राधा और कृष्ण का",
        "विष्णु और लक्ष्मी का"
    ],
    answer: "शिव और पार्वती का"
},

{
    question: "‘ब्रेन ऑफ बांबे’ किसे कहा जाता था ?",
    option: [
        "उमाशंकर दीक्षित को",
        "शीला दीक्षित को",
        "सुरेन्द्र दीक्षित को",
        "हृदयनारायण दीक्षित को"
    ],
    answer: "उमाशंकर दीक्षित को"
},

{
    question: "गाँधीजी चंपारण में कब आए?",
    option: [
        "अप्रैल 1918 में",
        "अप्रैल 1920 में",
        "20 जून, 1917 में",
        "अप्रैल 1917 में"
    ],
    answer: "अप्रैल 1917 में"
},

{
    question: "निम्नलिखित में से कौन-सी मलयज की आलोचना है?",
    option: [
        "भाषा विज्ञान",
        "रससिद्धान्त",
        "कविता से साक्षात्कार",
        "इनमें से कोई नहीं"
    ],
    answer: "कविता से साक्षात्कार"
},

{
    question: "लहना सिंह किस पद पर था?",
    option: [
        "सूबेदार के",
        "लेफ्टिनेंट के",
        "जमादार के",
        "मेजर के"
    ],
    answer: "जमादार के"
},

{
    question: "जयशंकर प्रसाद की सफलतम नाट्यकृति है",
    option: [
        "स्कंदगुप्त",
        "एक घूँट",
        "ध्रुवस्वामिनी",
        "विशाख"
    ],
    answer: "ध्रुवस्वामिनी"
},

{
    question: "रघुवीर सहाय का जन्म स्थान कौन-सा है?",
    option: [
        "काशी",
        "लखनऊ",
        "मेरठ",
        "आगरा"
    ],
    answer: "लखनऊ"
},

{
    question: "पिता बिटिया को क्या करता है ?",
    option: [
        "घुमाता है",
        "खिलाता है",
        "सिखलाता है",
        "मारता है"
    ],
    answer: "सिखलाता है"
},

{
    question: "‘मानस’ की रचना कब हुई थी?",
    option: [
        "संवत 1632 में",
        "संवत 1640 में",
        "संवत 1631 में",
        "संवत 1642 में"
    ],
    answer: "संवत 1631 में"
},

{
    question: "‘पेशगी’ कहानी में फर्डिनांड की टिप्पणी किस पर आधारित है?",
    option: [
        "मैडम की आदतों पर",
        "घर की सजावट पर",
        "बच्चे की पढ़ाई पर",
        "खाना बनाने पर"
    ],
    answer: "मैडम की आदतों पर"
},

{
    question: "सुखदेव सिंह त्यागी की लड़की की शादी में किसने गाँवभर की चारपाइयाँ ढोकर एकत्रित किया था?",
    option: [
        "लेखक के पिता ने",
        "लेखक के भाई ने",
        "लेखक ने",
        "इनमें से कोई नहीं"
    ],
    answer: "लेखक के पिता ने"
},

{
    question: "चेख्यकोव ने जनरल की प्रतिक्रिया को कैसे महसूस किया?",
    option: [
        "सकारात्मक",
        "उदासीन",
        "नकारात्मक",
        "संतोषजनक"
    ],
    answer: "नकारात्मक"
},

{
    question: "'बीजक' के रचयिता कौन हैं?",
    option: [
        "तुलसीदास",
        "कबीरदास",
        "सूरदास",
        "जायसी"
    ],
    answer: "कबीरदास"
},

{
    question: "कौन-सा उपन्यास बालकृष्ण भट्ट द्वारा रचित है?",
    option: [
        "मैला आँचल",
        "गोदान",
        "सौ अजान एक सुजान",
        "अंतराल"
    ],
    answer: "सौ अजान एक सुजान"
},

{
    question: "बटुआ लौटने के बाद होशेकम ने क्या किया?",
    option: [
        "गाँव में घूमा",
        "चुप रहा",
        "घर में रहा",
        "पुलिस से बात की"
    ],
    answer: "गाँव में घूमा"
},

{
    question: "‘पर किसने यह, सातो सागर के पार एकाकीपन से ही माना-हार’ यह किस कवि के कविता का अंश है?",
    option: [
        "शमशेर बहादुर सिंह",
        "मुक्तिबोध",
        "नागार्जुन",
        "त्रिलोचन"
    ],
    answer: "शमशेर बहादुर सिंह"
},

{
    question: "‘पुत्र वियोग’ कविता में कवयित्री ने किसके लिए पत्थर को देवता मानकर पूजा की?",
    option: [
        "अपने लिए",
        "पति के लिए",
        "भाई के लिए",
        "पुत्र के लिए"
    ],
    answer: "पुत्र के लिए"
},

{
    question: "नाभादास में जाति-पाँति एवं वर्णाश्रम का खण्डन किस कवि के छप्पय में किया है?",
    option: [
        "सूरदास",
        "कबीर",
        "बिहारी",
        "इनमें से कोई नहीं"
    ],
    answer: "कबीर"
},

{
    question: "‘तुमुल कोलाहल कलह में’ शीर्षक कविता के रचयिता कौन हैं?",
    option: [
        "सूर्यकांत त्रिपाठी ‘निराला’",
        "जयशंकर प्रसाद",
        "महादेवी वर्मा",
        "पंत"
    ],
    answer: "जयशंकर प्रसाद"
},

{
    question: "कौन-सी कृति माथुरजी की नहीं है?",
    option: [
        "मेरी बाँसुरी",
        "बंदी",
        "रेशमी टाई",
        "कोणार्क"
    ],
    answer: "रेशमी टाई"
},

{
    question: "कौन-सी कृति विनोद कुमार शुक्ल की नहीं है?",
    option: [
        "सब कुछ होना बचा रहेगा",
        "वह आदमी नया गरम कोट पहनकर चला गया विचार की तरह",
        "नौकर की कमीज",
        "असाध्य वीणा"
    ],
    answer: "असाध्य वीणा"
},

{
    question: "कौन-सी रचना तुलसीदास की नहीं है?",
    option: [
        "पार्वती मंगलं",
        "बैराग्य संदीपनी",
        "आखिरी कलल",
        "कवितावली"
    ],
    answer: "आखिरी कलल"
},

{
    question: "इनमें से कौन-सी पुस्तक प्रसादजी की है?",
    option: [
        "झरना",
        "चित्राधारा",
        "सूरजमुखी अँधेरे के",
        "चित्रकोटि"
    ],
    answer: "झरना"
},

{
    question: "चेख्यकोव की आत्महत्या के बाद की स्थिति कैसी थी?",
    option: [
        "शांति",
        "तनाव",
        "दर्द",
        "यंत्रचालित"
    ],
    answer: "यंत्रचालित"
},

{
    question: "उषा की ज्योति में कौन-सा अलंकार है?",
    option: [
        "श्लेष",
        "अनुप्रास",
        "उपमा",
        "यमक"
    ],
    answer: "अनुप्रास"
},

{
    question: "कहानी में कारमेन किस भूमिका में है?",
    option: [
        "नौकरानी",
        "मालकिन",
        "मित्र",
        "चौकीदार"
    ],
    answer: "नौकरानी"
},

{
    question: "'सजल जलपात' में कौन-सा अलंकार है?",
    option: [
        "रूपक",
        "यमक",
        "उपमा",
        "श्लेष"
    ],
    answer: "रूपक"
},

{
    question: "गांधारी थी...",
    option: [
        "दुर्योधन की माँ",
        "कृष्ण की माँ",
        "अर्जुन की माँ",
        "बलराम की माँ"
    ],
    answer: "दुर्योधन की माँ"
},

{
    question: "मोहन राकेश किस पत्रिका के सम्पादक रहे?",
    option: [
        "सारिका",
        "सारिता",
        "स्वाभाविका",
        "इनमें कोई नहीं"
    ],
    answer: "सारिका"
},

{
    question: "‘पेशगी’ कहानी में कारमेन की आर्थिक स्थिति कैसी है?",
    option: [
        "विपन्न",
        "सम्पन्न",
        "मध्यम",
        "औसत"
    ],
    answer: "विपन्न"
},

{
    question: "“पुरुष जब नारी के गुण लेता है तब वह देवता बन जाता है, किन्तु नारी जब नर के गुण सीखती है तब वह राक्षसी हो जाती है।” यह किसका कथन है?",
    option: [
        "दिनकर जी का",
        "रवीन्द्रनाथ का",
        "प्रेमचंद का",
        "इनमें से कोई नहीं"
    ],
    answer: "प्रेमचंद का"
},

{
    question: "निम्नलिखित में से कौन-सी रचना मोहन राकेश की है?",
    option: [
        "रास्तातल यात्रा",
        "सुखमय जीवन",
        "न आनेवाला कल",
        "हरे को हरिनाम"
    ],
    answer: "न आनेवाला कल"
},

{
    question: "‘अज्ञेय’ की माँ का नाम था ?",
    option: [
        "शीला देवी",
        "व्यंती देवी",
        "राधा देवी",
        "शकुंतला देवी"
    ],
    answer: "व्यंती देवी"
},

{
    question: "ज्ञानेंद्रपति का जन्म कहाँ हुआ था?",
    option: [
        "उत्तर प्रदेश में",
        "राजस्थान में",
        "झारखंड में",
        "हरियाणा में"
    ],
    answer: "झारखंड में"
},

{
    question: "‘लागति लपकि कंठ-वैरण के नाजिन सी’ में कौन-सा अलंकार है?",
    option: [
        "श्लेष",
        "रूपक",
        "अनुप्रास",
        "उपमा"
    ],
    answer: "अनुप्रास"
},

{
    question: "कौन-सी कृति बालकृष्ण भट्ट की लिखी हुई है?",
    option: [
        "रेणुका",
        "रेल का विकट खेल",
        "वैशाली का नगरवधू",
        "आषाढ़ी"
    ],
    answer: "रेल का विकट खेल"
},

{
    question: "कौन-सी रचना मलयज की है?",
    option: [
        "एक चादर मैली सी",
        "भीनी-भीनी बोली चटकारी",
        "कविता से साक्षात्कार",
        "मौत मुस्कराई"
    ],
    answer: "कविता से साक्षात्कार"
},

{
    question: "निम्नलिखित में ‘रामचरितमानस’ क्या है?",
    option: [
        "गीतिकाव्य",
        "गाथा",
        "महाकाव्य",
        "खंडकाव्य"
    ],
    answer: "महाकाव्य"
},

{
    question: "कहानी का मुख्य पात्र कौन है?",
    option: [
        "मैत्र मलांदे",
        "होशेकम",
        "मारियस पोमेल",
        "मैत्र ब्रेतों"
    ],
    answer: "होशेकम"
},

{
    question: "‘तारसप्तक’ का संपादक कौन है ?",
    option: [
        "विद्यानिवास मिश्र",
        "धर्मवीर भारती",
        "कन्हैयालाल नंदन",
        "सच्चिदानंद हीरानंद वात्स्यायन ‘अज्ञेय’"
    ],
    answer: "सच्चिदानंद हीरानंद वात्स्यायन ‘अज्ञेय’"
},

{
    question: "जयप्रकाश नारायण को समाज सेवा के लिए किस पुरस्कार से सम्मानित किया गया ?",
    option: [
        "अर्जुन पुरस्कार",
        "नोबल पुरस्कार",
        "मैग्सेसे सम्मान",
        "गाँधी सम्मान"
    ],
    answer: "मैग्सेसे सम्मान"
},

{
    question: "इनमें से कौन-सी पुस्तक प्रसादजी की है?",
    option: [
        "झरना",
        "इंद्रजाल",
        "सूरजमुखी अँधेरे के",
        "चितकोबरा"
    ],
    answer: "झरना"
},

{
    question: "देवी प्रसाद साहू जयशंकर प्रसाद के कौन थे?",
    option: [
        "पितामह",
        "प्रतिपितामह",
        "पिता",
        "इनमें से कोई नहीं"
    ],
    answer: "पिता"
},

{
    question: "तेरह दिनों तक हमलोग भूखे-प्यासे जंगली रास्ते में चलते रहे हैं, यह किसने कहा है?",
    option: [
        "कुंती",
        "चौधरी",
        "ईसाई लड़की",
        "दीनू"
    ],
    answer: "ईसाई लड़की"
},

{
    question: "तुलसीदास का जन्म कहाँ हुआ था ?",
    option: [
        "राजापुर (बाँदा, उत्तर प्रदेश) में",
        "अयोध्या में",
        "हाजीपुर में",
        "प्रयाग में"
    ],
    answer: "राजापुर (बाँदा, उत्तर प्रदेश) में"
},

{
    question: "गाँधीजी चंपारण में कब आए?",
    option: [
        "अप्रैल 1918 में",
        "अप्रैल 1920 में",
        "20 जून 1917 में",
        "अप्रैल 1917 में"
    ],
    answer: "अप्रैल 1917 में"
},

{
    question: "'ओ सदानीरा' निबन्ध बिहार के किस क्षेत्र की संस्कृति पर लिखी गयी है?",
    option: [
        "सारण",
        "तिरहुत",
        "मिथिला",
        "चंपारण"
    ],
    answer: "चंपारण"
},

{
    question: "'कंकाल' क्या है ?",
    option: [
        "महाकाव्य",
        "कहानी",
        "उपन्यास",
        "प्रबंधकाव्य"
    ],
    answer: "उपन्यास"
},

{
    question: "सुभद्रा कुमारी चौहान की कौन-सी कृति नहीं है?",
    option: [
        "बिखरे मोती",
        "मुकुल",
        "प्रायश्चित",
        "त्रिधारा"
    ],
    answer: "प्रायश्चित"
},

{
    question: "चेख्यकोव ने किस वस्त्र में जनरल से माफी मांगी?",
    option: [
        "पुरानी वर्दी",
        "नई वर्दी",
        "खेल की वर्दी",
        "काम की वर्दी"
    ],
    answer: "नई वर्दी"
},

{
    question: "मलिक मुहम्मद जायसी की कविता कौन सी है?",
    option: [
        "पुत्र वियोग",
        "कड़बक",
        "उषा",
        "हार-जीत"
    ],
    answer: "कड़बक"
},

{
    question: "ओमप्रकाश वाल्मीकि का जन्म कहाँ हुआ था?",
    option: [
        "बरला, मुजफ्फरनगर, उत्तरप्रदेश",
        "कानपुर, उत्तरप्रदेश",
        "बनारस, उत्तरप्रदेश",
        "इलाहाबाद, उत्तरप्रदेश"
    ],
    answer: "बरला, मुजफ्फरनगर, उत्तरप्रदेश"
},

{
    question: "जे. कृष्णमूर्ति का जन्म कब हुआ था ?",
    option: [
        "12 मई, 1895 को",
        "18 जून, 1892 को",
        "23 मई, 1898 को",
        "15 अगस्त, 1902 को"
    ],
    answer: "12 मई, 1895 को"
},

{
    question: "जे. कृष्णमूर्ति का पूरा नाम था",
    option: [
        "जय कृष्णमूर्ति",
        "जिद्दू कृष्णमूर्ति",
        "जीवंत कृष्णमूर्ति",
        "जनेश कृष्णमूर्ति"
    ],
    answer: "जिद्दू कृष्णमूर्ति"
},

{
    question: "नामवर सिंह का जन्म कब हुआ था ?",
    option: [
        "28 जुलाई 1927 को",
        "20 जून 1925 को",
        "27 मई 1926 को",
        "22 मई 1925 को"
    ],
    answer: "28 जुलाई 1927 को"
},

{
    question: "छप्पय कितनी पंक्तियों का छंद होता है?",
    option: [
        "चार",
        "पाँच",
        "छः",
        "सात"
    ],
    answer: "छः"
},

{
    question: "जयशंकर प्रसाद ने किस भाषा में काव्य रचना की है?",
    option: [
        "अवधी",
        "खड़ी बोली",
        "ब्रज",
        "इनमें से कोई नहीं"
    ],
    answer: "खड़ी बोली"
},

{
    question: "शिवराज भूषण में कितने अलंकारों का निरूपण हुआ है?",
    option: [
        "110",
        "112",
        "108",
        "105"
    ],
    answer: "105"
},

{
    question: "मेहनतकश और औरत को कवि ने किस रूप में देखा है?",
    option: [
        "सोना",
        "लोहा",
        "पत्थर",
        "लकड़ी"
    ],
    answer: "लोहा"
},

{
    question: "धाँगड़ों को नील की खेती के सिलसिले में कब लाया गया?",
    option: [
        "18वीं शताब्दी के अन्त में",
        "17वीं शताब्दी के अन्त में",
        "19वीं शताब्दी के अन्त में",
        "इनमें से कोई नहीं"
    ],
    answer: "18वीं शताब्दी के अन्त में"
},

{
    question: "‘तिरिछ’ क्या होता है?",
    option: [
        "जंगली साँप",
        "दरियाई घोड़ा",
        "भेड़िया",
        "विषधर (जहरीला लिजार्ड)"
    ],
    answer: "विषधर (जहरीला लिजार्ड)"
},

{
    question: "विनोद कुमार शुक्ल का जन्म कहा हुआ था ?",
    option: [
        "उत्तर प्रदेश में",
        "बिहार में",
        "मध्य प्रदेश में",
        "छत्तीसगढ़ में"
    ],
    answer: "छत्तीसगढ़ में"
},

{
    question: "‘बिरहनी’ किस एकांकी की पात्र है?",
    option: [
        "पैर तले की जमीन",
        "लहरों के राजहंस",
        "आधे अधूरे",
        "सिपाही की माँ"
    ],
    answer: "सिपाही की माँ"
},

{
    question: "मालती के पति का नाम क्या था ?",
    option: [
        "युगेश्वर",
        "महेश्वर",
        "राजेश्वर",
        "परमेश्वर"
    ],
    answer: "महेश्वर"
},

{
    question: "नामवर सिंह की कौन-सी रचना है?",
    option: [
        "अंधेरानगर",
        "ओ सदानीरा",
        "प्रगीत और समाज",
        "तय तो यही था"
    ],
    answer: "प्रगीत और समाज"
},

{
    question: "‘जूठन’ क्या है?",
    option: [
        "रेखाचित्र",
        "शब्द-चित्र",
        "कहानी",
        "आत्मकथा"
    ],
    answer: "कहानी"
},

{
    question: "‘शिवा बावनी’ के कितने मुक्तकों में छत्रपति शिवाजी की वीरता का बखान किया गया है?",
    option: [
        "50",
        "53",
        "52",
        "54"
    ],
    answer: "52"
},

{
    question: "तीनकटिया प्रथा का संबंध है",
    option: [
        "ईंट से",
        "तम्बाकू से",
        "मसाला से",
        "नील से"
    ],
    answer: "नील से"
},

{
    question: "‘विनयपत्रिका’ की भाषा है",
    option: [
        "अवधी",
        "अंतर्वेदी (ब्रजभाषा)",
        "मैथिली",
        "अंगिका"
    ],
    answer: "अंतर्वेदी (ब्रजभाषा)"
},

{
    question: "जयप्रकाश नारायण के अनुसार देश का अविष्ठा किसके हाथों में है ?",
    option: [
        "नेताओं के",
        "नई पीढ़ी के",
        "पुरानी पीढ़ी के",
        "पूँजीपतियों के"
    ],
    answer: "नई पीढ़ी के"
},

{
    question: "कौन-सी रचना मलयज की नहीं है",
    option: [
        "जख्म पर धूल",
        "संवाद और एकालाप",
        "रामचंद्र शुक्ल",
        "सुनो राधिका"
    ],
    answer: "सुनो राधिका"
},

{
    question: "‘तन गई रीढ़’ किसकी कविता है?",
    option: [
        "मुक्तिबोध",
        "त्रिलोचन",
        "नागार्जुन",
        "निराला"
    ],
    answer: "नागार्जुन"
},

{
    question: "नामवर सिंह की कौन-सी रचना है?",
    option: [
        "अर्द्धनारीश्वर",
        "ओ सदानीरा",
        "प्रगीत और समाज",
        "तय तो यही था"
    ],
    answer: "प्रगीत और समाज"
},

{
    question: "रॉबिन्सन क्रूसो ने 16 वर्ष के उपरांत किसके मुख से एक बात सुनी?",
    option: [
        "फ्राइडे के",
        "सन्डे के",
        "एडीसन के",
        "स्टील के"
    ],
    answer: "फ्राइडे के"
},

{
    question: "‘रस्सी का टुकड़ा’ कहानी का अंत किस प्रकार हुआ?",
    option: [
        "सुखद",
        "दुखद",
        "सामान्य",
        "रहस्यमय"
    ],
    answer: "दुखद"
},

{
    question: "कौन-सी कृति शमशेर बहादुर सिंह की नहीं है?",
    option: [
        "इतने पास अपने",
        "उदिता",
        "टूटी हुई बिखरी हुई",
        "भारत : इतिहास और संस्कृति"
    ],
    answer: "भारत : इतिहास और संस्कृति"
},

{
    question: "‘प्रसाद’ रचित महाकाव्य का नाम है-",
    option: [
        "साकेत",
        "कामायनी",
        "प्रियप्रवास",
        "अरुण रामायण"
    ],
    answer: "कामायनी"
},

{
    question: "‘कबटुक अब अवसर पाई’ में ‘अंब’ सम्बोधन किसके लिए है?",
    option: [
        "सीता के लिए",
        "राधा के लिए",
        "अंजनी के लिए",
        "इनमें से कोई नहीं"
    ],
    answer: "सीता के लिए"
},

{
    question: "कबीर किसमें भेद नहीं करते हैं?",
    option: [
        "अमीर-गरीब में",
        "अच्छे-बुरे में",
        "गोरे-काले में",
        "हिन्दू-मुसलमान में"
    ],
    answer: "हिन्दू-मुसलमान में"
},

{
    question: "कौन-सी रचना बालकृष्ण भट्ट द्वारा रचित नहीं है?",
    option: [
        "पचावती",
        "वेणी संहार",
        "मेघदूतम् ।",
        "मेघनाथ वध"
    ],
    answer: "मेघदूतम् ।"
},

{
    question: "इनमें से कौन-सी पुस्तक प्रसाद जी की नहीं है?",
    option: [
        "आँसू",
        "इंद्रजाल",
        "आँधी",
        "शिवाजी का महत्त्व"
    ],
    answer: "शिवाजी का महत्त्व"
},

{
    question: "पई नदी कहाँ तक जाती है?",
    option: [
        "भिखनाझौरी",
        "बगहा",
        "रामनगर",
        "भितिहरवा"
    ],
    answer: "भिखनाझौरी"
},

{
    question: "कुटुक खात कुटुक धरनि गिरावत छवि निरखति नंद-रनियाँ में कौन-सा अलंकार है?",
    option: [
        "उपमा",
        "रूपक",
        "यमक",
        "अनुप्रास"
    ],
    answer: "अनुप्रास"
},

{
    question: "'तुलसीदास' के रचयिता कौन हैं?",
    option: [
        "तुलसीदास",
        "मैथिलीशरण गुप्त",
        "सुमित्रानंदन पंत",
        "सूर्यकांत त्रिपाठी 'निराला'"
    ],
    answer: "सूर्यकांत त्रिपाठी 'निराला'"
},

{
    question: "अजेय जी की कौन-सी कहानी “गैंग्रीन’ शीर्षक नाम से प्रसिद्ध है ?",
    option: [
        "छोड़ा हुआ रास्ता",
        "विपथगा",
        "ये तेरे प्रतिरूप",
        "रोज"
    ],
    answer: "रोज"
},

{
    question: "चेख्यकोव की पत्नी की प्रतिक्रिया पर जनरल की प्रतिक्रिया क्या थी?",
    option: [
        "तटस्थ",
        "उदासीन",
        "गुस्से में",
        "सहानुभूति से"
    ],
    answer: "उदासीन"
},

{
    question: "कौन-सी कृति उदय प्रकाश की है?",
    option: [
        "मलयज",
        "दरियाई घोड़ा",
        "लिहाफ",
        "नीली झील"
    ],
    answer: "दरियाई घोड़ा"
},

{
    question: "चंपारण में धाँगड़ कहाँ से आए?",
    option: [
        "राँची",
        "जमशेदपुर",
        "छोटानागपुर",
        "आंध्र प्रदेश"
    ],
    answer: "छोटानागपुर"
},

{
    question: "ओम प्रकाश ने किस नाट्यशाला की स्थापना की?",
    option: [
        "‘मेघदूत’ नामक",
        "रंगशाला’ नामक",
        "प्रेमचंद मंच’ नामक",
        "इनमें कोई नहीं"
    ],
    answer: "‘मेघदूत’ नामक"
},

{
    question: "लेनिन की मृत्यु कब हुई थी ?",
    option: [
        "1925 में",
        "1932 में",
        "1938 में",
        "1924 में"
    ],
    answer: "1924 में"
},

{
    question: "कौन-सी कृति जायसी की नहीं है?",
    option: [
        "पद्मावत",
        "अखरावट",
        "आखिरी कलाम",
        "मृगावती"
    ],
    answer: "मृगावती"
},

{
    question: "गाँव के घर के भीतर आने से पहले किसे खाँस कर आना पड़ता",
    option: [
        "युवकों को",
        "बुजुर्गों को",
        "महिलाओं को",
        "इनमें से कोई नहीं"
    ],
    answer: "बुजुर्गों को"
},

{
    question: "कौन-सी कृति तुलसी रचित है ?",
    option: [
        "‘उत्तररामचरितम’",
        "‘रामायण’",
        "‘रामचरितमानस’",
        "‘खंजननयन’"
    ],
    answer: "‘रामचरितमानस’"
},

{
    question: "साम्यवाद किससे लड़ रहा है?",
    option: [
        "समाजवादी से",
        "पूँजीपति से",
        "सत्तावादी से",
        "इनमें से कोई नहीं"
    ],
    answer: "पूँजीपति से"
},

{
    question: "‘संयोगिता स्वयंवर’ किसकी रचना है?",
    option: [
        "श्रीनिवास दास की",
        "श्यामसुंदर दास की",
        "रामचंद्र शुक्ल की",
        "लाल भगवान दीन की"
    ],
    answer: "श्रीनिवास दास की"
},

{
    question: "सुरक्षा कहाँ हो सकती है?",
    option: [
        "घर के भीतर",
        "अँधेरे में",
        "पलायन में",
        "चुनौती को झेलने में"
    ],
    answer: "चुनौती को झेलने में"
},

{
    question: "बुद्ध और महावीर ने नारियों को कौन-सा अधिकार दिया?",
    option: [
        "संन्यास लेने का",
        "भिक्षुणी होने का",
        "पति के त्याग का",
        "इनमें से कोई नहीं"
    ],
    answer: "भिक्षुणी होने का"
},

{
    question: "प्रसादजी का जन्म कहाँ हुआ था?",
    option: [
        "इलाहाबाद में",
        "पटना में",
        "वाराणसी में",
        "लखनऊ में"
    ],
    answer: "वाराणसी में"
},

{
    question: "पंडित राम औतार क्या थे?",
    option: [
        "ज्योतिषी",
        "वैद्य",
        "राजनेता",
        "ज्योतिषी और वैद्य"
    ],
    answer: "ज्योतिषी और वैद्य"
},

{
    question: "मनुष्य का शरीर क्यों थक जाता है?",
    option: [
        "मन की चंचलता से",
        "अधिक निद्रा से",
        "अधिक काम से",
        "इनमें से कोई नहीं"
    ],
    answer: "मन की चंचलता से"
},

{
    question: "तिरिछ क्या होता है?",
    option: [
        "जंगली साँप",
        "दरियाई घोड़ा",
        "भेड़िया",
        "विषधर (जहरीला लिजार्ड)"
    ],
    answer: "विषधर (जहरीला लिजार्ड)"
},

{
    question: "भूषण ने समुद्राग्नि से किसकी तुलना की है?",
    option: [
        "छत्रसाल की",
        "शिवाजी की",
        "राम की",
        "इनमें से कोई नहीं"
    ],
    answer: "शिवाजी की"
},

{
    question: "चेख्यकोव की मौत का कारण क्या था?",
    option: [
        "बीमारी",
        "आत्महत्या",
        "दिल का दौरा",
        "प्राकृतिक कारण"
    ],
    answer: "आत्महत्या"
},

{
    question: "‘सदानीरा’ किसको निमित्त बनाकर लिखा गया है?",
    option: [
        "कोसी को",
        "गंगा को",
        "गंडक को",
        "महानंदा को"
    ],
    answer: "गंडक को"
},

{
    question: "मलयज का जन्म हुआ था",
    option: [
        "1935 में",
        "1942 में",
        "1944 में",
        "1936 में"
    ],
    answer: "1935 में"
},

{
    question: "दिल्ली मेरा परदेस क्या है?",
    option: [
        "निबंध",
        "कहानी",
        "उपन्यास",
        "कविता"
    ],
    answer: "निबंध"
},

{
    question: "‘मानस’ (रामचरितमानस) का रचना समय क्या है ?",
    option: [
        "संवत् 1631",
        "संवत् 1622",
        "संवत् 1480",
        "संवत् 1632"
    ],
    answer: "संवत् 1631"
},

{
    question: "कौन कहता है? ‘मैं इसकी लाश ले जाकर चील और कौओं के आगे डाल दूँगा।’",
    option: [
        "मानक",
        "सिपाही",
        "दीनू",
        "चौधरी"
    ],
    answer: "सिपाही"
},

{
    question: "घर की मालकिन किस गतिविधि में व्यस्त थी?",
    option: [
        "ब्रिज खेलना",
        "खाना बनाना",
        "पुस्तक पढ़ना",
        "बच्चों को पढ़ाना"
    ],
    answer: "ब्रिज खेलना"
},

{
    question: "1974 में बिहार प्रदेश के मुख्यमंत्री कौन थे ?",
    option: [
        "कृष्णवल्लभ सहाय",
        "अब्दुल गफूर",
        "अनुग्रहनारायण सिंह",
        "महामाया प्रसाद"
    ],
    answer: "अब्दुल गफूर"
},

{
    question: "‘थरन’ शब्द किस शब्द से विकसित है?",
    option: [
        "थल",
        "थार",
        "स्थल",
        "स्थान"
    ],
    answer: "थार"
},

{
    question: "पुंडलीक जी कौन थे?",
    option: [
        "गाँव के मुखिया",
        "शिक्षक",
        "चिकित्सक",
        "राजनीतिक नेता"
    ],
    answer: "शिक्षक"
},

{
    question: "कौन-सी पुस्तक नामवर सिंह की नहीं है?",
    option: [
        "बकलम खुद",
        "इतिहास और आलोचना",
        "तिरिछ",
        "दूसरी परंपरा की खोज"
    ],
    answer: "तिरिछ"
},

{
    question: "मलिक मुहम्मद जायसी किस शाखा के कवि हैं?",
    option: [
        "प्रेममार्गी शाखा के",
        "ज्ञानमार्गी शाखा के",
        "राममार्गी शाखा के",
        "कृष्णमार्गी शाखा के"
    ],
    answer: "प्रेममार्गी शाखा के"
},

{
    question: "चेख्यकोव ने किस वर्दी में जनरल से माफी मांगी?",
    option: [
        "नई वर्दी",
        "पुरानी वर्दी",
        "काम की वर्दी",
        "खेल की वर्दी"
    ],
    answer: "नई वर्दी"
},

{
    question: "‘रस्सी का टुकड़ा’ कहानी किस शैली की है?",
    option: [
        "हास्य",
        "दुखांत",
        "रोमांचक",
        "प्रेमकथा"
    ],
    answer: "दुखांत"
},

{
    question: "‘अब और नहीं’ वाल्मीकि की कैसी कृति है?",
    option: [
        "कहानी",
        "कविता",
        "उपन्यास",
        "निबंध"
    ],
    answer: "कविता"
},

{
    question: "युद्ध और शांति की समस्या पर लिखी गई काव्यकृति है",
    option: [
        "नील कुसुम",
        "कुरुक्षेत्र",
        "द्वंद्वगीत",
        "रश्मिरथी"
    ],
    answer: "कुरुक्षेत्र"
},

{
    question: "लेखक ओमप्रकाश वाल्मीकि का जन्म हुआ था",
    option: [
        "30 जून 1950 को",
        "23 मई 1949 को",
        "18 अगस्त 1948 को",
        "25 मई 1942 को"
    ],
    answer: "30 जून 1950 को"
},

{
    question: "विनोद कुमार शुक्ल ने कौन सी कविता लिखी है?",
    option: [
        "अधिनायक",
        "प्यारे नन्हें बेटे को",
        "पुत्र वियोग",
        "हार-जीत"
    ],
    answer: "प्यारे नन्हें बेटे को"
},

{
    question: "बालकृष्ण भट्ट ने किस पत्रिका का सम्पादन किया?",
    option: [
        "आर्यावर्त",
        "हुंकार",
        "हिन्दी प्रदीप",
        "पंजाब केसरी"
    ],
    answer: "हिन्दी प्रदीप"
},

{
    question: "‘रोज’ शीर्षक कहानी के लेखक कौन हैं ?",
    option: [
        "नामवर सिंह",
        "‘अज्ञेय’",
        "मोहन राकेश",
        "उदय प्रकाश"
    ],
    answer: "‘अज्ञेय’"
},

{
    question: "ज्ञानेंद्रपति का जन्म कब हुआ था?",
    option: [
        "1 जनवरी, 1950 को",
        "10 जनवरी, 1949 को",
        "18 फरवरी, 1952 को",
        "23 जनवरी, 1948 को"
    ],
    answer: "1 जनवरी, 1950 को"
},

{
    question: "प्रसादजी की कौन-सी कृति अपूर्ण है ?",
    option: [
        "तितली",
        "लहर",
        "इरावती",
        "ध्रुवस्वामिनी"
    ],
    answer: "इरावती"
},

{
    question: "तुलसीदास का मूल नाम क्या था ?",
    option: [
        "बमभोला",
        "रामबोला",
        "हरिबोला",
        "इनमें से कोई नहीं"
    ],
    answer: "रामबोला"
},

{
    question: "नाटक के क्षेत्र में जयशंकर प्रसाद के बाद की सबसे बड़ी प्रतिभा कौन माने जाते हैं?",
    option: [
        "चंद्रधर शर्मा गुलेरी",
        "बालकृष्ण भट्ट",
        "जयप्रकाश नारायण",
        "मोहन राकेश"
    ],
    answer: "मोहन राकेश"
},

{
    question: "‘अर्द्धनारीश्वर’ का किस विद्या से संबंध है?",
    option: [
        "निबंध",
        "कहानी",
        "एकांकी",
        "व्यंग्य"
    ],
    answer: "एकांकी"
},

{
    question: "कोणार्क के नाटककार कौन हैं?",
    option: [
        "जयशंकर प्रसाद",
        "जगदीशचन्द्र माथुर",
        "हेतुकेश्वर प्रेमी",
        "मैथिलीशरण गुप्त"
    ],
    answer: "जगदीशचन्द्र माथुर"
},

{
    question: "‘सरोज स्मृति’ किसकी रचना है?",
    option: [
        "पंत",
        "निराला",
        "महादेवी वर्मा",
        "सुभद्रा कुमारी चौहान"
    ],
    answer: "निराला"
},

{
    question: "मेधा कहाँ नहीं हो सकती है?",
    option: [
        "जहाँ स्वतंत्रता हो",
        "जहाँ भय हो",
        "जहाँ अनुशासनहीनता हो",
        "इनमें से कोई नहीं"
    ],
    answer: "जहाँ स्वतंत्रता हो"
},

{
    question: "सच्चिदानंद हीरानंद वात्स्यायन ‘अज्ञेय’ द्वारा लिखी हुई कहानी कौन-सी है ?",
    option: [
        "तिरिछ",
        "रोज",
        "उसने कहा था",
        "सुखमय जीवन"
    ],
    answer: "रोज"
},

{
    question: "‘दिनकर’ का जन्म कब हुआ था?",
    option: [
        "23 सितम्बर, 1908 को",
        "22 दिसम्बर, 1912 को",
        "28 सितम्बर, 1911 को",
        "25 सितम्बर, 1913 को"
    ],
    answer: "23 सितम्बर, 1908 को"
},

{
    question: "वैशाली महोत्सव का बीजारोपण किया",
    option: [
        "‘अज्ञेय’ ने",
        "जगदीशचन्द्र माथुर ने",
        "श्री कृष्ण सिंह ने",
        "अशोक वाजपेयी ने"
    ],
    answer: "जगदीशचन्द्र माथुर ने"
},

{
    question: "‘मुन्‍नी’ कौन थी?",
    option: [
        "सुखनी की बेटी",
        "रजनी की बेटी",
        "शिवानी की बेटी",
        "बिरहनी की बेटी"
    ],
    answer: "बिरहनी की बेटी"
},

{
    question: "तुलसीदास किस शाखा के कवि है?",
    option: [
        "राममार्गी",
        "कृष्णमार्गी",
        "प्रेममार्गी",
        "ज्ञानमार्गी"
    ],
    answer: "राममार्गी"
},

{
    question: "कौन-सी पुस्तक नामवर सिंह की नहीं है?",
    option: [
        "बकलम खुद",
        "इतिहास और आलोचना",
        "तिरिछ",
        "दूसरी परंपरा की खोज"
    ],
    answer: "तिरिछ"
},

{
    question: "‘पेशगी’ कहानी में कारमेन की मदद क्यों नहीं की जा सकी?",
    option: [
        "आर्थिक समस्याएँ",
        "चिकित्सा सुविधा की कमी",
        "सामाजिक अवहेलना",
        "शिक्षा की कमी"
    ],
    answer: "आर्थिक समस्याएँ"
},

{
    question: "“सभ्यता जी के साहित्य में अपने युग के मूल उद्देश्य, उसके भिन्न-भिन्न रूप, अपनी आमरणीय प्रकृत शैली में प्रकट हुए हैं” - यह किसका कथन है?",
    option: [
        "मुक्ति बोध",
        "अशोक वाजपेयी",
        "रघुवीर सहाय",
        "अज्ञेयकर प्रसाद"
    ],
    answer: "मुक्ति बोध"
},

{
    question: "‘दलित साहित्य का सौंदर्यशास्त्र’ के लेखक हैं",
    option: [
        "मुक्तिबोध",
        "डॉ. नामवर सिंह",
        "ओमप्रकाश वाल्मीकि",
        "डॉ. नगेन्द्र"
    ],
    answer: "ओमप्रकाश वाल्मीकि"
},

{
    question: "जे. कृष्णमूर्ति का पूरा नाम था",
    option: [
        "जय कृष्णमूर्ति",
        "जिद्दू कृष्णमूर्ति",
        "जीवंत कृष्णमूर्ति",
        "जनेश कृष्णमूर्ति"
    ],
    answer: "जिद्दू कृष्णमूर्ति"
},

{
    question: "भूषण ने मुख्यतः किस भाषा में रचना की?",
    option: [
        "खड़ी बोली",
        "ब्रजभाषा",
        "अवधी",
        "इनमें से कोई नहीं"
    ],
    answer: "ब्रजभाषा"
},

{
    question: "युग रामधारी सिंह ‘दिनकर’ की रचना है",
    option: [
        "अर्द्धनारीश्वर",
        "‘रेणु’",
        "‘ओज और सदानीरा’",
        "जूठान"
    ],
    answer: "अर्द्धनारीश्वर"
},

{
    question: "सुखदेव सिंह त्यागी की लड़की की शादी में किसने गाँवभर की चारपाइयाँ ढोकर एकत्रित किया था?",
    option: [
        "लेखक के पिता ने",
        "लेखक के भाई ने",
        "लेखक ने",
        "इनमें से कोई नहीं"
    ],
    answer: "लेखक के पिता ने"
},

{
    question: "‘तिरिछ’ कहानी के पिताजी का नाम क्या है?",
    option: [
        "रामनिहाल प्रसाद",
        "रामस्वार्थ प्रसाद",
        "रामकिशोर प्रसाद",
        "रामबली प्रसाद"
    ],
    answer: "रामस्वार्थ प्रसाद"
},

{
    question: "कौन-सी कृति उदय प्रकाश की नहीं है?",
    option: [
        "पीली छतरीवाली लड़की",
        "पॉल गोमरा का स्कूटर",
        "टूटा हुआ पुल",
        "और अंत में प्रार्थना"
    ],
    answer: "टूटा हुआ पुल"
},

{
    question: "चेख्यकोव ने जनरल के साथ अपनी बातचीत को कैसे देखा?",
    option: [
        "सकारात्मक",
        "निराशाजनक",
        "संजीवनी",
        "चिंताजनक"
    ],
    answer: "निराशाजनक"
},

{
    question: "‘जूठन’ में चित्रण हुआ है",
    option: [
        "राजनीतिक विडंबना का",
        "सामाजिक विषमता का",
        "ऐतिहासिक चेतना का",
        "शैक्षिक परिवेश का"
    ],
    answer: "सामाजिक विषमता का"
},

{
    question: "सुखदेव सिंह त्यागी की लड़की की शादी में उनके घर के सफाई का काम किसने किया?",
    option: [
        "लेखक ने",
        "लेखक के पिता ने",
        "लेखक की माँ ने",
        "लेखक के भाई ने"
    ],
    answer: "लेखक की माँ ने"
},

{
    question: "प्रसादजी के पिता का नाम था",
    option: [
        "रविरल प्रसाद साहू",
        "देवी प्रसाद साहू",
        "कालिका प्रसाद साहू",
        "चंडिका प्रसाद साहू"
    ],
    answer: "देवी प्रसाद साहू"
},

{
    question: "नाभादास का स्थायी निवास कहाँ था?",
    option: [
        "वृंदावन",
        "हरिद्वार",
        "काशी",
        "इनमें से कोई नहीं"
    ],
    answer: "वृंदावन"
},

{
    question: "पुंडलीक जी ने नमिकता किससे सीखी?",
    option: [
        "गोखले जी से",
        "गाँधी जी से",
        "कुप्पास्वामी जी से",
        "इनमें किसी से नहीं"
    ],
    answer: "गाँधी जी से"
},

{
    question: "‘कामायनी’ के रचयिता कौन हैं?",
    option: [
        "जयशंकर प्रसाद",
        "सुमित्रानंदन पंत",
        "महादेवी वर्मा",
        "सूर्यकांत त्रिपाठी ‘निराला’"
    ],
    answer: "जयशंकर प्रसाद"
},

{
    question: "अंतोन चेखव का जन्म वर्ष क्या था?",
    option: [
        "1860",
        "1870",
        "1880",
        "1890"
    ],
    answer: "1860"
},

{
    question: "‘अरेखा-प्रेखा’ उदय प्रकाश की कैसी कृति है?",
    option: [
        "उपन्यास",
        "कहानी-संग्रह",
        "कविता-संग्रह",
        "इनमें से कोई नहीं"
    ],
    answer: "कहानी-संग्रह"
},

{
    question: "किसे ‘लोकनायकू’ के नाम से जाना जाता है ?",
    option: [
        "महात्मा गाँधी को",
        "जयप्रकाश नारायण को",
        "महाकवि जायसी को",
        "बाल गंगाधर तिलक को"
    ],
    answer: "जयप्रकाश नारायण को"
},

{
    question: "‘सिपाही की माँ’ एकांकी में किसकी कथावस्तु प्रस्तुत की गयी है?",
    option: [
        "बाप-बेटा",
        "माँ-बाप",
        "माँ-बेटी",
        "इनमें कोई नहीं"
    ],
    answer: "माँ-बेटी"
},

{
    question: "‘हँसते हुए मेरा अकेलापन’ के लेखक कौन हैं?",
    option: [
        "उदय प्रकाश",
        "मलयज",
        "मोहन राकेश",
        "जगदीशचन्द्र माथुर"
    ],
    answer: "मलयज"
},

{
    question: "मोहन राकेश का जन्म कहाँ हुआ था?",
    option: [
        "मऊई, आजमगढ़",
        "जेड़ावाली गली, अमृतसर",
        "अनूपपुर, मध्य प्रदेश",
        "लखनऊ, उत्तर प्रदेश"
    ],
    answer: "जेड़ावाली गली, अमृतसर"
},

{
    question: "सूरदास के दीक्षा गुरु कौन थे?",
    option: [
        "रामानुजाचार्य",
        "वल्लभाचार्य",
        "रामानंद",
        "चंडी दास"
    ],
    answer: "वल्लभाचार्य"
},

{
    question: "चेख्यकोव ने अपनी मौत के बाद किस स्थिति का सामना किया?",
    option: [
        "शांति",
        "दुःख",
        "तटस्थता",
        "यंत्रचालितता"
    ],
    answer: "यंत्रचालितता"
},

{
    question: "सुभद्रा कुमारी चौहान के पति का नाम क्या था?",
    option: [
        "ठाकुर लक्ष्मण सिंह",
        "ठाकुर दीनदयाल सिंह",
        "ठाकुर रामेश्वर सिंह",
        "ठाकुर रामप्रति सिंह"
    ],
    answer: "ठाकुर लक्ष्मण सिंह"
},

{
    question: "‘रस्सी का टुकड़ा’ कहानी का मुख्य संदेश क्या है?",
    option: [
        "सच्चाई की जीत",
        "निर्दोषता का बलिदान",
        "धन का महत्व",
        "मित्रता की शक्ति"
    ],
    answer: "निर्दोषता का बलिदान"
},

{
    question: "‘पेशगी’ कहानी का प्रमुख मुद्दा क्या है?",
    option: [
        "सामाजिक विषमता",
        "शिक्षा",
        "प्रेम",
        "दोस्ती"
    ],
    answer: "सामाजिक विषमता"
},

{
    question: "चेख्यकोव ने ब्रिजालोव के पास क्यों जाकर माफी मांगी?",
    option: [
        "सामाजिक दबाव",
        "व्यक्तिगत अपराधबोध",
        "कार्य की जिम्मेदारी",
        "बौद्धिक उत्सुकता"
    ],
    answer: "व्यक्तिगत अपराधबोध"
},

{
    question: "प्रेमचंद थे",
    option: [
        "गीतकार",
        "कथाकार",
        "फिल्मकार",
        "संगीतकार"
    ],
    answer: "कथाकार"
},

{
    question: "नाभादास की कविता किन दो कवियों के",
    option: [
        "जायसी एवं सूरदास",
        "कबीर एवं सूरदास",
        "सूरदास एवं तुलसीदास",
        "तुलसीदास एवं कबीरदास"
    ],
    answer: "कबीर एवं सूरदास"
},

{
    question: "जयप्रकाश नारायण ने आई०एस-सी० की परीक्षा कहाँ से पास की ?",
    option: [
        "पटना कॉलेज",
        "पटना साइंस कॉलेज",
        "हिन्दू विश्वविद्यालय",
        "बिहार विद्यापीठ"
    ],
    answer: "बिहार विद्यापीठ"
},

{
    question: "कहानीकार को सपने में बोलने और चीखने की आदत है-यह किसने बताया?",
    option: [
        "कहानीकार के पिता ने",
        "कहानीकार की माँ ने",
        "कहानीकार के भैया ने",
        "कहानीकार के चाचा ने"
    ],
    answer: "कहानीकार की माँ ने"
},

{
    question: "ज्ञानेंद्रपति को उनकी किस रचना के लिए 2006 में साहित्य अकादमी पुरस्कार प्रदान किया गया?",
    option: [
        "संशयात्मा",
        "भिनसार",
        "कवि ने कहा",
        "पढ़ते-पढ़ते"
    ],
    answer: "संशयात्मा"
},

{
    question: "लेखक को किसने बताया कि तिरिछ में काले नाग से सौ गुना ज्यादा जहर होता है?",
    option: [
        "धनू",
        "पंडित राम औतार",
        "नंदलाल",
        "रामकिशोर"
    ],
    answer: "धनू"
},

{
    question: "कवित्त के प्रथम पद में कौन-सा रस है?",
    option: [
        "वीर रस",
        "शृंगार रस",
        "करुण रस",
        "इनमें से कोई नहीं"
    ],
    answer: "वीर रस"
},

{
    question: "‘पेशगी’ कहानी में फर्डिनांड का क्या काम था?",
    option: [
        "चौकीदार",
        "नौकर",
        "मित्र",
        "डॉक्टर"
    ],
    answer: "चौकीदार"
},

{
    question: "किसने बटुआ लौटाया?",
    option: [
        "मैत्र मलांदे",
        "मारियस पोमेल",
        "मैत्र ब्रेतों",
        "होशेकम"
    ],
    answer: "मारियस पोमेल"
},

{
    question: "'कामायनी' के रचयिता कौन हैं?",
    option: [
        "जयशंकर प्रसाद",
        "सुमित्रानंदन पंत",
        "महादेवी वर्मा",
        "सूर्यकांत त्रिपाठी 'निराला'"
    ],
    answer: "जयशंकर प्रसाद"
},

{
    question: "एडीसन के अनुसार असल बातचीत कितने लोगों के बीच हो सकती?",
    option: [
        "दो",
        "तीन",
        "चार",
        "पाँच"
    ],
    answer: "दो"
},

{
    question: "हेनरी लोपेज का लेखन किसके बीच की दूरी को दर्शाता है?",
    option: [
        "विकसित और अविकसित देशों",
        "शहरी और ग्रामीण",
        "अमीर और गरीब",
        "पुराने और नए"
    ],
    answer: "विकसित और अविकसित देशों"
},

{
    question: "ज्ञानेंद्रपति सरकारी सेवा में क्या थे?",
    option: [
        "कारा अधीक्षक",
        "दंडाधिकारी",
        "अभियंता",
        "चिकित्सक"
    ],
    answer: "कारा अधीक्षक"
},

{
    question: "भट्टजी को किसने अंग्रेजी साहित्य के एडिसन और स्टील की श्रेणी में रखा है?",
    option: [
        "हजारी प्रसाद द्विवेदी",
        "डॉ. नागेन्द्र",
        "रामचंद्र शुक्ल",
        "रामविलास शर्मा"
    ],
    answer: "रामचंद्र शुक्ल"
},

{
    question: "‘आर्ट ऑफ कनवर्सेशन’ कहाँ के लोगों में सर्वाधिक प्रचलित है?",
    option: [
        "अफ्रीका के",
        "भारत के",
        "यूरोप के",
        "कनाडा के"
    ],
    answer: "यूरोप के"
},

{
    question: "शमशेर बहादुर सिंह की कौन-सी रचना नहीं है?",
    option: [
        "दूसरा सप्तक",
        "उदिता",
        "टूटी हुई बिखरी हुई",
        "सतह से उठता आदमी"
    ],
    answer: "सतह से उठता आदमी"
},

{
    question: "प्रसादजी का प्रथम संग्रह है",
    option: [
        "चित्राधार",
        "झरना",
        "लहर",
        "आँसू"
    ],
    answer: "चित्राधार"
},

{
    question: "ओमप्रकाश वाल्मीकि को 1993 में कौन-सा पुरस्कार मिला?",
    option: [
        "डॉ. अंबेडकर राष्ट्रीय पुरस्कार",
        "परिवेश सम्मान",
        "जयश्री सम्मान",
        "कथाक्रम सम्मान"
    ],
    answer: "डॉ. अंबेडकर राष्ट्रीय पुरस्कार"
},

{
    question: "'ओ सदानीरा' किसको निमित्त बनाकर लिखा गया है?",
    option: [
        "गंगा",
        "गंडक",
        "यमुना",
        "महानदी"
    ],
    answer: "गंडक"
},

{
    question: "इनमें से ‘प्रेम के पीर’ के कवि हैं?",
    option: [
        "जायसी",
        "नामदास",
        "सूरदास",
        "कबीरदास"
    ],
    answer: "जायसी"
},

{
    question: "‘विनयपत्रिका’ की भाषा है",
    option: [
        "अवधी",
        "अंतर्वेदी (ब्रजभाषा)",
        "मैथिली",
        "अंगिका"
    ],
    answer: "अंतर्वेदी (ब्रजभाषा)"
},

{
    question: "सुभद्रा कुमारी चौहान के पिता का नाम क्या था?",
    option: [
        "ठाकुर राजनाथ सिंह",
        "ठाकुर हिरनाय सिंह",
        "ठाकुर रामनाथ सिंह",
        "ठाकुर जगमोहन सिंह"
    ],
    answer: "ठाकुर रामनाथ सिंह"
},

{
    question: "जयशंकर प्रसाद का जन्म कब हुआ था?",
    option: [
        "1980 में",
        "1985 में",
        "1989 में",
        "1990 में"
    ],
    answer: "1989 में"
},

{
    question: "अज्ञेय जी ने इन्टर कहाँ से किया था ?",
    option: [
        "मद्रास क्रिश्चियन कॉलेज से",
        "पंजाब कॉलेज से",
        "फोरमन कॉलेज से",
        "इनमें से कहीं से नहीं"
    ],
    answer: "मद्रास क्रिश्चियन कॉलेज से"
},

{
    question: "‘पुत्र वियोग’ शीर्षक कविता किस काव्य-संग्रह से ली गई है?",
    option: [
        "‘चित्राधार’ से",
        "‘नहर’ से",
        "‘मुकुल’ से",
        "‘दीपशिखा’ से"
    ],
    answer: "‘मुकुल’ से"
},

{
    question: "'प्रसाद' रचित महाकाव्य का नाम है-",
    option: [
        "साकेत",
        "कामायनी",
        "प्रियप्रवास",
        "अरुण रामायण"
    ],
    answer: "कामायनी"
},

{
    question: "इनमें से कौन-सी पुस्तक प्रसादजी की नहीं है?",
    option: [
        "आँसू",
        "इंद्रजाल",
        "आँधी",
        "शिवाजी का महत्व"
    ],
    answer: "शिवाजी का महत्व"
},

{
    question: "‘अज्ञेय’ ‘किस वाद से सम्बन्धित हैं ?",
    option: [
        "छायावाद",
        "प्रयोगवाद",
        "रहस्यवाद",
        "स्वच्छंदतावाद"
    ],
    answer: "प्रयोगवाद"
},

{
    question: "‘कामायनी’ के कवि हैं",
    option: [
        "पंत",
        "प्रसाद",
        "महादेवी वर्मा",
        "निराला"
    ],
    answer: "प्रसाद"
},

{
    question: "उदय प्रकाश ने किस विश्वविद्यालय से एम०ए० किया?",
    option: [
        "जोधपुर विश्वविद्यालय, राजस्थान",
        "इलाहाबाद विश्वविद्यालय, उत्तरप्रदेश",
        "सागर विश्वविद्यालय, सागर",
        "दिल्ली विश्वविद्यालय, दिल्ली"
    ],
    answer: "सागर विश्वविद्यालय, सागर"
},

{
    question: "‘रिकंस्ट्रक्शन ऑफ इंडियन पॉलिटी’ किसकी रचना है ?",
    option: [
        "जवाहरलाल नेहरू",
        "राममनोहर लोहिया",
        "मदनमोहन मालवीय",
        "जयप्रकाश नारायण"
    ],
    answer: "जयप्रकाश नारायण"
},

{
    question: "तुलसीदास किस काल के कवि थे?",
    option: [
        "आदिकाल के",
        "रीतिकाल के",
        "आधुनिक काल के",
        "भक्तिकाल के"
    ],
    answer: "भक्तिकाल के"
},

{
    question: "‘असल बातचीत सिर्फ दो व्यक्तियों में ही हो सकती है।’ यह किसका मत है?",
    option: [
        "एडीसन",
        "बेन जॉनसन",
        "मिल्टन",
        "स्पेंसर"
    ],
    answer: "एडीसन"
},

{
    question: "नाभादास की रामभक्ति मर्यादा के स्थान पर-",
    option: [
        "शृंगार का पुट था",
        "करुणा का पुट था",
        "माधुर्य भाव का पुट था",
        "दुराग्रह का पुट था"
    ],
    answer: "माधुर्य भाव का पुट था"
},

{
    question: "‘जूठन’ के रचनाकार कौन हैं?",
    option: [
        "मोहन राकेश",
        "उदय प्रकाश",
        "ओमप्रकाश वाल्मीकि",
        "बालकृष्ण भट्ट"
    ],
    answer: "ओमप्रकाश वाल्मीकि"
},

{
    question: "छत्रसाल की तलवार काली देवी को क्या प्रदान करती है?",
    option: [
        "प्रसाद",
        "भोजन",
        "गहने",
        "इनमें से कोई नहीं"
    ],
    answer: "भोजन"
},

{
    question: "इनमें से कौन-सी पुस्तक प्रसादजी की है ?",
    option: [
        "झरना",
        "चित्राधारा",
        "सूरजमुखी अँधेरे के",
        "चितकोबरा"
    ],
    answer: "झरना"
},

{
    question: "'एक तटबंध' के रचनाकार कौन हैं?",
    option: [
        "रामवृक्ष बेनीपुरी",
        "जगदीशचन्द्र माथुर",
        "देवेन्द्र सत्यार्थी",
        "महादेवी वर्मा"
    ],
    answer: "जगदीशचन्द्र माथुर"
},

{
    question: "‘जूठन’ क्या है?",
    option: [
        "कहानी",
        "उपन्यास",
        "रिपोर्ताज",
        "आत्मकथा"
    ],
    answer: "आत्मकथा"
},

{
    question: "चेख्यकोव की पत्नी की प्रतिक्रिया कैसी थी?",
    option: [
        "चिंता भरी",
        "उपेक्षा वाली",
        "गुस्से भरी",
        "सहायता भरी"
    ],
    answer: "उपेक्षा वाली"
},

{
    question: "मोहन राकेश का जन्म कब हुआ था?",
    option: [
        "8 जनवरी 1925 को",
        "18 फरवरी 1930 को",
        "20 जनवरी 1926 को",
        "14 जनवरी 1931 को"
    ],
    answer: "8 जनवरी 1925 को"
},

{
    question: "जे. कृष्णमूर्ति का जन्म कहाँ हुआ था?",
    option: [
        "उत्तरप्रदेश में",
        "आन्ध्रप्रदेश में",
        "मध्यप्रदेश में",
        "कर्नाटक में"
    ],
    answer: "आन्ध्रप्रदेश में"
},

{
    question: "भगवान श्रीकृष्ण किस कवि के पूज्य थे?",
    option: [
        "तुलसीदास के",
        "जायसी के",
        "कबीरदास के",
        "सूरदास के"
    ],
    answer: "सूरदास के"
},

{
    question: "रचने और भोगने का रिश्ता कैसा होता है?",
    option: [
        "द्वंद्वात्मक",
        "सहयोगात्मक",
        "नकारात्मक",
        "निषेधात्मक"
    ],
    answer: "द्वंद्वात्मक"
},

{
    question: "जे. कृष्णमूर्ति की इनमें से कौन सी रचना है?",
    option: [
        "रोज",
        "बातचीत",
        "सम्पूर्ण क्रान्ति",
        "शिक्षा"
    ],
    answer: "शिक्षा"
},

{
    question: "‘उर्वशी’ किसकी रचना है ?",
    option: [
        "रामधारी सिंह दिनकर",
        "मोहनलाल महतो ‘वियोगी’",
        "सुमित्रानंदन पंत’",
        "जयशंकर प्रसाद"
    ],
    answer: "रामधारी सिंह दिनकर"
},

{
    question: "जायसी का काव्य किस प्रकार गंभीर एवं व्यापक है?",
    option: [
        "सरोवर की भाँति",
        "कुएँ की भाँति",
        "समुद्र की भाँति",
        "नदी की भाँति"
    ],
    answer: "समुद्र की भाँति"
},

{
    question: "‘तिरिछ’ कहानी के ‘पिताजी’ का नाम क्या है?",
    option: [
        "रामनिहाल प्रसाद",
        "रामस्वास्थ्य प्रसाद",
        "रामकिशोर प्रसाद",
        "रामबली प्रसाद"
    ],
    answer: "रामस्वास्थ्य प्रसाद"
},

{
    question: "'शिवराजभूषण' किसकी कृति है?",
    option: [
        "मतिराम की",
        "भूषण की",
        "पद्याकर की",
        "बिहारी की"
    ],
    answer: "भूषण की"
},

{
    question: "'सुकून की तलाश' क्या है?",
    option: [
        "गजलों का संग्रह",
        "उपन्यास",
        "कहानी",
        "निबंध संग्रह"
    ],
    answer: "गजलों का संग्रह"
},

{
    question: "‘अर्द्धनारीश्वर’ किसका कल्पित रूप है?",
    option: [
        "शंकर और पार्वती का",
        "राधा और कृष्ण का",
        "राम और सीता का",
        "विष्णु और लक्ष्मी का"
    ],
    answer: "शंकर और पार्वती का"
},

{
    question: "‘प्यारे नन्हें बेटे को’ कविता किस संकलन से ली गई है?",
    option: [
        "‘वह आदमी नया गरम कोट पहनकर चला गया विचार की तरह’ से",
        "‘सबकुछ होना बचा रहेगा’ से",
        "‘लगभग जयहिंद’ से",
        "‘हिमकिरीटिनी’ से"
    ],
    answer: "‘वह आदमी नया गरम कोट पहनकर चला गया विचार की तरह’ से"
},

{
    question: "कौन-सी कृति तुलसी रचित है?",
    option: [
        "‘उत्तररामचरितम’",
        "‘रामायण’",
        "‘रामचरितमानस’",
        "‘खंजननयन’"
    ],
    answer: "‘रामचरितमानस’"
},

{
    question: "‘प्यारे नन्हें बेटे को’ के रचयिता है-",
    option: [
        "नीरज",
        "बच्चन",
        "विनोद कुमार शुक्ल",
        "अशोक वाजपेयी"
    ],
    answer: "विनोद कुमार शुक्ल"
},

{
    question: "'कवियों के कवि' किसे कहा जाता है?",
    option: [
        "रघुवीर सहाय को",
        "जयशंकर प्रसाद को",
        "मुक्तिबोध को",
        "शमशेर बहादुर सिंह को"
    ],
    answer: "शमशेर बहादुर सिंह को"
},

{
    question: "‘पुत्र वियोग’ कविता में कवयित्री ने अपने असामयिक मृत-पुत्र के लिए किस शब्द का प्रयोग नहीं किया है?",
    option: [
        "खिलौना",
        "छौना",
        "खोया धन",
        "अनमोल रतन"
    ],
    answer: "अनमोल रतन"
},

{
    question: "चातकी किसके लिए तरसती है?",
    option: [
        "चालक के लिए",
        "प्रसाद जी की कविता के लिए",
        "स्वाति नक्षत्र की पहली बूँद के लिए",
        "इनमें से कोई नहीं"
    ],
    answer: "स्वाति नक्षत्र की पहली बूँद के लिए"
},

{
    question: "लेखक ओमप्रकाश वाल्मीकि का जन्म हुआ था",
    option: [
        "30 जून, 1950 को",
        "23 मई, 1949 को",
        "18 अगस्त, 1948 को",
        "25 मई, 1942 को"
    ],
    answer: "30 जून, 1950 को"
},

{
    question: "शमशेर बहादुर सिंह का जन्म कब हुआ था?",
    option: [
        "13 जनवरी, 1911 को",
        "23 फरवरी, 1911 को",
        "13 मार्च, 1911 को",
        "22 अप्रैल, 1911 को"
    ],
    answer: "13 जनवरी, 1911 को"
},

{
    question: "प्रसाद जी की किस कृति में आधुनिक मानव सभ्यता की मार्मिक समीक्षा की गयी है?",
    option: [
        "विशाख",
        "स्कंदगुप्त",
        "इन्द्रजाल",
        "कामायनी"
    ],
    answer: "कामायनी"
},

{
    question: "रामचरितमानस का प्रधान रस है",
    option: [
        "वीररस",
        "शृंगार रस",
        "करुणारस",
        "भक्तिरस"
    ],
    answer: "भक्तिरस"
},

{
    question: "ज्ञानेंद्रपति ने कौन-सी कविता लिखी है?",
    option: [
        "हार-जीत",
        "गाँव का घर",
        "उषा",
        "पुत्र वियोग"
    ],
    answer: "गाँव का घर"
},

{
    question: "ओमप्रकाश वाल्मीकि हिन्दी में किस आंदोलन से जुड़े महत्वपूर्ण रचनाकार हैं?",
    option: [
        "समाजवादी आंदोलन",
        "दलित आंदोलन",
        "भारतीय राष्ट्रीय आंदोलन",
        "इनमें से कोई नहीं"
    ],
    answer: "दलित आंदोलन"
},

{
    question: "‘कुली प्रथा’ किसकी कृति है?",
    option: [
        "ठाकुर लक्ष्मण सिंह की",
        "मुल्कराज आनंद की",
        "प्रेमचंद की",
        "ममता कालिया की"
    ],
    answer: "ठाकुर लक्ष्मण सिंह की"
},

{
    question: "जयप्रकाश नारायण का जम कब हुआ था ?",
    option: [
        "11 अक्टूबर, 1902 को",
        "8 अक्टूबर, 1904 को",
        "8 सितंबर, 1903 को",
        "18 अक्टूबर, 1902 को"
    ],
    answer: "11 अक्टूबर, 1902 को"
},

{
    question: "माँ के लिए अपने मन को समझाना कब कठिन हो जाता है?",
    option: [
        "धन नष्ट हो जाने पर",
        "पुत्र की मृत्यु पर",
        "पति की मृत्यु पर",
        "पिता की मृत्यु पर"
    ],
    answer: "पुत्र की मृत्यु पर"
},

{
    question: "बिहार के प्रमुख सांस्कृतिक उत्सव ‘वैशाली महोत्सव’ का बीजारोपण किसने किया?",
    option: [
        "जॉर्ज जियरसन ने",
        "सच्चिदानन्द सिन्हा ने",
        "जगदीशचन्द्र माथुर ने",
        "डॉ. राजेन्द्र प्रसाद ने"
    ],
    answer: "जगदीशचन्द्र माथुर ने"
},

{
    question: "जयप्रकाश नारायण को ‘भारत रल’ की उपाधि दी गई –",
    option: [
        "1990 में",
        "1998 में",
        "1978 में",
        "1974 में"
    ],
    answer: "1998 में"
},

{
    question: "सुभद्रा कुमारी चौहान अपनी पढ़ाई छोड़कर किस आन्दोलन में सक्रिय भूमिका निभाने लगी?",
    option: [
        "सविनय अवज्ञा आन्दोलन",
        "असहयोग आन्दोलन",
        "भारत छोड़ो आन्दोलन",
        "दिल्ली चलो आन्दोलन"
    ],
    answer: "असहयोग आन्दोलन"
},

{
    question: "कौन-सी कृति माथुरजी की है?",
    option: [
        "जानवर और जानवर",
        "कहानी : नई कहानी",
        "यायावर रहेगा याद",
        "भोर का तारा"
    ],
    answer: "भोर का तारा"
},

{
    question: "होशेकम ने रस्सी का टुकड़ा क्यों उठाया?",
    option: [
        "जरूरत के लिए",
        "बेचने के लिए",
        "खेल के लिए",
        "उसे काम की वस्तु समझकर"
    ],
    answer: "उसे काम की वस्तु समझकर"
},

{
    question: "जनरल ने चेख्यकोव की माफी के लिए क्या कहा?",
    option: [
        "“मुझे कोई फर्क नहीं पड़ता।”",
        "“तुम मुझसे मजाक कर रहे हो।”",
        "“यह महत्वपूर्ण है।”",
        "“मुझे कोई आपत्ति नहीं है।”"
    ],
    answer: "“तुम मुझसे मजाक कर रहे हो।”"
},

{
    question: "'ओ सदानीरा' किसको निमित्त बनाकर लिखा गया है?",
    option: [
        "गंगा",
        "गंडक",
        "यमुना",
        "महानदी"
    ],
    answer: "गंडक"
},

{
    question: "कौन सी रचना ओमप्रकाश वाल्मीकि की है?",
    option: [
        "नूतन ब्रह्मचारी",
        "दलित साहित्य का सौंदर्यशास्त्र",
        "सुखमय जीवन",
        "नीलकुसुम"
    ],
    answer: "दलित साहित्य का सौंदर्यशास्त्र"
},

{
    question: "जयशंकर प्रसाद की कौन-सी कृति नहीं है?",
    option: [
        "महाराणा प्रताप का महत्व",
        "प्रेमपथिक",
        "महाराजा मानसिंह",
        "इरावती"
    ],
    answer: "महाराजा मानसिंह"
},

{
    question: "कर्नाटक देश के राजा हरिसिंह को किसका मुकाबला करना पड़ा?",
    option: [
        "गयासुद्दीन तुगलक",
        "नादिरशाह",
        "अलाउद्दीन खिलजी",
        "कुतुबुद्दीन ऐबक"
    ],
    answer: "गयासुद्दीन तुगलक"
},

{
    question: "‘संवाद’ में सबसे महत्वपूर्ण क्या है?",
    option: [
        "तर्क",
        "जिज्ञासा",
        "आत्मीयता",
        "प्रवाहपूर्ण भाषा"
    ],
    answer: "आत्मीयता"
},

{
    question: "जायसी के काव्य का मुख्य रस क्या है?",
    option: [
        "वात्सल्य रस",
        "श्रृंगार रस",
        "वीर रस",
        "इनमें से कोई नहीं"
    ],
    answer: "श्रृंगार रस"
},

{
    question: "चेख्यकोव ने किस वस्त्र में जनरल से माफी मांगी?",
    option: [
        "पुरानी वर्दी",
        "नई वर्दी",
        "खेल की वर्दी",
        "काम की वर्दी"
    ],
    answer: "नई वर्दी"
},

{
    question: "सूरदास हिन्दी साहित्य के किस काल के कवि हैं?",
    option: [
        "आदिकाल",
        "भक्तिकाल",
        "रीतिकाल",
        "आधुनिक काल"
    ],
    answer: "भक्तिकाल"
},

{
    question: "तुलसीदास को किस चीज की भूख है?",
    option: [
        "यश की",
        "भक्ति की",
        "धन की",
        "इनमें से कोई नहीं"
    ],
    answer: "भक्ति की"
},

{
    question: "‘बातचीत’ किस विधा की रचना है?",
    option: [
        "आलोचना",
        "गीत",
        "शोध",
        "निबंध"
    ],
    answer: "निबंध"
},

{
    question: "लेखक के दुःस्वप्न के सबसे खतरनाक पात्र कौन थे?",
    option: [
        "साँप तथा बिच्छू",
        "शेर तथा तिरिछ",
        "हाथी तथा तिरिछ",
        "तिरिछ तथा बाघ"
    ],
    answer: "हाथी तथा तिरिछ"
},

{
    question: "'राम की शक्तिपूजा' किसकी कविता है?",
    option: [
        "पंत",
        "दिनकर",
        "महादेवी वर्मा",
        "निराला"
    ],
    answer: "निराला"
},

{
    question: "सुभद्रा कुमारी चौहान के अनुसार, माँ के लिए अपने मन को समझाना कब कठिन हो जाता है?",
    option: [
        "भाई के मृत्यु होने पर",
        "पिता की मृत्यु होने पर",
        "पुत्र की मृत्यु होने पर",
        "पति की मृत्यु होने पर"
    ],
    answer: "पुत्र की मृत्यु होने पर"
},

{
    question: "‘विमल बुद्धि हो तासुकी, जो यह गुन बखानी धरै - यह पंक्ति किस शीर्ष कविता से है?",
    option: [
        "कड़वक",
        "कवित्त",
        "पद",
        "छप्पय"
    ],
    answer: "छप्पय"
},

{
    question: "निम्नलिखित में ‘रामचरितमानस’ क्या है?",
    option: [
        "गीतिकाव्य",
        "गाथा",
        "महाकाव्य",
        "खंडकाव्य"
    ],
    answer: "महाकाव्य"
},

{
    question: "'सहर्ष स्वीकारा है' कविता के रचयिता कौन हैं?",
    option: [
        "नागार्जुन",
        "मुक्तिबोध",
        "केदारनाथ सिंह",
        "त्रिलोचन"
    ],
    answer: "मुक्तिबोध"
},

{
    question: "कौन-सी कृति जायसी की नहीं है?",
    option: [
        "‘पद्मावत’",
        "‘अखरावट’",
        "‘आखिरी कलाम’",
        "‘मृगावती’"
    ],
    answer: "‘मृगावती’"
},

{
    question: "नागार्जुन के काव्य संसार के प्रगीत नायक का व्यक्तित्व किस प्रकार का है?",
    option: [
        "गंभीर",
        "मनमौजी",
        "निष्कवच पकड़",
        "कपटी"
    ],
    answer: "निष्कवच पकड़"
},

{
    question: "'अधिनायक' शीर्षक कविता किस तरह की कविता है?",
    option: [
        "हास्य प्रधान",
        "व्यंग्य प्रधान",
        "रोमांस प्रधान",
        "वीर रस प्रधान"
    ],
    answer: "व्यंग्य प्रधान"
},

{
    question: "‘पेशगी’ कहानी में कारमेन का कौन सा पक्ष प्रमुख है?",
    option: [
        "विपन्नता",
        "सम्पन्नता",
        "संघर्ष",
        "सुख"
    ],
    answer: "विपन्नता"
},

{
    question: "विनोद कुमार शुक्ल को कौन-सा पुरस्कार नहीं प्रदान किया गया है?",
    option: [
        "दयावती मोदी कवि शिखर सम्मान",
        "साहित्य अकादमी पुरस्कार",
        "ज्ञानपीठ पुरस्कार",
        "रघुवीर सहाय स्मृति पुरस्कार"
    ],
    answer: "ज्ञानपीठ पुरस्कार"
},

{
    question: "कौन-सी कृति बालकृष्ण भट्ट की लिखी हुई नहीं है?",
    option: [
        "‘सो अजान एक सुजान’",
        "‘नूतन ब्रह्मचारी’",
        "‘शिशुपाल वध’",
        "प्रभामती"
    ],
    answer: "प्रभामती"
},

{
    question: "देवी प्रसाद साहू जयशंकर प्रसाद के कौन थे?",
    option: [
        "पितामह",
        "प्रतिपितामह",
        "पिता",
        "इनमें से कोई नहीं"
    ],
    answer: "पिता"
},

{
    question: "के कितने छंदों में महाराजा छत्रसाल की वीरता का यशोगान किया गया है?",
    option: [
        "50 छंदों में",
        "52 छंदों में",
        "59 छंदों में",
        "10 छंदों में"
    ],
    answer: "10 छंदों में"
},

{
    question: "चेख्यकोव ने घर पहुँचकर किस तरह की गतिविधियाँ की?",
    option: [
        "परिवार के साथ समय बिताया",
        "आराम किया",
        "सोफे पर लेट गया",
        "बाहरी गतिविधियों में शामिल हुआ"
    ],
    answer: "सोफे पर लेट गया"
},

{
    question: "‘पेशगी’ कहानी में कारमेन को किस बात का डर था?",
    option: [
        "मालकिन की फटकार",
        "नौकरी का नुकसान",
        "समाज की आलोचना",
        "परिवार की नाराजगी"
    ],
    answer: "मालकिन की फटकार"
},

{
    question: "किसके कपड़े के मोती तारों की तरह चमकते हैं?",
    option: [
        "दाँतों को",
        "तारों को",
        "धनते को",
        "इनमें से कोई नहीं"
    ],
    answer: "तारों को"
},

{
    question: "कवि भूषण को उपाधि दी थी-",
    option: [
        "चित्रकूट के सोलंकी राजा रुद्रसाह ने",
        "भामासाह ने",
        "टोडरमल ने",
        "अकबर ने"
    ],
    answer: "चित्रकूट के सोलंकी राजा रुद्रसाह ने"
},

{
    question: "कौन-सी पुस्तक अज्ञेय की है ?",
    option: [
        "मिट्टी की ओर",
        "मौत मुस्कुराई",
        "हरी घास पर क्षणभर",
        "ओ सदानीरा"
    ],
    answer: "हरी घास पर क्षणभर"
},

{
    question: "नामवर सिंह प्रधान संपादक थे",
    option: [
        "'हंस' के",
        "'सरस्वती' के",
        "'वागर्थ' के",
        "'आलोचना (त्रैमासिक)' के"
    ],
    answer: "'आलोचना (त्रैमासिक)' के"
},

{
    question: "शिवाजी के पुत्र का नाम था-",
    option: [
        "रघुनाथ",
        "शाहजी",
        "भानुप्रताप",
        "यशसेन"
    ],
    answer: "शाहजी"
},

{
    question: "वात्सल्य के विश्व में अद्वितीय कवि कौन हैं?",
    option: [
        "सूरदास",
        "तुलसीदास",
        "कबीरदास",
        "नामदास"
    ],
    answer: "सूरदास"
},

{
    question: "अर्द्धनारीश्वर कल्पित रूप है",
    option: [
        "शिव और पार्वती का",
        "राम और सीता का",
        "राधा और कृष्ण का",
        "विष्णु और लक्ष्मी का"
    ],
    answer: "शिव और पार्वती का"
},

{
    question: "चेख्यकोव की पत्नी ने किस प्रकार की प्रतिक्रिया व्यक्त की?",
    option: [
        "गुस्से में",
        "उदासीनता",
        "चिंता के साथ",
        "सहानुभूति के साथ"
    ],
    answer: "उदासीनता"
},

{
    question: "'कामायनी' के कवि हैं",
    option: [
        "पंत",
        "प्रसाद",
        "महादेवी वर्मा",
        "निराला"
    ],
    answer: "प्रसाद"
},

{
    question: "जयप्रकाश नारायण को भारत की जनता किस नाम से याद करती है ?",
    option: [
        "‘समाजनायक",
        "‘देशनायक’",
        "‘लोकनायक’",
        "‘जननायक’"
    ],
    answer: "‘लोकनायक’"
},

{
    question: "प्रसादजी के पिता का नाम था",
    option: [
        "रविरल प्रसाद साहू",
        "देवी प्रसाद साहू",
        "कालिका प्रसाद साहू",
        "चंडिका प्रसाद साहू"
    ],
    answer: "देवी प्रसाद साहू"
},

{
    question: "लहना सिंह क्या था ?",
    option: [
        "जमादार",
        "सूबेदार",
        "मेजर",
        "कैप्टेन (कप्तान)"
    ],
    answer: "जमादार"
},

{
    question: "‘संयोगिता स्वयंवर’ रचना है",
    option: [
        "बालकृष्ण भट्ट की",
        "प्रतापनारायण मिश्र की",
        "श्रीनिवास दास की",
        "मैथिलीशरण गुप्त की"
    ],
    answer: "श्रीनिवास दास की"
},

{
    question: "नामवर सिंह का जन्म कब हुआ था?",
    option: [
        "28 जुलाई 1927 को",
        "20 जून 1925 को",
        "27 मई 1926 को",
        "22 मई 1925 को"
    ],
    answer: "28 जुलाई 1927 को"
},

{
    question: "'अधिनायक' के रचयिता कौन हैं?",
    option: [
        "मुक्तिबोध",
        "रघुवीर सहाय",
        "नाचिकेता",
        "ज्ञानेंद्रपति"
    ],
    answer: "रघुवीर सहाय"
},

{
    question: "गुलेरीजी किस गाँव के मूल निवासी थे ?",
    option: [
        "फतेहपुर",
        "गुलेर",
        "मनेर",
        "गहमर"
    ],
    answer: "गुलेर"
},

{
    question: "जब लेखक बच्चा था, शादी-ब्याह के मौकों पर उनके परिवारवालों को खाने के लिए क्या मिलता था?",
    option: [
        "स्वादिष्ट पकवान",
        "साधारण भोजन",
        "मिठाइयाँ",
        "जूठन"
    ],
    answer: "जूठन"
},

{
    question: "चेख्यकोव को छींक आने पर किस व्यक्ति ने असुविधा अनुभव की?",
    option: [
        "जनरल ब्रिजालोव",
        "क्लर्क",
        "पत्नी",
        "मित्र"
    ],
    answer: "जनरल ब्रिजालोव"
},

{
    question: "मनुष्य का शरीर क्यों थक जाता है?",
    option: [
        "मन की चंचलता से",
        "अधिक निद्रा से",
        "अधिक काम से",
        "इनमें से कोई नहीं"
    ],
    answer: "मन की चंचलता से"
},

{
    question: "नामवर सिंह द्वारा लिखित 'प्रगीत और समाज' क्या है?",
    option: [
        "आलोचना",
        "निबंध",
        "एकांकी",
        "आत्मकथा"
    ],
    answer: "निबंध"
},

{
    question: "‘सम्पूर्ण क्रांति’ पाठ में दिया गया भाषण किसूका है ?",
    option: [
        "जयप्रकाश नारायण का",
        "रामधारी सिंह दिनकर का",
        "भगत सिंह का",
        "इनमें किसी का नहीं"
    ],
    answer: "जयप्रकाश नारायण का"
},

{
    question: "कौन-सी कृति उदय प्रकाश की है?",
    option: [
        "मलयज",
        "दरियाई घोड़ा",
        "लिहाफ",
        "नीली झील"
    ],
    answer: "दरियाई घोड़ा"
},

{
    question: "चेख्यकोव की अंतिम स्थिति कैसी थी?",
    option: [
        "आरामदायक",
        "दुखी",
        "उत्साही",
        "यंत्रचालित"
    ],
    answer: "यंत्रचालित"
},

{
    question: "मोहन राकेश रचित नाटक संग्रह हैं—",
    option: [
        "उत्तर प्रियदर्शी",
        "पहला राजा",
        "सत्य हरिश्चंद्र",
        "आषाढ़ का एक दिन"
    ],
    answer: "आषाढ़ का एक दिन"
},

{
    question: "उषा का जादू कब टूटता है?",
    option: [
        "सपने में",
        "विस्मृति में",
        "सूर्योदय होने पर",
        "ध्यान में"
    ],
    answer: "सूर्योदय होने पर"
},

{
    question: "जयप्रकाश नारायण के स्वास्थ्य पर निगरानी रखनेवाले डॉक्टर का नाम था-",
    option: [
        "डॉ० रहमान",
        "डॉ० इरफान",
        "डॉ० मकबूल",
        "डॉ० एजाज"
    ],
    answer: "डॉ० रहमान"
},

{
    question: "होशेकम को किसने चोर कहा?",
    option: [
        "बाजार के लोग",
        "मैत्र मलांदे",
        "पुलिस",
        "मैत्र ब्रेतों"
    ],
    answer: "बाजार के लोग"
},

{
    question: "जयशंकर प्रसाद की कौन-सी कृति नहीं है?",
    option: [
        "महाराणा प्रताप का महत्त्व",
        "प्रेमपथिक",
        "महाराजा मानसिंह",
        "इरावती"
    ],
    answer: "महाराजा मानसिंह"
},

{
    question: "जयप्रकाशजी मार्क्सवादी कब बने ?",
    option: [
        "1928 में",
        "1927 में",
        "1938 में",
        "1924 में"
    ],
    answer: "1924 में"
},

{
    question: "मेहनतकश और औरत को कवि ने किस रूप में देखा है ?",
    option: [
        "सोना",
        "लोहा",
        "पत्थर",
        "लकड़ी"
    ],
    answer: "लोहा"
},

{
    question: "लहना सिंह की मृत्यु किसकी गोद में हुई ?",
    option: [
        "कीरत सिंह",
        "वजीरा सिंह",
        "अंतर सिंह",
        "महीप सिंह"
    ],
    answer: "वजीरा सिंह"
},

{
    question: "'भूषण' की कविता में कौन रस पाया जाता है?",
    option: [
        "शृंगार रस",
        "भक्ति रस",
        "वीर रस 'छत्रसाल दशक'",
        "वात्सल्य रस"
    ],
    answer: "वीर रस 'छत्रसाल दशक'"
},

{
    question: "सूरदास किस धारा के कवि हैं?",
    option: [
        "रामाश्रयी",
        "कृष्णाश्रयी",
        "शैव",
        "इनमें से कोई नहीं"
    ],
    answer: "कृष्णाश्रयी"
},

{
    question: "‘बातचीत’ किस विधा की रचना है?",
    option: [
        "आलोचना",
        "गीत",
        "शोध",
        "निबंध"
    ],
    answer: "निबंध"
},

{
    question: "मलिक मुहम्मद जायसी किस शाखा के कवि हैं?",
    option: [
        "प्रेममार्गी शाखा के",
        "ज्ञानमार्गी शाखा के",
        "राममार्गी शाखा के",
        "कृष्णमार्गी शाखा के"
    ],
    answer: "प्रेममार्गी शाखा के"
},

{
    question: "'कानि' का अर्थ होता है-",
    option: [
        "एक आँख का न होना",
        "एक कानवाला",
        "अविश्वास",
        "विश्वास, प्रतीति"
    ],
    answer: "विश्वास, प्रतीति"
},

{
    question: "जे. कृष्णमूर्ति के संबंध में कौन-सा तथ्य सही है?",
    option: [
        "वे प्रायः लिखते थे",
        "वे उपन्यासकार थे",
        "वे प्रसिद्ध नाटककार थे",
        "वे प्रायः बोलते थे, संभाषण करते थे"
    ],
    answer: "वे प्रसिद्ध नाटककार थे"
},

{
    question: "तीनकटिया प्रथा का संबंध है",
    option: [
        "ईंट से",
        "तम्बाकू से",
        "मसाला से",
        "नील से"
    ],
    answer: "नील से"
},

{
    question: "कौन-सी कृति रामधारी सिंह ‘दिनकर’ की लिखी हुई नहीं है?",
    option: [
        "वट पीपल",
        "उर्वशी",
        "काव्य की भूमिका",
        "साकेत"
    ],
    answer: "साकेत"
},

{
    question: "बटुआ लौटाने पर किसको सूचना दी गई?",
    option: [
        "मैत्र हुलब्रेक",
        "होशेकम",
        "मलांदे",
        "पोमेल"
    ],
    answer: "होशेकम"
},

{
    question: "इनमें से कौन-सी पुस्तक प्रसादजी की है?",
    option: [
        "झरना",
        "चित्राधारा",
        "सूरजमुखी अँधेरे के",
        "चित्रकोटि"
    ],
    answer: "झरना"
},

{
    question: "चितामणि त्रिपाठी भूषण के कौन थे?",
    option: [
        "भाई",
        "चाचा",
        "भतीजा",
        "इनमें से कोई नहीं"
    ],
    answer: "भाई"
},

{
    question: "शमशेर बहादुर सिंह का जन्म कहाँ हुआ था?",
    option: [
        "देहरादून में",
        "पटना में",
        "लखनऊ में",
        "दिल्ली में"
    ],
    answer: "देहरादून में"
},

{
    question: "‘तुमुल कोलाहल कलह में’ शीर्षक कविता के रचयिता कौन हैं?",
    option: [
        "सूर्यकांत त्रिपाठी ‘निराला’",
        "जयशंकर प्रसाद",
        "महादेवी वर्मा",
        "पंत"
    ],
    answer: "जयशंकर प्रसाद"
},

{
    question: "जायसी की काव्य की भाषा कौन-सी थी?",
    option: [
        "खड़ी बोली",
        "ब्रज",
        "अवधी",
        "अरबी"
    ],
    answer: "अवधी"
},

{
    question: "रघुवीर सहाय नई दिल्ली से निकलने वाले किस अखबार के विशेष संवाददाता थे?",
    option: [
        "नवभारत टाइम्स",
        "हिन्दुस्तान टाइम्स",
        "टाइम्स ऑफ इंडिया",
        "इनमें से कोई नहीं"
    ],
    answer: "नवभारत टाइम्स"
},

{
    question: "‘बोलते क्षण’ किस साहित्यिक विधा की कृति है?",
    option: [
        "निबंध",
        "कहानी",
        "संस्मरण",
        "आलोचना"
    ],
    answer: "निबंध"
},

{
    question: "स्कूल के हेडमास्टर का क्या नाम था?",
    option: [
        "बलीराम",
        "कलीराम",
        "दीनूराम",
        "धनीराम"
    ],
    answer: "कलीराम"
},

{
    question: "जयप्रकाश नारायण मद्रास में अपने किस मित्र के साथ रूके थे ?",
    option: [
        "गंगा बाबू",
        "दिनकर जी",
        "ईश्वर अय्यर",
        "भगवान अय्यर"
    ],
    answer: "ईश्वर अय्यर"
},

{
    question: "लेखक के दुःस्वप्न के सबसे खतरनाक पात्र कौन थे?",
    option: [
        "साँप तथा बिच्छू",
        "शेर तथा तिरिछ",
        "हाथी तथा तिरिछ",
        "तिरिछ तथा बाघ"
    ],
    answer: "हाथी तथा तिरिछ"
},

{
    question: "प्रसादजी का जन्म कहाँ हुआ था?",
    option: [
        "इलाहाबाद में",
        "पटना में",
        "वाराणसी में",
        "लखनऊ में"
    ],
    answer: "वाराणसी में"
},

{
    question: "जयशंकर प्रसाद किस वाद के कवि थे?",
    option: [
        "छायावाद",
        "प्रगतिवाद",
        "प्रयोगवाद",
        "अतियथार्थवाद"
    ],
    answer: "छायावाद"
},

{
    question: "रामचरितमानस का प्रधान रस है",
    option: [
        "वीररस",
        "शृंगाररस",
        "करुणरस",
        "भक्तिरस"
    ],
    answer: "भक्तिरस"
},

{
    question: "तुलसीदास के शिक्षा गुरु थे-",
    option: [
        "नरहरिदास",
        "रविदास",
        "शेष सनातन",
        "मधुसूदन सरस्वती"
    ],
    answer: "शेष सनातन"
},

{
    question: "‘पेशगी’ कहानी किस सामाजिक मुद्दे को प्रस्तुत करती है?",
    option: [
        "शोषण",
        "प्रेम",
        "युद्ध",
        "धर्म"
    ],
    answer: "शोषण"
},

{
    question: "सुभद्रा कुमारी चौहान स्वयं को असहाय क्यों कहती हैं?",
    option: [
        "पिता-वियोग के कारण",
        "पुत्र-वियोग के कारण",
        "पति-वियोग के कारण",
        "इनमें से कोई नहीं"
    ],
    answer: "पुत्र-वियोग के कारण"
},

{
    question: "‘पेशगी’ कहानी में मैडम की आदतों का क्या प्रभाव होता है?",
    option: [
        "सामाजिक विषमता",
        "शारीरिक चोट",
        "मानसिक तनाव",
        "सांस्कृतिक परिवर्तन"
    ],
    answer: "सामाजिक विषमता"
},

{
    question: "रघुवीर सहाय को उनकी किस कृति पर 'साहित्य अकादमी पुरस्कार' मिला था?",
    option: [
        "इत्यलम्",
        "आत्महत्या के विरुद्ध",
        "लोग भूल गये हैं",
        "सीढ़ियों पर धूप में"
    ],
    answer: "लोग भूल गये हैं"
},

{
    question: "जयशंकर प्रसाद किस वाद के कवि थे ?",
    option: [
        "छायावाद",
        "प्रगतिवाद",
        "प्रयोगवाद",
        "अतियथार्थवाद"
    ],
    answer: "छायावाद"
},

{
    question: "चेख्यकोव ने जनरल की प्रतिक्रिया को कैसे महसूस किया?",
    option: [
        "सकारात्मक",
        "उदासीन",
        "नकारात्मक",
        "संतोषजनक"
    ],
    answer: "नकारात्मक"
},

{
    question: "होशेकम अपनी बेगुनाही का दावा किस वस्तु से करता रहा?",
    option: [
        "बटुआ",
        "रस्सी का टुकड़ा",
        "घड़ी",
        "जूता"
    ],
    answer: "रस्सी का टुकड़ा"
},

{
    question: "डिग्री का अर्थ क्या है?",
    option: [
        "धन कमाना",
        "प्रसिद्धि प्राप्त करना",
        "सत्य की खोज करना",
        "सत्य प्राप्त करना"
    ],
    answer: "सत्य की खोज करना"
},

{
    question: "तुलसीदास का जन्म कब हुआ?",
    option: [
        "1540 ई० में",
        "1543 ई० में",
        "1545 ई० में",
        "1550 ई० में"
    ],
    answer: "1543 ई० में"
},

{
    question: "शमशेर बहादुर सिंह किस साहित्यकार के समकालीन थे?",
    option: [
        "प्रेमचन्द",
        "जयशंकर प्रसाद",
        "कबीरदास",
        "नागार्जुन"
    ],
    answer: "नागार्जुन"
},

{
    question: "‘द फर्स्ट एंड लास्ट फ्रीडम’ किसकी कृति है?",
    option: [
        "मलयज की",
        "मोहन राकेश की",
        "जे. कृष्णमूर्ति की",
        "अब्दुल कलाम आजाद की"
    ],
    answer: "जे. कृष्णमूर्ति की"
},

{
    question: "सबके हित का वचन कौन कहता है? (पाठ के अनुसार)",
    option: [
        "सूर",
        "कबीर",
        "जायसी",
        "विद्यापति"
    ],
    answer: "कबीर"
},

{
    question: "‘पुत्र वियोग’ शीर्षक कविता किसकी रचना है?",
    option: [
        "जयशंकर प्रसाद",
        "सुभद्रा कुमारी चौहान",
        "रघुवीर सहाय",
        "शमशेर बहादुर सिंह"
    ],
    answer: "सुभद्रा कुमारी चौहान"
},

{
    question: "वल्लभाचार्य से मिलने के पूर्व सूर किस भाव के पद गाते थे?",
    option: [
        "प्रेम",
        "विरक्ति",
        "दैन्य",
        "अवसाद"
    ],
    answer: "दैन्य"
},

{
    question: "प्रभातकालीन आकाश कैसा है?",
    option: [
        "कमल के रंग जैसा",
        "नीले शंख जैसा",
        "काली सिल के जैसा",
        "उजली सीप के जैसा"
    ],
    answer: "नीले शंख जैसा"
},

{
    question: "'उषा' कविता में प्रातः काल को किसके समान बताया गया है?",
    option: [
        "लाल कमल के समान",
        "नीले शंख के समान",
        "नीली चादर के समान",
        "नीले सागर के समान"
    ],
    answer: "नीले शंख के समान"
},

{
    question: "बालकृष्ण किस काल के रचनाकार हैं?",
    option: [
        "आदिकाल",
        "भक्तिकाल",
        "रीतिकाल",
        "आधुनिक काल"
    ],
    answer: "आधुनिक काल"
},

{
    question: "सुभद्रा कुमारी चौहान की लिखी कविता कौन-सी है?",
    option: [
        "प्यारे नन्हे बेटे को",
        "पुत्र वियोग",
        "हार-जीत",
        "गाँव का घर"
    ],
    answer: "पुत्र वियोग"
},

{
    question: "नामवर सिंह द्वारा लिखित ‘प्रगीत और समाज’ क्या है?",
    option: [
        "आलोचना",
        "निबंध",
        "एकांकी",
        "आत्मकथा"
    ],
    answer: "निबंध"
},

{
    question: "सुभद्रा कुमारी चौहान का प्रतिनिधि कविता संग्रह कौन है?",
    option: [
        "त्रिधारा",
        "मुकुल",
        "अनामिका",
        "गीतिका"
    ],
    answer: "मुकुल"
},

{
    question: "नामवर सिंह 1970 में किस विश्वविद्यालय में हिन्दी विभाग के अध्यक्ष पद पर प्रोफेसर के रूप में नियुक्त हुए?",
    option: [
        "बनारस हिन्दू विश्वविद्यालय",
        "इलाहाबाद विश्वविद्यालय",
        "दिल्ली विश्वविद्यालय",
        "जोधपुर विश्वविद्यालय"
    ],
    answer: "जोधपुर विश्वविद्यालय"
},
];

// --- Helper: Shuffle questions ---
const shuffleQuestions = (questions) => {
  const shuffled = [...questions];
  for (let i = shuffled.length - 1; i > 0; i--) {
    const j = Math.floor(Math.random() * (i + 1));
    [shuffled[i], shuffled[j]] = [shuffled[j], shuffled[i]];
  }
  return shuffled;
};

// --- Component ---
export default function Hindi12thQuiz() {
  const [started, setStarted] = useState(false);
  const [submitted, setSubmitted] = useState(false);
  const [timer, setTimer] = useState(3600);
  const [questions, setQuestions] = useState([]);
  const [current, setCurrent] = useState(0);
  const [answers, setAnswers] = useState({});
  const [score, setScore] = useState(0);
  const [resultDetails, setResultDetails] = useState([]);
  const [showTimerWarning, setShowTimerWarning] = useState(false);
  const resultRef = useRef(null);

  useEffect(() => {
    if (started && !submitted && timer > 0) {
      const t = setInterval(() => {
        setTimer((p) => {
          if (p <= 60) setShowTimerWarning(true);
          return p - 1;
        });
      }, 1000);
      return () => clearInterval(t);
    }
    if (timer === 0 && started && !submitted) {
      submitExam();
    }
  }, [started, submitted, timer]);

  const startExam = () => {
    const selectedQuestions = shuffleQuestions(hindiQuestions).slice(0, 100);
    setQuestions(selectedQuestions);
    setStarted(true);
    setTimer(3600);
    setAnswers({});
    setCurrent(0);
    setShowTimerWarning(false);
  };

  const submitExam = () => {
    let s = 0;
    const details = questions.map((q, i) => {
      const isCorrect = answers[i] === q.answer;
      if (isCorrect) s++;
      return {
        question: q.question,
        option: q.option,
        correctAnswer: q.answer,
        userAnswer: answers[i] || "प्रयास नहीं किया",
        isCorrect: isCorrect,
        isAttempted: answers[i] !== undefined,
      };
    });
    setScore(s);
    setResultDetails(details);
    setSubmitted(true);
  };

  const downloadResult = () => {
    if (resultRef.current) {
      const printWindow = window.open('', '_blank');
      if (printWindow) {
        const content = resultRef.current.innerHTML;
        printWindow.document.write(`
          <html>
            <head>
              <title>हिंदी 12वीं परिणाम</title>
              <style>
                body { font-family: Arial, sans-serif; padding: 20px; }
                .result-container { max-width: 800px; margin: 0 auto; }
                .header { text-align: center; padding: 20px; background: linear-gradient(135deg, #1a237e, #3f51b5); color: white; border-radius: 10px; margin-bottom: 20px; }
                .score-card { text-align: center; padding: 20px; border: 2px solid #1a237e; border-radius: 10px; margin-bottom: 20px; }
                .score { font-size: 40px; font-weight: bold; color: #1a237e; }
                .status { font-size: 20px; margin: 10px 0; }
                .pass { color: #28a745; }
                .fail { color: #dc3545; }
                .question-item { padding: 15px; margin: 10px 0; border-radius: 8px; border-left: 4px solid #48bb78; background: #f8f9fa; }
                .question-item.wrong { border-left-color: #dc3545; background: #fff5f5; }
                .question-item .q { font-weight: bold; font-size: 14px; }
                .question-item .your-answer { margin-top: 5px; font-size: 13px; }
                .question-item .correct-answer { margin-top: 3px; font-size: 13px; color: #28a745; font-weight: bold; }
                .wrong-answer { color: #dc3545; }
                .correct-answer-text { color: #28a745; }
                .not-attempted { color: #ffc107; }
                .footer { text-align: center; margin-top: 20px; padding: 10px; color: #666; font-size: 12px; border-top: 1px solid #ddd; }
              </style>
            </head>
            <body>
              <div class="result-container">
                ${content}
              </div>
            </body>
          </html>
        `);
        printWindow.document.close();
        printWindow.print();
      }
    }
  };

  const getText = (key) => {
    const texts = {
      'title': { hi: '📖 हिंदी 12वीं' },
      'subtitle': { hi: 'कक्षा 12 हिंदी प्रश्नोत्तरी' },
      'questions': { hi: '📝 प्रश्न' },
      'time': { hi: '⏱️ समय' },
      'instructions': { hi: '📋 निर्देश:' },
      'compulsory': { hi: 'सभी प्रश्न अनिवार्य हैं' },
      'marks': { hi: 'प्रत्येक प्रश्न 1 अंक का है' },
      'negative': { hi: 'कोई नकारात्मक अंकन नहीं' },
      'start': { hi: '🚀 क्विज़ शुरू करें' },
      'answered': { hi: 'उत्तर दिए:' },
      'prev': { hi: '⬅ पिछला' },
      'next': { hi: 'अगला ➡' },
      'submit': { hi: '📤 जमा करें' },
      'navigator': { hi: 'प्रश्न नेविगेटर' },
      'answered_status': { hi: '🟢 उत्तर दिया' },
      'current_status': { hi: '🔵 वर्तमान' },
      'unanswered_status': { hi: '⚪ अनुत्तरित' },
      'congrats': { hi: '🎉 शानदार प्रदर्शन!' },
      'practice': { hi: '📖 सीखते रहें!' },
      'passed': { hi: '✔️ उत्तीर्ण' },
      'failed': { hi: '❌ सुधार की आवश्यकता' },
      'review': { hi: '📋 उत्तर समीक्षा' },
      'your_answer': { hi: 'आपका उत्तर:' },
      'correct_answer': { hi: 'सही उत्तर:' },
      'new_quiz': { hi: '🔄 नई क्विज़ लें' },
      'warning': { hi: '⚠️ 1 मिनट से कम समय शेष!' },
      'download': { hi: '📥 परिणाम डाउनलोड करें' },
      'status': { hi: 'स्थिति' },
      'correct': { hi: 'सही' },
      'wrong': { hi: 'गलत' },
      'not_attempted': { hi: 'प्रयास नहीं किया' },
    };
    return texts[key]?.['hi'] || key;
  };

  // Home Page
  if (!started) {
    return (
      <div style={{
        minHeight: "100vh",
        display: "flex",
        justifyContent: "center",
        alignItems: "center",
        background: "linear-gradient(135deg, #1a237e 0%, #283593 50%, #3f51b5 100%)",
        fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif",
        padding: "20px"
      }}>
        <div style={{
          backgroundColor: "white",
          padding: "25px 20px",
          borderRadius: "16px",
          boxShadow: "0 20px 60px rgba(0,0,0,0.6)",
          textAlign: "center",
          maxWidth: "500px",
          width: "100%",
          animation: "fadeInUp 0.6s ease"
        }}>
          <div style={{ fontSize: "48px", marginBottom: "5px" }}>📖</div>
          <h1 style={{ 
            color: "#1a237e", 
            marginBottom: "3px", 
            fontSize: "22px",
            fontWeight: "700"
          }}>
            {getText('title')}
          </h1>
          <p style={{ color: "#666", fontSize: "12px", marginBottom: "15px" }}>
            {getText('subtitle')}
          </p>
          <div style={{
            height: "3px",
            background: "linear-gradient(90deg, #1a237e, #3f51b5)",
            margin: "10px auto",
            width: "60px"
          }}></div>

          <div style={{
            display: "grid",
            gridTemplateColumns: "1fr 1fr",
            gap: "10px",
            marginTop: "10px"
          }}>
            <div style={{ 
              backgroundColor: "#e8f0fe", 
              padding: "12px", 
              borderRadius: "10px"
            }}>
              <div style={{ fontSize: "11px", color: "#666" }}>{getText('questions')}</div>
              <div style={{ fontSize: "22px", fontWeight: "bold", color: "#1a237e" }}>100</div>
            </div>
            <div style={{ 
              backgroundColor: "#e8f0fe", 
              padding: "12px", 
              borderRadius: "10px"
            }}>
              <div style={{ fontSize: "11px", color: "#666" }}>{getText('time')}</div>
              <div style={{ fontSize: "22px", fontWeight: "bold", color: "#1a237e" }}>60 Mins</div>
            </div>
          </div>

          <div style={{
            backgroundColor: "#e8f0fe",
            padding: "10px",
            borderRadius: "10px",
            marginTop: "10px",
            fontSize: "12px",
            color: "#1a237e"
          }}>
            💡 कक्षा 12 हिंदी (आरोह + वितान) के सभी अध्यायों की व्यापक कवरेज
          </div>

          <div style={{
            backgroundColor: "#f8f9fa",
            padding: "10px",
            borderRadius: "10px",
            marginTop: "10px",
            fontSize: "12px",
            color: "#555",
            textAlign: "left"
          }}>
            <strong>{getText('instructions')}</strong>
            <ul style={{ margin: "5px 0 0 0", paddingLeft: "18px" }}>
              <li>{getText('compulsory')}</li>
              <li>{getText('marks')}</li>
              <li>{getText('negative')}</li>
            </ul>
          </div>

          <button
            onClick={startExam}
            style={{
              padding: "14px 40px",
              fontSize: "18px",
              fontWeight: "bold",
              background: "linear-gradient(135deg, #1a237e 0%, #3f51b5 100%)",
              color: "white",
              border: "none",
              borderRadius: "50px",
              cursor: "pointer",
              marginTop: "20px",
              width: "100%",
              transition: "transform 0.3s, box-shadow 0.3s",
              boxShadow: "0 4px 15px rgba(63, 81, 181, 0.4)"
            }}
            onMouseEnter={(e) => e.target.style.transform = "scale(1.02)"}
            onMouseLeave={(e) => e.target.style.transform = "scale(1)"}
          >
            {getText('start')}
          </button>
        </div>
      </div>
    );
  }

  // Result Page
  if (submitted) {
    const percentage = ((score / questions.length) * 100).toFixed(2);
    const isPassed = percentage >= 60;
    return (
      <div style={{
        minHeight: "100vh",
        background: "#f5f7fa",
        padding: "15px",
        fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif"
      }}>
        <div style={{
          maxWidth: "800px",
          margin: "0 auto"
        }}>
          <div ref={resultRef} style={{
            backgroundColor: "white",
            borderRadius: "16px",
            padding: "25px 20px",
            boxShadow: "0 10px 40px rgba(0,0,0,0.1)",
            textAlign: "center",
            marginBottom: "20px",
            animation: "slideIn 0.5s ease"
          }}>
            <div className="header" style={{
              background: "linear-gradient(135deg, #1a237e, #3f51b5)",
              color: "white",
              padding: "15px",
              borderRadius: "10px",
              marginBottom: "15px"
            }}>
              <h1 style={{ margin: "0", fontSize: "22px" }}>{getText('title')}</h1>
              <p style={{ margin: "5px 0 0", fontSize: "12px", opacity: 0.9 }}>
                कक्षा 12 हिंदी क्विज़
              </p>
            </div>
            
            <h2 style={{ 
              fontSize: "20px", 
              marginBottom: "5px",
              color: "#2d3748"
            }}>
              {isPassed ? getText('congrats') : getText('practice')}
            </h2>
            <div style={{
              width: "80px",
              height: "80px",
              borderRadius: "50%",
              background: isPassed ? "#d4edda" : "#f8d7da",
              display: "flex",
              alignItems: "center",
              justifyContent: "center",
              margin: "15px auto",
              fontSize: "32px"
            }}>
              {isPassed ? "✅" : "📝"}
            </div>
            <div style={{ fontSize: "40px", fontWeight: "bold", color: "#1a237e" }}>
              {score} <span style={{ fontSize: "20px", color: "#888" }}>/ {questions.length}</span>
            </div>
            <div style={{ 
              fontSize: "18px", 
              color: isPassed ? "#28a745" : "#dc3545", 
              marginTop: "5px",
              fontWeight: "600"
            }}>
              {percentage}% {isPassed ? getText('passed') : getText('failed')}
            </div>
            <div style={{
              marginTop: "10px",
              fontSize: "13px",
              color: "#718096"
            }}>
              भाषा: हिन्दी • {getText('negative')}
            </div>

            <div style={{
              marginTop: "15px",
              display: "grid",
              gridTemplateColumns: "1fr 1fr 1fr",
              gap: "10px",
              fontSize: "13px"
            }}>
              <div style={{ backgroundColor: "#d4edda", padding: "8px", borderRadius: "8px", color: "#155724" }}>
                ✅ {getText('correct')}: {resultDetails.filter(r => r.isCorrect).length}
              </div>
              <div style={{ backgroundColor: "#f8d7da", padding: "8px", borderRadius: "8px", color: "#721c24" }}>
                ❌ {getText('wrong')}: {resultDetails.filter(r => !r.isCorrect && r.isAttempted).length}
              </div>
              <div style={{ backgroundColor: "#fff3cd", padding: "8px", borderRadius: "8px", color: "#856404" }}>
                ⚪ {getText('not_attempted')}: {resultDetails.filter(r => !r.isAttempted).length}
              </div>
            </div>
          </div>

          <div style={{ textAlign: "center", marginBottom: "20px" }}>
            <button
              onClick={downloadResult}
              style={{
                padding: "12px 30px",
                fontSize: "15px",
                fontWeight: "bold",
                background: "linear-gradient(135deg, #48bb78 0%, #38a169 100%)",
                color: "white",
                border: "none",
                borderRadius: "50px",
                cursor: "pointer",
                boxShadow: "0 4px 15px rgba(72, 187, 120, 0.4)",
                transition: "all 0.3s ease"
              }}
              onMouseEnter={(e) => e.target.style.transform = "scale(1.02)"}
              onMouseLeave={(e) => e.target.style.transform = "scale(1)"}
            >
              {getText('download')}
            </button>
          </div>

          <div style={{
            backgroundColor: "white",
            borderRadius: "16px",
            padding: "20px 15px",
            boxShadow: "0 10px 40px rgba(0,0,0,0.1)"
          }}>
            <h2 style={{ 
              borderBottom: "2px solid #eee", 
              paddingBottom: "12px", 
              marginBottom: "15px",
              fontSize: "18px",
              color: "#2d3748"
            }}>
              {getText('review')}
            </h2>
            {resultDetails.map((item, index) => (
              <div
                key={index}
                className={item.isCorrect ? '' : 'wrong'}
                style={{
                  backgroundColor: item.isCorrect ? "#f0fff4" : 
                                   item.isAttempted ? "#fff5f5" : "#fff3cd",
                  borderLeft: `4px solid ${item.isCorrect ? "#48bb78" : 
                              item.isAttempted ? "#fc8181" : "#ffc107"}`,
                  padding: "12px 15px",
                  marginBottom: "12px",
                  borderRadius: "8px",
                  animation: `fadeIn 0.3s ease ${index * 0.05}s`
                }}
              >
                <div style={{ display: "flex", justifyContent: "space-between", alignItems: "flex-start" }}>
                  <h4 style={{ 
                    margin: "0", 
                    fontSize: "14px", 
                    color: "#2d3748",
                    flex: 1,
                    marginRight: "10px"
                  }}>
                    Q{index + 1}. {item.question}
                  </h4>
                  <span style={{ fontSize: "18px", flexShrink: 0 }}>
                    {item.isCorrect ? "✅" : item.isAttempted ? "❌" : "⚪"}
                  </span>
                </div>
                <div style={{ marginTop: "8px", marginLeft: "5px", fontSize: "13px" }}>
                  <p style={{ margin: "3px 0" }}>
                    <strong>{getText('your_answer')}</strong>{" "}
                    <span style={{ 
                      color: item.isCorrect ? "#48bb78" : 
                             item.isAttempted ? "#dc3545" : "#ffc107",
                      fontWeight: item.isAttempted ? "bold" : "normal"
                    }}>
                      {item.userAnswer}
                    </span>
                    {!item.isAttempted && (
                      <span style={{ color: "#ffc107", marginLeft: "5px" }}>
                        ({getText('not_attempted')})
                      </span>
                    )}
                  </p>
                  {!item.isCorrect && (
                    <p style={{ margin: "3px 0" }}>
                      <strong>{getText('correct_answer')}</strong>{" "}
                      <span style={{ color: "#48bb78", fontWeight: "bold" }}>{item.correctAnswer}</span>
                    </p>
                  )}
                </div>
              </div>
            ))}
          </div>

          <div style={{ textAlign: "center", marginTop: "20px" }}>
            <button
              onClick={() => {
                setStarted(false);
                setSubmitted(false);
                setAnswers({});
                setResultDetails([]);
                setTimer(3600);
                setShowTimerWarning(false);
                setQuestions([]);
              }}
              style={{
                padding: "14px 35px",
                fontSize: "16px",
                fontWeight: "bold",
                background: "linear-gradient(135deg, #1a237e 0%, #3f51b5 100%)",
                color: "white",
                border: "none",
                borderRadius: "50px",
                cursor: "pointer",
                width: "100%",
                maxWidth: "300px",
                boxShadow: "0 4px 15px rgba(63, 81, 181, 0.4)",
                transition: "transform 0.3s ease"
              }}
              onMouseEnter={(e) => e.target.style.transform = "scale(1.02)"}
              onMouseLeave={(e) => e.target.style.transform = "scale(1)"}
            >
              {getText('new_quiz')}
            </button>
          </div>
        </div>
      </div>
    );
  }

  // Exam Page
  const q = questions[current] || { question: "", option: [], answer: "" };
  const answeredCount = Object.keys(answers).length;

  return (
    <div style={{
      minHeight: "100vh",
      background: "#f5f7fa",
      padding: "10px",
      fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif"
    }}>
      <div style={{
        maxWidth: "800px",
        margin: "0 auto"
      }}>
        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "10px 14px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginBottom: "10px",
          display: "flex",
          justifyContent: "space-between",
          alignItems: "center"
        }}>
          <div style={{ flex: 1 }}>
            <p style={{ 
              margin: "0", 
              fontSize: "11px", 
              color: "#718096"
            }}>
              Q{current + 1}/{questions.length}
            </p>
            <p style={{ 
              margin: "2px 0 0", 
              fontSize: "10px", 
              color: "#a0aec0"
            }}>
              {getText('answered')} {answeredCount}/{questions.length}
            </p>
          </div>
          <div style={{
            fontSize: "20px",
            fontWeight: "bold",
            color: timer < 60 ? "#fc8181" : "#1a237e",
            display: "flex",
            alignItems: "center",
            gap: "6px"
          }}>
            <span style={{ fontSize: "16px" }}>⏱️</span>
            <span>{Math.floor(timer / 60)}:{String(timer % 60).padStart(2, "0")}</span>
          </div>
        </div>

        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "16px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginBottom: "10px",
          animation: "fadeIn 0.3s ease"
        }}>
          <div style={{
            display: "inline-block",
            backgroundColor: "#e8f0fe",
            padding: "2px 10px",
            borderRadius: "12px",
            fontSize: "11px",
            color: "#1a237e",
            marginBottom: "12px"
          }}>
            📌 हिंदी 12वीं
          </div>
          <h3 style={{
            fontSize: "16px",
            color: "#1a237e",
            marginBottom: "16px",
            fontWeight: "600",
            lineHeight: "1.5"
          }}>
            {q.question}
          </h3>

          <div style={{ marginTop: "5px" }}>
            {q.option && q.option.map((op, idx) => (
              <div
                key={idx}
                style={{
                  padding: "10px 12px",
                  margin: "5px 0",
                  backgroundColor: answers[current] === op ? "#ebf8ff" : "#f7fafc",
                  border: answers[current] === op ? "2px solid #3f51b5" : "2px solid transparent",
                  borderRadius: "8px",
                  cursor: "pointer",
                  transition: "all 0.3s ease",
                  display: "flex",
                  alignItems: "center",
                  transform: answers[current] === op ? "scale(1.01)" : "scale(1)"
                }}
                onClick={() => setAnswers({ ...answers, [current]: op })}
                onMouseEnter={(e) => {
                  if (answers[current] !== op) {
                    e.currentTarget.style.backgroundColor = "#f0f0f0";
                    e.currentTarget.style.transform = "scale(1.005)";
                  }
                }}
                onMouseLeave={(e) => {
                  if (answers[current] !== op) {
                    e.currentTarget.style.backgroundColor = "#f7fafc";
                    e.currentTarget.style.transform = "scale(1)";
                  }
                }}
              >
                <input
                  type="radio"
                  id={`q${current}-opt${idx}`}
                  name={`question-${current}`}
                  checked={answers[current] === op}
                  onChange={() => {}}
                  style={{ marginRight: "10px", width: "16px", height: "16px", flexShrink: 0 }}
                />
                <label
                  htmlFor={`q${current}-opt${idx}`}
                  style={{
                    fontSize: "14px",
                    cursor: "pointer",
                    flex: 1,
                    margin: "0",
                    color: "#2d3748"
                  }}
                >
                  {op}
                </label>
              </div>
            ))}
          </div>
        </div>

        <div style={{
          display: "flex",
          gap: "8px",
          flexWrap: "wrap",
          justifyContent: "space-between"
        }}>
          <div style={{ display: "flex", gap: "8px" }}>
            <button
              onClick={() => setCurrent(Math.max(0, current - 1))}
              disabled={current === 0}
              style={{
                padding: "8px 14px",
                fontSize: "13px",
                backgroundColor: current === 0 ? "#e2e8f0" : "#3f51b5",
                color: current === 0 ? "#a0aec0" : "white",
                border: "none",
                borderRadius: "8px",
                cursor: current === 0 ? "not-allowed" : "pointer",
                fontWeight: "600",
                transition: "all 0.3s ease"
              }}
              onMouseEnter={(e) => {
                if (current !== 0) {
                  e.target.style.transform = "scale(1.05)";
                  e.target.style.boxShadow = "0 4px 12px rgba(63, 81, 181, 0.3)";
                }
              }}
              onMouseLeave={(e) => {
                e.target.style.transform = "scale(1)";
                e.target.style.boxShadow = "none";
              }}
            >
              {getText('prev')}
            </button>
            <button
              onClick={() => setCurrent(Math.min(questions.length - 1, current + 1))}
              disabled={current === questions.length - 1}
              style={{
                padding: "8px 14px",
                fontSize: "13px",
                backgroundColor: current === questions.length - 1 ? "#e2e8f0" : "#3f51b5",
                color: current === questions.length - 1 ? "#a0aec0" : "white",
                border: "none",
                borderRadius: "8px",
                cursor: current === questions.length - 1 ? "not-allowed" : "pointer",
                fontWeight: "600",
                transition: "all 0.3s ease"
              }}
              onMouseEnter={(e) => {
                if (current !== questions.length - 1) {
                  e.target.style.transform = "scale(1.05)";
                  e.target.style.boxShadow = "0 4px 12px rgba(63, 81, 181, 0.3)";
                }
              }}
              onMouseLeave={(e) => {
                e.target.style.transform = "scale(1)";
                e.target.style.boxShadow = "none";
              }}
            >
              {getText('next')}
            </button>
          </div>

          <button
            onClick={submitExam}
            style={{
              padding: "8px 18px",
              fontSize: "13px",
              backgroundColor: "#48bb78",
              color: "white",
              border: "none",
              borderRadius: "8px",
              cursor: "pointer",
              fontWeight: "600",
              transition: "all 0.3s ease",
              boxShadow: "0 2px 8px rgba(72, 187, 120, 0.3)"
            }}
            onMouseEnter={(e) => {
              e.target.style.transform = "scale(1.05)";
              e.target.style.boxShadow = "0 4px 15px rgba(72, 187, 120, 0.5)";
            }}
            onMouseLeave={(e) => {
              e.target.style.transform = "scale(1)";
              e.target.style.boxShadow = "0 2px 8px rgba(72, 187, 120, 0.3)";
            }}
          >
            {getText('submit')}
          </button>
        </div>

        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "12px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginTop: "10px"
        }}>
          <p style={{ 
            margin: "0 0 8px 0", 
            color: "#718096", 
            fontSize: "11px", 
            fontWeight: "600" 
          }}>
            {getText('navigator')}
          </p>
          <div style={{
            display: "flex",
            flexWrap: "wrap",
            gap: "5px"
          }}>
            {questions.map((_, idx) => (
              <button
                key={idx}
                onClick={() => setCurrent(idx)}
                style={{
                  width: "32px",
                  height: "32px",
                  fontSize: "11px",
                  backgroundColor: answers[idx] ? "#48bb78" : 
                                   current === idx ? "#3f51b5" : "#e2e8f0",
                  color: answers[idx] ? "white" :
                         current === idx ? "white" : "#4a5568",
                  border: current === idx ? "2px solid #3f51b5" : "none",
                  borderRadius: "6px",
                  cursor: "pointer",
                  fontWeight: "bold",
                  transition: "all 0.3s ease",
                  transform: answers[idx] ? "scale(1.05)" : "scale(1)"
                }}
                onMouseEnter={(e) => {
                  e.target.style.transform = "scale(1.1)";
                }}
                onMouseLeave={(e) => {
                  e.target.style.transform = answers[idx] ? "scale(1.05)" : "scale(1)";
                }}
              >
                {idx + 1}
              </button>
            ))}
          </div>
          <div style={{
            display: "flex",
            gap: "12px",
            marginTop: "8px",
            fontSize: "10px",
            color: "#4a5568",
            flexWrap: "wrap"
          }}>
            <span>{getText('answered_status')}</span>
            <span>{getText('current_status')}</span>
            <span>{getText('unanswered_status')}</span>
          </div>
        </div>

        {showTimerWarning && (
          <div style={{
            position: "fixed",
            bottom: "15px",
            right: "15px",
            left: "15px",
            backgroundColor: "#fc8181",
            color: "white",
            padding: "12px 18px",
            borderRadius: "10px",
            boxShadow: "0 4px 15px rgba(252, 129, 129, 0.4)",
            textAlign: "center",
            fontSize: "14px",
            fontWeight: "600",
            animation: "pulse 1.5s ease-in-out infinite",
            maxWidth: "400px",
            margin: "0 auto"
          }}>
            {getText('warning')}
          </div>
        )}
      </div>
      <style>
        {`
          @keyframes pulse {
            0% { opacity: 1; transform: scale(1); }
            50% { opacity: 0.6; transform: scale(0.98); }
            100% { opacity: 1; transform: scale(1); }
          }
          @keyframes fadeInUp {
            from { opacity: 0; transform: translateY(20px); }
            to { opacity: 1; transform: translateY(0); }
          }
          @keyframes fadeIn {
            from { opacity: 0; transform: translateX(-10px); }
            to { opacity: 1; transform: translateX(0); }
          }
          @keyframes slideIn {
            from { opacity: 0; transform: translateY(-30px); }
            to { opacity: 1; transform: translateY(0); }
          }
        `}
      </style>
    </div>
  );
}