// Philosophy12thQuiz.jsx
import React, { useState, useEffect, useRef } from "react";

// --- 12th Philosophy Question Bank (100 questions) - Hindi & English ---

// Hindi Questions
const philosophyHindi = [
 {
    question: "ह्यूम के अनुभववाद की प्रमुख मान्यता क्या है?",
    option: [
        "कार्य-कारण अनिवार्य नहीं है",
        "कार्य-कारण सम्बन्ध आवश्यक है",
        "अनिवार्यता बाह्य वस्तु तथा घटना में है",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "निम्नलिखित में किसने जगत को जादू को उपमा से समझाने का प्रयास किया है?",
    option: [
        "शंकर",
        "गौड़पाद",
        "रामानुज",
        "इनमें से कोई नहीं"
    ],
    answer: "शंकर"
},

{
    question: "दर्शन का अर्थ है- [2015A]",
    option: [
        "प्रत्यय की खोज",
        "ज्ञान के प्रति प्रेम",
        "अमरत्व की आकांक्षा",
        "नियमों का आविष्कार"
    ],
    answer: "प्रत्यय की खोज"
},

{
    question: "योग है-",
    option: [
        "त्याग",
        "समाधि",
        "ईश्वर के साथ साक्षात्कार",
        "इनमें से कोई नहीं"
    ],
    answer: "ईश्वर के साथ साक्षात्कार"
},

{
    question: "काण्ट के अनुसार बुद्धि के कितने आकार हैं?",
    option: [
        "पाँच",
        "आठ",
        "दस",
        "बारह"
    ],
    answer: "बारह"
},

{
    question: "सांख्य दर्शन के प्रवर्तक हैं-",
    option: [
        "गौतम",
        "कपिल",
        "महावीर",
        "कणाद"
    ],
    answer: "कपिल"
},

{
    question: "‘डिस्कोर्स ऑन मेथड’ ग्रंथ किसकी रचना है?",
    option: [
        "लाइबनिज",
        "स्पिनोजा",
        "देकार्त",
        "लॉक"
    ],
    answer: "देकार्त"
},

{
    question: "भारतीय दर्शन में आत्म-ज्ञान का संबंध है : [2022 A]",
    option: [
        "पुनर्जन्म से",
        "बंधन से",
        "धन संग्रह से",
        "अविद्या के निराकरण से"
    ],
    answer: "अविद्या के निराकरण से"
},

{
    question: "अनुमान का दूसरा नाम क्या है?",
    option: [
        "उपमान",
        "शब्द",
        "अभाव",
        "अन्वीक्षा"
    ],
    answer: "अन्वीक्षा"
},

{
    question: "गौड़पाद किनके गुरु थे?",
    option: [
        "शंकर के",
        "गुरु गोविंद के",
        "वल्लभाचार्य के",
        "इनमें से कोई नहीं"
    ],
    answer: "गुरु गोविंद के"
},

{
    question: "किसके अनुसार पदार्थ ज्ञान सार्वभौम, अनिवार्य एवं नवीन होना चाहिए?",
    option: [
        "देकार्त",
        "लॉक",
        "ह्यूम",
        "काण्ट"
    ],
    answer: "काण्ट"
},

{
    question: "पदार्थशास्त्र किस दर्शन का दूसरा नाम है?",
    option: [
        "न्याय",
        "सांख्य",
        "योग",
        "वैशेषिक"
    ],
    answer: "वैशेषिक"
},

{
    question: "योग दर्शन में चित्तवृत्ति विरोध को कहते हैं-",
    option: [
        "प्राणायाम",
        "समाधि",
        "योग",
        "इनमें से कोई नहीं"
    ],
    answer: "योग"
},

{
    question: "शंकर के अद्वैत वेदांत का दर्शन किस ग्रंथ पर आधारित है?",
    option: [
        "रामायण",
        "महाभारत",
        "पुराण",
        "उपनिषद्"
    ],
    answer: "उपनिषद्"
},

{
    question: "जैन दर्शन के तत्त्वमीमांसीय विचार को क्या कहते हैं?",
    option: [
        "अनेकान्तवाद",
        "शंकर",
        "हेतुवाद",
        "अद्वैतवाद"
    ],
    answer: "अनेकान्तवाद"
},

{
    question: "किसने कहा है कि होना तथा प्रत्यक्ष दोनों एक हैं?",
    option: [
        "देकार्त",
        "स्पिनोजा",
        "बर्कले",
        "लाइबनिज"
    ],
    answer: "बर्कले"
},

{
    question: "ईश्वर के अस्तित्व संबंधी प्रमाण हैं",
    option: [
        "प्रयोजनात्मक युक्ति",
        "नैतिक युक्ति",
        "सत्तामूलक युक्ति",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "ज्ञान प्राप्ति के उपरान्त बुद्ध का पहला उपदेश कहाँ हुआ था?",
    option: [
        "बोध गया में",
        "सारनाथ में",
        "राजगृह में",
        "कुशीनगर में"
    ],
    answer: "सारनाथ में"
},

{
    question: "किसके अनुसार- गीता माता है?",
    option: [
        "बाल गंगाधर तिलक",
        "विनोबा भावे",
        "श्री अरविन्द",
        "महात्मा गाँधी"
    ],
    answer: "महात्मा गाँधी"
},

{
    question: "सर्वोच्च शुभ क्या है?",
    option: [
        "मात्र साधन है",
        "मात्र बाह्य है",
        "चरम लक्ष्य है",
        "इनमें से कोई नहीं"
    ],
    answer: "चरम लक्ष्य है"
},

{
    question: "निम्नलिखित में से कौन पुरुषार्थ के अंतर्गत आता है ? [2022 A]",
    option: [
        "धर्म",
        "मोक्ष",
        "A और B दोनों",
        "प्रेम"
    ],
    answer: "A और B दोनों"
},

{
    question: "बौद्ध दर्शन और जैन दर्शन हैं-",
    option: [
        "अर्वाचीन",
        "समकालीन",
        "वैदिक काल के",
        "इनमें से कोई नहीं"
    ],
    answer: "समकालीन"
},

{
    question: "सांख्य दर्शन में ज्ञान को किस संदर्भ में लिया गया है?",
    option: [
        "पुरुष का ज्ञान",
        "प्रकृति का ज्ञान",
        "पुरुष और प्रकृति के बीच भिन्नता का ज्ञान",
        "इनमें से सभी"
    ],
    answer: "पुरुष और प्रकृति के बीच भिन्नता का ज्ञान"
},

{
    question: "मिल के अनुसार कारण है-",
    option: [
        "भावात्मक उपाधियों का योग",
        "निषेधात्मक उपाधियों का योग",
        "भावात्मक एवं निषेधात्मक उपाधियों का योग",
        "इनमें से कोई नहीं"
    ],
    answer: "भावात्मक एवं निषेधात्मक उपाधियों का योग"
},

{
    question: "बुद्धिवाद का समर्थक है",
    option: [
        "देकार्त",
        "लाइबनिज",
        "स्पिनोजा",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "अनुमान को प्रमाण के रूप में स्वीकार किया है-",
    option: [
        "न्याय दर्शन",
        "सांख्य दर्शन",
        "बौद्ध दर्शन",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "मानव की सामाजिक एकता पर विचार करने वाला दर्शन क्या कहलाता है?",
    option: [
        "आचार दर्शन",
        "समाज दर्शन",
        "धर्म दर्शन",
        "इनमें सभी"
    ],
    answer: "समाज दर्शन"
},

{
    question: "निम्नलिखित में से किसका संबंध जैन दर्शन से रहा है?",
    option: [
        "महावीर",
        "पार्श्वनाथ",
        "ऋषभदेव",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "चार्वाक, बौद्ध एवं जैन निम्न में से किस दार्शनिक सम्प्रदाय में आते हैं? [2009A, 2023A]",
    option: [
        "आस्तिक",
        "नास्तिक",
        "आस्तिक एवं नास्तिक",
        "इनमें से कोई नहीं"
    ],
    answer: "नास्तिक"
},

{
    question: "निम्न में से कौन चिन्तक कारणता के सिद्धांत से संबंधित हैं?",
    option: [
        "ह्यूम",
        "मिल",
        "अरस्तु",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "निम्न में से कौन एक बुद्धिवादी है?",
    option: [
        "लॉक",
        "बर्कले",
        "देकार्त",
        "काण्ट"
    ],
    answer: "देकार्त"
},

{
    question: "भारतीय दर्शन को अवतार की अवधारणा के द्वारा सम्प्रदाय किस ग्रंथ ने किया है ? [2022 A]",
    option: [
        "ब्रह्म सूत्र",
        "भगवद् गीता",
        "न्याय सूत्र",
        "शंकर भाष्य"
    ],
    answer: "भगवद् गीता"
},

{
    question: "भगवद्गीता को कर्मशास्त्र किसने कहा?",
    option: [
        "भगवान दास",
        "बाल गंगाधर तिलक",
        "गाँधीजी",
        "पं. नेहरू"
    ],
    answer: "बाल गंगाधर तिलक"
},

{
    question: "किसका उपदेश ज्ञान का स्रोत है?",
    option: [
        "आम पुरुष",
        "आप्त पुरुष",
        "आप्त स्त्री",
        "(B) और (C) दोनों"
    ],
    answer: "आप्त पुरुष"
},

{
    question: "सांख्य दर्शन की प्रमुख विशेषता क्या है?",
    option: [
        "शुद्ध एकवाद",
        "अनेकवाद",
        "द्वैतवाद",
        "इनमें से कोई नहीं"
    ],
    answer: "द्वैतवाद"
},

{
    question: "निष्काम कर्म का मूल सिद्धांत है",
    option: [
        "शारीरिक सुख",
        "कर्तव्य के लिए कर्तव्य",
        "(A) एवं (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "कर्तव्य के लिए कर्तव्य"
},

{
    question: "योग के अनुशासन के आलोक में अहिंसा क्या है?",
    option: [
        "तप",
        "नियम",
        "यम",
        "संतोष"
    ],
    answer: "यम"
},

{
    question: "चतुर्थ आर्य सत्य को कहा जाता है-",
    option: [
        "मध्यम मार्ग",
        "अष्टांगिक मार्ग",
        "(A) एवं (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "अष्टांगिक मार्ग"
},

{
    question: "वस्तुवाद की क्या मान्यता है?",
    option: [
        "ज्ञेय पदार्थ ज्ञाता पर निर्भर है",
        "ज्ञेय पदार्थ ज्ञाता से स्वतंत्र है",
        "(A) और (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "ज्ञेय पदार्थ ज्ञाता से स्वतंत्र है"
},

{
    question: "प्रकृति के गुण हैं-",
    option: [
        "सत्व, रज, तम",
        "सत्व, रज, अर्थ",
        "सत्व, रज, धर्म",
        "इनमें से सभी"
    ],
    answer: "सत्व, रज, तम"
},

{
    question: "नवीन वस्तुवाद का संबंध किन दार्शनिकों से है ?",
    option: [
        "मूर",
        "रसेल",
        "पेरी",
        "इन सभी"
    ],
    answer: "इन सभी"
},

{
    question: "किस आस्तिक दर्शन में ईश्वर के अस्तित्व को स्वीकार नहीं किया गया है?",
    option: [
        "न्याय दर्शन",
        "वैशेषिक दर्शन",
        "सांख्य दर्शन",
        "योग दर्शन"
    ],
    answer: "सांख्य दर्शन"
},

{
    question: "शंकर अद्वैत को कहते हैं-",
    option: [
        "शरीर",
        "ईश्वर",
        "ब्रह्म",
        "इनमें से सभी"
    ],
    answer: "ब्रह्म"
},

{
    question: "स्यादवाद को समझाने के लिए जैन दर्शन में कितने नयों का प्रतिपादन किया गया?",
    option: [
        "चार",
        "तीन",
        "पाँच",
        "सात"
    ],
    answer: "सात"
},

{
    question: "मोक्ष के दो प्रकार हैं- [2015A]",
    option: [
        "भाव एवं द्रव्य",
        "द्रव्य एवं निर्जरा",
        "भाव एवं जीव",
        "जीव एवं अजीव"
    ],
    answer: "जीव एवं अजीव"
},

{
    question: "निम्नलिखित में कौन ज्ञान का अवरोध करता है?",
    option: [
        "सत्त्व",
        "रजस्",
        "तमस्",
        "इनमें से कोई नहीं"
    ],
    answer: "तमस्"
},

{
    question: "जैन धर्म के प्रथम तीर्थंकर कौन हैं?",
    option: [
        "ऋषभदेव",
        "महावीर",
        "पार्श्वनाथ",
        "इनमें से कोई नहीं"
    ],
    answer: "ऋषभदेव"
},

{
    question: "जैन दर्शन में स्यादवाद की क्या विशेषता है?",
    option: [
        "स्यादवाद निरपेक्ष का विचार है",
        "स्यादवाद सापेक्षवाद है",
        "स्यादवाद का संबंध पंचमहाभूत से है",
        "इनमें से कोई नहीं"
    ],
    answer: "स्यादवाद सापेक्षवाद है"
},

{
    question: "न्याय दर्शन में अनुमान प्रमाण के आवश्यक अंग क्या हैं?",
    option: [
        "हेतु",
        "साध्य",
        "पक्ष",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "प्रमाता किसे कहते हैं? [2021A]",
    option: [
        "ज्ञान के साधन को",
        "ज्ञान की वस्तु को",
        "ज्ञान प्राप्त करने वाले को",
        "इनमें से कोई नहीं"
    ],
    answer: "ज्ञान प्राप्त करने वाले को"
},

{
    question: "प्रयोजनात्मक युक्ति का संबंध किससे है?",
    option: [
        "ईश्वर के अस्तित्व से",
        "आत्मा के अस्तित्व से",
        "जड़ के अस्तित्व से",
        "इनमें से कोई नहीं"
    ],
    answer: "जड़ के अस्तित्व से"
},

{
    question: "प्रतित्यसमुत्पाद के सिद्धांत का क्या दार्शनिक अर्थ है?",
    option: [
        "वस्तुएँ अपनी उत्पत्ति के लिए दूसरे हेतु पर निर्भर हैं",
        "वस्तुएँ नित्य हैं",
        "वस्तुओं का पूर्ण विनाश होता है",
        "इनमें से सभी"
    ],
    answer: "वस्तुएँ अपनी उत्पत्ति के लिए दूसरे हेतु पर निर्भर हैं"
},

{
    question: "किसने कहा है- “मनुष्य सभी वस्तुओं का मापदण्ड है”?",
    option: [
        "अरस्तू",
        "प्लेटो",
        "सोफिस्ट",
        "बेन"
    ],
    answer: "सोफिस्ट"
},

{
    question: "अनुपयुक्त नीतिशास्त्र का प्रणेता किसको माना जाता है?",
    option: [
        "मिल",
        "काण्ट",
        "पीटर सिंगर",
        "मूर"
    ],
    answer: "काण्ट"
},

{
    question: "नीति शून्य कर्म क्या है?",
    option: [
        "अच्छा कर्म",
        "अनुचित कर्म",
        "वैसा कर्म जिस पर नैतिक निर्णय नहीं दिया जाता है।",
        "इनमें से कोई नहीं"
    ],
    answer: "वैसा कर्म जिस पर नैतिक निर्णय नहीं दिया जाता है।"
},

{
    question: "गीता का उपदेश है-",
    option: [
        "सकाम कर्म",
        "निष्काम कर्म",
        "कर्म से संन्यास",
        "इनमें से सभी"
    ],
    answer: "निष्काम कर्म"
},

{
    question: "निम्न में से किस युक्ति का मानना है कि विश्व एक कार्य है और ईश्वर उसका कारण है?",
    option: [
        "तात्विक युक्ति",
        "प्रयोजनमूलक युक्ति",
        "विश्वमूलक युक्ति",
        "इनमें से कोई नहीं"
    ],
    answer: "विश्वमूलक युक्ति"
},

{
    question: "भारतीय दर्शन के किस पक्ष का प्रतिनिधित्व योग दर्शन करता है?",
    option: [
        "सांसारिक पक्ष",
        "व्यावहारिक पक्ष",
        "सामाजिक पक्ष",
        "इनमें से कोई नहीं"
    ],
    answer: "व्यावहारिक पक्ष"
},

{
    question: "ज्ञान के साधन के दृष्टिकोण से कौन-सी दार्शनिक परम्परा एकांगी है?",
    option: [
        "बुद्धिवाद",
        "अनुभववाद",
        "(A) और (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "(A) और (B) दोनों"
},

{
    question: "वैशेषिक के सृष्टिवाद को क्या कहा जाता है?",
    option: [
        "अणु सृष्टिवाद",
        "परमाणु सृष्टिवाद",
        "अणु एवं परमाणु सृष्टिवाद",
        "इनमें से कोई नहीं"
    ],
    answer: "परमाणु सृष्टिवाद"
},

{
    question: "बुद्धिवाद का आदर्श क्या है?",
    option: [
        "गणित",
        "रेखागणित",
        "(A) और (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "गणित"
},

{
    question: "शंकराचार्य ने किस दर्शन को प्रतिपादित किया है ?",
    option: [
        "द्वैतवाद",
        "विशिष्टाद्वैतवाद",
        "भेदाभेदवाद",
        "अद्वैतवाद"
    ],
    answer: "अद्वैतवाद"
},

{
    question: "‘पर्यावरण’ शब्द किससे बना है?",
    option: [
        "इन्वायरनर",
        "इन्वायर",
        "इन्वायरनर",
        "इनमें से सभी"
    ],
    answer: "इन्वायरनर"
},

{
    question: "निम्नलिखित में कौन-सा दर्शन बौद्धिक है?",
    option: [
        "भारतीय दर्शन",
        "पाश्चात्य दर्शन",
        "A एवं B दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "पाश्चात्य दर्शन"
},

{
    question: "प्रमा के कारण को क्या कहते हैं?",
    option: [
        "अप्रमा",
        "अप्रमाण",
        "प्रमाण",
        "इनमें से सभी"
    ],
    answer: "प्रमाण"
},

{
    question: "नीतिशास्त्र एवं समाज दर्शन के बीच संबंध है-",
    option: [
        "घनिष्ठ",
        "विरोधात्मक",
        "घनिष्ठ और विरोधात्मक",
        "इनमें से कोई नहीं"
    ],
    answer: "घनिष्ठ"
},

{
    question: "कौन से प्रमाण से सीमित ज्ञान प्राप्त होता है ?",
    option: [
        "प्रत्यक्ष",
        "अनुमान",
        "उपमान",
        "शब्द"
    ],
    answer: "प्रत्यक्ष"
},

{
    question: "निम्नलिखित में कौन-सा कथन अनुभववाद से सम्बद्ध है?",
    option: [
        "ज्ञान प्राप्ति का एकमात्र साधन इन्द्रियानुभूति है",
        "विवेक ही ज्ञान प्राप्ति का एकमात्र साधन है",
        "(A) और (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "ज्ञान प्राप्ति का एकमात्र साधन इन्द्रियानुभूति है"
},

{
    question: "अनेक कारणों के मेल से उत्पन्न संयुक्त कार्य को कहते हैं-",
    option: [
        "कारण-संयोग",
        "कार्य सम्मिश्रण",
        "बहुकारणवाद",
        "इनमें से कोई नहीं"
    ],
    answer: "कार्य सम्मिश्रण"
},

{
    question: "न्याय दर्शन के शब्द होते हैं-",
    option: [
        "नित्य",
        "अनित्य",
        "नित्य एवं अनित्य",
        "इनमें से कोई नहीं"
    ],
    answer: "अनित्य"
},

{
    question: "भारतीय दर्शन में प्रत्ययवाद का उदाहरण है-",
    option: [
        "योगाचार विज्ञानवाद",
        "सांख्य",
        "मीमांसा",
        "जैन"
    ],
    answer: "योगाचार विज्ञानवाद"
},

{
    question: "हेत्वाभास क्या है?",
    option: [
        "अनुमान से संबंधित दोष",
        "प्रत्यक्ष से संबंधित दोष",
        "शब्द प्रमाण से संबंधित दोष",
        "इनमें से कोई नहीं"
    ],
    answer: "अनुमान से संबंधित दोष"
},

{
    question: "पदार्थ में विद्यमान योग्य शक्ति को कौन-सा कारण कहते हैं?",
    option: [
        "द्रव्य कारण",
        "आकारिक कारण",
        "योग्य निमित्त कारण",
        "अंतिम कारण"
    ],
    answer: "योग्य निमित्त कारण"
},

{
    question: "जैन दर्शन के परामर्श कितने प्रकार के माने गए हैं?",
    option: [
        "एक",
        "चार",
        "पाँच",
        "सात"
    ],
    answer: "सात"
},

{
    question: "\"शंकर का दर्शन संगीत पूर्णता और गंभीरता में प्रथम स्थान रखता है।\" यह कथन किसका है?",
    option: [
        "डॉ० राधाकृष्णन",
        "चार्ल्स इलियट",
        "डॉ० दास गुप्ता",
        "इनमें से कोई नहीं"
    ],
    answer: "चार्ल्स इलियट"
},

{
    question: "गीता के अनुसार योग है-",
    option: [
        "त्याग",
        "समाधि",
        "ईश्वर से मिलन",
        "इनमें से कोई नहीं"
    ],
    answer: "ईश्वर से मिलन"
},

{
    question: "बौद्ध दर्शन को नास्तिक दर्शन क्यों कहते हैं?",
    option: [
        "क्योंकि यह चेतना को स्वीकार करता है",
        "क्योंकि यह पुनर्जन्म को स्वीकार करता है",
        "क्योंकि यह वेद की प्रामाणिकता को अस्वीकार करता है",
        "इनमें से सभी"
    ],
    answer: "क्योंकि यह वेद की प्रामाणिकता को अस्वीकार करता है"
},

{
    question: "बहुकारणवाद का अर्थ है-",
    option: [
        "कारणों का संयोग",
        "कार्यों का सम्मिश्रण",
        "एक घटना का एक कारण होना",
        "एक घटना के भिन्न समय में भिन्न कारण होना"
    ],
    answer: "एक घटना के भिन्न समय में भिन्न कारण होना"
},

{
    question: "ऋण के प्रकार क्या हैं?",
    option: [
        "ऋषि",
        "देव",
        "पितृ",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "वैशेषिक दर्शन का दूसरा नाम क्या है?",
    option: [
        "औलूक्य",
        "उलूक",
        "औलूक",
        "इनमें से सभी"
    ],
    answer: "औलूक्य"
},

{
    question: "काण्ट के ज्ञान-विचार को कहते हैं-",
    option: [
        "समीक्षावाद",
        "अनुभववाद",
        "बुद्धिवाद",
        "इनमें से कोई नहीं"
    ],
    answer: "समीक्षावाद"
},

{
    question: "सांख्य के अनुसार गुणों की संख्या है-",
    option: [
        "अनन्त",
        "दो",
        "पाँच",
        "इनमें कोई नहीं"
    ],
    answer: "इनमें कोई नहीं"
},

{
    question: "पंचावयव का संबंध किस प्रमाण से होता है?",
    option: [
        "शब्द",
        "प्रत्यक्ष",
        "उपमान",
        "इनमें से कोई नहीं"
    ],
    answer: "इनमें से कोई नहीं"
},

{
    question: "काण्ट के अनुसार ज्ञान के लिए क्या आवश्यक है?",
    option: [
        "अनुभव",
        "बुद्धि",
        "अनुभव और बुद्धि दोनों",
        "इनमें कोई नहीं"
    ],
    answer: "अनुभव और बुद्धि दोनों"
},

{
    question: "दुःख के कारणों का निवारण है-",
    option: [
        "चतुर्थ आर्य सत्य",
        "तृतीय आर्य सत्य",
        "द्वितीय आर्य सत्य",
        "प्रथम आर्य सत्य"
    ],
    answer: "तृतीय आर्य सत्य"
},

{
    question: "डॉ० राधाकृष्णन के अनुसार माया के दो कार्य हैं। वे हैं-",
    option: [
        "सत्य पर पर्दा डालना",
        "असत्य को प्रस्थापित करना",
        "(A) एवं (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "(A) एवं (B) दोनों"
},

{
    question: "जैन दर्शन के चौबीसवें तीर्थंकर कौन हैं?",
    option: [
        "ऋषभदेव",
        "पार्श्वनाथ",
        "गौतम",
        "इनमें से कोई नहीं"
    ],
    answer: "इनमें से कोई नहीं"
},

{
    question: "विश्वसनीय व्यक्ति को कहते हैं-",
    option: [
        "आप्त पुरुष",
        "परम पुरुष",
        "सामान्य",
        "इनमें से कोई नहीं"
    ],
    answer: "आप्त पुरुष"
},

{
    question: "बुद्ध के तृतीय आर्यसत्य में क्या कहा गया है?",
    option: [
        "दुःख है",
        "दुःख का कारण है",
        "दुःख के कारण का निवारण संभव है",
        "दुःख निवारण का मार्ग है"
    ],
    answer: "दुःख के कारण का निवारण संभव है"
},

{
    question: "वैशेषिक दर्शन के अनुसार पदार्थ कितने हैं?",
    option: [
        "सात",
        "चार",
        "दो",
        "एक"
    ],
    answer: "सात"
},

{
    question: "निम्न में कौन नास्तिक दर्शन है? [2010A]",
    option: [
        "न्याय दर्शन",
        "सांख्य दर्शन",
        "योग दर्शन",
        "इनमें से कोई नहीं"
    ],
    answer: "इनमें से कोई नहीं"
},

{
    question: "निम्नलिखित में अरस्तु के कारण के प्रकार कौन से हैं?",
    option: [
        "द्रव्य कारण",
        "आकारिक कारण",
        "अंतिम कारण",
        "इनमें सभी"
    ],
    answer: "इनमें सभी"
},

{
    question: "सरल प्रत्यय और जटिल प्रत्यय का विचार किस अनुभववादी दर्शन में है?",
    option: [
        "लॉक",
        "बर्कले",
        "ह्यूम",
        "इनमें कोई नहीं"
    ],
    answer: "लॉक"
},

{
    question: "नैतिक दर्शन किस पद से जाना जाता है?",
    option: [
        "इयथास",
        "इथिक्स",
        "इथिक्स",
        "इनमें से कोई नहीं"
    ],
    answer: "इथिक्स"
},

{
    question: "पर्यावरण का संबंध किससे है?",
    option: [
        "केवल पशु से",
        "केवल मनुष्य से",
        "देवता से",
        "प्रकृति के संतुलन से"
    ],
    answer: "प्रकृति के संतुलन से"
},

{
    question: "शुभ के प्रकार हैं-",
    option: [
        "सापेक्ष शुभ",
        "निरपेक्ष शुभ",
        "(A) एवं (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "(A) एवं (B) दोनों"
},

{
    question: "निम्नलिखित में से किस युक्ति को कारणतामूलक युक्ति कहा जा सकता है?",
    option: [
        "विश्वमूलक",
        "तात्विक",
        "प्रयोजनमूलक",
        "नैतिक"
    ],
    answer: "प्रयोजनमूलक"
},

{
    question: "\"ज्ञान की प्राप्ति जन्मजात प्रत्यय से होती है\" ऐसा मानना है-",
    option: [
        "अनुभववाद का",
        "बुद्धिवाद का",
        "समीक्षावाद का",
        "इनमें से कोई नहीं"
    ],
    answer: "बुद्धिवाद का"
},

{
    question: "प्रकृति का गुण तमस का काल रंग किस बात का सूचक माना जाता है? [2021A]",
    option: [
        "जड़ता या भारीपन का",
        "सक्रियता का",
        "परमानंद का",
        "इनमें से सभी"
    ],
    answer: "जड़ता या भारीपन का"
},

{
    question: "अनेकान्तवाद की आधारशिला है-",
    option: [
        "नयवाद",
        "स्वादवाद",
        "मोक्षवाद",
        "पुद्गलवाद"
    ],
    answer: "स्वादवाद"
},

{
    question: "योग के अष्टांग साधन में प्रथम अंग कौन है?",
    option: [
        "नियम",
        "यम",
        "आसन",
        "प्राणायाम"
    ],
    answer: "यम"
},

{
    question: "फिलॉसॉफी का अर्थ है- [2010A, 2013A, 2018A]",
    option: [
        "नियमों का आविष्कार",
        "ज्ञान के प्रति प्रेम",
        "अमरत्व की आकांक्षा",
        "प्रत्यय की खोज"
    ],
    answer: "ज्ञान के प्रति प्रेम"
},

{
    question: "भारतीय दर्शन है- [2011A, 15A, 16A, 18A, 23A]",
    option: [
        "व्यावहारिक",
        "अव्यावहारिक",
        "परिकल्पनात्मक",
        "इनमें से कोई नहीं"
    ],
    answer: "व्यावहारिक"
},

{
    question: "वैशेषिक दर्शन में सामान्य पदार्थ के संदर्भ में निम्नलिखित में से कौन-सा विकल्प सही है?",
    option: [
        "अभाव",
        "भाव",
        "भावाभाव",
        "इनमें से सभी"
    ],
    answer: "भाव"
},

{
    question: "‘धर्म चक्रप्रवर्तन’ का संबंध किस दर्शन से है?",
    option: [
        "जैन दर्शन",
        "बौद्ध दर्शन",
        "सांख्य दर्शन",
        "योग दर्शन"
    ],
    answer: "बौद्ध दर्शन"
},

{
    question: "किनके मतानुसार गीता महाभारत का अंग है?",
    option: [
        "अरविन्द घोष",
        "महात्मा गांधी",
        "डॉ. राधाकृष्णन",
        "बाल गंगाधर तिलक"
    ],
    answer: "डॉ. राधाकृष्णन"
},

{
    question: "कारण होता है-",
    option: [
        "पूर्ववर्ती",
        "अनौपाधिक",
        "नियत",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "योग दर्शन के प्रवर्तक हैं-",
    option: [
        "कपिल",
        "गौतम",
        "पतंजलि",
        "कणाद"
    ],
    answer: "पतंजलि"
},

{
    question: "बुद्धिवाद और अनुभववाद का टकराव किसके दर्शन में समाप्त होता है?",
    option: [
        "लाइबनिज",
        "ह्यूम",
        "बर्कले",
        "काण्ट"
    ],
    answer: "काण्ट"
},

{
    question: "न्याय दर्शन के प्रणेता हैं-",
    option: [
        "गौतम बुद्ध",
        "महर्षि गौतम",
        "कणाद",
        "जैमिनि"
    ],
    answer: "महर्षि गौतम"
},

{
    question: "आत्मा यथार्थतः-",
    option: [
        "भोक्ता है",
        "कर्ता है",
        "भोक्ता एवं कर्ता है",
        "इनमें से कोई नहीं"
    ],
    answer: "इनमें से कोई नहीं"
},

{
    question: "वैशेषिक दर्शन के प्रणेता हैं-",
    option: [
        "गौतम",
        "कणाद",
        "कपिल",
        "जैमिनि"
    ],
    answer: "कणाद"
},

{
    question: "देकार्त ने स्वीकारा है",
    option: [
        "समानान्तरवाद को",
        "अन्तक्रियावाद को",
        "पूर्वस्थापित सामंजस्यवाद को",
        "इनमें से कोई नहीं"
    ],
    answer: "अन्तक्रियावाद को"
},

{
    question: "तत्त्वतर्कम् अनुमानम् किसका मत है?",
    option: [
        "सांख्य का",
        "न्याय का",
        "बौद्ध का",
        "जैन का"
    ],
    answer: "न्याय का"
},

{
    question: "न्याय के द्वारा कितने प्रमाणों को स्वीकार किया गया है?",
    option: [
        "एक",
        "दो",
        "तीन",
        "चार"
    ],
    answer: "चार"
},

{
    question: "निम्नलिखित में से कौन दार्शनिक ज्ञान को ‘संश्लेषणात्मक प्रागनुभविक निर्णयों के एकतंत्र’ के रूप में परिभाषित करते हैं?",
    option: [
        "लॉक",
        "बर्कले",
        "काण्ट",
        "सुकरात"
    ],
    answer: "काण्ट"
},

{
    question: "निम्नलिखित में से कौन एक कथन सही है?",
    option: [
        "अधिकार और कर्तव्य एक-दूसरे से स्वतंत्र हैं",
        "अधिकार और कर्तव्य सापेक्ष हैं",
        "अधिकार कर्तव्य का विरोधी है",
        "इनमें से कोई नहीं"
    ],
    answer: "अधिकार और कर्तव्य सापेक्ष हैं"
},

{
    question: "अनेकान्तवाद और स्यादवाद किस दर्शन के बहुलतावादी यथार्थ सापेक्षवाद के ही दो रूप हैं?",
    option: [
        "जैन दर्शन",
        "बौद्ध दर्शन",
        "वेदांत दर्शन",
        "चार्वाक दर्शन"
    ],
    answer: "जैन दर्शन"
},

{
    question: "वस्तुएँ ज्ञाता से स्वतंत्र होती हैं, यह विचार है-",
    option: [
        "बुद्धिवाद",
        "प्रत्ययवाद",
        "वस्तुवाद",
        "समीक्षावाद"
    ],
    answer: "समीक्षावाद"
},

{
    question: "मीमांसा दर्शन है-",
    option: [
        "कर्मप्रधान",
        "आत्मप्रधान",
        "धर्मप्रधान",
        "इनमें से कोई नहीं"
    ],
    answer: "आत्मप्रधान"
},

{
    question: "शंकर के अनुसार माया क्या है?",
    option: [
        "ब्रह्म",
        "ब्रह्म की शक्ति",
        "कल्पनात्मक सत्ता",
        "इनमें से कोई नहीं"
    ],
    answer: "ब्रह्म की शक्ति"
},

{
    question: "वाक्यार्थ की कितनी शर्तें को न्याय दर्शन में माना जाता है?",
    option: [
        "एक",
        "दो",
        "तीन",
        "चार"
    ],
    answer: "चार"
},

{
    question: "त्रिगुण होते हैं-",
    option: [
        "तम",
        "रज",
        "गुण",
        "इनमें से कोई नहीं"
    ],
    answer: "रज"
},

{
    question: "वैशेषिक के अनुसार निम्नांकित में कौन द्रव्य नहीं है?",
    option: [
        "कर्म",
        "पृथ्वी",
        "काल",
        "आत्मा"
    ],
    answer: "कर्म"
},

{
    question: "भारतीय दर्शन के किस सम्प्रदाय में पदार्थ और द्रव्य की विस्तृत विवेचना मिलती है ? [2022 A]",
    option: [
        "योग दर्शन",
        "वैशेषिक दर्शन",
        "अद्वैत वेदांत",
        "मीमांसा दर्शन"
    ],
    answer: "वैशेषिक दर्शन"
},

{
    question: "भारतीय दर्शन के अंतर्गत निम्नलिखित में से कौन दर्शन आते हैं? [2021A]",
    option: [
        "अद्वैतवाद",
        "द्वैतवाद",
        "विशिष्टाद्वैतवाद",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "वैशेषिक दर्शन का समान तंत्र कौन दर्शन है?",
    option: [
        "योग दर्शन",
        "बौद्ध दर्शन",
        "जैन दर्शन",
        "न्याय दर्शन"
    ],
    answer: "न्याय दर्शन"
},

{
    question: "किस अनुभववादी ने जड़ पदार्थ का पूर्णतः निषेध किया और अध्यात्मवाद की स्थापना की?",
    option: [
        "लॉक",
        "बर्कले",
        "ह्यूम",
        "काण्ट"
    ],
    answer: "बर्कले"
},

{
    question: "लाइबनित्स का चिबिन्दु किसका उदाहरण है ?",
    option: [
        "स्याद्वाद",
        "आध्यात्मिक बहुतत्ववाद",
        "अनेकान्तवाद",
        "इनमें से कोई नहीं"
    ],
    answer: "आध्यात्मिक बहुतत्ववाद"
},

{
    question: "जिसके पास समबुद्धि होती है, उसे कहते हैं-",
    option: [
        "मुनि",
        "स्थितप्रज्ञ",
        "योगी",
        "इनमें से कोई नहीं"
    ],
    answer: "स्थितप्रज्ञ"
},

{
    question: "योग दर्शन के अनुसार योग का अर्थ है-",
    option: [
        "मिलन",
        "चित्तवृत्ति निरोध",
        "यम",
        "नियम"
    ],
    answer: "चित्तवृत्ति निरोध"
},

{
    question: "स्वप्न या भ्रम किस सत्ता के विषय हैं?",
    option: [
        "प्रतिभाषित सत्ता",
        "व्यावहारिक सत्ता",
        "पारमार्थिक सत्ता",
        "इनमें से कोई नहीं"
    ],
    answer: "प्रतिभाषित सत्ता"
},

{
    question: "निम्नलिखित में कौन दण्ड के सिद्धांत हैं?",
    option: [
        "निरोधक सिद्धांत",
        "सुधारक सिद्धांत",
        "प्रतिकारात्मक सिद्धांत",
        "ये सभी"
    ],
    answer: "ये सभी"
},

{
    question: "किस बुद्धिवादी दार्शनिक ने कहा है कि चिद्-बिन्दु शाश्वत होते हैं?",
    option: [
        "देकार्त",
        "स्पिनोजा",
        "लाइबनिज",
        "इनमें से कोई नहीं"
    ],
    answer: "लाइबनिज"
},

{
    question: "जैन दर्शन में सर्वज्ञानी संत को क्या कहा जाता है?",
    option: [
        "अर्हत",
        "योगी",
        "तीर्थंकर",
        "इनमें से कोई नहीं"
    ],
    answer: "तीर्थंकर"
},

{
    question: "चार्वाक दर्शन है- [2014A]",
    option: [
        "भौतिकवादी",
        "आध्यात्मवादी",
        "A एवं B दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "भौतिकवादी"
},

{
    question: "दर्शनशास्त्र की विषयवस्तु का स्वरूप कैसा है? [2021A]",
    option: [
        "व्यापक",
        "संकीर्ण",
        "आंशिक",
        "इनमें से कोई नहीं"
    ],
    answer: "व्यापक"
},

{
    question: "भारतीय दर्शन में यथार्थ ज्ञान कहलाता है-",
    option: [
        "अप्रमा",
        "प्रमा",
        "ख्याती",
        "इनमें से कोई नहीं"
    ],
    answer: "प्रमा"
},

{
    question: "न्याय दर्शन का केंद्रीय विचार है",
    option: [
        "नैतिक",
        "सौंदर्य",
        "राजनीतिक",
        "ज्ञान मीमांसीय"
    ],
    answer: "ज्ञान मीमांसीय"
},

{
    question: "पर्यावरण का संबंध है-",
    option: [
        "पशु से",
        "मनुष्य से",
        "देवता से",
        "वनस्पति से"
    ],
    answer: "वनस्पति से"
},

{
    question: "बुद्धिवादी दार्शनिक के अनुसार ज्ञान के प्रकार हैं",
    option: [
        "साधारण ज्ञान",
        "दार्शनिक ज्ञान",
        "(A) और (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "(A) और (B) दोनों"
},

{
    question: "जैन मतावलंबियों के अनुसार वेदांत और बौद्ध दर्शन किसका पोषक है?",
    option: [
        "अनेकान्तवाद",
        "एकान्तवाद",
        "(A) एवं (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "एकान्तवाद"
},

{
    question: "बौद्ध दर्शन में दुःख के कितने कारण हैं?",
    option: [
        "चार",
        "आठ",
        "बारह",
        "चौबीस"
    ],
    answer: "बारह"
},

{
    question: "निम्नलिखित में से कौन भारतीय दार्शनिक नहीं हैं? [2021A]",
    option: [
        "अरस्तू",
        "कपिल",
        "पतंजलि",
        "जैमिनी"
    ],
    answer: "अरस्तू"
},

{
    question: "किसके अंतिम भाग को उपनिषद् कहते हैं?",
    option: [
        "पुराण",
        "ज्ञान",
        "वेद",
        "इनमें से कोई नहीं"
    ],
    answer: "वेद"
},

{
    question: "अनुभववाद के समर्थक हैं",
    option: [
        "देकार्त",
        "स्पिनोजा",
        "ह्यूम",
        "काण्ट"
    ],
    answer: "ह्यूम"
},

{
    question: "गीता में परमात्मा के कौन स्वरूप बताए गए हैं?",
    option: [
        "व्यक्त",
        "अव्यक्त",
        "व्यक्त एवं अव्यक्त",
        "इनमें से कोई नहीं"
    ],
    answer: "व्यक्त एवं अव्यक्त"
},

{
    question: "कर्म शब्द की उत्पत्ति हुई है- [2014A, 2023A]",
    option: [
        "लृ धातु से",
        "कर्म धातु से",
        "कृ धातु से",
        "इनमें से कोई नहीं"
    ],
    answer: "कृ धातु से"
},

{
    question: "जैन दर्शन निम्नलिखित में से किसे स्वीकार करता है?",
    option: [
        "स्यादवाद",
        "आरंभवाद",
        "अनात्मवाद",
        "विवर्तवाद"
    ],
    answer: "स्यादवाद"
},

{
    question: "व्यापार नीतिशास्त्र किस दिशा में केन्द्रित है?",
    option: [
        "नैतिक शब्दों के विश्लेषण से",
        "ऋणदाताओं को बल प्रदान करने में",
        "व्यापार के क्षेत्र में नैतिक मूल्यों को स्थापित करने में",
        "इनमें से कोई नहीं"
    ],
    answer: "व्यापार के क्षेत्र में नैतिक मूल्यों को स्थापित करने में"
},

{
    question: "सांख्य विश्वास करता है-",
    option: [
        "प्रकृति परिणामवाद में",
        "ब्रह्म परिणामवाद में",
        "विवर्तवाद में",
        "इनमें से कोई नहीं"
    ],
    answer: "प्रकृति परिणामवाद में"
},

{
    question: "शंकर के दर्शन में व्यावहारिक सत्ता क्या है ?",
    option: [
        "निर्गुण ईश्वर",
        "ब्रह्म",
        "जगत",
        "इनमें से कोई नहीं"
    ],
    answer: "जगत"
},

{
    question: "वैशेषिक दर्शन के अनुसार गुण अपने अस्तित्व के लिए किस पर निर्भर करता है?",
    option: [
        "द्रव्य",
        "विशेष",
        "समवाय",
        "इनमें से कोई नहीं"
    ],
    answer: "द्रव्य"
},

{
    question: "कारण को भावात्मक और निषेधात्मक उपाधियों का योग किसने माना है ?",
    option: [
        "अरस्तु",
        "मिल",
        "ह्यूम",
        "काण्ट"
    ],
    answer: "मिल"
},

{
    question: "चतुर्थ आर्य सत्य को कहा जाता है?",
    option: [
        "मध्यम मार्ग",
        "अष्टांगिक मार्ग",
        "सम्यक मार्ग",
        "इनमें कोई नहीं"
    ],
    answer: "अष्टांगिक मार्ग"
},

{
    question: "निम्न में कौन पुरुषार्थ नहीं है? [2010A, 14A, 16A, 18A]",
    option: [
        "अर्थ",
        "धर्म",
        "ईश्वर",
        "काम"
    ],
    answer: "ईश्वर"
},

{
    question: "उपनिषद् को कहा जाता है-",
    option: [
        "योग विद्या",
        "ब्रह्म विद्या",
        "ज्ञान विद्या",
        "इनमें से कोई नहीं"
    ],
    answer: "ब्रह्म विद्या"
},

{
    question: "अनुमान का दूसरा नाम क्या है?",
    option: [
        "अन्वीक्षा",
        "परोक्षिका",
        "अनुमिति",
        "अनुपालक"
    ],
    answer: "अन्वीक्षा"
},

{
    question: "अद्वैत का अर्थ होता है-",
    option: [
        "दो नहीं",
        "एक नहीं",
        "चार नहीं",
        "तीन नहीं"
    ],
    answer: "दो नहीं"
},

{
    question: "निम्न में से कौन अनुभववादी नहीं है?",
    option: [
        "लॉक",
        "बर्कले",
        "ह्यूम",
        "काण्ट"
    ],
    answer: "काण्ट"
},

{
    question: "जैन दर्शन के प्रणेता हैं-",
    option: [
        "बुद्ध",
        "गौतम",
        "कपिल",
        "महावीर"
    ],
    answer: "महावीर"
},

{
    question: "कार्य-कारण नियम है-",
    option: [
        "वैज्ञानिक",
        "सामाजिक",
        "दार्शनिक",
        "सामान्य"
    ],
    answer: "वैज्ञानिक"
},

{
    question: "शंकर ने स्वप्न में अस्तित्व के स्वरूप को क्या कहा है?",
    option: [
        "प्रतिभाषिक सत्ता",
        "व्यावहारिक सत्ता",
        "पारमार्थिक सत्ता",
        "इनमें से कोई नहीं"
    ],
    answer: "प्रतिभाषिक सत्ता"
},

{
    question: "आस्तिक दर्शन निम्नलिखित में से किसे चेतना के अधिष्ठान के रूप में स्वीकार करता है ? [2022 A]",
    option: [
        "आत्मा",
        "जगत",
        "शरीर",
        "प्रकृति"
    ],
    answer: "आत्मा"
},

{
    question: "प्रत्ययवाद संबंधित है-",
    option: [
        "जड़ से",
        "चेतना से",
        "ज्ञान से",
        "अनुभव से"
    ],
    answer: "चेतना से"
},

{
    question: "भारतीय दर्शन में अनुभूतियों कितने प्रकार की मानी गयी हैं?",
    option: [
        "एक",
        "दो",
        "तीन",
        "चार"
    ],
    answer: "दो"
},

{
    question: "“नीतिशास्त्र मानव-आचरण का एक आदर्श निर्धारक विज्ञान है” यह उक्ति किनकी है?",
    option: [
        "मूर",
        "मैकेन्जी",
        "लिली",
        "इनमें से कोई नहीं"
    ],
    answer: "लिली"
},

{
    question: "निम्नलिखित में किसने आत्मा और शरीर को एक-दूसरे का पर्याय माना है?",
    option: [
        "चार्वाक",
        "शंकर",
        "बुद्ध",
        "जैन"
    ],
    answer: "चार्वाक"
},

{
    question: "सतोगुण, रजोगुण और तमोगुण हैं-",
    option: [
        "पुरुष के",
        "प्रकृति के",
        "ईश्वर के",
        "इनमें से कोई नहीं"
    ],
    answer: "प्रकृति के"
},

{
    question: "किस दर्शन में सम्यक समाधि का वर्णन है?",
    option: [
        "योग दर्शन",
        "बौद्ध दर्शन",
        "जैन दर्शन",
        "इनमें कोई नहीं"
    ],
    answer: "बौद्ध दर्शन"
},

{
    question: "शिक्षा दर्शन एक शाखा है-",
    option: [
        "भौतिकविज्ञान का",
        "मनोविज्ञान का",
        "दर्शनशास्त्र का",
        "तर्कशास्त्र का"
    ],
    answer: "दर्शनशास्त्र का"
},

{
    question: "सांख्य दर्शन निम्नलिखित में किसे स्वीकार करता है?",
    option: [
        "आरंभवाद",
        "परिणामवाद",
        "विवर्तवाद",
        "इनमें से कोई नहीं"
    ],
    answer: "परिणामवाद"
},

{
    question: "दो वस्तुओं के बीच का विशेष और अनिवार्य संबंध क्या कहलाता है? [2021A]",
    option: [
        "अभाव",
        "सन्निकर्ष",
        "व्याप्ति",
        "इनमें से कोई नहीं"
    ],
    answer: "व्याप्ति"
},

{
    question: "न्याय के अनुसार प्रमाण हैं-",
    option: [
        "दो",
        "छः",
        "चार",
        "इनमें से कोई नहीं"
    ],
    answer: "चार"
},

{
    question: "किसने कहा है कि ज्ञान संश्लेषणात्मक प्रागनुभविक निर्णय है?",
    option: [
        "काण्ट",
        "हेगल",
        "लाइबनिज",
        "स्पिनोजा"
    ],
    answer: "काण्ट"
},

{
    question: "प्रत्यक्ष न्यायशास्त्र में प्रमाण का कौन सा भेद है?",
    option: [
        "प्रथम",
        "द्वितीय",
        "तृतीय",
        "चतुर्थ"
    ],
    answer: "प्रथम"
},

{
    question: "निम्न में से कौन आस्तिक दर्शन है?",
    option: [
        "कर्म सिद्धान्त",
        "योग सिद्धान्त",
        "पुरुषार्थ सिद्धान्त",
        "इनमें से कोई नहीं"
    ],
    answer: "कर्म सिद्धान्त"
},

{
    question: "काण्ट के अनुसार ज्ञान है",
    option: [
        "प्रागनुभविक निर्णय",
        "अनुभव सापेक्ष निर्णय",
        "संश्लेषणात्मक प्रागनुभविक निर्णय",
        "इनमें से कोई नहीं"
    ],
    answer: "संश्लेषणात्मक प्रागनुभविक निर्णय"
},

{
    question: "दर्शनशास्त्र में ज्ञान को किस अर्थ में प्रयुक्त किया जाता है ? [2022 A]",
    option: [
        "विस्तृत अर्थ में",
        "संकुचित अर्थ में",
        "दोनों अर्थों में",
        "इनमें से कोई नहीं"
    ],
    answer: "दोनों अर्थों में"
},

{
    question: "किसने कहा है कि संवेदन बिना ज्ञान के अन्धा है और शुद्ध बोध बिना संवेदनों के खोखला है?",
    option: [
        "देकार्त",
        "स्पिनोजा",
        "लॉक",
        "काण्ट"
    ],
    answer: "काण्ट"
},

{
    question: "निम्नलिखित में कौन-सा गुण ज्ञान का प्रतीक है?",
    option: [
        "सत्त्व",
        "रजस्",
        "तमस्",
        "इनमें से कोई नहीं"
    ],
    answer: "सत्त्व"
},

{
    question: "बुद्ध के अष्टांगिक मार्ग के आठवें और अंतिम अंग का क्या नाम है?",
    option: [
        "प्रत्याहार",
        "धारणा",
        "ध्यान",
        "समाधि"
    ],
    answer: "समाधि"
},

{
    question: "कारण कार्य का है-",
    option: [
        "पूर्ववर्ती",
        "अनुवर्ती",
        "सहपरिणाम",
        "भी पूर्ववर्ती है तो कभी अनुवर्ती"
    ],
    answer: "पूर्ववर्ती"
},

{
    question: "कारण का गुणात्मक लक्षण क्या है ?",
    option: [
        "यह पूर्ववर्ती घटना है",
        "यह अनौपचारिक घटना है",
        "यह तात्कालिक, नियत, अनौपाधिक, पूर्ववर्ती घटना है",
        "इनमें से कोई नहीं"
    ],
    answer: "यह तात्कालिक, नियत, अनौपाधिक, पूर्ववर्ती घटना है"
},

{
    question: "बुद्ध के अनुसार प्रथम आर्य-सत्य निम्नलिखित में से कौन है?",
    option: [
        "संसार दुखों से परिपूर्ण है",
        "दुखों का कारण भी है",
        "दुखों का अन्त संभव है",
        "दुखों के अन्त का मार्ग है"
    ],
    answer: "संसार दुखों से परिपूर्ण है"
},

{
    question: "जैन दर्शन में विदेह मुक्ति को कहा जाता है-",
    option: [
        "बोधिसत्त्व",
        "कैवल्य",
        "निर्वाण",
        "परिनिर्वाण"
    ],
    answer: "निर्वाण"
},

{
    question: "पुरुषार्थ के अंतर्गत निम्नलिखित में से कौन आता है? [2021A]",
    option: [
        "सत्",
        "शुभ",
        "उचित",
        "उपभोग"
    ],
    answer: "उपभोग"
},

{
    question: "किस दर्शन में सम्यक समाधि का वर्णन है?",
    option: [
        "जैन दर्शन",
        "बौद्ध दर्शन",
        "योग",
        "मीमांसा"
    ],
    answer: "योग"
},

{
    question: "ज्ञान के साधन के सम्बन्ध में बुद्धिवादियों की प्रमुख मान्यता क्या है?",
    option: [
        "टेबुला रासा",
        "संस्कार और प्रत्यय",
        "जन्मजात प्रत्यय",
        "संशयवाद"
    ],
    answer: "जन्मजात प्रत्यय"
},

{
    question: "सत् गुण का सत् गुण में ही रूपांतरित होना क्या है ? [2022 A]",
    option: [
        "विरूप परिवर्तन",
        "स्वरूप परिवर्तन",
        "विवर्त परिवर्तन",
        "इनमें से कोई नहीं"
    ],
    answer: "स्वरूप परिवर्तन"
},

{
    question: "निम्न में से कौन नास्तिक दर्शन है?",
    option: [
        "योग दर्शन",
        "न्याय दर्शन",
        "जैन दर्शन",
        "सांख्य दर्शन"
    ],
    answer: "जैन दर्शन"
},

{
    question: "व्याप्ति ज्ञान की भूमिका किस प्रमाण के लिए है?",
    option: [
        "प्रत्यक्ष",
        "अलौकिक प्रत्यक्ष",
        "अनुमान",
        "इनमें से कोई नहीं"
    ],
    answer: "अनुमान"
},

{
    question: "न्याय दर्शन में योगज प्रत्यक्ष क्या है?",
    option: [
        "सामान्यों का प्रत्यक्ष",
        "लौकिक प्रत्यक्ष",
        "अलौकिक का प्रत्यक्ष",
        "इनमें से सभी"
    ],
    answer: "अलौकिक का प्रत्यक्ष"
},

{
    question: "धर्म, अर्थ, काम एवं मोक्ष किसके प्रकार हैं?",
    option: [
        "कर्म",
        "पुरुषार्थ",
        "आश्रम",
        "वर्ण"
    ],
    answer: "पुरुषार्थ"
},

{
    question: "स्वधर्म का वास्तविक संबंध है-",
    option: [
        "सामान्य धर्म से",
        "वर्णाश्रम धर्म से",
        "(A) एवं (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "इनमें से कोई नहीं"
},

{
    question: "सांख्य दर्शन में सत्कार्यवाद किस सिद्धान्त से सम्बन्धित है?",
    option: [
        "कार्य सिद्धांत",
        "कारण सिद्धांत",
        "कार्य-कारण सिद्धांत",
        "इनमें से कोई नहीं"
    ],
    answer: "कार्य-कारण सिद्धांत"
},

{
    question: "वैशेषिक दर्शन में उस द्रव्य को क्या कहते हैं जिसका विशिष्ट गुण चेतना होता है?",
    option: [
        "आकाश",
        "दिक्",
        "काल",
        "आत्मा"
    ],
    answer: "आत्मा"
},

{
    question: "आश्रम कितने सोपान की होती है? [2021A]",
    option: [
        "एक",
        "दो",
        "तीन",
        "चार"
    ],
    answer: "चार"
},

{
    question: "निम्नलिखित में से किस एक में बुद्ध के उपदेश संग्रहित हैं?",
    option: [
        "बुद्ध के उपदेश में",
        "ज्ञान की पुस्तक में",
        "त्रिपिटक में",
        "इनमें से कोई नहीं"
    ],
    answer: "त्रिपिटक में"
},

{
    question: "मानवीय आचरण पर नैतिक निर्णय के लिए क्या अनिवार्य है?",
    option: [
        "व्यक्ति का देश",
        "व्यक्ति का रंग",
        "व्यक्ति की भाषा",
        "व्यक्ति का इच्छा स्वातंत्र्य"
    ],
    answer: "व्यक्ति का इच्छा स्वातंत्र्य"
},

{
    question: "पंचावयव का संबंध किससे है?",
    option: [
        "न्याय के प्रत्यक्ष से",
        "न्याय के उपमान से",
        "न्याय के अनुमान से",
        "न्याय के शब्द प्रमाण से"
    ],
    answer: "न्याय के अनुमान से"
},

{
    question: "कारण की सही परिभाषा क्या है?",
    option: [
        "कारण एक पूर्ववर्ती घटना है",
        "कारण एक अनुवर्ती घटना है",
        "कारण अनौपचारिक पूर्ववर्ती घटना है",
        "कारण एक नियत, अनौपचारिक एवं तात्कालिक पूर्ववर्ती घटना है"
    ],
    answer: "कारण एक नियत, अनौपचारिक एवं तात्कालिक पूर्ववर्ती घटना है"
},

{
    question: "पूर्व स्थापित सामंजस्य सिद्धान्त संबंधित है",
    option: [
        "देकार्त से",
        "काण्ट से",
        "लाइबनिज से",
        "इनमें से कोई नहीं"
    ],
    answer: "लाइबनिज से"
},

{
    question: "अंतक्रियावाद सिद्धांत के प्रवर्तक हैं-",
    option: [
        "स्पीनोजा",
        "लाइबनीज",
        "देकार्त",
        "ह्यूम"
    ],
    answer: "स्पीनोजा"
},

{
    question: "माया की उस शक्ति का क्या नाम है जो ब्रह्म की सत्ता को छिपा लेती है?",
    option: [
        "प्रज्ञा",
        "समाधि",
        "आवरण",
        "इनमें से सभी"
    ],
    answer: "आवरण"
},

{
    question: "अरस्तु अनुसार कारण है-",
    option: [
        "आकारिक",
        "अंतिम",
        "उपादान",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "किस बुद्धिवादी दार्शनिक के अनुसार द्रव्य स्वतंत्र, निरपेक्ष, विलक्षण और सार्वभौम है?",
    option: [
        "देकार्त",
        "स्पिनोजा",
        "लाइबनिज",
        "लॉक"
    ],
    answer: "देकार्त"
},

{
    question: "निम्नलिखित में से कौन चिकित्सा नीतिशास्त्र का विषय है?",
    option: [
        "सरोगेट माँ",
        "भ्रूण हत्या",
        "चिकित्सक मरीज संबंध",
        "इनमें से कोई नहीं"
    ],
    answer: "इनमें से कोई नहीं"
},

{
    question: "भारतीय दर्शन में यथार्थ ज्ञान को कहा जाता है- [2014A, 2016A, 2023A]",
    option: [
        "प्रमा",
        "अप्रमा",
        "संभाव",
        "अध्याप"
    ],
    answer: "प्रमा"
},

{
    question: "बौद्ध दर्शन और जैन दर्शनों को कौन-सा दर्शन कहा जाता है?",
    option: [
        "आस्तिक दर्शन",
        "नास्तिक दर्शन",
        "(A) एवं (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "नास्तिक दर्शन"
},

{
    question: "ज्ञानशास्त्रीय सिद्धान्त के रूप में ‘समीक्षावाद’ देन है",
    option: [
        "देकार्त का",
        "स्पिनोजा का",
        "बर्कले का",
        "काण्ट का"
    ],
    answer: "काण्ट का"
},

{
    question: "किसने कहा है कि दर्शनशास्त्र का ज्ञान भी गणित के ज्ञान की तरह स्पष्ट एवं सुस्पष्ट होना चाहिए?",
    option: [
        "देकार्त",
        "लाइबनिज",
        "स्पिनोजा",
        "लॉक"
    ],
    answer: "देकार्त"
},

{
    question: "कार्य-कारण नियम आगमन का किस प्रकार का आधार है?",
    option: [
        "वास्तविक",
        "आकारिक",
        "(A) और (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "आकारिक"
},

{
    question: "ऋत संबंधित है- [2009A, 14A, 16A, 23A]",
    option: [
        "नैतिक नियम से",
        "धार्मिक नियम से",
        "भौतिक नियम से",
        "इनमें से सभी"
    ],
    answer: "नैतिक नियम से"
},

{
    question: "किसने कहा है कि ‘मैं सोचता हूँ इसलिए मैं हूँ’?",
    option: [
        "स्पिनोजा",
        "बर्कले",
        "लॉक",
        "देकार्त"
    ],
    answer: "देकार्त"
},

{
    question: "प्रकृति का कौन तत्व गुण मन की अशांति और वस्तुओं को चलायमान रखने के लिए जिम्मेदार होते हैं?",
    option: [
        "सत्त्वगुण",
        "रजोगुण",
        "तमोगुण",
        "इनमें से सभी"
    ],
    answer: "रजोगुण"
},

{
    question: "जैन धर्म के अंतिम तीर्थंकर कौन हैं?",
    option: [
        "महावीर",
        "ऋषभदेव",
        "पार्श्वनाथ",
        "शाक्य मुनि"
    ],
    answer: "महावीर"
},

{
    question: "समीक्षावाद का निर्माण होता है",
    option: [
        "अनुभववाद के भावात्मक अंशों को मिलाकर",
        "बुद्धिवाद के भावात्मक अंशों को मिलाकर",
        "अनुभववाद एवं बुद्धिवाद के भावात्मक अंशों को मिलाकर",
        "अनुभववाद एवं बुद्धिवाद के नकारात्मक अंशों को मिलाकर"
    ],
    answer: "अनुभववाद एवं बुद्धिवाद के भावात्मक अंशों को मिलाकर"
},

{
    question: "सही कथन क्या है?",
    option: [
        "कारण उपाधिक का एक अंग है",
        "कभी पूर्ववर्ती है तो कभी अनुवर्ती",
        "कारण और उपाधिक बराबर है",
        "उपाधि कारण का अंश नहीं है"
    ],
    answer: "कभी पूर्ववर्ती है तो कभी अनुवर्ती"
},

{
    question: "मन-शरीर संबंध की व्याख्या करता है ।",
    option: [
        "समानान्तरवाद",
        "अंतक्रियावाद",
        "पूर्वस्थापित सामंजस्यवाद्",
        "उपर्युक्त सभी"
    ],
    answer: "उपर्युक्त सभी"
},

{
    question: "प्रकृति के किस गुण के कारण वस्तुएं ऊर्ध्वगमन करती हैं ?",
    option: [
        "सत्वगुण",
        "रजोगुण",
        "तमोगुण",
        "इनमें से कोई नहीं"
    ],
    answer: "सत्वगुण"
},

{
    question: "बौद्ध दर्शन के किस आर्य सत्य को नैतिक कारणतावाद कहा गया है?",
    option: [
        "प्रथम आर्य सत्य",
        "द्वितीय आर्य सत्य",
        "तृतीय आर्य सत्य",
        "चतुर्थ आर्य सत्य"
    ],
    answer: "द्वितीय आर्य सत्य"
},

{
    question: "नीतिशून्य कर्म का क्या अर्थ है?",
    option: [
        "वह कर्म जो नैतिक दृष्टिकोण से अनुचित है",
        "वह कर्म जिसे मनुष्यों को नहीं करना चाहिए",
        "(A) और (B) दोनों",
        "वह कर्म जिस पर नैतिक निर्णय नहीं दिया जाता है"
    ],
    answer: "वह कर्म जिस पर नैतिक निर्णय नहीं दिया जाता है"
},

{
    question: "निम्नलिखित में से कौन ज्ञान का अवरोध करता है ? [2022 A]",
    option: [
        "सत्व",
        "रजस",
        "तमस",
        "इनमें से कोई नहीं"
    ],
    answer: "तमस"
},

{
    question: "नीतिशास्त्र किस विद्या को कहते हैं?",
    option: [
        "जो परम सत्ता की खोज करता है",
        "जो नैतिक मापदण्डों की खोज करता है",
        "जो ज्ञान के साधन की खोज करता है",
        "इनमें से कोई नहीं"
    ],
    answer: "जो नैतिक मापदण्डों की खोज करता है"
},

{
    question: "वैशेषिक दर्शन में सभी भौतिक द्रव्यों का अस्तित्व होता है।",
    option: [
        "दिक्",
        "काल",
        "दिक् एवं काल",
        "इनमें से कोई नहीं"
    ],
    answer: "दिक् एवं काल"
},

{
    question: "नैतिक नियम के अनुकूल रहने वाले कर्मों को क्या कहेंगे? [2021A]",
    option: [
        "उचित",
        "अनुचित",
        "उचित एवं अनुचित",
        "इनमें से कोई नहीं"
    ],
    answer: "उचित"
},

{
    question: "पर्यावरण नीतिशास्त्र की विषय-वस्तु क्या है?",
    option: [
        "चिकित्सा से जुड़ी नैतिक समस्याएँ",
        "व्यवसाय से जुड़ी नैतिक समस्याएँ",
        "पर्यावरण से जुड़ी नैतिक समस्याएँ",
        "मीडिया से जुड़ी नैतिक समस्याएँ"
    ],
    answer: "पर्यावरण से जुड़ी नैतिक समस्याएँ"
},

{
    question: "जैन दर्शन में ‘नय’ शब्द क्या दर्शाता है?",
    option: [
        "किसी वस्तु के सभी पक्षों के पूर्ण ज्ञान को दर्शाता है",
        "किसी वस्तु के कुछ पक्षों के आंशिक ज्ञान को दर्शाता है",
        "(A) और (B) दोनों को दर्शाता है",
        "इनमें से कोई नहीं"
    ],
    answer: "किसी वस्तु के कुछ पक्षों के आंशिक ज्ञान को दर्शाता है"
},

{
    question: "जो ज्ञान प्राप्त करता है, कहलाता है-",
    option: [
        "प्रमाण",
        "प्रमाता",
        "प्रमा",
        "अप्रमा"
    ],
    answer: "प्रमाता"
},

{
    question: "आस्तिक और नास्तिक दर्शन का भेद भारतीय सम्प्रदाय में किस आधार पर किया गया है? [2010A]",
    option: [
        "ईश्वर में विश्वास",
        "वेद में विश्वास",
        "आत्मा में विश्वास",
        "इनमें से कोई नहीं"
    ],
    answer: "वेद में विश्वास"
},

{
    question: "ज्ञान के साधन के रूप में सहज ज्ञान और निगमन को किसने स्वीकार किया है?",
    option: [
        "लॉक",
        "बर्कले",
        "ह्यूम",
        "देकार्त"
    ],
    answer: "देकार्त"
},

{
    question: "संस्कार और प्रत्ययों का विचार किस अनुभववादी के दर्शन में पाया जाता है?",
    option: [
        "ह्यूम",
        "लॉक",
        "बर्कले",
        "इनमें से कोई नहीं"
    ],
    answer: "ह्यूम"
},

{
    question: "आगमन का आकारिक आधार है-",
    option: [
        "प्रकृति-समरूपता",
        "निरीक्षण",
        "प्रयोग",
        "कारण कार्य नियम"
    ],
    answer: "कारण कार्य नियम"
},

{
    question: "जड़ में गति प्रदान करने वाली शक्ति को क्या कहते हैं?",
    option: [
        "उपादान कारण",
        "निमित्त कारण",
        "(A) और (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "निमित्त कारण"
},

{
    question: "योग दर्शन में चित्त की कितनी अवस्थाओं का जिक्र है?",
    option: [
        "एक",
        "चार",
        "पाँच",
        "आठ"
    ],
    answer: "पाँच"
},

{
    question: "प्रत्यक्ष ज्ञान के लिए क्या अनिवार्य है?",
    option: [
        "इन्द्रियों और विषयों का सन्निकर्ष",
        "व्याप्ति ज्ञान",
        "शब्द",
        "उदाहरण"
    ],
    answer: "इन्द्रियों और विषयों का सन्निकर्ष"
},

{
    question: "“दण्ड देने के पीछे एकमात्र उद्देश्य होता है कि व्यक्ति भविष्य में उस अपराध की पुनरावृत्ति न करे” यह विचार दण्ड के किस सिद्धांत से संबंधित है?",
    option: [
        "प्रतिशोधात्मक सिद्धांत",
        "निवार्तनवादी सिद्धांत",
        "सुधारवादी सिद्धांत",
        "इनमें सभी"
    ],
    answer: "निवार्तनवादी सिद्धांत"
},

{
    question: "निम्न में पुद्गल के कौन-से भेद हैं?",
    option: [
        "अणु",
        "स्कंध",
        "(A) एवं (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "(A) एवं (B) दोनों"
},

{
    question: "आधुनिक पाश्चात्य दर्शन का पिता कहलाता है:",
    option: [
        "स्पिनोजा",
        "लाइबनिज",
        "देकार्त",
        "इनमें से कोई नहीं"
    ],
    answer: "देकार्त"
},

{
    question: "बौद्ध दर्शन के अनुसार आर्य सत्य हैं-",
    option: [
        "दो",
        "तीन",
        "चार",
        "इनमें से कोई नहीं"
    ],
    answer: "चार"
},

{
    question: "स्यादवाद सिद्धांत है-",
    option: [
        "ज्ञानशास्त्रीय",
        "तत्त्वशास्त्रीय",
        "नीति मीमांसीय",
        "इनमें से कोई नहीं"
    ],
    answer: "ज्ञानशास्त्रीय"
},

{
    question: "जैन दर्शन के प्रवर्तक हैं-",
    option: [
        "गौतम",
        "कपिल",
        "महावीर",
        "इनमें से कोई नहीं"
    ],
    answer: "महावीर"
},

{
    question: "मन एवं शरीर का सम्बन्ध स्पिनोजा के अनुसार है –",
    option: [
        "क्रियावाद",
        "समानान्तरवाद",
        "उपर्युक्त दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "समानान्तरवाद"
},

{
    question: "महावीर को निर्वाण कहाँ प्राप्त हुआ?",
    option: [
        "पावापुरी",
        "बोधगया",
        "कुशीनगर",
        "राजगीर"
    ],
    answer: "पावापुरी"
},

{
    question: "सुख और दुःख क्रमशः शुभ और अशुभ कर्मों के अनिवार्य फल माने जाते हैं, यह किस सिद्धांत से जुड़ा हुआ है?",
    option: [
        "कर्म सिद्धांत",
        "योग सिद्धांत",
        "पुरुषार्थ सिद्धांत",
        "इनमें से कोई नहीं"
    ],
    answer: "कर्म सिद्धांत"
},

{
    question: "भौतिकवाद के अनुसार परम सत्ता है-",
    option: [
        "प्रत्यय",
        "तटस्थ",
        "जड़",
        "ईश्वर"
    ],
    answer: "जड़"
},

{
    question: "मन और शरीर के बीच देकार्त किस प्रकार के सम्बन्ध को स्वीकार करते हैं?",
    option: [
        "समानान्तरवाद",
        "अन्तःक्रियावाद",
        "नित्यवाद",
        "निश्चयवाद"
    ],
    answer: "अन्तःक्रियावाद"
},

{
    question: "काण्ट के समीक्षावाद पर प्रभाव है:",
    option: [
        "बुद्धिवाद का",
        "अनुभववाद का",
        "(A) और (B) दोनों का",
        "इनमें से कोई नहीं"
    ],
    answer: "(A) और (B) दोनों का"
},

{
    question: "योगदर्शन में 'अंतरंग साधन' के कितने अवयव हैं?",
    option: [
        "तीन",
        "पाँच",
        "चार",
        "दो"
    ],
    answer: "तीन"
},

{
    question: "भारतीय दर्शन की मूल दृष्टि है- [2014A, 2023A]",
    option: [
        "विश्लेषणात्मक",
        "बौद्धिक",
        "आध्यात्मिक",
        "इनमें से कोई नहीं"
    ],
    answer: "आध्यात्मिक"
},

{
    question: "किस ज्ञान सिद्धान्त के अनुसार ज्ञान की प्राप्ति आगमनात्मक विधि से होती है?",
    option: [
        "बुद्धिवाद",
        "अनुभववाद",
        "वाद",
        "वस्तुवाद"
    ],
    answer: "अनुभववाद"
},

{
    question: "बौद्ध दर्शन के अनुसार प्रथम आर्य सत्य है-",
    option: [
        "सुख",
        "आनन्द",
        "दुःख का कारण",
        "दुःख"
    ],
    answer: "दुःख"
},

{
    question: "अभाव का उल्लेख किस दर्शन में मिलता है?",
    option: [
        "सांख्य दर्शन",
        "योग दर्शन",
        "वैशेषिक दर्शन",
        "इनमें से सभी"
    ],
    answer: "वैशेषिक दर्शन"
},

{
    question: "नियम के अनुकूल रहने पर क्या कहेंगे?",
    option: [
        "उचित",
        "अनुचित",
        "उचित एवं अनुचित",
        "इनमें से कोई नहीं"
    ],
    answer: "उचित"
},

{
    question: "इन्द्रिय प्रत्यक्ष को ज्ञान का साधन किसने माना है?",
    option: [
        "लॉक",
        "बर्कले",
        "ह्यूम",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "आध्यात्मिक अनुभूति किस दर्शनशास्त्र में बौद्धिक ज्ञान से उच्च माना गया है?",
    option: [
        "भारतीय दर्शनशास्त्र",
        "पाश्चात्य दर्शनशास्त्र",
        "A एवं B दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "भारतीय दर्शनशास्त्र"
},

{
    question: "गीता में मोक्ष के कौन-कौन से मार्ग बताए गए हैं?",
    option: [
        "ज्ञान",
        "कर्म",
        "भक्ति",
        "ये सभी"
    ],
    answer: "ये सभी"
},

{
    question: "व्यापार नीतिशास्त्र अध्ययन है-",
    option: [
        "व्यापार के विस्तार का",
        "व्यापार के स्वामित्व का",
        "व्यापार के रखरखाव का",
        "व्यापार से जुड़ी नैतिकता का"
    ],
    answer: "व्यापार से जुड़ी नैतिकता का"
},

{
    question: "पर्यावरण के प्रकार हैं-",
    option: [
        "भौतिक",
        "मानसिक",
        "आध्यात्मिक",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "त्रिपिटक संबंधित हैं-",
    option: [
        "बौद्ध दर्शन से",
        "सांख्य दर्शन से",
        "जैन दर्शन से",
        "इनमें से कोई नहीं"
    ],
    answer: "बौद्ध दर्शन से"
},

{
    question: "शंकर का समय माना जाता है-",
    option: [
        "788-820 ई०",
        "800-900 ई०",
        "100-1100 ई०",
        "700-820 ई०"
    ],
    answer: "788-820 ई०"
},

{
    question: "जैन दर्शन में आत्मा को कहा जाता है-",
    option: [
        "पुरुष",
        "जीव",
        "ईश्वर",
        "अजीव"
    ],
    answer: "जीव"
},

{
    question: "ज्ञानमीमांसीय वस्तुवाद के अनुसार",
    option: [
        "ज्ञेय ज्ञाता से स्वतंत्र नहीं है",
        "ज्ञाता एवं ज्ञेय दोनों एक-दूसरे से स्वतंत्र हैं",
        "ज्ञाता एवं ज्ञेय दोनों एक-दूसरे से स्वतंत्र नहीं हैं",
        "[a] एवं [b] दोनों"
    ],
    answer: "[a] एवं [b] दोनों"
},

{
    question: "निम्नलिखित में से कौन सा विकल्प सांख्य दर्शन की प्रकृति के संदर्भ में सही है?",
    option: [
        "प्रकृति की संख्या एक है और सक्रिय है",
        "प्रकृति की संख्या दो है और सक्रिय है",
        "प्रकृति की संख्या अनेक है और निष्क्रिय है",
        "इनमें से कोई नहीं"
    ],
    answer: "प्रकृति की संख्या एक है और सक्रिय है"
},

{
    question: "बौद्ध दर्शन का प्रमुख सिद्धांत क्या है?",
    option: [
        "मध्यम मार्ग",
        "अद्वैतवाद",
        "ईश्वरवाद",
        "इनमें से सभी"
    ],
    answer: "मध्यम मार्ग"
},

{
    question: "बुद्ध के किस आर्य सत्य में निर्वाण का मार्ग वर्णित है?",
    option: [
        "प्रथम",
        "द्वितीय",
        "तृतीय",
        "चतुर्थ"
    ],
    answer: "चतुर्थ"
},

{
    question: "तत्त्वतर्कम् अनुमानम् अनुमान की परिभाषा दी गई है-",
    option: [
        "न्याय द्वारा",
        "वैशेषिक द्वारा",
        "सांख्य द्वारा",
        "इनमें से कोई नहीं"
    ],
    answer: "वैशेषिक द्वारा"
},

{
    question: "आत्मा के विशेष गुण हैं-",
    option: [
        "सुख",
        "दुःख",
        "सुख और दुःख",
        "इनमें से कोई नहीं"
    ],
    answer: "सुख और दुःख"
},

{
    question: "‘अनासक्ति योग’ नामक ग्रंथ की रचना किसने की?",
    option: [
        "बाल गंगाधर तिलक",
        "महात्मा गांधी",
        "अरविन्द घोष",
        "डॉ. राधाकृष्णन"
    ],
    answer: "महात्मा गांधी"
},

{
    question: "निष्काम कर्म क्या है?",
    option: [
        "कर्म का त्याग है",
        "कर्मफल का त्याग है",
        "सकाम कर्म है",
        "इनमें से कोई नहीं"
    ],
    answer: "कर्मफल का त्याग है"
},

{
    question: "समीक्षात्मक वस्तुवाद को कहते हैं",
    option: [
        "ज्ञान मीमांसीय एकवाद",
        "ज्ञान मीमांसीय द्वैतवाद",
        "तत्व मीमांसीय द्वैतवाद",
        "इनमें से कोई नहीं"
    ],
    answer: "ज्ञान मीमांसीय एकवाद"
},

{
    question: "विचार और विस्तार को ईश्वर का गुण किसने माना है?",
    option: [
        "स्पिनोजा",
        "देकार्त",
        "लाइबनिज",
        "काण्ट"
    ],
    answer: "स्पिनोजा"
},

{
    question: "भर्तृहरि ने प्रसिद्ध पुस्तक लिखा है-",
    option: [
        "स्फोटवाद",
        "वाक्यपदीयम्",
        "शब्दबोध",
        "इनमें कोई नहीं"
    ],
    answer: "वाक्यपदीयम्"
},

{
    question: "वैशेषिक द्वारा कितने प्रकार का कर्म माना गया है?",
    option: [
        "पाँच",
        "आठ",
        "सोलह",
        "चौबीस"
    ],
    answer: "पाँच"
},

{
    question: "अन्तःक्रियावाद सिद्धान्त है:",
    option: [
        "देकार्त का",
        "स्पिनोजा का",
        "लाइबनिज का",
        "लॉक का"
    ],
    answer: "देकार्त का"
},

{
    question: "शरीर और मन उपाधियों से सीमित परमात्मा क्या है?",
    option: [
        "माया",
        "जीवात्मा",
        "ब्रह्म",
        "इनमें से कोई नहीं"
    ],
    answer: "जीवात्मा"
},

{
    question: "चिकित्सा नीतिशास्त्र की महत्वपूर्ण समस्या क्या है?",
    option: [
        "आत्म हत्या",
        "भ्रूण हत्या",
        "हिंसा",
        "धार्मिक हिंसा"
    ],
    answer: "भ्रूण हत्या"
},

{
    question: "बुद्ध को निर्वाण कहाँ मिला था?",
    option: [
        "कुशीनगर",
        "सारनाथ",
        "बोध गया",
        "कपिलवस्तु"
    ],
    answer: "कुशीनगर"
},

{
    question: "श्वास प्रक्रिया को नियंत्रित करके एक क्रम में लाना क्या कहलाता है?",
    option: [
        "ध्यान",
        "धारणा",
        "समाधि",
        "प्राणायाम"
    ],
    answer: "प्राणायाम"
},

{
    question: "निम्नलिखित में से कौन अनुपयुक्त नीतिशास्त्र की शाखा है?",
    option: [
        "पर्यावरणीय नीतिशास्त्र",
        "जैव-चिकित्सीय नीतिशास्त्र",
        "व्यवसाय नीतिशास्त्र",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "निम्नलिखित में से कौन अनुपयुक्त नीतिशास्त्र की शाखा है?",
    option: [
        "पर्यावरणीय नीतिशास्त्र",
        "जैव-चिकित्सीय नीतिशास्त्र",
        "व्यवसाय नीतिशास्त्र",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "शंकर के अनुसार सत्-आनंद कौन है?",
    option: [
        "ईश्वर",
        "माया",
        "ब्रह्म",
        "इनमें से कोई नहीं"
    ],
    answer: "ब्रह्म"
},

{
    question: "“नीतिशास्त्र शुभ और उचित आचरण का अध्ययन है”- यह परिभाषा किसने दी?",
    option: [
        "मूर",
        "मैकेन्जी",
        "जॉन दे",
        "इनमें से कोई नहीं"
    ],
    answer: "मैकेन्जी"
},

{
    question: "शंकर के अनुसार शरीर से मुक्त आत्मा क्या है?",
    option: [
        "जीव",
        "माया",
        "ब्रह्म",
        "इनमें से कोई नहीं"
    ],
    answer: "ब्रह्म"
},

{
    question: "वैशेषिक द्वारा कितने प्रकार का गुण माना गया है?",
    option: [
        "बारह",
        "चौबीस",
        "आठ",
        "सोलह"
    ],
    answer: "चौबीस"
},

{
    question: "सांख्य, योग और न्याय दर्शन का सामान्य विचार है।",
    option: [
        "आस्तिकता",
        "नास्तिकता",
        "एकवादिता",
        "इनमें से कोई नहीं"
    ],
    answer: "आस्तिकता"
},

{
    question: "न्याय सूत्र किसने लिखा है?",
    option: [
        "वाचस्पति",
        "वात्स्यायन",
        "गौतम",
        "उदयन भट्ट"
    ],
    answer: "गौतम"
},

{
    question: "परिणाम की दृष्टि से कारण कार्य से क्या है?",
    option: [
        "बड़ा",
        "छोटा",
        "बहुकारणवाद",
        "इनमें से कोई नहीं"
    ],
    answer: "बहुकारणवाद"
},

{
    question: "व्यक्ति बनो’ यह वक्तव्य है",
    option: [
        "ब्रेडले का",
        "सोरोकीन का",
        "हिगेल का",
        "काण्ट का"
    ],
    answer: "ब्रेडले का"
},

{
    question: "शंकर के दर्शन के अनुसार पारमार्थिक सत्ता क्या है ?",
    option: [
        "सत्",
        "चित्",
        "आनन्द",
        "इनमें सभी"
    ],
    answer: "सत्"
},

{
    question: "भारत के दार्शनिक सम्प्रदायों को बाँटा गया है- [2009A,16A,23A]",
    option: [
        "आस्तिक",
        "नास्तिक",
        "आस्तिक एवं नास्तिक",
        "इनमें से कोई नहीं"
    ],
    answer: "आस्तिक एवं नास्तिक"
},

{
    question: "पतंजलि के अनुसार नियम की संख्या कितनी है?",
    option: [
        "दो",
        "पाँच",
        "तीन",
        "छः"
    ],
    answer: "पाँच"
},

{
    question: "बुद्ध का अष्टांगिक मार्ग निम्न में से किस आर्य-सत्य से सम्बद्ध है?",
    option: [
        "प्रथम आर्य-सत्य",
        "द्वितीय आर्य-सत्य",
        "तृतीय आर्य-सत्य",
        "चतुर्थ आर्य-सत्य"
    ],
    answer: "चतुर्थ आर्य-सत्य"
},

{
    question: "निम्न में से कौन-सी एक वेदान्त की शाखा नहीं है?",
    option: [
        "द्वैत",
        "विशिष्टाद्वैत",
        "अद्वैत",
        "इनमें से कोई नहीं"
    ],
    answer: "इनमें से कोई नहीं"
},

{
    question: "शिक्षा दर्शन का आधार-",
    option: [
        "प्रकृतिवाद है",
        "आध्यात्मवाद है",
        "(A) और (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "(A) और (B) दोनों"
},

{
    question: "ज्ञानशास्त्रीय प्रत्ययवाद स्वीकार करता है",
    option: [
        "वस्तु ज्ञाता से स्वतंत्र है",
        "वस्तु ज्ञाता पर निर्भर है",
        "वस्तु ज्ञाता से तटस्थ है",
        "इनमें से कोई नहीं"
    ],
    answer: "वस्तु ज्ञाता पर निर्भर है"
},

{
    question: "परम तत्व के अनुसार परम सत्ता है",
    option: [
        "प्रत्यय",
        "जड़",
        "तटस्थ",
        "इनमें से कोई नहीं"
    ],
    answer: "तटस्थ"
},

{
    question: "जैन दर्शन में ज्ञान की सापेक्षता का सिद्धान्त क्या है?",
    option: [
        "स्याद्वाद",
        "अनेकान्तवाद",
        "अख्यातिवाद",
        "इनमें से कोई नहीं"
    ],
    answer: "स्याद्वाद"
},

{
    question: "बौद्ध दर्शन में मोक्ष को निर्वाण कहा गया है। इससे व्यक्ति के-",
    option: [
        "समस्त दुःखों का अंत हो जाता है",
        "पुनर्जन्म की श्रृंखला समाप्त हो जाती है",
        "A एवं B दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "A एवं B दोनों"
},

{
    question: "“ज्ञान की प्राप्ति निगमनात्मक विधि से होती है” यह किस ज्ञान सिद्धान्त के अनुसार?",
    option: [
        "बुद्धिवाद",
        "अनुभववाद",
        "समीक्षावाद",
        "इनमें से कोई नहीं"
    ],
    answer: "बुद्धिवाद"
},

{
    question: "सर्वोच्च शुभ क्या है?",
    option: [
        "मात्र साधन है",
        "मात्र बाह्य है",
        "चरम लक्ष्य है",
        "इनमें से कोई नहीं"
    ],
    answer: "चरम लक्ष्य है"
},

{
    question: "निम्न में से किसने कहा है कि कारण भावात्मक और निषेधात्मक उपाधियों का योगफल है?",
    option: [
        "मिल",
        "अरस्तू",
        "ह्यूम",
        "इनमें से कोई नहीं"
    ],
    answer: "मिल"
},

{
    question: "समीक्षात्मक वस्तुवाद को कहते हैं",
    option: [
        "ज्ञान मीमांसीय एकवाद",
        "ज्ञान मीमांसीय द्वैतवाद",
        "तत्व मीमांसीय द्वैतवाद",
        "इनमें से कोई नहीं"
    ],
    answer: "ज्ञान मीमांसीय द्वैतवाद"
},

{
    question: "एन इंट्रोडक्शन टू एथिक्स के लेखक कौन हैं?",
    option: [
        "अरस्तू",
        "मिल",
        "मैकेंजी",
        "विलियम लिली"
    ],
    answer: "विलियम लिली"
},

{
    question: "वैशेषिक दर्शन के अनुसार गुण का आधार क्या है?",
    option: [
        "द्रव्य",
        "सामान्य",
        "विशेष",
        "इनमें से कोई नहीं"
    ],
    answer: "द्रव्य"
},

{
    question: "शंकर के अनुसार ब्रह्म है-",
    option: [
        "ब्रह्म",
        "जगत्",
        "ईश्वर",
        "इनमें कोई नहीं"
    ],
    answer: "इनमें कोई नहीं"
},

{
    question: "बौद्ध दर्शन और जैन दर्शन किस दार्शनिक सम्प्रदाय में आता है?",
    option: [
        "आस्तिक",
        "नास्तिक",
        "आस्तिक और नास्तिक दोनों",
        "इनमें से सभी"
    ],
    answer: "नास्तिक"
},

{
    question: "गीता में किनके विचार से ईश्वर की वाणी मानी गयी है",
    option: [
        "कृष्ण",
        "अर्जुन",
        "व्यास",
        "इनमें से कोई नहीं"
    ],
    answer: "कृष्ण"
},

{
    question: "किस दार्शनिक ने कहा कि सरल प्रत्ययों के निर्माण में हमारी बुद्धि निष्क्रिय रहती है?",
    option: [
        "स्पिनोजा",
        "लॉक",
        "लाइबनिज",
        "बर्कले"
    ],
    answer: "लॉक"
},

{
    question: "जीव का रूप क्या है?",
    option: [
        "नित्य",
        "शरीर में निवासित",
        "प्रकाशवान",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "निम्न में से अन्वीक्षा किसे कहते हैं?",
    option: [
        "प्रत्यक्ष",
        "शब्द",
        "उपमान",
        "अनुमान"
    ],
    answer: "अनुमान"
},

{
    question: "‘मैं सोचता हूँ, इसलिए मैं हूँ।’ यह कथन है",
    option: [
        "देकार्त का",
        "लॉक का",
        "ह्यूम का",
        "प्लेटो का"
    ],
    answer: "देकार्त का"
},

{
    question: "शिक्षा दर्शन एक शाखा है-",
    option: [
        "मनोविज्ञान की",
        "अर्थशास्त्र की",
        "तर्कशास्त्र की",
        "इनमें कोई नहीं"
    ],
    answer: "इनमें कोई नहीं"
},

{
    question: "ज्ञानमीमांसीय वस्तुवाद के अनुसार",
    option: [
        "ज्ञेय ज्ञाता से स्वतंत्र नहीं है",
        "ज्ञाता एवं ज्ञेय दोनों एक-दूसरे से स्वतंत्र है",
        "वस्तु ज्ञाता पर निर्भर है",
        "इनमें से कोई नहीं"
    ],
    answer: "ज्ञाता एवं ज्ञेय दोनों एक-दूसरे से स्वतंत्र है"
},

{
    question: "निम्न में से किस युक्ति का कहना है कि ईश्वर का अस्तित्व ईश्वर के विचार से अनिवार्यतः फलित होता है?",
    option: [
        "विश्वमूलक युक्ति",
        "कारणतामूलक युक्ति",
        "तात्विक युक्ति",
        "प्रयोजनमूलक युक्ति"
    ],
    answer: "तात्विक युक्ति"
},

{
    question: "भगवद् गीता के संबंध में निम्नलिखित में से कौन-सा विकल्प सही है?",
    option: [
        "भगवद् गीता कृष्ण-अर्जुन संवाद का प्रतिफल है",
        "भगवद् गीता महाभारत महाकाव्य का भाग है",
        "भगवद् गीता भगवान का गीत है",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "उपमान को किसकी श्रेणी में रखा जाता है?",
    option: [
        "शब्द की श्रेणी में",
        "प्रत्यक्ष की श्रेणी में",
        "अनुमान की श्रेणी में",
        "इनमें से कोई नहीं"
    ],
    answer: "इनमें से कोई नहीं"
},

{
    question: "गौतम की पुस्तक का नाम है-",
    option: [
        "रामायण",
        "योगासन",
        "न्याय सूत्र",
        "इनमें से कोई नहीं"
    ],
    answer: "न्याय सूत्र"
},

{
    question: "अनेकान्तवाद किस दर्शन से जुड़ा है?",
    option: [
        "बौद्ध दर्शन",
        "जैन दर्शन",
        "सांख्य दर्शन",
        "न्याय दर्शन"
    ],
    answer: "जैन दर्शन"
},

{
    question: "प्रागनुभविक ज्ञान संबंधित है-",
    option: [
        "अनुभव से",
        "बुद्धि से",
        "दोनों से",
        "इनमें से कोई नहीं"
    ],
    answer: "बुद्धि से"
},

{
    question: "न्याय दर्शन के एक वर्गीकरण के अनुसार निम्नलिखित में से कौन सा विकल्प अनुमान के प्रकार के संदर्भ में सही है?",
    option: [
        "पूर्ववत्",
        "शेषवत्",
        "सामान्यतोदृष्ट",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "वेद कितने हैं?",
    option: [
        "एक",
        "दो",
        "तीन",
        "चार"
    ],
    answer: "चार"
},

{
    question: "पतंजलि के योगिक प्रविधि का अंतिम पायदान क्या है?",
    option: [
        "प्रत्याहार",
        "धारणा",
        "ध्यान",
        "समाधि"
    ],
    answer: "समाधि"
},

{
    question: "चित्तवृत्ति निरोध को कहते हैं-",
    option: [
        "प्राणायाम",
        "योग",
        "समाधि",
        "इनमें से कोई नहीं"
    ],
    answer: "योग"
},

{
    question: "शंकर के अनुसार निरपेक्ष चेतन कौन सत्ता है?",
    option: [
        "जगत्",
        "जीवात्मा",
        "शरीर",
        "ब्रह्म"
    ],
    answer: "ब्रह्म"
},

{
    question: "निम्नलिखित में से कौन एक बुद्धिवादी एवं अनुभववादी नहीं है?",
    option: [
        "काण्ट",
        "स्पिनोजा",
        "ह्यूम",
        "इनमें से कोई नहीं"
    ],
    answer: "स्पिनोजा"
},

{
    question: "भारतीय दर्शन में बंध ज्ञान प्राप्त करने के साधन को क्या कहते हैं ? [2022A, 2023A]",
    option: [
        "प्रमाण",
        "प्रमा",
        "प्रमेय",
        "प्रमाता"
    ],
    answer: "प्रमाण"
},

{
    question: "‘भगवद्गीता’ का शाब्दिक अर्थ क्या है?",
    option: [
        "ईश्वर का गीत",
        "ईश्वर का अस्तित्व",
        "ईश्वर का स्वरूप",
        "ईश्वर की संख्या"
    ],
    answer: "ईश्वर का गीत"
},

{
    question: "निम्नलिखित में से किस युक्ति को कारणतामूलक युक्ति कहा जा सकता है?",
    option: [
        "सत्तामूलक",
        "विश्वमूलक",
        "प्रयोजनमूलक",
        "नैतिक"
    ],
    answer: "विश्वमूलक"
},

{
    question: "भारतीय दर्शन का प्राण या आत्मा किसे माना जा सकता है ? [2022 A]",
    option: [
        "स्वस्थ शरीर को",
        "स्वस्थ मन को",
        "शुद्ध आत्मा को",
        "शुद्ध अध्यात्म को"
    ],
    answer: "शुद्ध आत्मा को"
},

{
    question: "सांख्य दर्शन में चेतन सत्ता को क्या कहा जाता है?",
    option: [
        "प्रकृति",
        "सत्त्व",
        "पुरुष",
        "इनमें से कोई नहीं"
    ],
    answer: "पुरुष"
},

{
    question: "कारण क्या है?",
    option: [
        "केवल भावात्मक स्थितियों का योग",
        "केवल निषेधात्मक स्थितियों का योग",
        "भावात्मक एवं निषेधात्मक स्थितियों का योग",
        "इनमें से कोई नहीं"
    ],
    answer: "भावात्मक एवं निषेधात्मक स्थितियों का योग"
},

{
    question: "आस्तिक दर्शनों की संख्या है- [2010A, 18A]",
    option: [
        "आठ",
        "छः",
        "तीन",
        "पाँच"
    ],
    answer: "छः"
},

{
    question: "वैशेषिक दर्शन में पदार्थ का विभाजन हुआ है-",
    option: [
        "भाव पदार्थ",
        "अभाव पदार्थ",
        "(A) और (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "(A) और (B) दोनों"
},

{
    question: "‘दुःख है’ इसकी चर्चा बुद्ध अपने किस आर्य सत्य में करते हैं?",
    option: [
        "प्रथम आर्य सत्य",
        "द्वितीय आर्य सत्य",
        "तृतीय आर्य सत्य",
        "चतुर्थ आर्य सत्य"
    ],
    answer: "प्रथम आर्य सत्य"
},

{
    question: "शुद्ध सत्ता जो न तो बाधित होती है और न जिसके बाधित होने की कल्पना की जा सकती है, उसे कहा जाता है",
    option: [
        "व्यावहारिक सत्ता",
        "पारमार्थिक सत्ता",
        "प्रतिभाषित सत्ता",
        "इनमें से कोई नहीं"
    ],
    answer: "पारमार्थिक सत्ता"
},

{
    question: "निम्न में से कौन पुरुषार्थ नहीं है- [2011A, 2015A, 2023A]",
    option: [
        "ईश्वर",
        "आत्मा",
        "अर्थ",
        "इनमें से कोई नहीं"
    ],
    answer: "आत्मा"
},

{
    question: "प्रकृति का कौन-सा गुण जड़ता और निष्क्रियता का कारण है ? [2022 A]",
    option: [
        "सत्वगुण",
        "रजोगुण",
        "तमोगुण",
        "इनमें से सभी"
    ],
    answer: "तमोगुण"
},

{
    question: "अद्वैत वेदांत के प्रवर्तक हैं-",
    option: [
        "रामानुज",
        "शंकर",
        "मध्व",
        "निम्बार्क"
    ],
    answer: "शंकर"
},

{
    question: "गीता में योग शब्द का व्यवहार हुआ है-",
    option: [
        "आत्मा से मिलन का",
        "आत्मा का परमात्मा से मिलन का",
        "परमात्मा से मिलन का",
        "इनमें से कोई नहीं"
    ],
    answer: "आत्मा का परमात्मा से मिलन का"
},

{
    question: "गौतम ने वास्तविक ज्ञान को क्या कहा है?",
    option: [
        "प्रमा",
        "अप्रमा",
        "प्रमा एवं अप्रमा",
        "इनमें से कोई नहीं"
    ],
    answer: "प्रमा"
},

{
    question: "गीता में कुल कितने अध्याय हैं?",
    option: [
        "बारह",
        "पंद्रह",
        "अठारह",
        "पच्चीस"
    ],
    answer: "अठारह"
},

{
    question: "देकार्त आत्मा, ईश्वर जैसी सत्ता के ज्ञान का प्रारम्भ कहाँ से मानते हैं?",
    option: [
        "इन्द्रियों से",
        "कल्पना से",
        "परिकल्पना से",
        "स्वतः सिद्ध जन्मजात प्रत्यय से"
    ],
    answer: "स्वतः सिद्ध जन्मजात प्रत्यय से"
},

{
    question: "आलोचकों के मत में देकार्त की तात्विक युक्ति नकल है –",
    option: [
        "एक्वीनस",
        "बेकन",
        "अगस्टीन",
        "एन्सेल्टम"
    ],
    answer: "एन्सेल्टम"
},

{
    question: "चार्वाक को छोड़कर भारत के सभी दार्शनिक किसको बन्धन का मूल कारण मानते हैं?",
    option: [
        "ज्ञान को",
        "अज्ञान को",
        "ज्ञान एवं अज्ञान को",
        "इनमें से कोई नहीं"
    ],
    answer: "अज्ञान को"
},

{
    question: "ईश्वर की सत्ता के लिए नैतिक युक्ति का किसने समर्थन किया है?",
    option: [
        "काण्ट",
        "देकार्त",
        "स्पिनोजा",
        "ह्यूम"
    ],
    answer: "काण्ट"
},

{
    question: "अरस्तु के कारण के कितने प्रकार बताए हैं?",
    option: [
        "दो",
        "तीन",
        "चार",
        "पाँच"
    ],
    answer: "चार"
},

{
    question: "जैन दर्शन के ‘अनेकान्तवाद’ के सिद्धांत का सीधा संबंध किससे है?",
    option: [
        "द्रव्य की अनेकता से",
        "ज्ञान की सापेक्षता से",
        "जैन धर्म के ग्रंथ से",
        "जैन धर्म के पूजा स्थलों से"
    ],
    answer: "द्रव्य की अनेकता से"
},

{
    question: "त्रिरत्न हैं-",
    option: [
        "सम्यक दर्शन",
        "सम्यक ज्ञान",
        "सम्यक चरित्र",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "बुद्ध के अष्टांगिक मार्ग के प्रथम दो (सम्यक दृष्टि एवं सम्यक संकल्प) को कहा जाता है?",
    option: [
        "प्रज्ञा",
        "शील",
        "समाधि",
        "इनमें कोई नहीं"
    ],
    answer: "प्रज्ञा"
},

{
    question: "किसने संस्कारों को प्राथमिक तथा प्रत्ययों को गौण माना है?",
    option: [
        "ह्यूम",
        "लॉक",
        "बर्कले",
        "काण्ट"
    ],
    answer: "ह्यूम"
},

{
    question: "भगवद् गीता के अनुसार वह कर्म क्या है जो बिना फल की इच्छा के किया जाता है?",
    option: [
        "सकाम कर्म",
        "निष्काम कर्म",
        "विकर्म",
        "अकर्म"
    ],
    answer: "निष्काम कर्म"
},

{
    question: "सांख्य एवं योग-दर्शन के अनुसार दुःख के कौन-से प्रकार हैं?",
    option: [
        "आध्यात्मिक दुःख",
        "आधिभौतिक दुःख",
        "आधिदैविक दुःख",
        "ये सभी"
    ],
    answer: "ये सभी"
},

{
    question: "किसके अनुसार गीता कर्म का विज्ञान है?",
    option: [
        "बाल गंगाधर तिलक",
        "विनोबा भावे",
        "अरविन्द घोष",
        "महात्मा गांधी"
    ],
    answer: "बाल गंगाधर तिलक"
},

{
    question: "निम्न में से कौन एकवादी है?",
    option: [
        "देकार्त",
        "स्पिनोजा",
        "सांख्य",
        "लाइबनीज"
    ],
    answer: "स्पिनोजा"
},

{
    question: "वस्तुवाद की क्या मान्यता है?",
    option: [
        "ज्ञेय पदार्थ ज्ञाता पर निर्भर है",
        "ज्ञेय पदार्थ ज्ञाता से स्वतंत्र है",
        "(A) और (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "ज्ञेय पदार्थ ज्ञाता से स्वतंत्र है"
},

{
    question: "निम्नलिखित में कौन-सा कथन अनुभववाद से सम्बद्ध है?",
    option: [
        "ज्ञान प्राप्ति का एकमात्र साधन इन्द्रियानुभूति है",
        "विवेक ही ज्ञान प्राप्ति का एकमात्र साधन है",
        "(A) और (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "ज्ञान प्राप्ति का एकमात्र साधन इन्द्रियानुभूति है"
},

{
    question: "निम्न में से कौन-सा एक दृष्टिकोण वैशेषिक के अनुसार सही नहीं है?",
    option: [
        "परमाणु नित्य हैं",
        "परमाणु से बने समान नित्य हैं",
        "परमाणु उपमान के द्वारा नहीं जाने जाते हैं",
        "इनमें से सभी"
    ],
    answer: "परमाणु उपमान के द्वारा नहीं जाने जाते हैं"
},

{
    question: "योग दर्शन के अष्टांगिक मार्ग में अंतरंग साधन किसे कहते हैं?",
    option: [
        "धारणा",
        "ध्यान",
        "समाधि",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "व्यापार नीतिशास्त्र अध्ययन है-",
    option: [
        "आदर्शों का",
        "मूल्यों का",
        "लाभ का",
        "नैतिकता का"
    ],
    answer: "लाभ का"
},

{
    question: "निम्न में कौन नास्तिक दर्शन हैं? [2018A]",
    option: [
        "बौद्ध दर्शन",
        "जैन दर्शन",
        "चार्वाक दर्शन",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "किसी कार्य की उत्पत्ति में कौन अनिवार्य है?",
    option: [
        "निषेधात्मक उपाधियों की उपस्थिति",
        "भावात्मक उपाधियों की उपस्थिति",
        "निषेधात्मक उपाधियों की अनुपस्थिति",
        "इनमें से कोई नहीं"
    ],
    answer: "भावात्मक उपाधियों की उपस्थिति"
},

{
    question: "निम्नलिखित में से कौन पुनर्जन्म में विश्वास करता है लेकिन आत्मा को शाश्वत नहीं मानता है?",
    option: [
        "जैन दर्शन",
        "सांख्य दर्शन",
        "बौद्ध दर्शन",
        "इनमें से सभी"
    ],
    answer: "बौद्ध दर्शन"
},

{
    question: "वैशेषिक के अभाव पदार्थ दिया है-",
    option: [
        "प्रशस्तपाद द्वारा",
        "गौतम द्वारा",
        "कणाद द्वारा",
        "भर्तृहरि द्वारा"
    ],
    answer: "प्रशस्तपाद द्वारा"
},

{
    question: "कर्म सिद्धांत कारणतावाद है-",
    option: [
        "तार्किक",
        "न्यायिक",
        "नैतिक",
        "इनमें से कोई नहीं"
    ],
    answer: "नैतिक"
},

{
    question: "अद्वैत वेदांत के मूल में क्या है ?",
    option: [
        "योग विद्या",
        "ब्रह्म विद्या",
        "जगत् विद्या",
        "माया विद्या"
    ],
    answer: "ब्रह्म विद्या"
},

{
    question: "प्रकृति के गुणों में होने वाले परिवर्तन को कहते हैं-",
    option: [
        "विरूप परिवर्तन",
        "शाश्वत परिवर्तन",
        "आकारिक परिवर्तन",
        "अंतिम परिवर्तन"
    ],
    answer: "विरूप परिवर्तन"
},

{
    question: "कौन नास्तिक शिरोधर्म कहलाता है?",
    option: [
        "बौद्ध",
        "जैन",
        "चार्वाक",
        "न्याय"
    ],
    answer: "चार्वाक"
},

{
    question: "निम्न में से कौन चिंतक संदेहवाद से संबंधित है?",
    option: [
        "लॉक",
        "स्पिनोजा",
        "ह्यूम",
        "प्लेटो"
    ],
    answer: "ह्यूम"
},

{
    question: "‘पंचस्कंधवाद’ की वकालत कौन भारतीय दर्शन करता है?",
    option: [
        "बौद्ध दर्शन",
        "जैन दर्शन",
        "न्याय दर्शन",
        "सांख्य दर्शन"
    ],
    answer: "बौद्ध दर्शन"
},

{
    question: "शंकर के अनुसार जगत् को किस सत्ता के अन्तर्गत रखा जा सकता है?",
    option: [
        "प्रतिभाषित सत्ता",
        "व्यावहारिक सत्ता",
        "पारमार्थिक सत्ता",
        "इनमें सभी"
    ],
    answer: "व्यावहारिक सत्ता"
},

{
    question: "अन्तक्रियावाद सिद्धान्त के प्रवर्तक हैं।",
    option: [
        "स्पीनोजा",
        "लाइबनीज",
        "देकार्त",
        "ह्यूम"
    ],
    answer: "देकार्त"
},

{
    question: "जब आत्मा शरीर, इन्द्रिय मन इत्यादि उपाधियों से सीमित हो जाता है, तो वह है-",
    option: [
        "ब्रह्म",
        "जीव",
        "माया",
        "इनमें से कोई नहीं"
    ],
    answer: "जीव"
},

{
    question: "रामानुजाचार्य ने किस दर्शन को प्रतिपादित किया है?",
    option: [
        "अद्वैतवाद",
        "विशिष्टाद्वैतवाद",
        "द्वैतवाद",
        "भेदाभेदवाद"
    ],
    answer: "विशिष्टाद्वैतवाद"
},

{
    question: "भारतीय दर्शन में बंधन की अवधारणा का क्या अर्थ है? [2022A]",
    option: [
        "आत्मा का शरीर से बंधे रहना",
        "शरीर का जगत से बंधे रहना",
        "जीवात्मा का परमात्मा से बंधे रहना",
        "सगुण ईश्वर का निर्गुण ईश्वर से बंधे रहना"
    ],
    answer: "आत्मा का शरीर से बंधे रहना"
},

{
    question: "सांख्य दर्शन में आत्मा के लिए जिस पद का प्रयोग हुआ है वह है-",
    option: [
        "जीव",
        "आत्मा",
        "पुरुष",
        "इनमें से कोई नहीं"
    ],
    answer: "पुरुष"
},

{
    question: "मीमांसा दर्शन के प्रणेता हैं-",
    option: [
        "कपिल",
        "गौतम",
        "जैमिनि",
        "पतंजलि"
    ],
    answer: "जैमिनि"
},

{
    question: "अयथार्थ ज्ञान कहलाता है",
    option: [
        "अप्रमा",
        "प्रमा",
        "प्रमाण",
        "इनमें से कोई नहीं"
    ],
    answer: "अप्रमा"
},

{
    question: "सर्वोच्च शुभ किसे कहा जाता है?",
    option: [
        "सापेक्ष शुभ को",
        "निरपेक्ष शुभ को",
        "(A) एवं (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "निरपेक्ष शुभ को"
},

{
    question: "निम्नलिखित में कौन-सा कथन अनुभववाद से सम्बद्ध है?",
    option: [
        "ज्ञान-प्राप्ति का एकमात्र साधन इन्द्रियानुभूति है",
        "विवेक ही ज्ञान-प्राप्ति का एकमात्र साधन है",
        "(A) और (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "ज्ञान-प्राप्ति का एकमात्र साधन इन्द्रियानुभूति है"
},

{
    question: "भौतिकवाद के अनुसार परम सत्ता है-",
    option: [
        "प्रत्यय",
        "तटस्थ",
        "जड़",
        "ईश्वर"
    ],
    answer: "जड़"
},

{
    question: "दण्ड की अवधारणा है-",
    option: [
        "सामाजिक",
        "दार्शनिक",
        "नैतिक",
        "इनमें से सभी"
    ],
    answer: "नैतिक"
},

{
    question: "अद्वैत वेदांत में जगत् है-",
    option: [
        "पूर्णतः सत्य",
        "पूर्णतः असत्य",
        "मिथ्या",
        "इनमें से सभी"
    ],
    answer: "मिथ्या"
},

{
    question: "सांख्य दर्शन में सत्त्वगुण के स्वरूप के संदर्भ में क्या स्वीकार किया जाता है?",
    option: [
        "सत्य सुख का स्वभाव और स्रोत है",
        "सत्त्व लघु है",
        "सत्त्व चमकीला है",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "सांख्य दर्शन का आध्यात्मिक सत्ता क्या है?",
    option: [
        "प्रकृति",
        "पृथ्वी",
        "ईश्वर",
        "पुरुष"
    ],
    answer: "पुरुष"
},

{
    question: "जैन दर्शन के अनेकान्तवाद की क्या मान्यता है?",
    option: [
        "विश्व की विभिन्न वस्तुएँ एक दूसरे से संबंधित नहीं होती हैं",
        "विश्व की विभिन्न वस्तुओं के अनेक रूप नहीं होते हैं",
        "विश्व का अस्तित्व नहीं है",
        "विश्व की विभिन्न वस्तुओं के अनेक रूप होते हैं"
    ],
    answer: "विश्व की विभिन्न वस्तुओं के अनेक रूप होते हैं"
},

{
    question: "निम्न में से कौन आस्तिक दर्शन नहीं है?",
    option: [
        "न्याय दर्शन",
        "योग दर्शन",
        "मीमांसा दर्शन",
        "इनमें से कोई नहीं"
    ],
    answer: "इनमें से कोई नहीं"
},

{
    question: "कारण होता है-",
    option: [
        "अनौपाधिक",
        "पूर्ववर्ती",
        "नियत",
        "उपरोक्त सभी"
    ],
    answer: "उपरोक्त सभी"
},

{
    question: "सांख्य का अर्थ है सम्यक ज्ञान सम्यक ज्ञान का अर्थ है-",
    option: [
        "पुरुष का ज्ञान",
        "प्रकृति का ज्ञान",
        "पुरुष और प्रकृति के बीच भिन्नता का ज्ञान",
        "ये सभी"
    ],
    answer: "पुरुष और प्रकृति के बीच भिन्नता का ज्ञान"
},

{
    question: "निम्नलिखित में से किस एक में बुद्ध के उपदेश संग्रहित हैं?",
    option: [
        "न्याय सूत्र में",
        "त्रिपिटक में",
        "ज्ञान की पुस्तक में",
        "न्याय दर्शन"
    ],
    answer: "त्रिपिटक में"
},

{
    question: "बौद्ध दर्शन के अनुसार अर्हत् किसे कहते हैं?",
    option: [
        "वह जिसने अपनी सभी इच्छाओं पर नियंत्रण पा लिया है",
        "वह जो अपनी इच्छाओं के वश में है",
        "वह जो अपनी इच्छाओं को तृप्त चाहता है",
        "इनमें से सभी"
    ],
    answer: "वह जिसने अपनी सभी इच्छाओं पर नियंत्रण पा लिया है"
},

{
    question: "कारण कार्य संबंध बतलाने वाले सिद्धांत में की क्या विशेषता है?",
    option: [
        "ये वैज्ञानिक सिद्धांत हैं",
        "ये अवैज्ञानिक सिद्धांत हैं",
        "ये धार्मिक सिद्धांत हैं",
        "ये नैतिक सिद्धांत हैं"
    ],
    answer: "ये वैज्ञानिक सिद्धांत हैं"
},

{
    question: "निम्नलिखित में कौन-सा एक परार्थानुमान का घटक नहीं है?",
    option: [
        "परामर्श",
        "उदाहरण",
        "हेतु",
        "उपनय"
    ],
    answer: "परामर्श"
},

{
    question: "न्याय ज्ञानमीमांसा में शेषवत् क्या है?",
    option: [
        "तात्कालिक अनुमान",
        "प्रत्यक्ष",
        "उपमान",
        "शाब्दिक प्रमाण"
    ],
    answer: "तात्कालिक अनुमान"
},

{
    question: "प्रत्ययवाद के अनुसार परम सत्ता है-",
    option: [
        "प्रत्यय",
        "जड़",
        "तटस्थ",
        "इनमें से कोई नहीं"
    ],
    answer: "प्रत्यय"
},

{
    question: "सन्देह का देकार्त के दर्शन में क्या स्थान है?",
    option: [
        "दार्शनिक विचार का प्रारम्भ बिंदु",
        "सत्य का साधन",
        "प्रथम असंदिग्ध सत्य की खोज का साधन",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "पुरुषार्थ हैं- [2009A, 11A, 14A]",
    option: [
        "दो",
        "तीन",
        "चार",
        "इनमें से कोई नहीं"
    ],
    answer: "चार"
},

{
    question: "स्यादवाद सिद्धांत संबंधित है-",
    option: [
        "न्याय दर्शन",
        "बौद्ध दर्शन",
        "जैन दर्शन",
        "इनमें से कोई नहीं"
    ],
    answer: "जैन दर्शन"
},

{
    question: "बुद्ध के अनुसार दुःख का मूल कारण है-",
    option: [
        "तृष्णा",
        "जाति",
        "नामरूप",
        "अविद्या"
    ],
    answer: "तृष्णा"
},

{
    question: "निम्न में से कौन एक समानान्तरवाद का समर्थक है ?",
    option: [
        "लाइबनिस",
        "लॉक",
        "देकार्त",
        "स्पिनोजा"
    ],
    answer: "स्पिनोजा"
},

{
    question: "निम्नलिखित में से अनुभववादी तर्कशास्त्री कौन है?",
    option: [
        "जॉन लॉक",
        "बर्कले",
        "ह्यूम",
        "इनमें सभी"
    ],
    answer: "इनमें सभी"
},

{
    question: "“पूर्व-स्थापित सामंजस्यवाद’ दिया गया है-",
    option: [
        "देकार्त द्वारा",
        "स्पिनोजा द्वारा",
        "लाइबनीज द्वारा",
        "ह्यूम द्वारा"
    ],
    answer: "लाइबनीज द्वारा"
},

{
    question: "गीता रहस्य की रचना किसने की है?",
    option: [
        "बाल गंगाधर तिलक",
        "महात्मा गांधी",
        "अरविन्द घोष",
        "इनमें से कोई नहीं"
    ],
    answer: "बाल गंगाधर तिलक"
},

{
    question: "किस बुद्धिवादी दार्शनिक ने पूर्व स्थापित सामंजस्य का सिद्धान्त प्रतिपादित किया है?",
    option: [
        "स्पिनोजा",
        "देकार्त",
        "लाइबनिज",
        "काण्ट"
    ],
    answer: "लाइबनिज"
},

{
    question: "योग दर्शन है-",
    option: [
        "द्वैतवादी",
        "अद्वैतवादी",
        "द्वैतवादी एवं अद्वैतवादी",
        "इनमें से कोई नहीं"
    ],
    answer: "द्वैतवादी"
},

{
    question: "काण्ट के ज्ञान सम्बन्धी विचार को कहते हैं-",
    option: [
        "अनुभववाद",
        "समीक्षावाद",
        "बुद्धिवाद",
        "इनमें से कोई नहीं"
    ],
    answer: "समीक्षावाद"
},

{
    question: "‘स्वयं सोचता हूँ इसलिए मैं हूँ’ यह कथन किसका है?",
    option: [
        "स्पिनोजा",
        "बर्कले",
        "लॉक",
        "देकार्त"
    ],
    answer: "देकार्त"
},

{
    question: "जैन दर्शन के अनुसार अनस्तिकाय द्रव्य क्या है?",
    option: [
        "अजीव",
        "जीव",
        "काल",
        "इनमें से कोई नहीं"
    ],
    answer: "काल"
},

{
    question: "भारतीय दर्शन का सामान्य लक्षण है- [2014A]",
    option: [
        "अविद्या",
        "मोक्ष (मुक्ति)",
        "पुनर्जन्म",
        "इनमें से सभी"
    ],
    answer: "मोक्ष (मुक्ति)"
},

{
    question: "गीता में किस योग की चर्चा हुई है?",
    option: [
        "ज्ञान योग",
        "भक्तियोग",
        "कर्मयोग",
        "ये सभी"
    ],
    answer: "ये सभी"
},

{
    question: "क्षणभंगुर की अवधारणा किस दर्शन की है?",
    option: [
        "बौद्ध दर्शन",
        "जैन दर्शन",
        "न्याय दर्शन",
        "इनमें से कोई नहीं"
    ],
    answer: "बौद्ध दर्शन"
},

{
    question: "अद्वैत वेदांत के अनुसार जगत है-",
    option: [
        "प्रतिभासिक सत्ता",
        "व्यावहारिक सत्ता",
        "पारमार्थिक सत्ता",
        "इनमें से कोई नहीं"
    ],
    answer: "व्यावहारिक सत्ता"
},

{
    question: "निम्नलिखित में से कौन भगवद् गीता के अनुसार ईश्वर के अवतार हैं?",
    option: [
        "अर्जुन",
        "कर्ण",
        "कृष्ण",
        "भीम"
    ],
    answer: "कृष्ण"
},

{
    question: "जन्मजात प्रत्ययों के विचार का खण्डन किसने किया?",
    option: [
        "लॉक",
        "बर्कले",
        "ह्यूम",
        "काण्ट"
    ],
    answer: "लॉक"
},

{
    question: "पदार्थ सिद्धांत संबंधित है-",
    option: [
        "न्याय दर्शन",
        "वैशेषिक दर्शन",
        "सांख्य दर्शन",
        "इनमें से कोई नहीं"
    ],
    answer: "न्याय दर्शन"
},

{
    question: "भारतीय दर्शन की उत्पत्ति हुई- [2009A, 2023A]",
    option: [
        "निराशावादी दृष्टिकोण से",
        "आध्यात्मिक असंतोष से",
        "पलायनवादी प्रवृत्ति से",
        "भौतिक सुख प्राप्ति की कामना से"
    ],
    answer: "आध्यात्मिक असंतोष से"
},

{
    question: "आत्मा और जगत से संबंधित लोकप्रिय प्रश्नों के प्रति महात्मा बुद्ध मौन रहा करते थे? ऐसे मुख्य प्रश्नों की संख्या कितनी है?",
    option: [
        "चार",
        "दो",
        "आठ",
        "दस"
    ],
    answer: "दस"
},

{
    question: "दर्शन की उत्पत्ति किस धातु से हुई है? [2009A, 12, 14A]",
    option: [
        "कृ धातु से",
        "दृश धातु से",
        "लृ धातु से",
        "इनमें से कोई नहीं"
    ],
    answer: "दृश धातु से"
},

{
    question: "अलौकिक प्रत्यक्ष का उदाहरण क्या है?",
    option: [
        "सामान्य लक्षण प्रत्यक्ष",
        "ज्ञान लक्षण प्रत्यक्ष",
        "योगज प्रत्यक्ष",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "गीता में स्वधर्म का क्या अभिप्राय है?",
    option: [
        "जिस वर्ण का जो स्वाभाविक कर्म है वही उसका स्वधर्म है",
        "वर्णों के वर्णान्तर कर्म ही उनका स्वधर्म है",
        "उपर्युक्त दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "जिस वर्ण का जो स्वाभाविक कर्म है वही उसका स्वधर्म है"
},

{
    question: "नैतिक निर्णय क्या है?",
    option: [
        "वास्तविकता सूचक निर्णय",
        "वर्णनात्मक निर्णय",
        "तार्किक निर्णय",
        "मूल्य विषयक निर्णय"
    ],
    answer: "मूल्य विषयक निर्णय"
},

{
    question: "निम्न में से कौन आस्तिक दर्शन है?",
    option: [
        "जैन दर्शन",
        "बौद्ध दर्शन",
        "सांख्य दर्शन",
        "इनमें से कोई नहीं"
    ],
    answer: "सांख्य दर्शन"
},

{
    question: "भगवद्गीता में कौन से विचार पाये जाते हैं?",
    option: [
        "निष्काम कर्म",
        "योग की अवधारणा",
        "लोक संग्रह",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "कौन वस्तुवादी है ?",
    option: [
        "न्याय",
        "देकार्त",
        "स्पिनोजा",
        "लाइबनिज"
    ],
    answer: "देकार्त"
},

{
    question: "सत्कार्यवाद के रूप हैं-",
    option: [
        "विवर्तवाद एवं आरम्भवाद",
        "विवर्तवाद",
        "विवर्तवाद एवं परिणामवाद",
        "परिणामवाद"
    ],
    answer: "विवर्तवाद एवं परिणामवाद"
},

{
    question: "सांख्य दर्शन के अनुसार गुण के प्रकार हैं-",
    option: [
        "सत्त्व",
        "रजस्",
        "तमस्",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "महायान धार्मिक सम्प्रदाय का संबंध किस दर्शन से है?",
    option: [
        "जैन दर्शन से",
        "बौद्ध दर्शन से",
        "न्याय दर्शन से",
        "सांख्य दर्शन से"
    ],
    answer: "बौद्ध दर्शन से"
},

{
    question: "न्याय, वैशेषिक, सांख्य एवं योग निम्न में से किस दार्शनिक सम्प्रदाय में आते हैं?",
    option: [
        "आस्तिक",
        "नास्तिक",
        "आस्तिक एवं नास्तिक",
        "इनमें से कोई नहीं"
    ],
    answer: "आस्तिक"
},

{
    question: "तत्त्व के निम्नलिखित में से कौन लक्षण है?",
    option: [
        "उत्पत्ति",
        "क्षय",
        "नित्यता",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "देकार्त के बाद किस आधुनिक बुद्धिवादी ने मन और शरीर को एक ही माना है?",
    option: [
        "लाइबनिज",
        "स्पिनोजा",
        "लॉक",
        "बर्कले"
    ],
    answer: "स्पिनोजा"
},

{
    question: "श्वेताम्बर धार्मिक सम्प्रदाय का संबंध किस दर्शन से है?",
    option: [
        "जैन दर्शन",
        "बौद्ध दर्शन",
        "सांख्य दर्शन",
        "योग दर्शन"
    ],
    answer: "जैन दर्शन"
},

{
    question: "स्यादवाद को समझाने के लिए जैन दर्शन में कितने नयों का प्रतिपादन किया गया?",
    option: [
        "चार",
        "पाँच",
        "सात",
        "नव"
    ],
    answer: "सात"
},

{
    question: "अनुमान का तार्किक आधार है-",
    option: [
        "हेतु",
        "व्याप्ति",
        "पक्ष",
        "इनमें से कोई नहीं"
    ],
    answer: "हेतु"
},

{
    question: "बौद्ध दर्शन का मौलिक एवं प्रामाणिक आधार निम्न में से कौन है?",
    option: [
        "सुत्तपिटक",
        "अभिधम्मपिटक",
        "विनयपिटक",
        "ये सभी"
    ],
    answer: "ये सभी"
},

{
    question: "पूर्वस्थापित सामंजस्य सिद्धांत संबंधित है –",
    option: [
        "देकार्त से",
        "काण्ट से",
        "लाइबनित्स से",
        "इनमें से कोई नहीं"
    ],
    answer: "लाइबनित्स से"
},

{
    question: "भगवद्गीता में योग शब्द का प्रयोग किन अर्थ में हुआ है?",
    option: [
        "समाधिवाचक",
        "संबंधवाचक",
        "(A) एवं (B) दोनों",
        "दोनों में से कोई नहीं"
    ],
    answer: "दोनों में से कोई नहीं"
},

{
    question: "व्यापार व्यवसाय है-",
    option: [
        "अनीतिक",
        "क्रूर",
        "लाभोन्मुखी",
        "इनमें से कोई नहीं"
    ],
    answer: "लाभोन्मुखी"
},

{
    question: "गीता की रचना किसके द्वारा की गयी है?",
    option: [
        "व्यास के द्वारा",
        "कृष्ण के द्वारा",
        "अर्जुन के द्वारा",
        "इनमें से कोई नहीं"
    ],
    answer: "व्यास के द्वारा"
},

{
    question: "‘ज्ञान की प्राप्ति जन्मजात प्रत्यय से होती है।’ ऐसा मानना है",
    option: [
        "बुद्धिवाद का",
        "अनुभववाद का",
        "समीक्षावाद का",
        "इनमें से कोई नहीं"
    ],
    answer: "बुद्धिवाद का"
},

{
    question: "पर्यावरणीय नीतिशास्त्र है-",
    option: [
        "मनुष्य केन्द्रित",
        "जीवन केन्द्रित",
        "पशु केन्द्रित",
        "इनमें से सभी"
    ],
    answer: "मनुष्य केन्द्रित"
},

{
    question: "ब्रह्म है-",
    option: [
        "अनेक",
        "अचेतन",
        "अनिर्वचनीय",
        "इनमें से कोई नहीं"
    ],
    answer: "इनमें से कोई नहीं"
},

{
    question: "जड़ में गति प्रदान करने वाली शक्ति को क्या कहते हैं?",
    option: [
        "निमित्त कारण",
        "उपादान कारण",
        "आकारिक कारण",
        "अंतिम कारण"
    ],
    answer: "निमित्त कारण"
},

{
    question: "समीक्षावाद का निर्माण होता है",
    option: [
        "अनुभववाद के भावात्मक अंशों को मिलाकर",
        "बुद्धिवाद के भावात्मक अंशों को मिलाकर",
        "अनुभववाद एवं बुद्धिवाद के भावात्मक अंशों को मिलाकर",
        "अनुभववाद एवं बुद्धिवाद के नकारात्मक अंशों को मिलाकर"
    ],
    answer: "अनुभववाद एवं बुद्धिवाद के भावात्मक अंशों को मिलाकर"
},

{
    question: "किस दार्शनिक ने कहा है- ‘ज्ञान संश्लेषणात्मक प्रागनुभविक निर्णय है’?",
    option: [
        "काण्ट",
        "हेगल",
        "लाइबनिज",
        "स्पिनोजा"
    ],
    answer: "काण्ट"
},

{
    question: "भारतीय दर्शन को निराशावादी क्यों कहा गया है ?",
    option: [
        "आत्मा को शाश्वत मानने के कारण",
        "जगत को दुःखपूर्ण मानने के कारण",
        "मुक्ति की अवधारणा के कारण",
        "कर्म सिद्धांत के कारण"
    ],
    answer: "जगत को दुःखपूर्ण मानने के कारण"
},

{
    question: "अनुभववाद और बुद्धिवाद का सिद्धान्त है",
    option: [
        "एक-दूसरे का विरोधी",
        "एक-दूसरे का पूरक",
        "न तो विरोधी और न पूरक",
        "इनमें से कोई नहीं"
    ],
    answer: "एक-दूसरे का विरोधी"
},

{
    question: "न्याय ज्ञानमीमांसा में ज्ञान लक्षण प्रत्यक्ष क्या है?",
    option: [
        "अलौकिक प्रत्यक्ष",
        "लौकिक प्रत्यक्ष",
        "सविकल्पक प्रत्यक्ष",
        "निर्विकल्पक प्रत्यक्ष"
    ],
    answer: "अलौकिक प्रत्यक्ष"
},

{
    question: "भारतीय दर्शन अपनी किस विशेषता के कारण पाश्चात्य दर्शन से भिन्नता स्थापित करता है ? [2022 A]",
    option: [
        "केवल ज्ञान के आधार पर",
        "केवल ईश्वर विचार के आधार पर",
        "केवल जगत विचार के आधार पर",
        "दृष्टि युक्त ज्ञान के आधार पर"
    ],
    answer: "दृष्टि युक्त ज्ञान के आधार पर"
},

{
    question: "अद्वैत वेदांत के अनुसार चेतन आत्मा का है",
    option: [
        "गुण",
        "स्वरूप",
        "प्रज्ञा",
        "इनमें से कोई नहीं"
    ],
    answer: "स्वरूप"
},

{
    question: "अद्वैतवाद के अनुसार विश्व की सृष्टि कौन करता है ?",
    option: [
        "अपर ब्रह्म",
        "ईश्वर",
        "सगुण ब्रह्म",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "अनुभववाद के समर्थक हैं",
    option: [
        "लॉक",
        "बर्कले",
        "ह्यूम",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "निम्नलिखित में से कौन भारतीय दार्शनिक नहीं हैं? [2023A]",
    option: [
        "कपिल",
        "गौतम",
        "कैंट",
        "कणाद"
    ],
    answer: "कैंट"
},

{
    question: "‘मैं सोचता हूँ इसलिए मैं हूँ’ यह कथन है-",
    option: [
        "देकार्त का",
        "लॉक का",
        "ह्यूम का",
        "प्लेटो का"
    ],
    answer: "देकार्त का"
},

{
    question: "किसने कहा है कि कार्य-कारण संबंध आदत और प्रथा के कारण बनते हैं?",
    option: [
        "देकार्त",
        "स्पिनोजा",
        "ह्यूम",
        "लाइबनीज"
    ],
    answer: "ह्यूम"
},

{
    question: "निम्नलिखित में किस दर्शन के अनुसार जीवन का मूल उद्देश्य मोक्षानुभूति प्राप्त करना है?",
    option: [
        "योग-दर्शन",
        "सांख्य-दर्शन",
        "न्याय-दर्शन",
        "योग-दर्शन एवं सांख्य-दर्शन"
    ],
    answer: "योग-दर्शन एवं सांख्य-दर्शन"
},

{
    question: "भारतीय-दर्शन के अनुसार जीवन का कौन-सा प्रयोजन भौतिक है ? [2022 A]",
    option: [
        "काम",
        "अर्थ",
        "धर्म",
        "A और B दोनों"
    ],
    answer: "A और B दोनों"
},

{
    question: "स्पिनोजा ने स्वीकारा है",
    option: [
        "अंत:क्रियावाद",
        "समानान्तरवाद",
        "पूर्वस्थापित सामंजस्यवाद",
        "इनमें से कोई नहीं"
    ],
    answer: "समानान्तरवाद"
},

{
    question: "आत्मा की सत्यता कौन-सी है?",
    option: [
        "व्यावहारिक",
        "पारमार्थिक",
        "प्रतिभाषित",
        "इनमें से कोई नहीं"
    ],
    answer: "पारमार्थिक"
},

{
    question: "भारतीय दर्शन की कौन-सी अवधारणा मनुष्य के सांसारिक जीवन के क्रमिक विकास का उद्देश्य निर्धारित करता है ? [2022 A]",
    option: [
        "द्रव्य की अवधारणा",
        "पुरुषार्थ की अवधारणा",
        "ईश्वर की अवधारणा",
        "इनमें से कोई भी नहीं"
    ],
    answer: "पुरुषार्थ की अवधारणा"
},

{
    question: "ऋण की अवधारणा संबंधित है?",
    option: [
        "ब्रह्मचर्याश्रम से",
        "गृहस्थाश्रम से",
        "वानप्रस्थाश्रम से",
        "संन्यासाश्रम से"
    ],
    answer: "गृहस्थाश्रम से"
},

{
    question: "किस दार्शनिक ने कहा है- “ज्ञान संश्लेषणात्मक प्रागनुभविक निर्णय है”?",
    option: [
        "काण्ट",
        "हेगल",
        "लाइबनिज",
        "स्पिनोजा"
    ],
    answer: "काण्ट"
},

{
    question: "लोकसंग्रह का सिद्धांत क्या है?",
    option: [
        "पदार्थ सुखवाद",
        "सर्वकल्याणवाद",
        "पूर्णतावाद",
        "इनमें से सभी"
    ],
    answer: "सर्वकल्याणवाद"
},

{
    question: "वस्तुवाद है-",
    option: [
        "तत्वमीमांसीय सिद्धान्त",
        "ज्ञानमीमांसीय सिद्धान्त",
        "तत्वमीमांसीय एवं ज्ञानमीमांसीय दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "तत्वमीमांसीय सिद्धान्त"
},

{
    question: "प्रतित्यसमुत्पाद सिद्धान्त का संबंध निम्न में से किनके साथ है?",
    option: [
        "महात्मा बुद्ध",
        "महात्मा महावीर",
        "(A) एवं (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "महात्मा बुद्ध"
},

{
    question: "प्रत्याहार की अवस्था का योग-प्रविधि में क्या योगदान है?",
    option: [
        "इन्द्रियों को बाह्य विषयों से वापस खींचना",
        "इन्द्रियों को आंतरिक विषयों से वापस खींचना",
        "इन्द्रियों को वापस मन के पूर्ण वश में करना",
        "इनमें से सभी"
    ],
    answer: "इन्द्रियों को बाह्य विषयों से वापस खींचना"
},

{
    question: "वैशेषिक दर्शन के अनुसार द्रव्य की संख्या कितनी है?",
    option: [
        "पाँच",
        "छः",
        "नौ",
        "चार"
    ],
    answer: "नौ"
},

{
    question: "सविकल्पक प्रत्यक्ष के पहले की अवस्था क्या है?",
    option: [
        "उपमान",
        "शब्द",
        "सामान्य लक्षण प्रत्यक्ष",
        "निर्विकल्पक प्रत्यक्ष"
    ],
    answer: "निर्विकल्पक प्रत्यक्ष"
},

{
    question: "बुद्ध के अष्टांगिक मार्ग को किन अंगों में बाँटा जा सकता है?",
    option: [
        "प्रज्ञा",
        "शील",
        "समाधि",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "कारण का गुणात्मक लक्षण है-",
    option: [
        "पूर्ववर्ती घटना है",
        "अनौपाधिक घटना है",
        "तात्कालिक, नियत, अनौपाधिक, पूर्ववर्ती घटना है",
        "इनमें से सभी"
    ],
    answer: "तात्कालिक, नियत, अनौपाधिक, पूर्ववर्ती घटना है"
},

{
    question: "ईश्वर की सत्ता के लिए सत्तामूलक युक्ति का किसने समर्थन किया है?",
    option: [
        "लॉक",
        "ह्यूम",
        "काण्ट",
        "देकार्त"
    ],
    answer: "देकार्त"
},

{
    question: "जैन दर्शन के अनुसार द्रव्य का क्या लक्षण है?",
    option: [
        "उत्पत्ति",
        "विनाश",
        "स्थिरता",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "ग्रीक दर्शन के जनक हैं-",
    option: [
        "सुकरात",
        "थेल्स",
        "अरस्तु",
        "ह्यूम"
    ],
    answer: "थेल्स"
},

{
    question: "देकार्त मन तथा शरीर के संबंध की व्याख्या किया है",
    option: [
        "पूर्व स्थापित सामंजस्य द्वारा",
        "क्रिया-प्रतिक्रियावाद द्वारा",
        "दोनों सिद्धांतों द्वारा",
        "इनमें से कोई नहीं"
    ],
    answer: "क्रिया-प्रतिक्रियावाद द्वारा"
},

{
    question: "देकार्त, स्पिनोजा एवं लाइबनिज ज्ञान के किस सिद्धान्त को मानने वाले हैं?",
    option: [
        "अनुभववादी सिद्धान्त",
        "बुद्धिवादी सिद्धान्त",
        "(A) और (B) दोनों",
        "इनमें से कोई नहीं"
    ],
    answer: "बुद्धिवादी सिद्धान्त"
},

{
    question: "किस तर्क ने जगत के अस्तित्व के आधार पर ईश्वर का अस्तित्व प्रमाणित किया है?",
    option: [
        "जगत-सम्बन्धी तर्क",
        "प्रयोजनमूलक तर्क",
        "कारणता-सम्बन्धी तर्क",
        "सत्तावादी तर्क"
    ],
    answer: "सत्तावादी तर्क"
},

{
    question: "किस आधुनिक पाश्चात्य अनुभववादी ने अपने पूर्व के कारण-कार्य सिद्धान्त की पूर्व मान्यताओं को धराशायी कर दिया?",
    option: [
        "लॉक",
        "बर्कले",
        "ह्यूम",
        "स्पिनोजा"
    ],
    answer: "ह्यूम"
},

{
    question: "किसने कहा है कि बुद्धिवाद का अन्त अंधविश्वास में तथा अनुभववाद का अन्त संशयवाद में होता है?",
    option: [
        "लॉक",
        "बर्कले",
        "ह्यूम",
        "काण्ट"
    ],
    answer: "काण्ट"
},

{
    question: "समीक्षावाद का निर्माण होता है",
    option: [
        "अनुभववाद के भावात्मक अंशों को मिलाकर",
        "बुद्धिवाद के भावात्मक अंशों को मिलाकर",
        "अनुभववाद एवं बुद्धिवाद के भावात्मक अंशों को मिलाकर",
        "अनुभववाद एवं बुद्धिवाद के नकारात्मक अंशों को मिलाकर"
    ],
    answer: "अनुभववाद एवं बुद्धिवाद के भावात्मक अंशों को मिलाकर"
},

{
    question: "‘प्रतित्यसमुत्पाद’ की चर्चा बौद्ध दर्शन के किस आर्य सत्य में हुई है?",
    option: [
        "प्रथम आर्य सत्य",
        "द्वितीय आर्य सत्य",
        "तृतीय आर्य सत्य",
        "चतुर्थ आर्य सत्य"
    ],
    answer: "द्वितीय आर्य सत्य"
},

{
    question: "न्याय ज्ञानमीमांसा के अनुसार प्रमेय क्या है?",
    option: [
        "प्रमाता",
        "प्रमाण",
        "प्रमा",
        "प्रमा का विषय"
    ],
    answer: "प्रमा का विषय"
},

{
    question: "न्याय दर्शन के प्रवर्तक कौन थे?",
    option: [
        "अक्षपाद",
        "नागार्जुन",
        "कपिल",
        "कणाद"
    ],
    answer: "अक्षपाद"
},

{
    question: "किसके अनुसार ‘यथार्थ ज्ञान सार्वभौम, अनिवार्य और नवीन होना चाहिए’?",
    option: [
        "काण्ट",
        "स्पिनोजा",
        "लॉक",
        "ह्यूम"
    ],
    answer: "काण्ट"
},

{
    question: "तत्व चिन्तामणि पुस्तक के लेखक कौन हैं",
    option: [
        "उदयन",
        "गंगेश",
        "गौतम",
        "प्रशस्तपाद"
    ],
    answer: "गंगेश"
},

{
    question: "मूल तत्त्व के सन्दर्भ में अद्वैत वेदान्त किस तत्त्व मीमांसा को अपनाता है ?",
    option: [
        "शुद्ध एकवाद",
        "द्वैतवाद",
        "विशिष्ट द्वैतवाद",
        "इनमें से सभी"
    ],
    answer: "शुद्ध एकवाद"
},

{
    question: "निम्नलिखित में कौन कर्म के एक प्रकार हैं?",
    option: [
        "संचित कर्म",
        "प्रारब्ध कर्म",
        "संचीयमान कर्म",
        "ये सभी"
    ],
    answer: "ये सभी"
},

{
    question: "भारतीय दर्शन में कर्म सिद्धांत के अनुसार कर्म का फल क्या हो सकता है?",
    option: [
        "बंधन",
        "जीवन में दुःख",
        "पुनर्जन्म",
        "इनमें से सभी"
    ],
    answer: "इनमें से सभी"
},

{
    question: "सर्वेश्वरवाद के समर्थक कौन हैं?",
    option: [
        "ह्यूम",
        "लॉक",
        "स्पिनोजा",
        "काण्ट"
    ],
    answer: "स्पिनोजा"
},

{
    question: "बुद्ध के अनुसार द्वितीय आर्य सत्य निम्नलिखित में से कौन है?",
    option: [
        "संसार दुखों से परिपूर्ण है",
        "दुखों का कारण भी है",
        "दुखों का अन्त संभव है",
        "दुखों के अन्त का मार्ग है"
    ],
    answer: "दुखों का कारण भी है"
},

{
    question: "अनुमान प्रमाण का जड़ क्या होता है? [2021A]",
    option: [
        "उपमान",
        "प्रत्यक्ष",
        "शब्द",
        "इनमें से कोई नहीं"
    ],
    answer: "प्रत्यक्ष"
},

{
    question: "महात्मा गांधी ने गीता को कहा है-",
    option: [
        "माता",
        "पिता",
        "बाइबिल",
        "कुरान"
    ],
    answer: "माता"
},

{
    question: "ब्रह्मसूत्र के रचयिता हैं",
    option: [
        "गौड़पाद",
        "बर्कले",
        "शंकर",
        "निम्बार्क"
    ],
    answer: "शंकर"
},

{
    question: "एनीसेल्म के समय में किस सिद्धान्त का वर्चस्व था ?",
    option: [
        "बल सिद्धान्त",
        "गति सिद्धान्त",
        "गुरुत्वाकर्षण सिद्धान्त",
        "इनमें से कोई नहीं"
    ],
    answer: "गुरुत्वाकर्षण सिद्धान्त"
},

{
    question: "बौद्ध-दर्शन के संस्थापक कौन थे?",
    option: [
        "नागार्जुन",
        "महात्मा बुद्ध",
        "गौतम ऋषि",
        "राहुल"
    ],
    answer: "महात्मा बुद्ध"
},

{
    question: "अयथार्थ ज्ञान कहलाता है",
    option: [
        "अप्रमा",
        "प्रमा",
        "प्रमाण",
        "इनमें से कोई नहीं"
    ],
    answer: "अप्रमा"
},

{
    question: "जैन दर्शन के अनुसार जीवन का चरम लक्ष्य है-",
    option: [
        "अर्थ",
        "धर्म",
        "काम",
        "मोक्ष"
    ],
    answer: "मोक्ष"
},

{
    question: "सांख्य दर्शन में आत्मा को कहा जाता है-",
    option: [
        "ब्रह्म",
        "पुरुष",
        "ईश्वर",
        "इनमें से सभी"
    ],
    answer: "पुरुष"
},

{
    question: "किस दार्शनिक ने तत्त्वमीमांसीय प्रश्नों पर मौन धारण किये रहने को प्राथमिकता दिया है?",
    option: [
        "महावीर",
        "स्यादवाद",
        "कपिल",
        "अद्वैतवाद"
    ],
    answer: "अद्वैतवाद"
},
];

// English Questions
const philosophyEnglish = [
{
    question: "hyuum of anubhvvaad of prmukh maanytaa what is?",
    option: [
        "function-cause anivaary is not",
        "function-cause smbndh necessary is",
        "anivaarytaa baahy item and ghttnaa in is",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "following in who jgt to jaaduu to upmaa from smjhaane of pryaas done is?",
    option: [
        "shNkr",
        "gaudd'paad",
        "raamaanuj",
        "None of these"
    ],
    answer: "shNkr"
},

{
    question: "drshn means- [2015A]",
    option: [
        "prtyy of khoj",
        "knowledge towards prem",
        "amrtv of aakaaNkssaa",
        "niymoN of aavisskaar"
    ],
    answer: "prtyy of khoj"
},

{
    question: "yog is-",
    option: [
        "tyaag",
        "smaadhi",
        "iishvr of with saakssaatkaar",
        "None of these"
    ],
    answer: "iishvr of with saakssaatkaar"
},

{
    question: "kaanntt according to buddhi of how many aakaar are?",
    option: [
        "five",
        "eight",
        "ten",
        "twelve"
    ],
    answer: "twelve"
},

{
    question: "saaNkhy drshn of prvrtk are-",
    option: [
        "gautm",
        "kpil",
        "mhaaviir",
        "knnaad"
    ],
    answer: "kpil"
},

{
    question: "‘ddiskors oNn methdd’ grNth whose rgram is?",
    option: [
        "laaibnij",
        "spinojaa",
        "dekaart",
        "loNk"
    ],
    answer: "dekaart"
},

{
    question: "Indian drshn in aatm-knowledge of relation is : [2022 A]",
    option: [
        "punrjnm from",
        "bNdhn from",
        "money sNgrh from",
        "avidyaa of niraakrnn from"
    ],
    answer: "avidyaa of niraakrnn from"
},

{
    question: "anumaan of duusraa name what is?",
    option: [
        "upmaan",
        "shbd",
        "abhaav",
        "anviikssaa"
    ],
    answer: "anviikssaa"
},

{
    question: "gaudd'paad kinke guru the?",
    option: [
        "shNkr of",
        "guru goviNd of",
        "vllbhaacaary of",
        "None of these"
    ],
    answer: "guru goviNd of"
},

{
    question: "whichaccording to substance knowledge saarvbhaum, anivaary and nviin should be?",
    option: [
        "dekaart",
        "loNk",
        "hyuum",
        "kaanntt"
    ],
    answer: "kaanntt"
},

{
    question: "pdaarthshaastr which drshn of duusraa name is?",
    option: [
        "nyaay",
        "saaNkhy",
        "yog",
        "vaishessik"
    ],
    answer: "vaishessik"
},

{
    question: "yog drshn in cittvRtti virodh to called are-",
    option: [
        "praannaayaam",
        "smaadhi",
        "yog",
        "None of these"
    ],
    answer: "yog"
},

{
    question: "shNkr of advait vedaaNt of drshn which grNth on aadhaarit is?",
    option: [
        "raamaaynn",
        "mhaabhaart",
        "puraann",
        "upnissd"
    ],
    answer: "upnissd"
},

{
    question: "jain drshn of tttvmiimaaNsiiy vicaar to what called are?",
    option: [
        "anekaantvaad",
        "shNkr",
        "hetuvaad",
        "advaitvaad"
    ],
    answer: "anekaantvaad"
},

{
    question: "who said is ki honaa and direct both one are?",
    option: [
        "dekaart",
        "spinojaa",
        "brkle",
        "laaibnij"
    ],
    answer: "brkle"
},

{
    question: "iishvr of astitv sNbNdhii proof are",
    option: [
        "pryojnaatmk yukti",
        "naitik yukti",
        "sttaamuulk yukti",
        "uprokt all"
    ],
    answer: "uprokt all"
},

{
    question: "knowledge obtaining of upraant buddh of first updesh where was thaa?",
    option: [
        "bodh was in",
        "saarnaath in",
        "raajgRh in",
        "kushiingr in"
    ],
    answer: "saarnaath in"
},

{
    question: "whichaccording to- giitaa mother is?",
    option: [
        "child gNgaadhr tilk",
        "vinobaa bhaave",
        "shrii arvind",
        "mhaatmaa gaaNdhii"
    ],
    answer: "mhaatmaa gaaNdhii"
},

{
    question: "srvocc shubh what is?",
    option: [
        "maatr means is",
        "maatr baahy is",
        "crm lkssy is",
        "None of these"
    ],
    answer: "crm lkssy is"
},

{
    question: "Which of the following purussaarth under comes is ? [2022 A]",
    option: [
        "dhrm",
        "mokss",
        "A and B both",
        "prem"
    ],
    answer: "A and B both"
},

{
    question: "bauddh drshn and jain drshn are-",
    option: [
        "arvaaciin",
        "smkaaliin",
        "vaidik kaal of",
        "None of these"
    ],
    answer: "smkaaliin"
},

{
    question: "saaNkhy drshn in knowledge to which sNdrbh in liyaa was is?",
    option: [
        "man of knowledge",
        "prkRti of knowledge",
        "man and prkRti between bhinntaa of knowledge",
        "All of these"
    ],
    answer: "man and prkRti between bhinntaa of knowledge"
},

{
    question: "mil according to cause is-",
    option: [
        "bhaavaatmk upaadhiyoN of yog",
        "nissedhaatmk upaadhiyoN of yog",
        "bhaavaatmk and nissedhaatmk upaadhiyoN of yog",
        "None of these"
    ],
    answer: "bhaavaatmk and nissedhaatmk upaadhiyoN of yog"
},

{
    question: "buddhivaad of smrthk is",
    option: [
        "dekaart",
        "laaibnij",
        "spinojaa",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "anumaan to proof as sviikaar done is-",
    option: [
        "nyaay drshn",
        "saaNkhy drshn",
        "bauddh drshn",
        "uprokt all"
    ],
    answer: "uprokt all"
},

{
    question: "human of social ektaa on vicaar doing which drshn what is called is?",
    option: [
        "aacaar drshn",
        "society drshn",
        "dhrm drshn",
        "All of these"
    ],
    answer: "society drshn"
},

{
    question: "following in from whose relation jain drshn from rhaa is?",
    option: [
        "mhaaviir",
        "paarshvnaath",
        "Rssbhdev",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "caarvaak, bauddh and jain following in from which daarshnik smprdaay in come are? [2009A, 2023A]",
    option: [
        "aastik",
        "naastik",
        "aastik and naastik",
        "None of these"
    ],
    answer: "naastik"
},

{
    question: "Which of the following cintk kaarnntaa of siddhaaNt related to are?",
    option: [
        "hyuum",
        "mil",
        "arstu",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "Which of the following one buddhivaadii is?",
    option: [
        "loNk",
        "brkle",
        "dekaart",
        "kaanntt"
    ],
    answer: "dekaart"
},

{
    question: "Indian drshn to avtaar of avdhaarnnaa of by smprdaay which grNth ne done is ? [2022 A]",
    option: [
        "brhm suutr",
        "bhgvd giitaa",
        "nyaay suutr",
        "shNkr bhaassy"
    ],
    answer: "bhgvd giitaa"
},

{
    question: "bhgvdgiitaa to krmshaastr who said?",
    option: [
        "bhgvaan daas",
        "child gNgaadhr tilk",
        "gaaNdhiijii",
        "pN. nehruu"
    ],
    answer: "child gNgaadhr tilk"
},

{
    question: "whose updesh knowledge is a source of?",
    option: [
        "common man",
        "aapt man",
        "aapt woman",
        "(B) and (C) both"
    ],
    answer: "aapt man"
},

{
    question: "saaNkhy drshn of prmukh characteristic what is?",
    option: [
        "pure ekvaad",
        "anekvaad",
        "dvaitvaad",
        "None of these"
    ],
    answer: "dvaitvaad"
},

{
    question: "nisskaam krm of muul siddhaaNt is",
    option: [
        "physical sukh",
        "krtvy for krtvy",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "krtvy for krtvy"
},

{
    question: "yog of anushaasn of aalok in ahiNsaa what is?",
    option: [
        "tp",
        "niym",
        "ym",
        "sNtoss"
    ],
    answer: "ym"
},

{
    question: "cturth aary sty to said goes is-",
    option: [
        "mdhym maarg",
        "assttaaNgik maarg",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "assttaaNgik maarg"
},

{
    question: "vstuvaad of what maanytaa is?",
    option: [
        "jnyey substance jnyaataa on depends is",
        "jnyey substance jnyaataa from svtNtr is",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "jnyey substance jnyaataa from svtNtr is"
},

{
    question: "prkRti of quality are-",
    option: [
        "stv, rj, tm",
        "stv, rj, meaning",
        "stv, rj, dhrm",
        "All of these"
    ],
    answer: "stv, rj, tm"
},

{
    question: "nviin vstuvaad of relation which daarshnikoN from is ?",
    option: [
        "muur",
        "rsel",
        "perii",
        "these all"
    ],
    answer: "these all"
},

{
    question: "which aastik drshn in iishvr of astitv to sviikaar not done was is?",
    option: [
        "nyaay drshn",
        "vaishessik drshn",
        "saaNkhy drshn",
        "yog drshn"
    ],
    answer: "saaNkhy drshn"
},

{
    question: "shNkr advait to called are-",
    option: [
        "body",
        "iishvr",
        "brhm",
        "All of these"
    ],
    answer: "brhm"
},

{
    question: "syaadvaad to smjhaane for jain drshn in how many nyoN of prtipaadn done was?",
    option: [
        "four",
        "three",
        "five",
        "seven"
    ],
    answer: "seven"
},

{
    question: "mokss of two type are- [2015A]",
    option: [
        "bhaav and agent",
        "agent and nirjraa",
        "bhaav and jiiv",
        "jiiv and ajiiv"
    ],
    answer: "jiiv and ajiiv"
},

{
    question: "following in which knowledge of avrodh does is?",
    option: [
        "sttv",
        "rjs",
        "tms",
        "None of these"
    ],
    answer: "tms"
},

{
    question: "jain dhrm of prthm tiirthNkr which are?",
    option: [
        "Rssbhdev",
        "mhaaviir",
        "paarshvnaath",
        "None of these"
    ],
    answer: "Rssbhdev"
},

{
    question: "jain drshn in syaadvaad of what characteristic is?",
    option: [
        "syaadvaad nirpekss of vicaar is",
        "syaadvaad saapekssvaad is",
        "syaadvaad of relation pNcmhaabhuut from is",
        "None of these"
    ],
    answer: "syaadvaad saapekssvaad is"
},

{
    question: "nyaay drshn in anumaan proof of necessary organ what are?",
    option: [
        "for",
        "saadhy",
        "pkss",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "prmaataa kise called are? [2021A]",
    option: [
        "knowledge of means to",
        "knowledge of item to",
        "knowledge obtained doing which to",
        "None of these"
    ],
    answer: "knowledge obtained doing which to"
},

{
    question: "pryojnaatmk yukti of relation from whom is?",
    option: [
        "iishvr of astitv from",
        "aatmaa of astitv from",
        "jdd' of astitv from",
        "None of these"
    ],
    answer: "jdd' of astitv from"
},

{
    question: "prtitysmutpaad of siddhaaNt of what daarshnik meaning is?",
    option: [
        "vstueN apnii utptti for another for on depends are",
        "vstueN nity are",
        "vstuoN of full vinaash is",
        "All of these"
    ],
    answer: "vstueN apnii utptti for another for on depends are"
},

{
    question: "who said is- “mnussy all vstuoN of maapdnndd is”?",
    option: [
        "arstuu",
        "pletto",
        "sophistt",
        "ben"
    ],
    answer: "sophistt"
},

{
    question: "anupyukt niitishaastr of prnnetaa kisko maanaa goes is?",
    option: [
        "mil",
        "kaanntt",
        "piittr siNgr",
        "muur"
    ],
    answer: "kaanntt"
},

{
    question: "niiti shuuny krm what is?",
    option: [
        "good krm",
        "anucit krm",
        "vaisaa krm which on naitik nirnny not is given / ",
        "None of these"
    ],
    answer: "vaisaa krm which on naitik nirnny not is given / "
},

{
    question: "giitaa of updesh is-",
    option: [
        "skaam krm",
        "nisskaam krm",
        "krm from sNnyaas",
        "All of these"
    ],
    answer: "nisskaam krm"
},

{
    question: "following in from which yukti of maannaa is ki world one function is and iishvr uskaa cause is?",
    option: [
        "taatvik yukti",
        "pryojnmuulk yukti",
        "vishvmuulk yukti",
        "None of these"
    ],
    answer: "vishvmuulk yukti"
},

{
    question: "Indian drshn of which pkss of prtinidhitv yog drshn does is?",
    option: [
        "saaNsaarik pkss",
        "vyaavhaarik pkss",
        "social pkss",
        "None of these"
    ],
    answer: "vyaavhaarik pkss"
},

{
    question: "knowledge of means of dRssttikonn from which-sii daarshnik prmpraa ekaaNgii is?",
    option: [
        "buddhivaad",
        "anubhvvaad",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "(A) and (B) both"
},

{
    question: "vaishessik of sRssttivaad to what said goes is?",
    option: [
        "annu sRssttivaad",
        "prmaannu sRssttivaad",
        "annu and prmaannu sRssttivaad",
        "None of these"
    ],
    answer: "prmaannu sRssttivaad"
},

{
    question: "buddhivaad of aadrsh what is?",
    option: [
        "gnnit",
        "rekhaagnnit",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "gnnit"
},

{
    question: "shNkraacaary ne which drshn to prtipaadit done is ?",
    option: [
        "dvaitvaad",
        "vishissttaadvaitvaad",
        "bhedaabhedvaad",
        "advaitvaad"
    ],
    answer: "advaitvaad"
},

{
    question: "‘environment’ shbd from whom bnaa is?",
    option: [
        "invaayrnr",
        "invaayr",
        "invaayrnr",
        "All of these"
    ],
    answer: "invaayrnr"
},

{
    question: "following in which-saa drshn bauddhik is?",
    option: [
        "Indian drshn",
        "paashcaaty drshn",
        "A and B both",
        "None of these"
    ],
    answer: "paashcaaty drshn"
},

{
    question: "prmaa because of to what called are?",
    option: [
        "aprmaa",
        "aprmaann",
        "proof",
        "All of these"
    ],
    answer: "proof"
},

{
    question: "niitishaastr and society drshn between relation is-",
    option: [
        "ghnisstth",
        "virodhaatmk",
        "ghnisstth and virodhaatmk",
        "None of these"
    ],
    answer: "ghnisstth"
},

{
    question: "which from proof from siimit knowledge obtained is ?",
    option: [
        "direct",
        "anumaan",
        "upmaan",
        "shbd"
    ],
    answer: "direct"
},

{
    question: "following in which-saa kthn anubhvvaad from smbddh is?",
    option: [
        "knowledge obtaining of ekmaatr means indriyaanubhuuti is",
        "vivek only knowledge obtaining of ekmaatr means is",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "knowledge obtaining of ekmaatr means indriyaanubhuuti is"
},

{
    question: "anek kaarnnoN of mel from produced combined function to called are-",
    option: [
        "cause-sNyog",
        "function smmishrnn",
        "bhukaarnnvaad",
        "None of these"
    ],
    answer: "function smmishrnn"
},

{
    question: "nyaay drshn of shbd are-",
    option: [
        "nity",
        "anity",
        "nity and anity",
        "None of these"
    ],
    answer: "anity"
},

{
    question: "Indian drshn in prtyyvaad of udaahrnn is-",
    option: [
        "yogaacaar viknowledgevaad",
        "saaNkhy",
        "miimaaNsaa",
        "jain"
    ],
    answer: "yogaacaar viknowledgevaad"
},

{
    question: "hetvaabhaas what is?",
    option: [
        "anumaan related to defect",
        "direct related to defect",
        "shbd proof related to defect",
        "None of these"
    ],
    answer: "anumaan related to defect"
},

{
    question: "substance in vidymaan yogy power to which-saa cause called are?",
    option: [
        "agent cause",
        "aakaarik cause",
        "yogy nimitt cause",
        "aNtim cause"
    ],
    answer: "yogy nimitt cause"
},

{
    question: "jain drshn of praamrsh how many types of maane were are?",
    option: [
        "one",
        "four",
        "five",
        "seven"
    ],
    answer: "seven"
},

{
    question: "\"shNkr of drshn sNgiit puurnntaa and gNbhiirtaa in prthm place keeps hai / \" this kthn whose is?",
    option: [
        "ddoN0 raadhaakRssnnn",
        "caarls iliytt",
        "ddoN0 daas guptaa",
        "None of these"
    ],
    answer: "caarls iliytt"
},

{
    question: "giitaa according to yog is-",
    option: [
        "tyaag",
        "smaadhi",
        "iishvr from miln",
        "None of these"
    ],
    answer: "iishvr from miln"
},

{
    question: "bauddh drshn to naastik drshn why called are?",
    option: [
        "kyoNki this cetnaa to sviikaar does is",
        "kyoNki this punrjnm to sviikaar does is",
        "kyoNki this ved of praamaanniktaa to asviikaar does is",
        "All of these"
    ],
    answer: "kyoNki this ved of praamaanniktaa to asviikaar does is"
},

{
    question: "bhukaarnnvaad means-",
    option: [
        "kaarnnoN of sNyog",
        "kaaryoN of smmishrnn",
        "one ghttnaa of one cause honaa",
        "one ghttnaa of bhinn time in bhinn cause honaa"
    ],
    answer: "one ghttnaa of bhinn time in bhinn cause honaa"
},

{
    question: "loan of type what are?",
    option: [
        "Rssi",
        "dev",
        "pitR",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "vaishessik drshn of duusraa name what is?",
    option: [
        "auluuky",
        "uluuk",
        "auluuk",
        "All of these"
    ],
    answer: "auluuky"
},

{
    question: "kaanntt of knowledge-vicaar to called are-",
    option: [
        "smiikssaavaad",
        "anubhvvaad",
        "buddhivaad",
        "None of these"
    ],
    answer: "smiikssaavaad"
},

{
    question: "saaNkhy according to gunnoN of sNkhyaa is-",
    option: [
        "annt",
        "two",
        "five",
        "among these any not"
    ],
    answer: "among these any not"
},

{
    question: "pNcaavyv of relation which proof from is?",
    option: [
        "shbd",
        "direct",
        "upmaan",
        "None of these"
    ],
    answer: "None of these"
},

{
    question: "kaanntt according to knowledge for what necessary is?",
    option: [
        "anubhv",
        "buddhi",
        "anubhv and buddhi both",
        "among these any not"
    ],
    answer: "anubhv and buddhi both"
},

{
    question: "duHkh because ofoN of nivaarnn is-",
    option: [
        "cturth aary sty",
        "tRtiiy aary sty",
        "dvitiiy aary sty",
        "prthm aary sty"
    ],
    answer: "tRtiiy aary sty"
},

{
    question: "ddoN0 raadhaakRssnnn according to maayaa of two function haiN /  ve are-",
    option: [
        "sty on prdaa ddaalnaa",
        "asty to prsthaapit to do",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "(A) and (B) both"
},

{
    question: "jain drshn of caubiisveN tiirthNkr which are?",
    option: [
        "Rssbhdev",
        "paarshvnaath",
        "gautm",
        "None of these"
    ],
    answer: "None of these"
},

{
    question: "vishvsniiy person to called are-",
    option: [
        "aapt man",
        "prm man",
        "normal",
        "None of these"
    ],
    answer: "aapt man"
},

{
    question: "buddh of tRtiiy aarysty in what said was is?",
    option: [
        "duHkh is",
        "duHkh of cause is",
        "duHkh because of of nivaarnn sNbhv is",
        "duHkh nivaarnn of maarg is"
    ],
    answer: "duHkh because of of nivaarnn sNbhv is"
},

{
    question: "vaishessik drshn according to substance how many are?",
    option: [
        "seven",
        "four",
        "two",
        "one"
    ],
    answer: "seven"
},

{
    question: "following in which naastik drshn is? [2010A]",
    option: [
        "nyaay drshn",
        "saaNkhy drshn",
        "yog drshn",
        "None of these"
    ],
    answer: "None of these"
},

{
    question: "following in arstu because of of type which from are?",
    option: [
        "agent cause",
        "aakaarik cause",
        "aNtim cause",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "srl prtyy and jttil prtyy of vicaar which anubhvvaadii drshn in is?",
    option: [
        "loNk",
        "brkle",
        "hyuum",
        "among these any not"
    ],
    answer: "loNk"
},

{
    question: "naitik drshn which pd from go goes is?",
    option: [
        "iythaas",
        "ithiks",
        "ithiks",
        "None of these"
    ],
    answer: "ithiks"
},

{
    question: "environment of relation from whom is?",
    option: [
        "only pshu from",
        "only mnussy from",
        "devtaa from",
        "prkRti of sNtuln from"
    ],
    answer: "prkRti of sNtuln from"
},

{
    question: "shubh of type are-",
    option: [
        "saapekss shubh",
        "nirpekss shubh",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "(A) and (B) both"
},

{
    question: "following in from which yukti to kaarnntaamuulk yukti said jaa can is?",
    option: [
        "vishvmuulk",
        "taatvik",
        "pryojnmuulk",
        "naitik"
    ],
    answer: "pryojnmuulk"
},

{
    question: "\"knowledge of obtaining congenital prtyy from occurs\" such maannaa is-",
    option: [
        "anubhvvaad of",
        "buddhivaad of",
        "smiikssaavaad of",
        "None of these"
    ],
    answer: "buddhivaad of"
},

{
    question: "prkRti of quality tms of kaal color which baat of suuck maanaa goes is? [2021A]",
    option: [
        "jdd'taa or bhaariipn of",
        "skriytaa of",
        "prmaanNd of",
        "All of these"
    ],
    answer: "jdd'taa or bhaariipn of"
},

{
    question: "anekaantvaad of aadhaarshilaa is-",
    option: [
        "nyvaad",
        "svaadvaad",
        "mokssvaad",
        "pudglvaad"
    ],
    answer: "svaadvaad"
},

{
    question: "yog of assttaaNg means in prthm organ which is?",
    option: [
        "niym",
        "ym",
        "aasn",
        "praannaayaam"
    ],
    answer: "ym"
},

{
    question: "philoNsoNphii means- [2010A, 2013A, 2018A]",
    option: [
        "niymoN of aavisskaar",
        "knowledge towards prem",
        "amrtv of aakaaNkssaa",
        "prtyy of khoj"
    ],
    answer: "knowledge towards prem"
},

{
    question: "Indian drshn is- [2011A, 15A, 16A, 18A, 23A]",
    option: [
        "vyaavhaarik",
        "avyaavhaarik",
        "priklpnaatmk",
        "None of these"
    ],
    answer: "vyaavhaarik"
},

{
    question: "vaishessik drshn in normal substance of sNdrbh in Which of the following viklp correct is?",
    option: [
        "abhaav",
        "bhaav",
        "bhaavaabhaav",
        "All of these"
    ],
    answer: "bhaav"
},

{
    question: "‘dhrm ckrprvrtn’ of relation which drshn from is?",
    option: [
        "jain drshn",
        "bauddh drshn",
        "saaNkhy drshn",
        "yog drshn"
    ],
    answer: "bauddh drshn"
},

{
    question: "kinke mtaanusaar giitaa mhaabhaart of organ is?",
    option: [
        "arvind ghoss",
        "mhaatmaa gaaNdhii",
        "ddoN. raadhaakRssnnn",
        "child gNgaadhr tilk"
    ],
    answer: "ddoN. raadhaakRssnnn"
},

{
    question: "cause is-",
    option: [
        "puurvvrtii",
        "anaupaadhik",
        "niyt",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "yog drshn of prvrtk are-",
    option: [
        "kpil",
        "gautm",
        "ptNjli",
        "knnaad"
    ],
    answer: "ptNjli"
},

{
    question: "buddhivaad and anubhvvaad of ttkraav whose drshn in smaapt is?",
    option: [
        "laaibnij",
        "hyuum",
        "brkle",
        "kaanntt"
    ],
    answer: "kaanntt"
},

{
    question: "nyaay drshn of prnnetaa are-",
    option: [
        "gautm buddh",
        "mhrssi gautm",
        "knnaad",
        "jaimini"
    ],
    answer: "mhrssi gautm"
},

{
    question: "aatmaa ythaarthtH-",
    option: [
        "bhoktaa is",
        "krtaa is",
        "bhoktaa and krtaa is",
        "None of these"
    ],
    answer: "None of these"
},

{
    question: "vaishessik drshn of prnnetaa are-",
    option: [
        "gautm",
        "knnaad",
        "kpil",
        "jaimini"
    ],
    answer: "knnaad"
},

{
    question: "dekaart ne sviikaaraa is",
    option: [
        "smaanaantrvaad to",
        "antkriyaavaad to",
        "puurvsthaapit saamNjsyvaad to",
        "None of these"
    ],
    answer: "antkriyaavaad to"
},

{
    question: "tttvtrkm anumaanm whose mt is?",
    option: [
        "saaNkhy of",
        "nyaay of",
        "bauddh of",
        "jain of"
    ],
    answer: "nyaay of"
},

{
    question: "nyaay of by how many prmaannoN to sviikaar done was is?",
    option: [
        "one",
        "two",
        "three",
        "four"
    ],
    answer: "four"
},

{
    question: "Which of the following daarshnik knowledge to ‘sNshlessnnaatmk praagnubhvik nirnnyoN of ektNtr’ as pribhaassit do are?",
    option: [
        "loNk",
        "brkle",
        "kaanntt",
        "sukraat"
    ],
    answer: "kaanntt"
},

{
    question: "Which of the following one kthn correct is?",
    option: [
        "right and krtvy one-another from svtNtr are",
        "right and krtvy saapekss are",
        "right krtvy of virodhii is",
        "None of these"
    ],
    answer: "right and krtvy saapekss are"
},

{
    question: "anekaantvaad and syaadvaad which drshn of bhultaavaadii ythaarth saapekssvaad of only two form are?",
    option: [
        "jain drshn",
        "bauddh drshn",
        "vedaaNt drshn",
        "caarvaak drshn"
    ],
    answer: "jain drshn"
},

{
    question: "vstueN jnyaataa from svtNtr occursN, this vicaar is-",
    option: [
        "buddhivaad",
        "prtyyvaad",
        "vstuvaad",
        "smiikssaavaad"
    ],
    answer: "smiikssaavaad"
},

{
    question: "miimaaNsaa drshn is-",
    option: [
        "krmprdhaan",
        "aatmprdhaan",
        "dhrmprdhaan",
        "None of these"
    ],
    answer: "aatmprdhaan"
},

{
    question: "shNkr according to maayaa what is?",
    option: [
        "brhm",
        "brhm of power",
        "klpnaatmk sttaa",
        "None of these"
    ],
    answer: "brhm of power"
},

{
    question: "vaakyaarth of how many shrteN to nyaay drshn in maanaa goes is?",
    option: [
        "one",
        "two",
        "three",
        "four"
    ],
    answer: "four"
},

{
    question: "trigunn are-",
    option: [
        "tm",
        "rj",
        "quality",
        "None of these"
    ],
    answer: "rj"
},

{
    question: "vaishessik according to nimnaaNkit in which agent is not?",
    option: [
        "krm",
        "pRthvii",
        "kaal",
        "aatmaa"
    ],
    answer: "krm"
},

{
    question: "Indian drshn of which smprdaay in substance and agent of vistRt vivegram is received is ? [2022 A]",
    option: [
        "yog drshn",
        "vaishessik drshn",
        "advait vedaaNt",
        "miimaaNsaa drshn"
    ],
    answer: "vaishessik drshn"
},

{
    question: "Indian drshn under Which of the following drshn come are? [2021A]",
    option: [
        "advaitvaad",
        "dvaitvaad",
        "vishissttaadvaitvaad",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "vaishessik drshn of smaan system which drshn is?",
    option: [
        "yog drshn",
        "bauddh drshn",
        "jain drshn",
        "nyaay drshn"
    ],
    answer: "nyaay drshn"
},

{
    question: "which anubhvvaadii ne jdd' substance of puurnntH nissedh done and adhyaatmvaad establishment of?",
    option: [
        "loNk",
        "brkle",
        "hyuum",
        "kaanntt"
    ],
    answer: "brkle"
},

{
    question: "laaibnits of cibindu whose udaahrnn is ?",
    option: [
        "syaadvaad",
        "aadhyaatmik bhuttvvaad",
        "anekaantvaad",
        "None of these"
    ],
    answer: "aadhyaatmik bhuttvvaad"
},

{
    question: "jiske near smbuddhi occurs, use called are-",
    option: [
        "muni",
        "sthitprjny",
        "yogii",
        "None of these"
    ],
    answer: "sthitprjny"
},

{
    question: "yog drshn according to yog means-",
    option: [
        "miln",
        "cittvRtti nirodh",
        "ym",
        "niym"
    ],
    answer: "cittvRtti nirodh"
},

{
    question: "svpn or bhrm which sttaa of vissy are?",
    option: [
        "prtibhaassit sttaa",
        "vyaavhaarik sttaa",
        "paarmaarthik sttaa",
        "None of these"
    ],
    answer: "prtibhaassit sttaa"
},

{
    question: "following in which dnndd of siddhaaNt are?",
    option: [
        "nirodhk siddhaaNt",
        "sudhaark siddhaaNt",
        "prtikaaraatmk siddhaaNt",
        "these all"
    ],
    answer: "these all"
},

{
    question: "which buddhivaadii daarshnik ne said is ki cid-bindu shaashvt are?",
    option: [
        "dekaart",
        "spinojaa",
        "laaibnij",
        "None of these"
    ],
    answer: "laaibnij"
},

{
    question: "jain drshn in srvknowledgeii sNt to what said goes is?",
    option: [
        "arht",
        "yogii",
        "tiirthNkr",
        "None of these"
    ],
    answer: "tiirthNkr"
},

{
    question: "caarvaak drshn is- [2014A]",
    option: [
        "physicalvaadii",
        "aadhyaatmvaadii",
        "A and B both",
        "None of these"
    ],
    answer: "physicalvaadii"
},

{
    question: "drshnshaastr of vissyvstu of svruup what kind is? [2021A]",
    option: [
        "vyaapk",
        "sNkiirnn",
        "aaNshik",
        "None of these"
    ],
    answer: "vyaapk"
},

{
    question: "Indian drshn in ythaarth knowledge is called is-",
    option: [
        "aprmaa",
        "prmaa",
        "khyaatii",
        "None of these"
    ],
    answer: "prmaa"
},

{
    question: "nyaay drshn of keNdriiy vicaar is",
    option: [
        "naitik",
        "sauNdry",
        "raajniitik",
        "knowledge miimaaNsiiy"
    ],
    answer: "knowledge miimaaNsiiy"
},

{
    question: "environment of relation is-",
    option: [
        "pshu from",
        "mnussy from",
        "devtaa from",
        "vnspti from"
    ],
    answer: "vnspti from"
},

{
    question: "buddhivaadii daarshnik according to knowledge of type are",
    option: [
        "saadhaarnn knowledge",
        "daarshnik knowledge",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "(A) and (B) both"
},

{
    question: "jain mtaavlNbiyoN according to vedaaNt and bauddh drshn whose nutrient is?",
    option: [
        "anekaantvaad",
        "ekaantvaad",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "ekaantvaad"
},

{
    question: "bauddh drshn in duHkh of how many cause are?",
    option: [
        "four",
        "eight",
        "twelve",
        "caubiis"
    ],
    answer: "twelve"
},

{
    question: "Which of the following Indian daarshnik is notN? [2021A]",
    option: [
        "arstuu",
        "kpil",
        "ptNjli",
        "jaiminii"
    ],
    answer: "arstuu"
},

{
    question: "whose aNtim part to upnissd called are?",
    option: [
        "puraann",
        "knowledge",
        "ved",
        "None of these"
    ],
    answer: "ved"
},

{
    question: "anubhvvaad of smrthk are",
    option: [
        "dekaart",
        "spinojaa",
        "hyuum",
        "kaanntt"
    ],
    answer: "hyuum"
},

{
    question: "giitaa in prmaatmaa of which svruup btaae were are?",
    option: [
        "vykt",
        "avykt",
        "vykt and avykt",
        "None of these"
    ],
    answer: "vykt and avykt"
},

{
    question: "krm shbd of utptti was is- [2014A, 2023A]",
    option: [
        "lR dhaatu from",
        "krm dhaatu from",
        "kR dhaatu from",
        "None of these"
    ],
    answer: "kR dhaatu from"
},

{
    question: "jain drshn following in from kise sviikaar does is?",
    option: [
        "syaadvaad",
        "aarNbhvaad",
        "anaatmvaad",
        "vivrtvaad"
    ],
    answer: "syaadvaad"
},

{
    question: "vyaapaar niitishaastr which dishaa in kendrit is?",
    option: [
        "naitik shbdoN of vishlessnn from",
        "RnndaataaoN to force provide doing in",
        "vyaapaar of field in naitik values to sthaapit doing in",
        "None of these"
    ],
    answer: "vyaapaar of field in naitik values to sthaapit doing in"
},

{
    question: "saaNkhy vishvaas does is-",
    option: [
        "prkRti prinnaamvaad in",
        "brhm prinnaamvaad in",
        "vivrtvaad in",
        "None of these"
    ],
    answer: "prkRti prinnaamvaad in"
},

{
    question: "shNkr of drshn in vyaavhaarik sttaa what is ?",
    option: [
        "nirgunn iishvr",
        "brhm",
        "jgt",
        "None of these"
    ],
    answer: "jgt"
},

{
    question: "vaishessik drshn according to quality apne astitv for which on depends does is?",
    option: [
        "agent",
        "special",
        "smvaay",
        "None of these"
    ],
    answer: "agent"
},

{
    question: "cause to bhaavaatmk and nissedhaatmk upaadhiyoN of yog who maanaa is ?",
    option: [
        "arstu",
        "mil",
        "hyuum",
        "kaanntt"
    ],
    answer: "mil"
},

{
    question: "cturth aary sty to said goes is?",
    option: [
        "mdhym maarg",
        "assttaaNgik maarg",
        "smyk maarg",
        "among these any not"
    ],
    answer: "assttaaNgik maarg"
},

{
    question: "following in which purussaarth is not? [2010A, 14A, 16A, 18A]",
    option: [
        "meaning",
        "dhrm",
        "iishvr",
        "work"
    ],
    answer: "iishvr"
},

{
    question: "upnissd to said goes is-",
    option: [
        "yog vidyaa",
        "brhm vidyaa",
        "knowledge vidyaa",
        "None of these"
    ],
    answer: "brhm vidyaa"
},

{
    question: "anumaan of duusraa name what is?",
    option: [
        "anviikssaa",
        "prokssikaa",
        "anumiti",
        "anupaalk"
    ],
    answer: "anviikssaa"
},

{
    question: "advait of meaning is-",
    option: [
        "two not",
        "one not",
        "four not",
        "three not"
    ],
    answer: "two not"
},

{
    question: "Which of the following anubhvvaadii is not?",
    option: [
        "loNk",
        "brkle",
        "hyuum",
        "kaanntt"
    ],
    answer: "kaanntt"
},

{
    question: "jain drshn of prnnetaa are-",
    option: [
        "buddh",
        "gautm",
        "kpil",
        "mhaaviir"
    ],
    answer: "mhaaviir"
},

{
    question: "function-cause niym is-",
    option: [
        "vaiknowledgeik",
        "social",
        "daarshnik",
        "normal"
    ],
    answer: "vaiknowledgeik"
},

{
    question: "shNkr ne svpn in astitv of svruup to what said is?",
    option: [
        "prtibhaassik sttaa",
        "vyaavhaarik sttaa",
        "paarmaarthik sttaa",
        "None of these"
    ],
    answer: "prtibhaassik sttaa"
},

{
    question: "aastik drshn following in from kise cetnaa of adhisstthaan as sviikaar does is ? [2022 A]",
    option: [
        "aatmaa",
        "jgt",
        "body",
        "prkRti"
    ],
    answer: "aatmaa"
},

{
    question: "prtyyvaad related is-",
    option: [
        "jdd' from",
        "cetnaa from",
        "knowledge from",
        "anubhv from"
    ],
    answer: "cetnaa from"
},

{
    question: "Indian drshn in anubhuutiyoN how many types of maanii gyii are?",
    option: [
        "one",
        "two",
        "three",
        "four"
    ],
    answer: "two"
},

{
    question: "“niitishaastr human-aacrnn of one aadrsh nirdhaark viknowledge is” this ukti kinkii is?",
    option: [
        "muur",
        "maikenjii",
        "lilii",
        "None of these"
    ],
    answer: "lilii"
},

{
    question: "following in who aatmaa and body to one-another of pryaay maanaa is?",
    option: [
        "caarvaak",
        "shNkr",
        "buddh",
        "jain"
    ],
    answer: "caarvaak"
},

{
    question: "stogunn, rjogunn and tmogunn are-",
    option: [
        "man of",
        "prkRti of",
        "iishvr of",
        "None of these"
    ],
    answer: "prkRti of"
},

{
    question: "which drshn in smyk smaadhi of vrnnn is?",
    option: [
        "yog drshn",
        "bauddh drshn",
        "jain drshn",
        "among these any not"
    ],
    answer: "bauddh drshn"
},

{
    question: "education drshn one shaakhaa is-",
    option: [
        "physicalviknowledge of",
        "mnoviknowledge of",
        "drshnshaastr of",
        "trkshaastr of"
    ],
    answer: "drshnshaastr of"
},

{
    question: "saaNkhy drshn following in kise sviikaar does is?",
    option: [
        "aarNbhvaad",
        "prinnaamvaad",
        "vivrtvaad",
        "None of these"
    ],
    answer: "prinnaamvaad"
},

{
    question: "two vstuoN between of special and anivaary relation what is called is? [2021A]",
    option: [
        "abhaav",
        "snnikrss",
        "vyaapti",
        "None of these"
    ],
    answer: "vyaapti"
},

{
    question: "nyaay according to proof are-",
    option: [
        "two",
        "six",
        "four",
        "None of these"
    ],
    answer: "four"
},

{
    question: "who said is ki knowledge sNshlessnnaatmk praagnubhvik nirnny is?",
    option: [
        "kaanntt",
        "hegl",
        "laaibnij",
        "spinojaa"
    ],
    answer: "kaanntt"
},

{
    question: "direct nyaayshaastr in proof of which saa bhed is?",
    option: [
        "prthm",
        "dvitiiy",
        "tRtiiy",
        "cturth"
    ],
    answer: "prthm"
},

{
    question: "Which of the following aastik drshn is?",
    option: [
        "krm principle",
        "yog principle",
        "purussaarth principle",
        "None of these"
    ],
    answer: "krm principle"
},

{
    question: "kaanntt according to knowledge is",
    option: [
        "praagnubhvik nirnny",
        "anubhv saapekss nirnny",
        "sNshlessnnaatmk praagnubhvik nirnny",
        "None of these"
    ],
    answer: "sNshlessnnaatmk praagnubhvik nirnny"
},

{
    question: "drshnshaastr in knowledge to which meaning in pryukt is done ? [2022 A]",
    option: [
        "vistRt meaning in",
        "sNkucit meaning in",
        "both arthoN in",
        "None of these"
    ],
    answer: "both arthoN in"
},

{
    question: "who said is ki sNvedn binaa knowledge of andhaa is and pure bodh binaa sNvednoN of khokhlaa is?",
    option: [
        "dekaart",
        "spinojaa",
        "loNk",
        "kaanntt"
    ],
    answer: "kaanntt"
},

{
    question: "following in which-saa quality knowledge symbolizes?",
    option: [
        "sttv",
        "rjs",
        "tms",
        "None of these"
    ],
    answer: "sttv"
},

{
    question: "buddh of assttaaNgik maarg of aatthveN and aNtim organ of what name is?",
    option: [
        "prtyaahaar",
        "dhaarnnaa",
        "dhyaan",
        "smaadhi"
    ],
    answer: "smaadhi"
},

{
    question: "cause function of is-",
    option: [
        "puurvvrtii",
        "anuvrtii",
        "shprinnaam",
        "also puurvvrtii is then kbhii anuvrtii"
    ],
    answer: "puurvvrtii"
},

{
    question: "cause of gunnaatmk lkssnn what is ?",
    option: [
        "this puurvvrtii ghttnaa is",
        "this anaupcaarik ghttnaa is",
        "this taatkaalik, niyt, anaupaadhik, puurvvrtii ghttnaa is",
        "None of these"
    ],
    answer: "this taatkaalik, niyt, anaupaadhik, puurvvrtii ghttnaa is"
},

{
    question: "buddh according to prthm aary-sty Which of the following is?",
    option: [
        "sNsaar dukhoN from pripuurnn is",
        "dukhoN of cause also is",
        "dukhoN of ant sNbhv is",
        "dukhoN of ant of maarg is"
    ],
    answer: "sNsaar dukhoN from pripuurnn is"
},

{
    question: "jain drshn in videh mukti to said goes is-",
    option: [
        "bodhisttv",
        "kaivly",
        "nirvaann",
        "prinirvaann"
    ],
    answer: "nirvaann"
},

{
    question: "purussaarth under Which of the following comes is? [2021A]",
    option: [
        "st",
        "shubh",
        "proper",
        "upbhog"
    ],
    answer: "upbhog"
},

{
    question: "which drshn in smyk smaadhi of vrnnn is?",
    option: [
        "jain drshn",
        "bauddh drshn",
        "yog",
        "miimaaNsaa"
    ],
    answer: "yog"
},

{
    question: "knowledge of means of smbndh in buddhivaadiyoN of prmukh maanytaa what is?",
    option: [
        "ttebulaa raasaa",
        "sNskaar and prtyy",
        "congenital prtyy",
        "sNshyvaad"
    ],
    answer: "congenital prtyy"
},

{
    question: "st quality of st quality in only ruupaaNtrit honaa what is ? [2022 A]",
    option: [
        "viruup change",
        "svruup change",
        "vivrt change",
        "None of these"
    ],
    answer: "svruup change"
},

{
    question: "Which of the following naastik drshn is?",
    option: [
        "yog drshn",
        "nyaay drshn",
        "jain drshn",
        "saaNkhy drshn"
    ],
    answer: "jain drshn"
},

{
    question: "vyaapti knowledge of bhuumikaa which proof for is?",
    option: [
        "direct",
        "alaukik direct",
        "anumaan",
        "None of these"
    ],
    answer: "anumaan"
},

{
    question: "nyaay drshn in yogj direct what is?",
    option: [
        "saamaanyoN of direct",
        "laukik direct",
        "alaukik of direct",
        "All of these"
    ],
    answer: "alaukik of direct"
},

{
    question: "dhrm, meaning, work and mokss whose type are?",
    option: [
        "krm",
        "purussaarth",
        "aashrm",
        "vrnn"
    ],
    answer: "purussaarth"
},

{
    question: "svdhrm of real relation is-",
    option: [
        "normal dhrm from",
        "vrnnaashrm dhrm from",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "None of these"
},

{
    question: "saaNkhy drshn in stkaaryvaad which principle from smbndhit is?",
    option: [
        "function siddhaaNt",
        "cause siddhaaNt",
        "function-cause siddhaaNt",
        "None of these"
    ],
    answer: "function-cause siddhaaNt"
},

{
    question: "vaishessik drshn in that agent to what called are jiskaa special quality cetnaa is?",
    option: [
        "aakaash",
        "dik",
        "kaal",
        "aatmaa"
    ],
    answer: "aatmaa"
},

{
    question: "aashrm how many sopaan of occurs? [2021A]",
    option: [
        "one",
        "two",
        "three",
        "four"
    ],
    answer: "four"
},

{
    question: "following in from which one in buddh of updesh sNgrhit are?",
    option: [
        "buddh of updesh in",
        "knowledge of book in",
        "tripittk in",
        "None of these"
    ],
    answer: "tripittk in"
},

{
    question: "human aacrnn on naitik nirnny for what anivaary is?",
    option: [
        "person of desh",
        "person of color",
        "person of language",
        "person of icchaa svaatNtry"
    ],
    answer: "person of icchaa svaatNtry"
},

{
    question: "pNcaavyv of relation from whom is?",
    option: [
        "nyaay of direct from",
        "nyaay of upmaan from",
        "nyaay of anumaan from",
        "nyaay of shbd proof from"
    ],
    answer: "nyaay of anumaan from"
},

{
    question: "cause of correct pribhaassaa what is?",
    option: [
        "cause one puurvvrtii ghttnaa is",
        "cause one anuvrtii ghttnaa is",
        "cause anaupcaarik puurvvrtii ghttnaa is",
        "cause one niyt, anaupcaarik and taatkaalik puurvvrtii ghttnaa is"
    ],
    answer: "cause one niyt, anaupcaarik and taatkaalik puurvvrtii ghttnaa is"
},

{
    question: "puurv sthaapit saamNjsy principle related is",
    option: [
        "dekaart from",
        "kaanntt from",
        "laaibnij from",
        "None of these"
    ],
    answer: "laaibnij from"
},

{
    question: "aNtkriyaavaad siddhaaNt of prvrtk are-",
    option: [
        "spiinojaa",
        "laaibniij",
        "dekaart",
        "hyuum"
    ],
    answer: "spiinojaa"
},

{
    question: "maayaa of that power of what name is jo brhm of sttaa to chipaa letii is?",
    option: [
        "prjnyaa",
        "smaadhi",
        "aavrnn",
        "All of these"
    ],
    answer: "aavrnn"
},

{
    question: "arstu according cause is-",
    option: [
        "aakaarik",
        "aNtim",
        "upaadaan",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "which buddhivaadii daarshnik according to agent svtNtr, nirpekss, vilkssnn and saarvbhaum is?",
    option: [
        "dekaart",
        "spinojaa",
        "laaibnij",
        "loNk"
    ],
    answer: "dekaart"
},

{
    question: "Which of the following medical treatment niitishaastr of vissy is?",
    option: [
        "srogett mother",
        "embryo htyaa",
        "cikitsk mriij relation",
        "None of these"
    ],
    answer: "None of these"
},

{
    question: "Indian drshn in ythaarth knowledge to said goes is- [2014A, 2016A, 2023A]",
    option: [
        "prmaa",
        "aprmaa",
        "sNbhaav",
        "adhyaap"
    ],
    answer: "prmaa"
},

{
    question: "bauddh drshn and jain drshnoN to which-saa drshn said goes is?",
    option: [
        "aastik drshn",
        "naastik drshn",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "naastik drshn"
},

{
    question: "knowledgeshaastriiy principle as ‘smiikssaavaad’ den is",
    option: [
        "dekaart of",
        "spinojaa of",
        "brkle of",
        "kaanntt of"
    ],
    answer: "kaanntt of"
},

{
    question: "who said is ki drshnshaastr of knowledge also gnnit of knowledge of trh spsstt and suspsstt should be?",
    option: [
        "dekaart",
        "laaibnij",
        "spinojaa",
        "loNk"
    ],
    answer: "dekaart"
},

{
    question: "function-cause niym aagmn of what type of basis is?",
    option: [
        "real",
        "aakaarik",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "aakaarik"
},

{
    question: "Rt related is- [2009A, 14A, 16A, 23A]",
    option: [
        "naitik niym from",
        "dhaarmik niym from",
        "physical niym from",
        "All of these"
    ],
    answer: "naitik niym from"
},

{
    question: "who said is ki ‘maiN soctaa huuN islie maiN huuN’?",
    option: [
        "spinojaa",
        "brkle",
        "loNk",
        "dekaart"
    ],
    answer: "dekaart"
},

{
    question: "prkRti of which element quality mn of ashaaNti and vstuoN to claaymaan keeping for jimmedaar are?",
    option: [
        "sttvgunn",
        "rjogunn",
        "tmogunn",
        "All of these"
    ],
    answer: "rjogunn"
},

{
    question: "jain dhrm of aNtim tiirthNkr which are?",
    option: [
        "mhaaviir",
        "Rssbhdev",
        "paarshvnaath",
        "shaaky muni"
    ],
    answer: "mhaaviir"
},

{
    question: "smiikssaavaad is produced",
    option: [
        "anubhvvaad of bhaavaatmk aNshoN to milaakr",
        "buddhivaad of bhaavaatmk aNshoN to milaakr",
        "anubhvvaad and buddhivaad of bhaavaatmk aNshoN to milaakr",
        "anubhvvaad and buddhivaad of nkaaraatmk aNshoN to milaakr"
    ],
    answer: "anubhvvaad and buddhivaad of bhaavaatmk aNshoN to milaakr"
},

{
    question: "correct kthn what is?",
    option: [
        "cause upaadhik of one organ is",
        "kbhii puurvvrtii is then kbhii anuvrtii",
        "cause and upaadhik braabr is",
        "upaadhi cause of aNsh is not"
    ],
    answer: "kbhii puurvvrtii is then kbhii anuvrtii"
},

{
    question: "mn-body relation of vyaakhyaa does is  / ",
    option: [
        "smaanaantrvaad",
        "aNtkriyaavaad",
        "puurvsthaapit saamNjsyvaad",
        "All of the above"
    ],
    answer: "All of the above"
},

{
    question: "prkRti of which quality because of vstueN uurdhvgmn does are ?",
    option: [
        "stvgunn",
        "rjogunn",
        "tmogunn",
        "None of these"
    ],
    answer: "stvgunn"
},

{
    question: "bauddh drshn of which aary sty to naitik kaarnntaavaad said was is?",
    option: [
        "prthm aary sty",
        "dvitiiy aary sty",
        "tRtiiy aary sty",
        "cturth aary sty"
    ],
    answer: "dvitiiy aary sty"
},

{
    question: "niitishuuny krm of what meaning is?",
    option: [
        "vh krm jo naitik dRssttikonn from anucit is",
        "vh krm jise mnussyoN to not to do should",
        "(A) and (B) both",
        "vh krm which on naitik nirnny not is given"
    ],
    answer: "vh krm which on naitik nirnny not is given"
},

{
    question: "Which of the following knowledge of avrodh does is ? [2022 A]",
    option: [
        "stv",
        "rjs",
        "tms",
        "None of these"
    ],
    answer: "tms"
},

{
    question: "niitishaastr which vidyaa to called are?",
    option: [
        "jo prm sttaa of khoj does is",
        "jo naitik maapdnnddoN of khoj does is",
        "jo knowledge of means of khoj does is",
        "None of these"
    ],
    answer: "jo naitik maapdnnddoN of khoj does is"
},

{
    question: "vaishessik drshn in all physical drvyoN of astitv is / ",
    option: [
        "dik",
        "kaal",
        "dik and kaal",
        "None of these"
    ],
    answer: "dik and kaal"
},

{
    question: "naitik niym of anukuul rhne which krmoN to what kheNge? [2021A]",
    option: [
        "proper",
        "anucit",
        "proper and anucit",
        "None of these"
    ],
    answer: "proper"
},

{
    question: "environment niitishaastr of vissy-item what is?",
    option: [
        "medical treatment from judd'ii naitik smsyaaeN",
        "vyfaty from judd'ii naitik smsyaaeN",
        "environment from judd'ii naitik smsyaaeN",
        "miiddiyaa from judd'ii naitik smsyaaeN"
    ],
    answer: "environment from judd'ii naitik smsyaaeN"
},

{
    question: "jain drshn in ‘ny’ shbd what drshaataa is?",
    option: [
        "any item of all pkssoN of full knowledge to drshaataa is",
        "any item of kuch pkssoN of aaNshik knowledge to drshaataa is",
        "(A) and (B) both to drshaataa is",
        "None of these"
    ],
    answer: "any item of kuch pkssoN of aaNshik knowledge to drshaataa is"
},

{
    question: "jo knowledge obtained does is, is called is-",
    option: [
        "proof",
        "prmaataa",
        "prmaa",
        "aprmaa"
    ],
    answer: "prmaataa"
},

{
    question: "aastik and naastik drshn of bhed Indian smprdaay in which basis on done was is? [2010A]",
    option: [
        "iishvr in vishvaas",
        "ved in vishvaas",
        "aatmaa in vishvaas",
        "None of these"
    ],
    answer: "ved in vishvaas"
},

{
    question: "knowledge of means as shj knowledge and nigmn to who sviikaar done is?",
    option: [
        "loNk",
        "brkle",
        "hyuum",
        "dekaart"
    ],
    answer: "dekaart"
},

{
    question: "sNskaar and prtyyoN of vicaar which anubhvvaadii of drshn in is found?",
    option: [
        "hyuum",
        "loNk",
        "brkle",
        "None of these"
    ],
    answer: "hyuum"
},

{
    question: "aagmn of aakaarik basis is-",
    option: [
        "prkRti-smruuptaa",
        "niriikssnn",
        "use",
        "cause function niym"
    ],
    answer: "cause function niym"
},

{
    question: "jdd' in gti provide doing which power to what called are?",
    option: [
        "upaadaan cause",
        "nimitt cause",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "nimitt cause"
},

{
    question: "yog drshn in citt of how many avsthaaoN of jikr is?",
    option: [
        "one",
        "four",
        "five",
        "eight"
    ],
    answer: "five"
},

{
    question: "direct knowledge for what anivaary is?",
    option: [
        "indriyoN and vissyoN of snnikrss",
        "vyaapti knowledge",
        "shbd",
        "udaahrnn"
    ],
    answer: "indriyoN and vissyoN of snnikrss"
},

{
    question: "“dnndd giving of back ekmaatr uddeshy is ki person bhvissy in that apraadh of punraavRtti n kre” this vicaar dnndd of which siddhaaNt related to is?",
    option: [
        "prtishodhaatmk siddhaaNt",
        "nivaartnvaadii siddhaaNt",
        "sudhaarvaadii siddhaaNt",
        "All of these"
    ],
    answer: "nivaartnvaadii siddhaaNt"
},

{
    question: "following in pudgl of which-from bhed are?",
    option: [
        "annu",
        "skNdh",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "(A) and (B) both"
},

{
    question: "aadhunik paashcaaty drshn of pitaa is called is:",
    option: [
        "spinojaa",
        "laaibnij",
        "dekaart",
        "None of these"
    ],
    answer: "dekaart"
},

{
    question: "bauddh drshn according to aary sty are-",
    option: [
        "two",
        "three",
        "four",
        "None of these"
    ],
    answer: "four"
},

{
    question: "syaadvaad siddhaaNt is-",
    option: [
        "knowledgeshaastriiy",
        "tttvshaastriiy",
        "niiti miimaaNsiiy",
        "None of these"
    ],
    answer: "knowledgeshaastriiy"
},

{
    question: "jain drshn of prvrtk are-",
    option: [
        "gautm",
        "kpil",
        "mhaaviir",
        "None of these"
    ],
    answer: "mhaaviir"
},

{
    question: "mn and body of smbndh spinojaa according to is –",
    option: [
        "kriyaavaad",
        "smaanaantrvaad",
        "above-mentioned both",
        "None of these"
    ],
    answer: "smaanaantrvaad"
},

{
    question: "mhaaviir to nirvaann where obtained was?",
    option: [
        "paavaapurii",
        "bodhgyaa",
        "kushiingr",
        "raajgiir"
    ],
    answer: "paavaapurii"
},

{
    question: "sukh and duHkh krmshH shubh and ashubh krmoN of anivaary fruit maane go are, this which siddhaaNt from judd'aa was is?",
    option: [
        "krm siddhaaNt",
        "yog siddhaaNt",
        "purussaarth siddhaaNt",
        "None of these"
    ],
    answer: "krm siddhaaNt"
},

{
    question: "physicalvaad according to prm sttaa is-",
    option: [
        "prtyy",
        "tttsth",
        "jdd'",
        "iishvr"
    ],
    answer: "jdd'"
},

{
    question: "mn and body between dekaart what type of smbndh to sviikaar do are?",
    option: [
        "smaanaantrvaad",
        "antHkriyaavaad",
        "nityvaad",
        "nishcyvaad"
    ],
    answer: "antHkriyaavaad"
},

{
    question: "kaanntt of smiikssaavaad on effect is:",
    option: [
        "buddhivaad of",
        "anubhvvaad of",
        "(A) and (B) both of",
        "None of these"
    ],
    answer: "(A) and (B) both of"
},

{
    question: "yogdrshn in 'aNtrNg means' of how many avyv are?",
    option: [
        "three",
        "five",
        "four",
        "two"
    ],
    answer: "three"
},

{
    question: "Indian drshn of muul dRsstti is- [2014A, 2023A]",
    option: [
        "vishlessnnaatmk",
        "bauddhik",
        "aadhyaatmik",
        "None of these"
    ],
    answer: "aadhyaatmik"
},

{
    question: "which knowledge principle according to knowledge of obtaining aagmnaatmk method from occurs?",
    option: [
        "buddhivaad",
        "anubhvvaad",
        "vaad",
        "vstuvaad"
    ],
    answer: "anubhvvaad"
},

{
    question: "bauddh drshn according to prthm aary sty is-",
    option: [
        "sukh",
        "aannd",
        "duHkh of cause",
        "duHkh"
    ],
    answer: "duHkh"
},

{
    question: "abhaav of ullekh which drshn in is received is?",
    option: [
        "saaNkhy drshn",
        "yog drshn",
        "vaishessik drshn",
        "All of these"
    ],
    answer: "vaishessik drshn"
},

{
    question: "niym of anukuul rhne on what kheNge?",
    option: [
        "proper",
        "anucit",
        "proper and anucit",
        "None of these"
    ],
    answer: "proper"
},

{
    question: "indriy direct to knowledge of means who maanaa is?",
    option: [
        "loNk",
        "brkle",
        "hyuum",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "aadhyaatmik anubhuuti which drshnshaastr in bauddhik knowledge from high maanaa was is?",
    option: [
        "Indian drshnshaastr",
        "paashcaaty drshnshaastr",
        "A and B both",
        "None of these"
    ],
    answer: "Indian drshnshaastr"
},

{
    question: "giitaa in mokss of which-which from maarg btaae were are?",
    option: [
        "knowledge",
        "krm",
        "bhkti",
        "these all"
    ],
    answer: "these all"
},

{
    question: "vyaapaar niitishaastr adhyyn is-",
    option: [
        "vyaapaar of vistaar of",
        "vyaapaar of svaamitv of",
        "vyaapaar of rkhrkhaav of",
        "vyaapaar from judd'ii naitiktaa of"
    ],
    answer: "vyaapaar from judd'ii naitiktaa of"
},

{
    question: "environment of type are-",
    option: [
        "physical",
        "mental",
        "aadhyaatmik",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "tripittk related are-",
    option: [
        "bauddh drshn from",
        "saaNkhy drshn from",
        "jain drshn from",
        "None of these"
    ],
    answer: "bauddh drshn from"
},

{
    question: "shNkr of time maanaa goes is-",
    option: [
        "788-820 AD",
        "800-900 AD",
        "100-1100 AD",
        "700-820 AD"
    ],
    answer: "788-820 AD"
},

{
    question: "jain drshn in aatmaa to said goes is-",
    option: [
        "man",
        "jiiv",
        "iishvr",
        "ajiiv"
    ],
    answer: "jiiv"
},

{
    question: "knowledgemiimaaNsiiy vstuvaad according to",
    option: [
        "jnyey jnyaataa from svtNtr is not",
        "jnyaataa and jnyey both one-another from svtNtr are",
        "jnyaataa and jnyey both one-another from svtNtr is notN",
        "[a] and [b] both"
    ],
    answer: "[a] and [b] both"
},

{
    question: "Which of the following saa viklp saaNkhy drshn of prkRti of sNdrbh in correct is?",
    option: [
        "prkRti of sNkhyaa one is and skriy is",
        "prkRti of sNkhyaa two is and skriy is",
        "prkRti of sNkhyaa anek is and nisskriy is",
        "None of these"
    ],
    answer: "prkRti of sNkhyaa one is and skriy is"
},

{
    question: "bauddh drshn of prmukh siddhaaNt what is?",
    option: [
        "mdhym maarg",
        "advaitvaad",
        "iishvrvaad",
        "All of these"
    ],
    answer: "mdhym maarg"
},

{
    question: "buddh of which aary sty in nirvaann of maarg vrnnit is?",
    option: [
        "prthm",
        "dvitiiy",
        "tRtiiy",
        "cturth"
    ],
    answer: "cturth"
},

{
    question: "tttvtrkm anumaanm anumaan of pribhaassaa dii was is-",
    option: [
        "nyaay by",
        "vaishessik by",
        "saaNkhy by",
        "None of these"
    ],
    answer: "vaishessik by"
},

{
    question: "aatmaa of special quality are-",
    option: [
        "sukh",
        "duHkh",
        "sukh and duHkh",
        "None of these"
    ],
    answer: "sukh and duHkh"
},

{
    question: "‘anaaskti yog’ naamk grNth of rgram who of?",
    option: [
        "child gNgaadhr tilk",
        "mhaatmaa gaaNdhii",
        "arvind ghoss",
        "ddoN. raadhaakRssnnn"
    ],
    answer: "mhaatmaa gaaNdhii"
},

{
    question: "nisskaam krm what is?",
    option: [
        "krm of tyaag is",
        "krmphl of tyaag is",
        "skaam krm is",
        "None of these"
    ],
    answer: "krmphl of tyaag is"
},

{
    question: "smiikssaatmk vstuvaad to called are",
    option: [
        "knowledge miimaaNsiiy ekvaad",
        "knowledge miimaaNsiiy dvaitvaad",
        "element miimaaNsiiy dvaitvaad",
        "None of these"
    ],
    answer: "knowledge miimaaNsiiy ekvaad"
},

{
    question: "vicaar and vistaar to iishvr of quality who maanaa is?",
    option: [
        "spinojaa",
        "dekaart",
        "laaibnij",
        "kaanntt"
    ],
    answer: "spinojaa"
},

{
    question: "bhrtRhri ne prsiddh book likhaa is-",
    option: [
        "sphottvaad",
        "vaakypdiiym",
        "shbdbodh",
        "among these any not"
    ],
    answer: "vaakypdiiym"
},

{
    question: "vaishessik by how many types of krm maanaa was is?",
    option: [
        "five",
        "eight",
        "solh",
        "caubiis"
    ],
    answer: "five"
},

{
    question: "antHkriyaavaad principle is:",
    option: [
        "dekaart of",
        "spinojaa of",
        "laaibnij of",
        "loNk of"
    ],
    answer: "dekaart of"
},

{
    question: "body and mn upaadhiyoN from siimit prmaatmaa what is?",
    option: [
        "maayaa",
        "jiivaatmaa",
        "brhm",
        "None of these"
    ],
    answer: "jiivaatmaa"
},

{
    question: "medical treatment niitishaastr of important problem what is?",
    option: [
        "aatm htyaa",
        "embryo htyaa",
        "hiNsaa",
        "dhaarmik hiNsaa"
    ],
    answer: "embryo htyaa"
},

{
    question: "buddh to nirvaann where mixed thaa?",
    option: [
        "kushiingr",
        "saarnaath",
        "bodh was",
        "kpilvstu"
    ],
    answer: "kushiingr"
},

{
    question: "respiratory prkriyaa to controlled by doing one krm in laanaa what is called is?",
    option: [
        "dhyaan",
        "dhaarnnaa",
        "smaadhi",
        "praannaayaam"
    ],
    answer: "praannaayaam"
},

{
    question: "Which of the following anupyukt niitishaastr of shaakhaa is?",
    option: [
        "pryaavrnniiy niitishaastr",
        "jaiv-cikitsiiy niitishaastr",
        "vyfaty niitishaastr",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "Which of the following anupyukt niitishaastr of shaakhaa is?",
    option: [
        "pryaavrnniiy niitishaastr",
        "jaiv-cikitsiiy niitishaastr",
        "vyfaty niitishaastr",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "shNkr according to st-aanNd which is?",
    option: [
        "iishvr",
        "maayaa",
        "brhm",
        "None of these"
    ],
    answer: "brhm"
},

{
    question: "“niitishaastr shubh and proper aacrnn of adhyyn is”- this pribhaassaa who dii?",
    option: [
        "muur",
        "maikenjii",
        "joNn de",
        "None of these"
    ],
    answer: "maikenjii"
},

{
    question: "shNkr according to body from mukt aatmaa what is?",
    option: [
        "jiiv",
        "maayaa",
        "brhm",
        "None of these"
    ],
    answer: "brhm"
},

{
    question: "vaishessik by how many types of quality maanaa was is?",
    option: [
        "twelve",
        "caubiis",
        "eight",
        "solh"
    ],
    answer: "caubiis"
},

{
    question: "saaNkhy, yog and nyaay drshn of normal vicaar hai / ",
    option: [
        "aastiktaa",
        "naastiktaa",
        "ekvaaditaa",
        "None of these"
    ],
    answer: "aastiktaa"
},

{
    question: "nyaay suutr who likhaa is?",
    option: [
        "vaacspti",
        "vaatsyaayn",
        "gautm",
        "udyn bhtttt"
    ],
    answer: "gautm"
},

{
    question: "prinnaam of dRsstti from cause function from what is?",
    option: [
        "bdd'aa",
        "chottaa",
        "bhukaarnnvaad",
        "None of these"
    ],
    answer: "bhukaarnnvaad"
},

{
    question: "person bno’ this vktvy is",
    option: [
        "breddle of",
        "sorokiin of",
        "higel of",
        "kaanntt of"
    ],
    answer: "breddle of"
},

{
    question: "shNkr of drshn according to paarmaarthik sttaa what is ?",
    option: [
        "st",
        "cit",
        "aannd",
        "All of these"
    ],
    answer: "st"
},

{
    question: "India of daarshnik smprdaayoN to baaNttaa was is- [2009A,16A,23A]",
    option: [
        "aastik",
        "naastik",
        "aastik and naastik",
        "None of these"
    ],
    answer: "aastik and naastik"
},

{
    question: "ptNjli according to niym of sNkhyaa how many is?",
    option: [
        "two",
        "five",
        "three",
        "six"
    ],
    answer: "five"
},

{
    question: "buddh of assttaaNgik maarg following in from which aary-sty from smbddh is?",
    option: [
        "prthm aary-sty",
        "dvitiiy aary-sty",
        "tRtiiy aary-sty",
        "cturth aary-sty"
    ],
    answer: "cturth aary-sty"
},

{
    question: "Which of the following one vedaant of shaakhaa is not?",
    option: [
        "dvait",
        "vishissttaadvait",
        "advait",
        "None of these"
    ],
    answer: "None of these"
},

{
    question: "education drshn of basis-",
    option: [
        "prkRtivaad is",
        "aadhyaatmvaad is",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "(A) and (B) both"
},

{
    question: "knowledgeshaastriiy prtyyvaad sviikaar does is",
    option: [
        "item jnyaataa from svtNtr is",
        "item jnyaataa on depends is",
        "item jnyaataa from tttsth is",
        "None of these"
    ],
    answer: "item jnyaataa on depends is"
},

{
    question: "prm element according to prm sttaa is",
    option: [
        "prtyy",
        "jdd'",
        "tttsth",
        "None of these"
    ],
    answer: "tttsth"
},

{
    question: "jain drshn in knowledge of saapeksstaa of principle what is?",
    option: [
        "syaadvaad",
        "anekaantvaad",
        "akhyaativaad",
        "None of these"
    ],
    answer: "syaadvaad"
},

{
    question: "bauddh drshn in mokss to nirvaann said was hai /  isse person of-",
    option: [
        "smst duHkhoN of aNt be goes is",
        "punrjnm of shrRNkhlaa smaapt be goes is",
        "A and B both",
        "None of these"
    ],
    answer: "A and B both"
},

{
    question: "“knowledge of obtaining nigmnaatmk method from occurs” this which knowledge principle according to?",
    option: [
        "buddhivaad",
        "anubhvvaad",
        "smiikssaavaad",
        "None of these"
    ],
    answer: "buddhivaad"
},

{
    question: "srvocc shubh what is?",
    option: [
        "maatr means is",
        "maatr baahy is",
        "crm lkssy is",
        "None of these"
    ],
    answer: "crm lkssy is"
},

{
    question: "following in from who said is ki cause bhaavaatmk and nissedhaatmk upaadhiyoN of yogphl is?",
    option: [
        "mil",
        "arstuu",
        "hyuum",
        "None of these"
    ],
    answer: "mil"
},

{
    question: "smiikssaatmk vstuvaad to called are",
    option: [
        "knowledge miimaaNsiiy ekvaad",
        "knowledge miimaaNsiiy dvaitvaad",
        "element miimaaNsiiy dvaitvaad",
        "None of these"
    ],
    answer: "knowledge miimaaNsiiy dvaitvaad"
},

{
    question: "en iNttroddkshn ttuu ethiks of lekhk which are?",
    option: [
        "arstuu",
        "mil",
        "maikeNjii",
        "viliym lilii"
    ],
    answer: "viliym lilii"
},

{
    question: "vaishessik drshn according to quality of basis what is?",
    option: [
        "agent",
        "normal",
        "special",
        "None of these"
    ],
    answer: "agent"
},

{
    question: "shNkr according to brhm is-",
    option: [
        "brhm",
        "jgt",
        "iishvr",
        "among these any not"
    ],
    answer: "among these any not"
},

{
    question: "bauddh drshn and jain drshn which daarshnik smprdaay in comes is?",
    option: [
        "aastik",
        "naastik",
        "aastik and naastik both",
        "All of these"
    ],
    answer: "naastik"
},

{
    question: "giitaa in kinke vicaar from iishvr of vaannii maanii gyii is",
    option: [
        "kRssnn",
        "arjun",
        "vyaas",
        "None of these"
    ],
    answer: "kRssnn"
},

{
    question: "which daarshnik ne said ki srl prtyyoN of construction in hmaarii buddhi nisskriy rhtii is?",
    option: [
        "spinojaa",
        "loNk",
        "laaibnij",
        "brkle"
    ],
    answer: "loNk"
},

{
    question: "jiiv of form what is?",
    option: [
        "nity",
        "body in nivaasit",
        "prkaashvaan",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "following in from anviikssaa kise called are?",
    option: [
        "direct",
        "shbd",
        "upmaan",
        "anumaan"
    ],
    answer: "anumaan"
},

{
    question: "‘maiN soctaa huuN, islie maiN huuN / ’ this kthn is",
    option: [
        "dekaart of",
        "loNk of",
        "hyuum of",
        "pletto of"
    ],
    answer: "dekaart of"
},

{
    question: "education drshn one shaakhaa is-",
    option: [
        "mnoviknowledge of",
        "economics of",
        "trkshaastr of",
        "among these any not"
    ],
    answer: "among these any not"
},

{
    question: "knowledgemiimaaNsiiy vstuvaad according to",
    option: [
        "jnyey jnyaataa from svtNtr is not",
        "jnyaataa and jnyey both one-another from svtNtr is",
        "item jnyaataa on depends is",
        "None of these"
    ],
    answer: "jnyaataa and jnyey both one-another from svtNtr is"
},

{
    question: "following in from which yukti of khnaa is ki iishvr of astitv iishvr of vicaar from anivaarytH phlit is?",
    option: [
        "vishvmuulk yukti",
        "kaarnntaamuulk yukti",
        "taatvik yukti",
        "pryojnmuulk yukti"
    ],
    answer: "taatvik yukti"
},

{
    question: "bhgvd giitaa of relation in Which of the following viklp correct is?",
    option: [
        "bhgvd giitaa kRssnn-arjun sNvaad of prtiphl is",
        "bhgvd giitaa mhaabhaart mhaakaavy of part is",
        "bhgvd giitaa bhgvaan of giit is",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "upmaan to whose shrennii in rkhaa goes is?",
    option: [
        "shbd of shrennii in",
        "direct of shrennii in",
        "anumaan of shrennii in",
        "None of these"
    ],
    answer: "None of these"
},

{
    question: "gautm of book of name is-",
    option: [
        "raamaaynn",
        "yogaasn",
        "nyaay suutr",
        "None of these"
    ],
    answer: "nyaay suutr"
},

{
    question: "anekaantvaad which drshn from judd'aa is?",
    option: [
        "bauddh drshn",
        "jain drshn",
        "saaNkhy drshn",
        "nyaay drshn"
    ],
    answer: "jain drshn"
},

{
    question: "praagnubhvik knowledge related is-",
    option: [
        "anubhv from",
        "buddhi from",
        "both from",
        "None of these"
    ],
    answer: "buddhi from"
},

{
    question: "nyaay drshn of one vrgiikrnn according to Which of the following saa viklp anumaan of type of sNdrbh in correct is?",
    option: [
        "puurvvt",
        "shessvt",
        "saamaanytodRsstt",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "ved how many are?",
    option: [
        "one",
        "two",
        "three",
        "four"
    ],
    answer: "four"
},

{
    question: "ptNjli of yogik prvidhi of aNtim paaydaan what is?",
    option: [
        "prtyaahaar",
        "dhaarnnaa",
        "dhyaan",
        "smaadhi"
    ],
    answer: "smaadhi"
},

{
    question: "cittvRtti nirodh to called are-",
    option: [
        "praannaayaam",
        "yog",
        "smaadhi",
        "None of these"
    ],
    answer: "yog"
},

{
    question: "shNkr according to nirpekss cetn which sttaa is?",
    option: [
        "jgt",
        "jiivaatmaa",
        "body",
        "brhm"
    ],
    answer: "brhm"
},

{
    question: "Which of the following one buddhivaadii and anubhvvaadii is not?",
    option: [
        "kaanntt",
        "spinojaa",
        "hyuum",
        "None of these"
    ],
    answer: "spinojaa"
},

{
    question: "Indian drshn in bNdh knowledge obtained doing of means to what called are ? [2022A, 2023A]",
    option: [
        "proof",
        "prmaa",
        "prmey",
        "prmaataa"
    ],
    answer: "proof"
},

{
    question: "‘bhgvdgiitaa’ of shaabdik meaning what is?",
    option: [
        "iishvr of giit",
        "iishvr of astitv",
        "iishvr of svruup",
        "iishvr of sNkhyaa"
    ],
    answer: "iishvr of giit"
},

{
    question: "following in from which yukti to kaarnntaamuulk yukti said jaa can is?",
    option: [
        "sttaamuulk",
        "vishvmuulk",
        "pryojnmuulk",
        "naitik"
    ],
    answer: "vishvmuulk"
},

{
    question: "Indian drshn of praann or aatmaa kise maanaa jaa can is ? [2022 A]",
    option: [
        "healthy body to",
        "healthy mn to",
        "pure aatmaa to",
        "pure adhyaatm to"
    ],
    answer: "pure aatmaa to"
},

{
    question: "saaNkhy drshn in cetn sttaa to what said goes is?",
    option: [
        "prkRti",
        "sttv",
        "man",
        "None of these"
    ],
    answer: "man"
},

{
    question: "cause what is?",
    option: [
        "only bhaavaatmk sthitiyoN of yog",
        "only nissedhaatmk sthitiyoN of yog",
        "bhaavaatmk and nissedhaatmk sthitiyoN of yog",
        "None of these"
    ],
    answer: "bhaavaatmk and nissedhaatmk sthitiyoN of yog"
},

{
    question: "aastik drshnoN of sNkhyaa is- [2010A, 18A]",
    option: [
        "eight",
        "six",
        "three",
        "five"
    ],
    answer: "six"
},

{
    question: "vaishessik drshn in substance of vibhaajn was is-",
    option: [
        "bhaav substance",
        "abhaav substance",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "(A) and (B) both"
},

{
    question: "‘duHkh is’ iskii crcaa buddh apne which aary sty in do are?",
    option: [
        "prthm aary sty",
        "dvitiiy aary sty",
        "tRtiiy aary sty",
        "cturth aary sty"
    ],
    answer: "prthm aary sty"
},

{
    question: "pure sttaa jo n then baadhit occurs and n jiske baadhit being of klpnaa of jaa sktii is, use said goes is",
    option: [
        "vyaavhaarik sttaa",
        "paarmaarthik sttaa",
        "prtibhaassit sttaa",
        "None of these"
    ],
    answer: "paarmaarthik sttaa"
},

{
    question: "Which of the following purussaarth is not- [2011A, 2015A, 2023A]",
    option: [
        "iishvr",
        "aatmaa",
        "meaning",
        "None of these"
    ],
    answer: "aatmaa"
},

{
    question: "prkRti of which-saa quality jdd'taa and nisskriytaa of cause is ? [2022 A]",
    option: [
        "stvgunn",
        "rjogunn",
        "tmogunn",
        "All of these"
    ],
    answer: "tmogunn"
},

{
    question: "advait vedaaNt of prvrtk are-",
    option: [
        "raamaanuj",
        "shNkr",
        "mdhv",
        "nimbaark"
    ],
    answer: "shNkr"
},

{
    question: "giitaa in yog shbd of behavior was is-",
    option: [
        "aatmaa from miln of",
        "aatmaa of prmaatmaa from miln of",
        "prmaatmaa from miln of",
        "None of these"
    ],
    answer: "aatmaa of prmaatmaa from miln of"
},

{
    question: "gautm ne real knowledge to what said is?",
    option: [
        "prmaa",
        "aprmaa",
        "prmaa and aprmaa",
        "None of these"
    ],
    answer: "prmaa"
},

{
    question: "giitaa in kul how many adhyaay are?",
    option: [
        "twelve",
        "pNdrh",
        "atthaarh",
        "twenty-five"
    ],
    answer: "atthaarh"
},

{
    question: "dekaart aatmaa, iishvr jaisii sttaa of knowledge of praarmbh where from maante are?",
    option: [
        "indriyoN from",
        "klpnaa from",
        "priklpnaa from",
        "svtH siddh congenital prtyy from"
    ],
    answer: "svtH siddh congenital prtyy from"
},

{
    question: "aalockoN of mt in dekaart of taatvik yukti nkl is –",
    option: [
        "ekviins",
        "bekn",
        "agsttiin",
        "enselttm"
    ],
    answer: "enselttm"
},

{
    question: "caarvaak to chodd'kr India of all daarshnik kisko bndhn of muul cause maante are?",
    option: [
        "knowledge to",
        "aknowledge to",
        "knowledge and aknowledge to",
        "None of these"
    ],
    answer: "aknowledge to"
},

{
    question: "iishvr of sttaa for naitik yukti of who smrthn done is?",
    option: [
        "kaanntt",
        "dekaart",
        "spinojaa",
        "hyuum"
    ],
    answer: "kaanntt"
},

{
    question: "arstu because of of how many type btaae are?",
    option: [
        "two",
        "three",
        "four",
        "five"
    ],
    answer: "four"
},

{
    question: "jain drshn of ‘anekaantvaad’ of siddhaaNt of direct relation from whom is?",
    option: [
        "agent of anektaa from",
        "knowledge of saapeksstaa from",
        "jain dhrm of grNth from",
        "jain dhrm of puujaa sthloN from"
    ],
    answer: "agent of anektaa from"
},

{
    question: "trirtn are-",
    option: [
        "smyk drshn",
        "smyk knowledge",
        "smyk critr",
        "uprokt all"
    ],
    answer: "uprokt all"
},

{
    question: "buddh of assttaaNgik maarg of prthm two (smyk dRsstti and smyk sNklp) to said goes is?",
    option: [
        "prjnyaa",
        "shiil",
        "smaadhi",
        "among these any not"
    ],
    answer: "prjnyaa"
},

{
    question: "who sNskaaroN to primary and prtyyoN to gaunn maanaa is?",
    option: [
        "hyuum",
        "loNk",
        "brkle",
        "kaanntt"
    ],
    answer: "hyuum"
},

{
    question: "bhgvd giitaa according to vh krm what is jo binaa fruit of icchaa of is done?",
    option: [
        "skaam krm",
        "nisskaam krm",
        "vikrm",
        "akrm"
    ],
    answer: "nisskaam krm"
},

{
    question: "saaNkhy and yog-drshn according to duHkh of which-from type are?",
    option: [
        "aadhyaatmik duHkh",
        "aadhiphysical duHkh",
        "aadhidaivik duHkh",
        "these all"
    ],
    answer: "these all"
},

{
    question: "whichaccording to giitaa krm of viknowledge is?",
    option: [
        "child gNgaadhr tilk",
        "vinobaa bhaave",
        "arvind ghoss",
        "mhaatmaa gaaNdhii"
    ],
    answer: "child gNgaadhr tilk"
},

{
    question: "Which of the following ekvaadii is?",
    option: [
        "dekaart",
        "spinojaa",
        "saaNkhy",
        "laaibniij"
    ],
    answer: "spinojaa"
},

{
    question: "vstuvaad of what maanytaa is?",
    option: [
        "jnyey substance jnyaataa on depends is",
        "jnyey substance jnyaataa from svtNtr is",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "jnyey substance jnyaataa from svtNtr is"
},

{
    question: "following in which-saa kthn anubhvvaad from smbddh is?",
    option: [
        "knowledge obtaining of ekmaatr means indriyaanubhuuti is",
        "vivek only knowledge obtaining of ekmaatr means is",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "knowledge obtaining of ekmaatr means indriyaanubhuuti is"
},

{
    question: "Which of the following one dRssttikonn vaishessik according to correct is not?",
    option: [
        "prmaannu nity are",
        "prmaannu from made smaan nity are",
        "prmaannu upmaan of by not going go are",
        "All of these"
    ],
    answer: "prmaannu upmaan of by not going go are"
},

{
    question: "yog drshn of assttaaNgik maarg in aNtrNg means kise called are?",
    option: [
        "dhaarnnaa",
        "dhyaan",
        "smaadhi",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "vyaapaar niitishaastr adhyyn is-",
    option: [
        "aadrshoN of",
        "values of",
        "profit of",
        "naitiktaa of"
    ],
    answer: "profit of"
},

{
    question: "following in which naastik drshn are? [2018A]",
    option: [
        "bauddh drshn",
        "jain drshn",
        "caarvaak drshn",
        "uprokt all"
    ],
    answer: "uprokt all"
},

{
    question: "any function of utptti in which anivaary is?",
    option: [
        "nissedhaatmk upaadhiyoN of upsthiti",
        "bhaavaatmk upaadhiyoN of upsthiti",
        "nissedhaatmk upaadhiyoN of anupsthiti",
        "None of these"
    ],
    answer: "bhaavaatmk upaadhiyoN of upsthiti"
},

{
    question: "Which of the following punrjnm in vishvaas does is but aatmaa to shaashvt not maantaa is?",
    option: [
        "jain drshn",
        "saaNkhy drshn",
        "bauddh drshn",
        "All of these"
    ],
    answer: "bauddh drshn"
},

{
    question: "vaishessik of abhaav substance given is-",
    option: [
        "prshstpaad by",
        "gautm by",
        "knnaad by",
        "bhrtRhri by"
    ],
    answer: "prshstpaad by"
},

{
    question: "krm siddhaaNt kaarnntaavaad is-",
    option: [
        "taarkik",
        "nyaayik",
        "naitik",
        "None of these"
    ],
    answer: "naitik"
},

{
    question: "advait vedaaNt of muul in what is ?",
    option: [
        "yog vidyaa",
        "brhm vidyaa",
        "jgt vidyaa",
        "maayaa vidyaa"
    ],
    answer: "brhm vidyaa"
},

{
    question: "prkRti of gunnoN in being which change to called are-",
    option: [
        "viruup change",
        "shaashvt change",
        "aakaarik change",
        "aNtim change"
    ],
    answer: "viruup change"
},

{
    question: "which naastik shirodhrm is called is?",
    option: [
        "bauddh",
        "jain",
        "caarvaak",
        "nyaay"
    ],
    answer: "caarvaak"
},

{
    question: "Which of the following ciNtk sNdehvaad related to is?",
    option: [
        "loNk",
        "spinojaa",
        "hyuum",
        "pletto"
    ],
    answer: "hyuum"
},

{
    question: "‘pNcskNdhvaad’ of vkaalt which Indian drshn does is?",
    option: [
        "bauddh drshn",
        "jain drshn",
        "nyaay drshn",
        "saaNkhy drshn"
    ],
    answer: "bauddh drshn"
},

{
    question: "shNkr according to jgt to which sttaa of under rkhaa jaa can is?",
    option: [
        "prtibhaassit sttaa",
        "vyaavhaarik sttaa",
        "paarmaarthik sttaa",
        "All of these"
    ],
    answer: "vyaavhaarik sttaa"
},

{
    question: "antkriyaavaad principle of prvrtk haiN / ",
    option: [
        "spiinojaa",
        "laaibniij",
        "dekaart",
        "hyuum"
    ],
    answer: "dekaart"
},

{
    question: "when aatmaa body, indriy mn etc upaadhiyoN from siimit be goes is, then vh is-",
    option: [
        "brhm",
        "jiiv",
        "maayaa",
        "None of these"
    ],
    answer: "jiiv"
},

{
    question: "raamaanujaacaary ne which drshn to prtipaadit done is?",
    option: [
        "advaitvaad",
        "vishissttaadvaitvaad",
        "dvaitvaad",
        "bhedaabhedvaad"
    ],
    answer: "vishissttaadvaitvaad"
},

{
    question: "Indian drshn in bNdhn of avdhaarnnaa of what meaning is? [2022A]",
    option: [
        "aatmaa of body from bNdhe rhnaa",
        "body of jgt from bNdhe rhnaa",
        "jiivaatmaa of prmaatmaa from bNdhe rhnaa",
        "sgunn iishvr of nirgunn iishvr from bNdhe rhnaa"
    ],
    answer: "aatmaa of body from bNdhe rhnaa"
},

{
    question: "saaNkhy drshn in aatmaa for which pd use of was is vh is-",
    option: [
        "jiiv",
        "aatmaa",
        "man",
        "None of these"
    ],
    answer: "man"
},

{
    question: "miimaaNsaa drshn of prnnetaa are-",
    option: [
        "kpil",
        "gautm",
        "jaimini",
        "ptNjli"
    ],
    answer: "jaimini"
},

{
    question: "aythaarth knowledge is called is",
    option: [
        "aprmaa",
        "prmaa",
        "proof",
        "None of these"
    ],
    answer: "aprmaa"
},

{
    question: "srvocc shubh kise said goes is?",
    option: [
        "saapekss shubh to",
        "nirpekss shubh to",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "nirpekss shubh to"
},

{
    question: "following in which-saa kthn anubhvvaad from smbddh is?",
    option: [
        "knowledge-obtaining of ekmaatr means indriyaanubhuuti is",
        "vivek only knowledge-obtaining of ekmaatr means is",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "knowledge-obtaining of ekmaatr means indriyaanubhuuti is"
},

{
    question: "physicalvaad according to prm sttaa is-",
    option: [
        "prtyy",
        "tttsth",
        "jdd'",
        "iishvr"
    ],
    answer: "jdd'"
},

{
    question: "dnndd of avdhaarnnaa is-",
    option: [
        "social",
        "daarshnik",
        "naitik",
        "All of these"
    ],
    answer: "naitik"
},

{
    question: "advait vedaaNt in jgt is-",
    option: [
        "puurnntH sty",
        "puurnntH asty",
        "mithyaa",
        "All of these"
    ],
    answer: "mithyaa"
},

{
    question: "saaNkhy drshn in sttvgunn of svruup of sNdrbh in what sviikaar is done?",
    option: [
        "sty sukh of svbhaav and source is",
        "sttv small is",
        "sttv cmkiilaa is",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "saaNkhy drshn of aadhyaatmik sttaa what is?",
    option: [
        "prkRti",
        "pRthvii",
        "iishvr",
        "man"
    ],
    answer: "man"
},

{
    question: "jain drshn of anekaantvaad of what maanytaa is?",
    option: [
        "world of vibhinn vstueN one another related to does not occur are",
        "world of vibhinn vstuoN of anek form not are",
        "world of astitv is not",
        "world of vibhinn vstuoN of anek form are"
    ],
    answer: "world of vibhinn vstuoN of anek form are"
},

{
    question: "Which of the following aastik drshn is not?",
    option: [
        "nyaay drshn",
        "yog drshn",
        "miimaaNsaa drshn",
        "None of these"
    ],
    answer: "None of these"
},

{
    question: "cause is-",
    option: [
        "anaupaadhik",
        "puurvvrtii",
        "niyt",
        "uprokt all"
    ],
    answer: "uprokt all"
},

{
    question: "saaNkhy means smyk knowledge smyk knowledge means-",
    option: [
        "man of knowledge",
        "prkRti of knowledge",
        "man and prkRti between bhinntaa of knowledge",
        "these all"
    ],
    answer: "man and prkRti between bhinntaa of knowledge"
},

{
    question: "following in from which one in buddh of updesh sNgrhit are?",
    option: [
        "nyaay suutr in",
        "tripittk in",
        "knowledge of book in",
        "nyaay drshn"
    ],
    answer: "tripittk in"
},

{
    question: "bauddh drshn according to arht kise called are?",
    option: [
        "vh jisne apnii all icchaaoN on control paa liyaa is",
        "vh jo apnii icchaaoN of vsh in is",
        "vh jo apnii icchaaoN to tRpt caahtaa is",
        "All of these"
    ],
    answer: "vh jisne apnii all icchaaoN on control paa liyaa is"
},

{
    question: "cause function relation btlaane which siddhaaNt in of what characteristic is?",
    option: [
        "these vaiknowledgeik siddhaaNt are",
        "these avaiknowledgeik siddhaaNt are",
        "these dhaarmik siddhaaNt are",
        "these naitik siddhaaNt are"
    ],
    answer: "these vaiknowledgeik siddhaaNt are"
},

{
    question: "following in which-saa one praarthaanumaan of ghttk is not?",
    option: [
        "praamrsh",
        "udaahrnn",
        "for",
        "upny"
    ],
    answer: "praamrsh"
},

{
    question: "nyaay knowledgemiimaaNsaa in shessvt what is?",
    option: [
        "taatkaalik anumaan",
        "direct",
        "upmaan",
        "shaabdik proof"
    ],
    answer: "taatkaalik anumaan"
},

{
    question: "prtyyvaad according to prm sttaa is-",
    option: [
        "prtyy",
        "jdd'",
        "tttsth",
        "None of these"
    ],
    answer: "prtyy"
},

{
    question: "sndeh of dekaart of drshn in what place is?",
    option: [
        "daarshnik vicaar of praarmbh biNdu",
        "sty of means",
        "prthm asNdigdh sty of khoj of means",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "purussaarth are- [2009A, 11A, 14A]",
    option: [
        "two",
        "three",
        "four",
        "None of these"
    ],
    answer: "four"
},

{
    question: "syaadvaad siddhaaNt related is-",
    option: [
        "nyaay drshn",
        "bauddh drshn",
        "jain drshn",
        "None of these"
    ],
    answer: "jain drshn"
},

{
    question: "buddh according to duHkh of muul cause is-",
    option: [
        "tRssnnaa",
        "jaati",
        "naamruup",
        "avidyaa"
    ],
    answer: "tRssnnaa"
},

{
    question: "Which of the following one smaanaantrvaad of smrthk is ?",
    option: [
        "laaibnis",
        "loNk",
        "dekaart",
        "spinojaa"
    ],
    answer: "spinojaa"
},

{
    question: "following in from anubhvvaadii trkshaastrii which is?",
    option: [
        "joNn loNk",
        "brkle",
        "hyuum",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "“puurv-sthaapit saamNjsyvaad’ given was is-",
    option: [
        "dekaart by",
        "spinojaa by",
        "laaibniij by",
        "hyuum by"
    ],
    answer: "laaibniij by"
},

{
    question: "giitaa rhsy of rgram who of is?",
    option: [
        "child gNgaadhr tilk",
        "mhaatmaa gaaNdhii",
        "arvind ghoss",
        "None of these"
    ],
    answer: "child gNgaadhr tilk"
},

{
    question: "which buddhivaadii daarshnik ne puurv sthaapit saamNjsy of principle prtipaadit done is?",
    option: [
        "spinojaa",
        "dekaart",
        "laaibnij",
        "kaanntt"
    ],
    answer: "laaibnij"
},

{
    question: "yog drshn is-",
    option: [
        "dvaitvaadii",
        "advaitvaadii",
        "dvaitvaadii and advaitvaadii",
        "None of these"
    ],
    answer: "dvaitvaadii"
},

{
    question: "kaanntt of knowledge smbndhii vicaar to called are-",
    option: [
        "anubhvvaad",
        "smiikssaavaad",
        "buddhivaad",
        "None of these"
    ],
    answer: "smiikssaavaad"
},

{
    question: "‘svyN soctaa huuN islie maiN huuN’ this kthn whose is?",
    option: [
        "spinojaa",
        "brkle",
        "loNk",
        "dekaart"
    ],
    answer: "dekaart"
},

{
    question: "jain drshn according to anstikaay agent what is?",
    option: [
        "ajiiv",
        "jiiv",
        "kaal",
        "None of these"
    ],
    answer: "kaal"
},

{
    question: "Indian drshn of normal lkssnn is- [2014A]",
    option: [
        "avidyaa",
        "mokss (mukti)",
        "punrjnm",
        "All of these"
    ],
    answer: "mokss (mukti)"
},

{
    question: "giitaa in which yog of crcaa was is?",
    option: [
        "knowledge yog",
        "bhktiyog",
        "krmyog",
        "these all"
    ],
    answer: "these all"
},

{
    question: "kssnnbhNgur of avdhaarnnaa which drshn of is?",
    option: [
        "bauddh drshn",
        "jain drshn",
        "nyaay drshn",
        "None of these"
    ],
    answer: "bauddh drshn"
},

{
    question: "advait vedaaNt according to jgt is-",
    option: [
        "prtibhaasik sttaa",
        "vyaavhaarik sttaa",
        "paarmaarthik sttaa",
        "None of these"
    ],
    answer: "vyaavhaarik sttaa"
},

{
    question: "Which of the following bhgvd giitaa according to iishvr of avtaar are?",
    option: [
        "arjun",
        "krnn",
        "kRssnn",
        "bhiim"
    ],
    answer: "kRssnn"
},

{
    question: "congenital prtyyoN of vicaar of khnnddn who done?",
    option: [
        "loNk",
        "brkle",
        "hyuum",
        "kaanntt"
    ],
    answer: "loNk"
},

{
    question: "substance siddhaaNt related is-",
    option: [
        "nyaay drshn",
        "vaishessik drshn",
        "saaNkhy drshn",
        "None of these"
    ],
    answer: "nyaay drshn"
},

{
    question: "Indian drshn of utptti was- [2009A, 2023A]",
    option: [
        "niraashaavaadii dRssttikonn from",
        "aadhyaatmik asNtoss from",
        "plaaynvaadii prvRtti from",
        "physical sukh obtaining of kaamnaa from"
    ],
    answer: "aadhyaatmik asNtoss from"
},

{
    question: "aatmaa and jgt related to lokpriy prshnoN towards mhaatmaa buddh maun rhaa do the? such main prshnoN of sNkhyaa how many is?",
    option: [
        "four",
        "two",
        "eight",
        "ten"
    ],
    answer: "ten"
},

{
    question: "drshn of utptti which dhaatu from was is? [2009A, 12, 14A]",
    option: [
        "kR dhaatu from",
        "dRsh dhaatu from",
        "lR dhaatu from",
        "None of these"
    ],
    answer: "dRsh dhaatu from"
},

{
    question: "alaukik direct of udaahrnn what is?",
    option: [
        "normal lkssnn direct",
        "knowledge lkssnn direct",
        "yogj direct",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "giitaa in svdhrm of what abhipraay is?",
    option: [
        "which vrnn of jo svaabhaavik krm is vhii uskaa svdhrm is",
        "vrnnoN of vrnnaantr krm only unkaa svdhrm is",
        "above-mentioned both",
        "None of these"
    ],
    answer: "which vrnn of jo svaabhaavik krm is vhii uskaa svdhrm is"
},

{
    question: "naitik nirnny what is?",
    option: [
        "vaastviktaa suuck nirnny",
        "vrnnnaatmk nirnny",
        "taarkik nirnny",
        "value vissyk nirnny"
    ],
    answer: "value vissyk nirnny"
},

{
    question: "Which of the following aastik drshn is?",
    option: [
        "jain drshn",
        "bauddh drshn",
        "saaNkhy drshn",
        "None of these"
    ],
    answer: "saaNkhy drshn"
},

{
    question: "bhgvdgiitaa in which from vicaar paaye go are?",
    option: [
        "nisskaam krm",
        "yog of avdhaarnnaa",
        "lok sNgrh",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "which vstuvaadii is ?",
    option: [
        "nyaay",
        "dekaart",
        "spinojaa",
        "laaibnij"
    ],
    answer: "dekaart"
},

{
    question: "stkaaryvaad of form are-",
    option: [
        "vivrtvaad and aarmbhvaad",
        "vivrtvaad",
        "vivrtvaad and prinnaamvaad",
        "prinnaamvaad"
    ],
    answer: "vivrtvaad and prinnaamvaad"
},

{
    question: "saaNkhy drshn according to quality of type are-",
    option: [
        "sttv",
        "rjs",
        "tms",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "mhaayaan dhaarmik smprdaay of relation which drshn from is?",
    option: [
        "jain drshn from",
        "bauddh drshn from",
        "nyaay drshn from",
        "saaNkhy drshn from"
    ],
    answer: "bauddh drshn from"
},

{
    question: "nyaay, vaishessik, saaNkhy and yog following in from which daarshnik smprdaay in come are?",
    option: [
        "aastik",
        "naastik",
        "aastik and naastik",
        "None of these"
    ],
    answer: "aastik"
},

{
    question: "tttv of Which of the following lkssnn is?",
    option: [
        "utptti",
        "decay",
        "nitytaa",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "dekaart after which aadhunik buddhivaadii ne mn and body to one only maanaa is?",
    option: [
        "laaibnij",
        "spinojaa",
        "loNk",
        "brkle"
    ],
    answer: "spinojaa"
},

{
    question: "shvetaambr dhaarmik smprdaay of relation which drshn from is?",
    option: [
        "jain drshn",
        "bauddh drshn",
        "saaNkhy drshn",
        "yog drshn"
    ],
    answer: "jain drshn"
},

{
    question: "syaadvaad to smjhaane for jain drshn in how many nyoN of prtipaadn done was?",
    option: [
        "four",
        "five",
        "seven",
        "nv"
    ],
    answer: "seven"
},

{
    question: "anumaan of taarkik basis is-",
    option: [
        "for",
        "vyaapti",
        "pkss",
        "None of these"
    ],
    answer: "for"
},

{
    question: "bauddh drshn of maulik and praamaannik basis Which of the following is?",
    option: [
        "suttpittk",
        "abhidhmmpittk",
        "vinypittk",
        "these all"
    ],
    answer: "these all"
},

{
    question: "puurvsthaapit saamNjsy siddhaaNt related is –",
    option: [
        "dekaart from",
        "kaanntt from",
        "laaibnits from",
        "None of these"
    ],
    answer: "laaibnits from"
},

{
    question: "bhgvdgiitaa in yog shbd use of which meaning in was is?",
    option: [
        "smaadhivaack",
        "sNbNdhvaack",
        "(A) and (B) both",
        "both in from any not"
    ],
    answer: "both in from any not"
},

{
    question: "vyaapaar vyfaty is-",
    option: [
        "aniitik",
        "kruur",
        "laabhonmukhii",
        "None of these"
    ],
    answer: "laabhonmukhii"
},

{
    question: "giitaa of rgram by whom of gyii is?",
    option: [
        "vyaas of by",
        "kRssnn of by",
        "arjun of by",
        "None of these"
    ],
    answer: "vyaas of by"
},

{
    question: "‘knowledge of obtaining congenital prtyy from occurs / ’ such maannaa is",
    option: [
        "buddhivaad of",
        "anubhvvaad of",
        "smiikssaavaad of",
        "None of these"
    ],
    answer: "buddhivaad of"
},

{
    question: "pryaavrnniiy niitishaastr is-",
    option: [
        "mnussy kendrit",
        "life kendrit",
        "pshu kendrit",
        "All of these"
    ],
    answer: "mnussy kendrit"
},

{
    question: "brhm is-",
    option: [
        "anek",
        "acetn",
        "anirvcniiy",
        "None of these"
    ],
    answer: "None of these"
},

{
    question: "jdd' in gti provide doing which power to what called are?",
    option: [
        "nimitt cause",
        "upaadaan cause",
        "aakaarik cause",
        "aNtim cause"
    ],
    answer: "nimitt cause"
},

{
    question: "smiikssaavaad is produced",
    option: [
        "anubhvvaad of bhaavaatmk aNshoN to milaakr",
        "buddhivaad of bhaavaatmk aNshoN to milaakr",
        "anubhvvaad and buddhivaad of bhaavaatmk aNshoN to milaakr",
        "anubhvvaad and buddhivaad of nkaaraatmk aNshoN to milaakr"
    ],
    answer: "anubhvvaad and buddhivaad of bhaavaatmk aNshoN to milaakr"
},

{
    question: "which daarshnik ne said is- ‘knowledge sNshlessnnaatmk praagnubhvik nirnny is’?",
    option: [
        "kaanntt",
        "hegl",
        "laaibnij",
        "spinojaa"
    ],
    answer: "kaanntt"
},

{
    question: "Indian drshn to niraashaavaadii why said was is ?",
    option: [
        "aatmaa to shaashvt maanne because of",
        "jgt to duHkhpuurnn maanne because of",
        "mukti of avdhaarnnaa because of",
        "krm siddhaaNt because of"
    ],
    answer: "jgt to duHkhpuurnn maanne because of"
},

{
    question: "anubhvvaad and buddhivaad of principle is",
    option: [
        "one-another of virodhii",
        "one-another of complementary",
        "n then virodhii and n complementary",
        "None of these"
    ],
    answer: "one-another of virodhii"
},

{
    question: "nyaay knowledgemiimaaNsaa in knowledge lkssnn direct what is?",
    option: [
        "alaukik direct",
        "laukik direct",
        "sviklpk direct",
        "nirviklpk direct"
    ],
    answer: "alaukik direct"
},

{
    question: "Indian drshn apnii which characteristic because of paashcaaty drshn from bhinntaa sthaapit does is ? [2022 A]",
    option: [
        "only knowledge of basis on",
        "only iishvr vicaar of basis on",
        "only jgt vicaar of basis on",
        "dRsstti containing knowledge of basis on"
    ],
    answer: "dRsstti containing knowledge of basis on"
},

{
    question: "advait vedaaNt according to cetn aatmaa of is",
    option: [
        "quality",
        "svruup",
        "prjnyaa",
        "None of these"
    ],
    answer: "svruup"
},

{
    question: "advaitvaad according to world of sRsstti which does is ?",
    option: [
        "apr brhm",
        "iishvr",
        "sgunn brhm",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "anubhvvaad of smrthk are",
    option: [
        "loNk",
        "brkle",
        "hyuum",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "Which of the following Indian daarshnik is notN? [2023A]",
    option: [
        "kpil",
        "gautm",
        "kaiNtt",
        "knnaad"
    ],
    answer: "kaiNtt"
},

{
    question: "‘maiN soctaa huuN islie maiN huuN’ this kthn is-",
    option: [
        "dekaart of",
        "loNk of",
        "hyuum of",
        "pletto of"
    ],
    answer: "dekaart of"
},

{
    question: "who said is ki function-cause relation aadt and prthaa because of become are?",
    option: [
        "dekaart",
        "spinojaa",
        "hyuum",
        "laaibniij"
    ],
    answer: "hyuum"
},

{
    question: "following in which drshn according to life of muul uddeshy mokssaanubhuuti obtained to do is?",
    option: [
        "yog-drshn",
        "saaNkhy-drshn",
        "nyaay-drshn",
        "yog-drshn and saaNkhy-drshn"
    ],
    answer: "yog-drshn and saaNkhy-drshn"
},

{
    question: "Indian-drshn according to life of which-saa pryojn physical is ? [2022 A]",
    option: [
        "work",
        "meaning",
        "dhrm",
        "A and B both"
    ],
    answer: "A and B both"
},

{
    question: "spinojaa ne sviikaaraa is",
    option: [
        "aNt:kriyaavaad",
        "smaanaantrvaad",
        "puurvsthaapit saamNjsyvaad",
        "None of these"
    ],
    answer: "smaanaantrvaad"
},

{
    question: "aatmaa of stytaa which-sii is?",
    option: [
        "vyaavhaarik",
        "paarmaarthik",
        "prtibhaassit",
        "None of these"
    ],
    answer: "paarmaarthik"
},

{
    question: "Indian drshn of which-sii avdhaarnnaa mnussy of saaNsaarik life of krmik development of uddeshy determined does is ? [2022 A]",
    option: [
        "agent of avdhaarnnaa",
        "purussaarth of avdhaarnnaa",
        "iishvr of avdhaarnnaa",
        "Any of these also not"
    ],
    answer: "purussaarth of avdhaarnnaa"
},

{
    question: "loan of avdhaarnnaa related is?",
    option: [
        "brhmcryaashrm from",
        "gRhsthaashrm from",
        "vaanprsthaashrm from",
        "sNnyaasaashrm from"
    ],
    answer: "gRhsthaashrm from"
},

{
    question: "which daarshnik ne said is- “knowledge sNshlessnnaatmk praagnubhvik nirnny is”?",
    option: [
        "kaanntt",
        "hegl",
        "laaibnij",
        "spinojaa"
    ],
    answer: "kaanntt"
},

{
    question: "loksNgrh of siddhaaNt what is?",
    option: [
        "substance sukhvaad",
        "srvklyaannvaad",
        "puurnntaavaad",
        "All of these"
    ],
    answer: "srvklyaannvaad"
},

{
    question: "vstuvaad is-",
    option: [
        "ttvmiimaaNsiiy principle",
        "knowledgemiimaaNsiiy principle",
        "ttvmiimaaNsiiy and knowledgemiimaaNsiiy both",
        "None of these"
    ],
    answer: "ttvmiimaaNsiiy principle"
},

{
    question: "prtitysmutpaad principle of relation following in from kinke with is?",
    option: [
        "mhaatmaa buddh",
        "mhaatmaa mhaaviir",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "mhaatmaa buddh"
},

{
    question: "prtyaahaar of stage of yog-prvidhi in what yogdaan is?",
    option: [
        "indriyoN to baahy vissyoN from vaaps khiiNgram",
        "indriyoN to indoor vissyoN from vaaps khiiNgram",
        "indriyoN to vaaps mn of full vsh in to do",
        "All of these"
    ],
    answer: "indriyoN to baahy vissyoN from vaaps khiiNgram"
},

{
    question: "vaishessik drshn according to agent of sNkhyaa how many is?",
    option: [
        "five",
        "six",
        "nine",
        "four"
    ],
    answer: "nine"
},

{
    question: "sviklpk direct of before of stage what is?",
    option: [
        "upmaan",
        "shbd",
        "normal lkssnn direct",
        "nirviklpk direct"
    ],
    answer: "nirviklpk direct"
},

{
    question: "buddh of assttaaNgik maarg to which organs in baaNttaa jaa can is?",
    option: [
        "prjnyaa",
        "shiil",
        "smaadhi",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "cause of gunnaatmk lkssnn is-",
    option: [
        "puurvvrtii ghttnaa is",
        "anaupaadhik ghttnaa is",
        "taatkaalik, niyt, anaupaadhik, puurvvrtii ghttnaa is",
        "All of these"
    ],
    answer: "taatkaalik, niyt, anaupaadhik, puurvvrtii ghttnaa is"
},

{
    question: "iishvr of sttaa for sttaamuulk yukti of who smrthn done is?",
    option: [
        "loNk",
        "hyuum",
        "kaanntt",
        "dekaart"
    ],
    answer: "dekaart"
},

{
    question: "jain drshn according to agent of what lkssnn is?",
    option: [
        "utptti",
        "vinaash",
        "sthirtaa",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "griik drshn of jnk are-",
    option: [
        "sukraat",
        "thels",
        "arstu",
        "hyuum"
    ],
    answer: "thels"
},

{
    question: "dekaart mn and body of relation of vyaakhyaa done is",
    option: [
        "puurv sthaapit saamNjsy by",
        "activity-prtikriyaavaad by",
        "both siddhaaNtoN by",
        "None of these"
    ],
    answer: "activity-prtikriyaavaad by"
},

{
    question: "dekaart, spinojaa and laaibnij knowledge of which principle to maanne which are?",
    option: [
        "anubhvvaadii principle",
        "buddhivaadii principle",
        "(A) and (B) both",
        "None of these"
    ],
    answer: "buddhivaadii principle"
},

{
    question: "which trk ne jgt of astitv of basis on iishvr of astitv prmaannit done is?",
    option: [
        "jgt-smbndhii trk",
        "pryojnmuulk trk",
        "kaarnntaa-smbndhii trk",
        "sttaavaadii trk"
    ],
    answer: "sttaavaadii trk"
},

{
    question: "which aadhunik paashcaaty anubhvvaadii ne apne puurv because of-function principle of puurv maanytaaoN to dhraashaayii by given?",
    option: [
        "loNk",
        "brkle",
        "hyuum",
        "spinojaa"
    ],
    answer: "hyuum"
},

{
    question: "who said is ki buddhivaad of ant aNdhvishvaas in and anubhvvaad of ant sNshyvaad in is?",
    option: [
        "loNk",
        "brkle",
        "hyuum",
        "kaanntt"
    ],
    answer: "kaanntt"
},

{
    question: "smiikssaavaad is produced",
    option: [
        "anubhvvaad of bhaavaatmk aNshoN to milaakr",
        "buddhivaad of bhaavaatmk aNshoN to milaakr",
        "anubhvvaad and buddhivaad of bhaavaatmk aNshoN to milaakr",
        "anubhvvaad and buddhivaad of nkaaraatmk aNshoN to milaakr"
    ],
    answer: "anubhvvaad and buddhivaad of bhaavaatmk aNshoN to milaakr"
},

{
    question: "‘prtitysmutpaad’ of crcaa bauddh drshn of which aary sty in was is?",
    option: [
        "prthm aary sty",
        "dvitiiy aary sty",
        "tRtiiy aary sty",
        "cturth aary sty"
    ],
    answer: "dvitiiy aary sty"
},

{
    question: "nyaay knowledgemiimaaNsaa according to prmey what is?",
    option: [
        "prmaataa",
        "proof",
        "prmaa",
        "prmaa of vissy"
    ],
    answer: "prmaa of vissy"
},

{
    question: "nyaay drshn of prvrtk which the?",
    option: [
        "aksspaad",
        "naagaarjun",
        "kpil",
        "knnaad"
    ],
    answer: "aksspaad"
},

{
    question: "whichaccording to ‘ythaarth knowledge saarvbhaum, anivaary and nviin should be’?",
    option: [
        "kaanntt",
        "spinojaa",
        "loNk",
        "hyuum"
    ],
    answer: "kaanntt"
},

{
    question: "element cintaamnni book of lekhk which are",
    option: [
        "udyn",
        "gNgesh",
        "gautm",
        "prshstpaad"
    ],
    answer: "gNgesh"
},

{
    question: "muul tttv of sndrbh in advait vedaant which tttv miimaaNsaa to apnaataa is ?",
    option: [
        "pure ekvaad",
        "dvaitvaad",
        "special dvaitvaad",
        "All of these"
    ],
    answer: "pure ekvaad"
},

{
    question: "following in which krm of one type are?",
    option: [
        "sNcit krm",
        "praarbdh krm",
        "sNciiymaan krm",
        "these all"
    ],
    answer: "these all"
},

{
    question: "Indian drshn in krm siddhaaNt according to krm of fruit what may cause?",
    option: [
        "bNdhn",
        "life in duHkh",
        "punrjnm",
        "All of these"
    ],
    answer: "All of these"
},

{
    question: "srveshvrvaad of smrthk which are?",
    option: [
        "hyuum",
        "loNk",
        "spinojaa",
        "kaanntt"
    ],
    answer: "spinojaa"
},

{
    question: "buddh according to dvitiiy aary sty Which of the following is?",
    option: [
        "sNsaar dukhoN from pripuurnn is",
        "dukhoN of cause also is",
        "dukhoN of ant sNbhv is",
        "dukhoN of ant of maarg is"
    ],
    answer: "dukhoN of cause also is"
},

{
    question: "anumaan proof of jdd' what is? [2021A]",
    option: [
        "upmaan",
        "direct",
        "shbd",
        "None of these"
    ],
    answer: "direct"
},

{
    question: "mhaatmaa gaaNdhii ne giitaa to said is-",
    option: [
        "mother",
        "pitaa",
        "baaibil",
        "kuraan"
    ],
    answer: "mother"
},

{
    question: "brhmsuutr of rcyitaa are",
    option: [
        "gaudd'paad",
        "brkle",
        "shNkr",
        "nimbaark"
    ],
    answer: "shNkr"
},

{
    question: "eniiselm at the time of in which principle of vrcsv thaa ?",
    option: [
        "force principle",
        "gti principle",
        "gurutvaakrssnn principle",
        "None of these"
    ],
    answer: "gurutvaakrssnn principle"
},

{
    question: "bauddh-drshn of sNsthaapk which the?",
    option: [
        "naagaarjun",
        "mhaatmaa buddh",
        "gautm Rssi",
        "raahul"
    ],
    answer: "mhaatmaa buddh"
},

{
    question: "aythaarth knowledge is called is",
    option: [
        "aprmaa",
        "prmaa",
        "proof",
        "None of these"
    ],
    answer: "aprmaa"
},

{
    question: "jain drshn according to life of crm lkssy is-",
    option: [
        "meaning",
        "dhrm",
        "work",
        "mokss"
    ],
    answer: "mokss"
},

{
    question: "saaNkhy drshn in aatmaa to said goes is-",
    option: [
        "brhm",
        "man",
        "iishvr",
        "All of these"
    ],
    answer: "man"
},

{
    question: "which daarshnik ne tttvmiimaaNsiiy prshnoN on maun dhaarnn kiye rhne to primarytaa given is?",
    option: [
        "mhaaviir",
        "syaadvaad",
        "kpil",
        "advaitvaad"
    ],
    answer: "advaitvaad"
},
];

// --- Helper: Shuffle questions ---
const shuffleQuestions = (questions) => {
  const shuffled = [...questions];
  for (let i = shuffled.length - 1; i > 0; i--) {
    const j = Math.floor(Math.random() * (i + 1));
    [shuffled[i], shuffled[j]] = [shuffled[j], shuffled[i]];
  }
  return shuffled;
};

// --- Component ---
export default function Philosophy12thQuiz() {
  const [started, setStarted] = useState(false);
  const [submitted, setSubmitted] = useState(false);
  const [timer, setTimer] = useState(3600); // 60 minutes = 3600 seconds
  const [language, setLanguage] = useState('hi');
  const [questions, setQuestions] = useState([]);
  const [current, setCurrent] = useState(0);
  const [answers, setAnswers] = useState({});
  const [score, setScore] = useState(0);
  const [resultDetails, setResultDetails] = useState([]);
  const [showTimerWarning, setShowTimerWarning] = useState(false);
  const resultRef = useRef(null);

  useEffect(() => {
    if (started && !submitted && timer > 0) {
      const t = setInterval(() => {
        setTimer((p) => {
          if (p <= 60) setShowTimerWarning(true);
          return p - 1;
        });
      }, 1000);
      return () => clearInterval(t);
    }
    if (timer === 0 && started && !submitted) {
      submitExam();
    }
  }, [started, submitted, timer]);

  const startExam = () => {
    const questionBank = language === 'hi' ? philosophyHindi : philosophyEnglish;
    // Select only 100 questions (all of them)
    const selectedQuestions = shuffleQuestions(questionBank).slice(0, 100);
    setQuestions(selectedQuestions);
    setStarted(true);
    setTimer(3600);
    setAnswers({});
    setCurrent(0);
    setShowTimerWarning(false);
  };

  const submitExam = () => {
    let s = 0;
    const details = questions.map((q, i) => {
      const isCorrect = answers[i] === q.answer;
      if (isCorrect) s++;
      return {
        question: q.question,
        option: q.option,
        correctAnswer: q.answer,
        userAnswer: answers[i] || (language === 'hi' ? "प्रयास नहीं किया" : "Not Attempted"),
        isCorrect: isCorrect,
        isAttempted: answers[i] !== undefined,
      };
    });
    setScore(s);
    setResultDetails(details);
    setSubmitted(true);
  };

  const toggleLanguage = () => {
    if (!started) {
      setLanguage(language === 'hi' ? 'en' : 'hi');
    }
  };

  const downloadResult = () => {
    if (resultRef.current) {
      const printWindow = window.open('', '_blank');
      if (printWindow) {
        const content = resultRef.current.innerHTML;
        printWindow.document.write(`
          <html>
            <head>
              <title>${language === 'hi' ? 'दर्शनशास्त्र 12वीं परिणाम' : 'Philosophy 12th Result'}</title>
              <style>
                body { font-family: Arial, sans-serif; padding: 20px; }
                .result-container { max-width: 800px; margin: 0 auto; }
                .header { text-align: center; padding: 20px; background: linear-gradient(135deg, #1a237e, #3f51b5); color: white; border-radius: 10px; margin-bottom: 20px; }
                .score-card { text-align: center; padding: 20px; border: 2px solid #1a237e; border-radius: 10px; margin-bottom: 20px; }
                .score { font-size: 40px; font-weight: bold; color: #1a237e; }
                .status { font-size: 20px; margin: 10px 0; }
                .pass { color: #28a745; }
                .fail { color: #dc3545; }
                .question-item { padding: 15px; margin: 10px 0; border-radius: 8px; border-left: 4px solid #48bb78; background: #f8f9fa; }
                .question-item.wrong { border-left-color: #dc3545; background: #fff5f5; }
                .question-item .q { font-weight: bold; font-size: 14px; }
                .question-item .your-answer { margin-top: 5px; font-size: 13px; }
                .question-item .correct-answer { margin-top: 3px; font-size: 13px; color: #28a745; font-weight: bold; }
                .wrong-answer { color: #dc3545; }
                .correct-answer-text { color: #28a745; }
                .not-attempted { color: #ffc107; }
                .footer { text-align: center; margin-top: 20px; padding: 10px; color: #666; font-size: 12px; border-top: 1px solid #ddd; }
              </style>
            </head>
            <body>
              <div class="result-container">
                ${content}
              </div>
            </body>
          </html>
        `);
        printWindow.document.close();
        printWindow.print();
      }
    }
  };

  const getText = (key) => {
    const texts = {
      'title': { hi: '🕉️ दर्शनशास्त्र 12वीं', en: '🕉️ Philosophy 12th' },
      'subtitle': { hi: 'कक्षा 12 दर्शनशास्त्र प्रश्नोत्तरी', en: 'Class 12 Philosophy Quiz' },
      'questions': { hi: '📝 प्रश्न', en: '📝 Questions' },
      'time': { hi: '⏱️ समय', en: '⏱️ Time' },
      'instructions': { hi: '📋 निर्देश:', en: '📋 Instructions:' },
      'compulsory': { hi: 'सभी प्रश्न अनिवार्य हैं', en: 'All questions are compulsory' },
      'marks': { hi: 'प्रत्येक प्रश्न 1 अंक का है', en: 'Each question carries 1 mark' },
      'negative': { hi: 'कोई नकारात्मक अंकन नहीं', en: 'No negative marking' },
      'start': { hi: '🚀 क्विज़ शुरू करें', en: '🚀 Start Quiz' },
      'answered': { hi: 'उत्तर दिए:', en: 'Answered:' },
      'prev': { hi: '⬅ पिछला', en: '⬅ Prev' },
      'next': { hi: 'अगला ➡', en: 'Next ➡' },
      'submit': { hi: '📤 जमा करें', en: '📤 Submit' },
      'navigator': { hi: 'प्रश्न नेविगेटर', en: 'Question Navigator' },
      'answered_status': { hi: '🟢 उत्तर दिया', en: '🟢 Answered' },
      'current_status': { hi: '🔵 वर्तमान', en: '🔵 Current' },
      'unanswered_status': { hi: '⚪ अनुत्तरित', en: '⚪ Unanswered' },
      'congrats': { hi: '🎉 शानदार प्रदर्शन!', en: '🎉 Excellent Performance!' },
      'practice': { hi: '📖 सीखते रहें!', en: '📖 Keep Learning!' },
      'passed': { hi: '✔️ उत्तीर्ण', en: '✔️ Passed' },
      'failed': { hi: '❌ सुधार की आवश्यकता', en: '❌ Needs Improvement' },
      'review': { hi: '📋 उत्तर समीक्षा', en: '📋 Answer Review' },
      'your_answer': { hi: 'आपका उत्तर:', en: 'Your Answer:' },
      'correct_answer': { hi: 'सही उत्तर:', en: 'Correct Answer:' },
      'new_quiz': { hi: '🔄 नई क्विज़ लें', en: '🔄 Take New Quiz' },
      'warning': { hi: '⚠️ 1 मिनट से कम समय शेष!', en: '⚠️ Less than 1 minute remaining!' },
      'download': { hi: '📥 परिणाम डाउनलोड करें', en: '📥 Download Result' },
      'status': { hi: 'स्थिति', en: 'Status' },
      'correct': { hi: 'सही', en: 'Correct' },
      'wrong': { hi: 'गलत', en: 'Wrong' },
      'not_attempted': { hi: 'प्रयास नहीं किया', en: 'Not Attempted' },
    };
    return texts[key]?.[language] || texts[key]?.['en'] || key;
  };

  // Home Page
  if (!started) {
    return (
      <div style={{
        minHeight: "100vh",
        display: "flex",
        justifyContent: "center",
        alignItems: "center",
        background: "linear-gradient(135deg, #1a237e 0%, #283593 50%, #3f51b5 100%)",
        fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif",
        padding: "20px"
      }}>
        <div style={{
          backgroundColor: "white",
          padding: "25px 20px",
          borderRadius: "16px",
          boxShadow: "0 20px 60px rgba(0,0,0,0.6)",
          textAlign: "center",
          maxWidth: "500px",
          width: "100%",
          animation: "fadeInUp 0.6s ease"
        }}>
          <div style={{ fontSize: "48px", marginBottom: "5px" }}>🕉️</div>
          <h1 style={{ 
            color: "#1a237e", 
            marginBottom: "3px", 
            fontSize: "22px",
            fontWeight: "700"
          }}>
            {getText('title')}
          </h1>
          <p style={{ color: "#666", fontSize: "12px", marginBottom: "15px" }}>
            {getText('subtitle')}
          </p>
          <div style={{
            height: "3px",
            background: "linear-gradient(90deg, #1a237e, #3f51b5)",
            margin: "10px auto",
            width: "60px"
          }}></div>

          {/* Language Toggle */}
          <div style={{
            display: "flex",
            justifyContent: "center",
            alignItems: "center",
            gap: "12px",
            marginTop: "15px",
            marginBottom: "15px"
          }}>
            <span style={{ 
              fontSize: "14px", 
              fontWeight: language === 'hi' ? "700" : "400",
              color: language === 'hi' ? "#1a237e" : "#999"
            }}>हिन्दी</span>
            <button
              onClick={toggleLanguage}
              style={{
                width: "50px",
                height: "26px",
                borderRadius: "13px",
                background: language === 'hi' ? "#3f51b5" : "#4a90d9",
                border: "none",
                cursor: "pointer",
                position: "relative",
                transition: "all 0.3s ease"
              }}
            >
              <div style={{
                width: "20px",
                height: "20px",
                borderRadius: "50%",
                background: "white",
                position: "absolute",
                top: "3px",
                left: language === 'hi' ? "3px" : "27px",
                transition: "all 0.3s ease",
                boxShadow: "0 2px 4px rgba(0,0,0,0.2)"
              }}></div>
            </button>
            <span style={{ 
              fontSize: "14px", 
              fontWeight: language === 'en' ? "700" : "400",
              color: language === 'en' ? "#1a237e" : "#999"
            }}>English</span>
          </div>

          <div style={{
            display: "grid",
            gridTemplateColumns: "1fr 1fr",
            gap: "10px",
            marginTop: "10px"
          }}>
            <div style={{ 
              backgroundColor: "#e8f0fe", 
              padding: "12px", 
              borderRadius: "10px"
            }}>
              <div style={{ fontSize: "11px", color: "#666" }}>{getText('questions')}</div>
              <div style={{ fontSize: "22px", fontWeight: "bold", color: "#1a237e" }}>100</div>
            </div>
            <div style={{ 
              backgroundColor: "#e8f0fe", 
              padding: "12px", 
              borderRadius: "10px"
            }}>
              <div style={{ fontSize: "11px", color: "#666" }}>{getText('time')}</div>
              <div style={{ fontSize: "22px", fontWeight: "bold", color: "#1a237e" }}>60 Mins</div>
            </div>
          </div>

          <div style={{
            backgroundColor: "#e8f0fe",
            padding: "10px",
            borderRadius: "10px",
            marginTop: "10px",
            fontSize: "12px",
            color: "#1a237e"
          }}>
            💡 {language === 'hi' ? 'कक्षा 12 दर्शनशास्त्र के सभी अध्यायों की व्यापक कवरेज' : 'Comprehensive coverage of all Class 12 Philosophy chapters'}
          </div>

          <div style={{
            backgroundColor: "#f8f9fa",
            padding: "10px",
            borderRadius: "10px",
            marginTop: "10px",
            fontSize: "12px",
            color: "#555",
            textAlign: "left"
          }}>
            <strong>{getText('instructions')}</strong>
            <ul style={{ margin: "5px 0 0 0", paddingLeft: "18px" }}>
              <li>{getText('compulsory')}</li>
              <li>{getText('marks')}</li>
              <li>{getText('negative')}</li>
            </ul>
          </div>

          <button
            onClick={startExam}
            style={{
              padding: "14px 40px",
              fontSize: "18px",
              fontWeight: "bold",
              background: "linear-gradient(135deg, #1a237e 0%, #3f51b5 100%)",
              color: "white",
              border: "none",
              borderRadius: "50px",
              cursor: "pointer",
              marginTop: "20px",
              width: "100%",
              transition: "transform 0.3s, box-shadow 0.3s",
              boxShadow: "0 4px 15px rgba(63, 81, 181, 0.4)"
            }}
            onMouseEnter={(e) => e.target.style.transform = "scale(1.02)"}
            onMouseLeave={(e) => e.target.style.transform = "scale(1)"}
          >
            {getText('start')}
          </button>
        </div>
      </div>
    );
  }

  // Result Page
  if (submitted) {
    const percentage = ((score / questions.length) * 100).toFixed(2);
    const isPassed = percentage >= 60;
    return (
      <div style={{
        minHeight: "100vh",
        background: "#f5f7fa",
        padding: "15px",
        fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif"
      }}>
        <div style={{
          maxWidth: "800px",
          margin: "0 auto"
        }}>
          {/* Result Card - For Download */}
          <div ref={resultRef} style={{
            backgroundColor: "white",
            borderRadius: "16px",
            padding: "25px 20px",
            boxShadow: "0 10px 40px rgba(0,0,0,0.1)",
            textAlign: "center",
            marginBottom: "20px",
            animation: "slideIn 0.5s ease"
          }}>
            <div className="header" style={{
              background: "linear-gradient(135deg, #1a237e, #3f51b5)",
              color: "white",
              padding: "15px",
              borderRadius: "10px",
              marginBottom: "15px"
            }}>
              <h1 style={{ margin: "0", fontSize: "22px" }}>{getText('title')}</h1>
              <p style={{ margin: "5px 0 0", fontSize: "12px", opacity: 0.9 }}>
                {language === 'hi' ? 'कक्षा 12 दर्शनशास्त्र क्विज़' : 'Class 12 Philosophy Quiz'}
              </p>
            </div>
            
            <h2 style={{ 
              fontSize: "20px", 
              marginBottom: "5px",
              color: "#2d3748"
            }}>
              {isPassed ? getText('congrats') : getText('practice')}
            </h2>
            <div style={{
              width: "80px",
              height: "80px",
              borderRadius: "50%",
              background: isPassed ? "#d4edda" : "#f8d7da",
              display: "flex",
              alignItems: "center",
              justifyContent: "center",
              margin: "15px auto",
              fontSize: "32px"
            }}>
              {isPassed ? "✅" : "📝"}
            </div>
            <div style={{ fontSize: "40px", fontWeight: "bold", color: "#1a237e" }}>
              {score} <span style={{ fontSize: "20px", color: "#888" }}>/ {questions.length}</span>
            </div>
            <div style={{ 
              fontSize: "18px", 
              color: isPassed ? "#28a745" : "#dc3545", 
              marginTop: "5px",
              fontWeight: "600"
            }}>
              {percentage}% {isPassed ? getText('passed') : getText('failed')}
            </div>
            <div style={{
              marginTop: "10px",
              fontSize: "13px",
              color: "#718096"
            }}>
              {language === 'hi' ? "भाषा: हिन्दी" : "Language: English"} • {getText('negative')}
            </div>

            <div style={{
              marginTop: "15px",
              display: "grid",
              gridTemplateColumns: "1fr 1fr 1fr",
              gap: "10px",
              fontSize: "13px"
            }}>
              <div style={{ backgroundColor: "#d4edda", padding: "8px", borderRadius: "8px", color: "#155724" }}>
                ✅ {getText('correct')}: {resultDetails.filter(r => r.isCorrect).length}
              </div>
              <div style={{ backgroundColor: "#f8d7da", padding: "8px", borderRadius: "8px", color: "#721c24" }}>
                ❌ {getText('wrong')}: {resultDetails.filter(r => !r.isCorrect && r.isAttempted).length}
              </div>
              <div style={{ backgroundColor: "#fff3cd", padding: "8px", borderRadius: "8px", color: "#856404" }}>
                ⚪ {getText('not_attempted')}: {resultDetails.filter(r => !r.isAttempted).length}
              </div>
            </div>
          </div>

          {/* Download Button */}
          <div style={{ textAlign: "center", marginBottom: "20px" }}>
            <button
              onClick={downloadResult}
              style={{
                padding: "12px 30px",
                fontSize: "15px",
                fontWeight: "bold",
                background: "linear-gradient(135deg, #48bb78 0%, #38a169 100%)",
                color: "white",
                border: "none",
                borderRadius: "50px",
                cursor: "pointer",
                boxShadow: "0 4px 15px rgba(72, 187, 120, 0.4)",
                transition: "all 0.3s ease"
              }}
              onMouseEnter={(e) => e.target.style.transform = "scale(1.02)"}
              onMouseLeave={(e) => e.target.style.transform = "scale(1)"}
            >
              {getText('download')}
            </button>
          </div>

          {/* Answer Review */}
          <div style={{
            backgroundColor: "white",
            borderRadius: "16px",
            padding: "20px 15px",
            boxShadow: "0 10px 40px rgba(0,0,0,0.1)"
          }}>
            <h2 style={{ 
              borderBottom: "2px solid #eee", 
              paddingBottom: "12px", 
              marginBottom: "15px",
              fontSize: "18px",
              color: "#2d3748"
            }}>
              {getText('review')}
            </h2>
            {resultDetails.map((item, index) => (
              <div
                key={index}
                className={item.isCorrect ? '' : 'wrong'}
                style={{
                  backgroundColor: item.isCorrect ? "#f0fff4" : 
                                   item.isAttempted ? "#fff5f5" : "#fff3cd",
                  borderLeft: `4px solid ${item.isCorrect ? "#48bb78" : 
                              item.isAttempted ? "#fc8181" : "#ffc107"}`,
                  padding: "12px 15px",
                  marginBottom: "12px",
                  borderRadius: "8px",
                  animation: `fadeIn 0.3s ease ${index * 0.05}s`
                }}
              >
                <div style={{ display: "flex", justifyContent: "space-between", alignItems: "flex-start" }}>
                  <h4 style={{ 
                    margin: "0", 
                    fontSize: "14px", 
                    color: "#2d3748",
                    flex: 1,
                    marginRight: "10px"
                  }}>
                    Q{index + 1}. {item.question}
                  </h4>
                  <span style={{ fontSize: "18px", flexShrink: 0 }}>
                    {item.isCorrect ? "✅" : item.isAttempted ? "❌" : "⚪"}
                  </span>
                </div>
                <div style={{ marginTop: "8px", marginLeft: "5px", fontSize: "13px" }}>
                  <p style={{ margin: "3px 0" }}>
                    <strong>{getText('your_answer')}</strong>{" "}
                    <span style={{ 
                      color: item.isCorrect ? "#48bb78" : 
                             item.isAttempted ? "#dc3545" : "#ffc107",
                      fontWeight: item.isAttempted ? "bold" : "normal"
                    }}>
                      {item.userAnswer}
                    </span>
                    {!item.isAttempted && (
                      <span style={{ color: "#ffc107", marginLeft: "5px" }}>
                        ({getText('not_attempted')})
                      </span>
                    )}
                  </p>
                  {!item.isCorrect && (
                    <p style={{ margin: "3px 0" }}>
                      <strong>{getText('correct_answer')}</strong>{" "}
                      <span style={{ color: "#48bb78", fontWeight: "bold" }}>{item.correctAnswer}</span>
                    </p>
                  )}
                </div>
              </div>
            ))}
          </div>

          <div style={{ textAlign: "center", marginTop: "20px" }}>
            <button
              onClick={() => {
                setStarted(false);
                setSubmitted(false);
                setAnswers({});
                setResultDetails([]);
                setTimer(3600);
                setShowTimerWarning(false);
                setQuestions([]);
              }}
              style={{
                padding: "14px 35px",
                fontSize: "16px",
                fontWeight: "bold",
                background: "linear-gradient(135deg, #1a237e 0%, #3f51b5 100%)",
                color: "white",
                border: "none",
                borderRadius: "50px",
                cursor: "pointer",
                width: "100%",
                maxWidth: "300px",
                boxShadow: "0 4px 15px rgba(63, 81, 181, 0.4)",
                transition: "transform 0.3s ease"
              }}
              onMouseEnter={(e) => e.target.style.transform = "scale(1.02)"}
              onMouseLeave={(e) => e.target.style.transform = "scale(1)"}
            >
              {getText('new_quiz')}
            </button>
          </div>
        </div>
      </div>
    );
  }

  // Exam Page
  const q = questions[current] || { question: "", option: [], answer: "" };
  const answeredCount = Object.keys(answers).length;

  return (
    <div style={{
      minHeight: "100vh",
      background: "#f5f7fa",
      padding: "10px",
      fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif"
    }}>
      <div style={{
        maxWidth: "800px",
        margin: "0 auto"
      }}>
        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "10px 14px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginBottom: "10px",
          display: "flex",
          justifyContent: "space-between",
          alignItems: "center"
        }}>
          <div style={{ flex: 1 }}>
            <p style={{ 
              margin: "0", 
              fontSize: "11px", 
              color: "#718096"
            }}>
              Q{current + 1}/{questions.length}
            </p>
            <p style={{ 
              margin: "2px 0 0", 
              fontSize: "10px", 
              color: "#a0aec0"
            }}>
              {getText('answered')} {answeredCount}/{questions.length}
            </p>
          </div>
          <div style={{
            fontSize: "20px",
            fontWeight: "bold",
            color: timer < 60 ? "#fc8181" : "#1a237e",
            display: "flex",
            alignItems: "center",
            gap: "6px"
          }}>
            <span style={{ fontSize: "16px" }}>⏱️</span>
            <span>{Math.floor(timer / 60)}:{String(timer % 60).padStart(2, "0")}</span>
          </div>
        </div>

        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "16px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginBottom: "10px",
          animation: "fadeIn 0.3s ease"
        }}>
          <div style={{
            display: "inline-block",
            backgroundColor: "#e8f0fe",
            padding: "2px 10px",
            borderRadius: "12px",
            fontSize: "11px",
            color: "#1a237e",
            marginBottom: "12px"
          }}>
            📌 {language === 'hi' ? 'दर्शनशास्त्र 12वीं' : 'Philosophy 12th'}
          </div>
          <h3 style={{
            fontSize: "16px",
            color: "#1a237e",
            marginBottom: "16px",
            fontWeight: "600",
            lineHeight: "1.5"
          }}>
            {q.question}
          </h3>

          <div style={{ marginTop: "5px" }}>
            {q.option && q.option.map((op, idx) => (
              <div
                key={idx}
                style={{
                  padding: "10px 12px",
                  margin: "5px 0",
                  backgroundColor: answers[current] === op ? "#ebf8ff" : "#f7fafc",
                  border: answers[current] === op ? "2px solid #3f51b5" : "2px solid transparent",
                  borderRadius: "8px",
                  cursor: "pointer",
                  transition: "all 0.3s ease",
                  display: "flex",
                  alignItems: "center",
                  transform: answers[current] === op ? "scale(1.01)" : "scale(1)"
                }}
                onClick={() => setAnswers({ ...answers, [current]: op })}
                onMouseEnter={(e) => {
                  if (answers[current] !== op) {
                    e.currentTarget.style.backgroundColor = "#f0f0f0";
                    e.currentTarget.style.transform = "scale(1.005)";
                  }
                }}
                onMouseLeave={(e) => {
                  if (answers[current] !== op) {
                    e.currentTarget.style.backgroundColor = "#f7fafc";
                    e.currentTarget.style.transform = "scale(1)";
                  }
                }}
              >
                <input
                  type="radio"
                  id={`q${current}-opt${idx}`}
                  name={`question-${current}`}
                  checked={answers[current] === op}
                  onChange={() => {}}
                  style={{ marginRight: "10px", width: "16px", height: "16px", flexShrink: 0 }}
                />
                <label
                  htmlFor={`q${current}-opt${idx}`}
                  style={{
                    fontSize: "14px",
                    cursor: "pointer",
                    flex: 1,
                    margin: "0",
                    color: "#2d3748"
                  }}
                >
                  {op}
                </label>
              </div>
            ))}
          </div>
        </div>

        <div style={{
          display: "flex",
          gap: "8px",
          flexWrap: "wrap",
          justifyContent: "space-between"
        }}>
          <div style={{ display: "flex", gap: "8px" }}>
            <button
              onClick={() => setCurrent(Math.max(0, current - 1))}
              disabled={current === 0}
              style={{
                padding: "8px 14px",
                fontSize: "13px",
                backgroundColor: current === 0 ? "#e2e8f0" : "#3f51b5",
                color: current === 0 ? "#a0aec0" : "white",
                border: "none",
                borderRadius: "8px",
                cursor: current === 0 ? "not-allowed" : "pointer",
                fontWeight: "600",
                transition: "all 0.3s ease"
              }}
              onMouseEnter={(e) => {
                if (current !== 0) {
                  e.target.style.transform = "scale(1.05)";
                  e.target.style.boxShadow = "0 4px 12px rgba(63, 81, 181, 0.3)";
                }
              }}
              onMouseLeave={(e) => {
                e.target.style.transform = "scale(1)";
                e.target.style.boxShadow = "none";
              }}
            >
              {getText('prev')}
            </button>
            <button
              onClick={() => setCurrent(Math.min(questions.length - 1, current + 1))}
              disabled={current === questions.length - 1}
              style={{
                padding: "8px 14px",
                fontSize: "13px",
                backgroundColor: current === questions.length - 1 ? "#e2e8f0" : "#3f51b5",
                color: current === questions.length - 1 ? "#a0aec0" : "white",
                border: "none",
                borderRadius: "8px",
                cursor: current === questions.length - 1 ? "not-allowed" : "pointer",
                fontWeight: "600",
                transition: "all 0.3s ease"
              }}
              onMouseEnter={(e) => {
                if (current !== questions.length - 1) {
                  e.target.style.transform = "scale(1.05)";
                  e.target.style.boxShadow = "0 4px 12px rgba(63, 81, 181, 0.3)";
                }
              }}
              onMouseLeave={(e) => {
                e.target.style.transform = "scale(1)";
                e.target.style.boxShadow = "none";
              }}
            >
              {getText('next')}
            </button>
          </div>

          <button
            onClick={submitExam}
            style={{
              padding: "8px 18px",
              fontSize: "13px",
              backgroundColor: "#48bb78",
              color: "white",
              border: "none",
              borderRadius: "8px",
              cursor: "pointer",
              fontWeight: "600",
              transition: "all 0.3s ease",
              boxShadow: "0 2px 8px rgba(72, 187, 120, 0.3)"
            }}
            onMouseEnter={(e) => {
              e.target.style.transform = "scale(1.05)";
              e.target.style.boxShadow = "0 4px 15px rgba(72, 187, 120, 0.5)";
            }}
            onMouseLeave={(e) => {
              e.target.style.transform = "scale(1)";
              e.target.style.boxShadow = "0 2px 8px rgba(72, 187, 120, 0.3)";
            }}
          >
            {getText('submit')}
          </button>
        </div>

        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "12px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginTop: "10px"
        }}>
          <p style={{ 
            margin: "0 0 8px 0", 
            color: "#718096", 
            fontSize: "11px", 
            fontWeight: "600" 
          }}>
            {getText('navigator')}
          </p>
          <div style={{
            display: "flex",
            flexWrap: "wrap",
            gap: "5px"
          }}>
            {questions.map((_, idx) => (
              <button
                key={idx}
                onClick={() => setCurrent(idx)}
                style={{
                  width: "32px",
                  height: "32px",
                  fontSize: "11px",
                  backgroundColor: answers[idx] ? "#48bb78" : 
                                   current === idx ? "#3f51b5" : "#e2e8f0",
                  color: answers[idx] ? "white" :
                         current === idx ? "white" : "#4a5568",
                  border: current === idx ? "2px solid #3f51b5" : "none",
                  borderRadius: "6px",
                  cursor: "pointer",
                  fontWeight: "bold",
                  transition: "all 0.3s ease",
                  transform: answers[idx] ? "scale(1.05)" : "scale(1)"
                }}
                onMouseEnter={(e) => {
                  e.target.style.transform = "scale(1.1)";
                }}
                onMouseLeave={(e) => {
                  e.target.style.transform = answers[idx] ? "scale(1.05)" : "scale(1)";
                }}
              >
                {idx + 1}
              </button>
            ))}
          </div>
          <div style={{
            display: "flex",
            gap: "12px",
            marginTop: "8px",
            fontSize: "10px",
            color: "#4a5568",
            flexWrap: "wrap"
          }}>
            <span>{getText('answered_status')}</span>
            <span>{getText('current_status')}</span>
            <span>{getText('unanswered_status')}</span>
          </div>
        </div>

        {showTimerWarning && (
          <div style={{
            position: "fixed",
            bottom: "15px",
            right: "15px",
            left: "15px",
            backgroundColor: "#fc8181",
            color: "white",
            padding: "12px 18px",
            borderRadius: "10px",
            boxShadow: "0 4px 15px rgba(252, 129, 129, 0.4)",
            textAlign: "center",
            fontSize: "14px",
            fontWeight: "600",
            animation: "pulse 1.5s ease-in-out infinite",
            maxWidth: "400px",
            margin: "0 auto"
          }}>
            {getText('warning')}
          </div>
        )}
      </div>
      <style>
        {`
          @keyframes pulse {
            0% { opacity: 1; transform: scale(1); }
            50% { opacity: 0.6; transform: scale(0.98); }
            100% { opacity: 1; transform: scale(1); }
          }
          @keyframes fadeInUp {
            from { opacity: 0; transform: translateY(20px); }
            to { opacity: 1; transform: translateY(0); }
          }
          @keyframes fadeIn {
            from { opacity: 0; transform: translateX(-10px); }
            to { opacity: 1; transform: translateX(0); }
          }
          @keyframes slideIn {
            from { opacity: 0; transform: translateY(-30px); }
            to { opacity: 1; transform: translateY(0); }
          }
        `}
      </style>
    </div>
  );
}