// Psychology12thQuiz.jsx
import React, { useState, useEffect, useRef } from "react";

// --- 12th Psychology Question Bank (100 questions) - Hindi & English ---

// Hindi Questions
const psychologyHindi = [
  {
    question: "बुद्धि के विषय पर शोध कार्य करने वाले पहले मनोवैज्ञानिक था",
    option: ["बिने", "स्पीयरमैन", "थॉमसन", "गिलफोर्ड"],
    answer: "बिने"
},
{
    question: "संवेगात्मक बुद्धि’ पद का प्रतिपादन किसने किया?",
    option: ["गाल्टन", "वुड तथा वुड", "सैलोवे तथा मेयर", "इनमें से कोई नहीं"],
    answer: "सैलोवे तथा मेयर"
},
{
    question: "किसने बुद्धि को एक सार्वभौमिक क्षमता माना है?",
    option: ["वेश्लर", "बिने", "गार्डनर", "इनमें से कोई नहीं"],
    answer: "वेश्लर"
},
{
    question: "थर्स्टन के अनुसार, बुद्धि में कितने प्राथमिक मानसिक योग्यताएँ उपस्थित होती हैं?",
    option: ["5", "6", "7", "8"],
    answer: "7"
},
{
    question: "निम्नलिखित में कौन एक व्यक्ति का शीलगुण है?",
    option: ["बुद्धि", "अभिप्रेरणा", "सृजनात्मकता", "संवेग"],
    answer: "बुद्धि"
},
{
    question: "जिन व्यक्तियों की बुद्धि-लब्धि 90 से 100 के बीच होती है, उन्हें कहते हैं-",
    option: ["जल", "मूढ़", "सामान्य", "प्रतिभाशाली"],
    answer: "सामान्य"
},
{
    question: "किसने कहा कि ‘अमूर्त चिन्तन की योग्यता ही बुद्धि है?",
    option: ["बिने", "टरमन", "रेबर", "इनमें से कोई नहीं"],
    answer: "रेबर"
},
{
    question: "जिन व्यक्तियों की बुद्धि-लब्धि 80 से 89 के बीच होती है, उन्हें कहते हैं-",
    option: ["प्रतिभाशाली", "मूढ़", "सुस्त", "औसत"],
    answer: "मूढ़"
},
{
    question: "किसन बुद्धि लब्धि के संप्रत्यय को विकसित किया?",
    option: ["बिने", "टरमन", "स्टर्न", "साइमन"],
    answer: "स्टर्न"
},
{
    question: "व्यक्ति के जीवन में सफलता का कितना प्रतिशत संवेगात्मक बुद्धि से निर्धारित होता है?",
    option: ["लगभग 60 प्रतिशत", "लगभग 70 प्रतिशत", "लगभग 80 प्रतिशत", "लगभग 100 प्रतिशत"],
    answer: "लगभग 80 प्रतिशत"
},
{
    question: "प्राथमिक मानसिक योग्यता का सिद्धान्त किसने प्रस्तुत किया?",
    option: ["लिकर्ट", "गिलफोर्ड", "थर्स्टन", "गार्डनर"],
    answer: "थर्स्टन"
},
{
    question: "किस वर्ष बुद्धि का पास मॉडले विकसित हुआ?",
    option: ["1984", "1994", "1954", "1964"],
    answer: "1994"
},
{
    question: "मानसिक उम्र के संप्रत्यय को किसने विकसित किया?",
    option: ["बिने", "स्टर्न", "टरमन", "बिने तथा साइमन"],
    answer: "बिने"
},
{
    question: "बुद्धि के किनके सिद्धान्त को एक-कारकीय सिद्धान्त कहा गया है?",
    option: ["गिलफोर्ड", "जेन्सन", "थर्स्टन", "बिने"],
    answer: "बिने"
},
{
    question: "जिस बच्चे की बुद्धि लब्धि 35-49 होती है, उसे किस श्रेणी में रखा जा सकता है?",
    option: ["सौम्य मानसिक दुर्बलता", "साधारण मानसिक दुर्बलता", "गम्भीर मानसिक दुर्बलता", "अति गम्भीर मानसिक दुर्बलता"],
    answer: "साधारण मानसिक दुर्बलता"
},
{
    question: "आगमनात्मक तर्कना को किसने बुद्धि का एक कारक माना?",
    option: ["जेन्सन", "स्पीयरमैन", "थर्स्टन", "गिलफोर्ड"],
    answer: "थर्स्टन"
},
{
    question: "मनोवैज्ञानिक के बौद्धिक कौशल को किस श्रेणी में रखा जाएगा?",
    option: ["सामान्य कौशल", "प्रेक्षणात्मक कौशल", "विशिष्ट कौशल", "इनमें से कोई नहीं"],
    answer: "प्रेक्षणात्मक कौशल"
},
{
    question: "गार्डनर के अनुसार निम्नांकित में किसे बुद्धि की एक श्रेणी नहीं माना गया है?",
    option: ["तार्किक गणितीय", "जी कारक", "स्थानिक", "अन्तरावै भक्तिक"],
    answer: "जी कारक"
},
{
    question: "पास मॉडल का विस्तारित रूप क्या है?",
    option: ["योजना, अवधान भाव, प्रबोधन, सहकालिक अनुक्रमिक", "अवधान भाव प्रबोधन, सहकालिक अनुक्रमिक योजना", "सहकालिक अनुक्रमिक योजना, अवधान भाव प्रबोधन", "इनमें से कोई नहीं"],
    answer: "सहकालिक अनुक्रमिक योजना, अवधान भाव प्रबोधन"
},
{
    question: "बुद्धि संरचना मॉडल किसने विकसित किया?",
    option: ["गार्डनर", "गिलफोर्ड", "जेनसन", "इनमें से कोई नहीं"],
    answer: "गिलफोर्ड"
},
{
    question: "व्यक्ति की सर्जनात्मकता की क्षमता को किस मनोवैज्ञानिक ने प्रभावी आश्चर्य’ का नाम दिया है?",
    option: ["ब्रूनर", "पासी", "बाकर मेहदी", "टोरेन्स"],
    answer: "ब्रूनर"
},
{
    question: "संवेगात्मक बुद्धि के तत्वों में निम्नलिखित में से किसे नहीं रखा जा सकता है?",
    option: ["अपने संवेगों की सही जानकारी रखना", "स्वयं को प्रेरित करना", "दूसरे को धमकी देना", "दूसरे के संवेगों को पहचानना"],
    answer: "दूसरे को धमकी देना"
},
{
    question: "जिस बच्चे की बुद्धि-लब्धि 33-49 होती है, उसे किस श्रेणी में रखा जा सकता है?",
    option: ["सौम्य मानसिक दुर्बलता", "साधारण मानसिक दुर्बलता", "गम्भीर मानसिक दुर्बलता", "अति गम्भीर दुर्बलता"],
    answer: "साधारण मानसिक दुर्बलता"
},
{
    question: "बुद्धि के द्वि-कारक सिद्धान्त का प्रतिपादन किसने किया?",
    option: ["चार्ल्स स्पीयरमैन", "बिने", "रेबर", "इनमें से कोई नहीं"],
    answer: "चार्ल्स स्पीयरमैन"
},
{
    question: "निम्नलिखित में से कौन सर्जनात्मक चिन्तन की अवस्था नहीं है?",
    option: ["सत्यापन", "उद्भवन", "धारणा", "तैयारी"],
    answer: "धारणा"
},
{
    question: "बुद्धि के बहुतत्व सिद्धान्त का प्रतिपादन कौन किया?",
    option: ["थर्स्टन", "बिने", "रेबर", "स्पीयर मैन"],
    answer: "थर्स्टन"
},
{
    question: "थार्नडाइक ने बुद्धि को कितने वर्गों में विभाजित किया?",
    option: ["पाँच", "तीन", "दो", "छ:"],
    answer: "तीन"
},
{
    question: "25 से नीचे बुद्धि-लब्धि वाले लोगों को किस वर्ग में रखा जाएगा?",
    option: ["मूर्ख", "क्षीण बुद्धि", "अल्पमति", "जड़ बुद्धि"],
    answer: "जड़ बुद्धि"
},
{
    question: "वुण्ट कहाँ के रहने वाले थे?",
    option: ["फ्रांस", "इंग्लैण्ड", "जर्मनी", "इटली"],
    answer: "जर्मनी"
},
{
    question: "वैश्लर ने वयस्क बुद्धि परीक्षण किया-",
    option: ["1964 ई. में", "1963 ई. में", "1961 ई. में", "1955 ई. में"],
    answer: "1955 ई. में"
},
{
    question: "पास-एलॉग परीक्षण कौन किया-",
    option: ["अलेक्जेण्डर ने", "बिने ने", "स्पीयरमैन ने", "गार्डनर ने"],
    answer: "अलेक्जेण्डर ने"
},
{
    question: "समूह खण्ड सिद्धान्त का प्रतिपादन किसने किया था?",
    option: ["गार्डनर", "स्पीयरमैन", "बिने", "अलेक्जेण्डर"],
    answer: "स्पीयरमैन"
},
{
    question: "मानवीय विशेषताओं का अध्ययन करने के लिए गाल्टन ने कब प्रयोगशाला की स्थापना किया?",
    option: ["1882 ई. में", "1883 ई. में", "1884 ई. में", "1885 ई. में"],
    answer: "1882 ई. में"
},
{
    question: "गार्डनर ने अभी तक कुल कितने प्रकार के बुद्धि का पहचान किया है?",
    option: ["पाँच", "छह", "सात", "आठ"],
    answer: "आठ"
},
{
    question: "नए एवं मूल्यवानं विचारों को देने की क्षमता को कहा जाता है?",
    option: ["बुद्धि", "सूझ", "अभिक्षमता", "सर्जनशीलता"],
    answer: "सर्जनशीलता"
},
{
    question: "यदि किसी व्यक्ति की मानसिक आयु तथा वास्तविक आयु लगभग बराबर-बराबर हो तो वह कहलाता है-",
    option: ["तीव्र बुद्धि का व्यक्ति", "मंद बुद्धि का व्यक्ति", "सामान्य बुद्धि का व्यक्ति", "प्रतिभाशली बुद्धि का व्यक्ति"],
    answer: "सामान्य बुद्धि का व्यक्ति"
},
{
    question: "गिलफोर्ड के बुद्धि मॉडल में बौद्धिक क्षमताओं की श्रेणियाँ हैं-",
    option: ["180", "100", "120", "150"],
    answer: "150"
},
{
    question: "व्यक्ति की किसी विशेष क्षेत्र की विशेष योग्यता कहलाती है-",
    option: ["व्यक्तित्व", "अभिक्षमता", "अभिवृत्ति", "अभिरुचि"],
    answer: "अभिक्षमता"
},
{
    question: "स्पीयरमैन के अनुसार बुद्धि के तत्त्व हैं-",
    option: ["3", "2", "1", "4"],
    answer: "2"
},
{
    question: "बुद्धि के ‘योजना, अवधान-भाव प्रबोधन तथा सहकालिक-अनुक्रमिक मॉडल’ को प्रस्तावित किया-",
    option: ["जे.पी. दास-नागलीरी-किर्बी", "बिने-टर्मन-कर्बी", "नागलीरी-बिने-टर्मन", "इनमें से कोई नहीं"],
    answer: "जे.पी. दास-नागलीरी-किर्बी"
},
{
    question: "“स्टर्नवर्ग’ के अनुसार बुद्धि की श्रेणी है-",
    option: ["55", "2", "1", "3"],
    answer: "3"
},
{
    question: "यदि किसी बच्चे की वास्तविक आयु 100 महीना है तथा मानसिक आयु 120 महीना है तो उसकी बुद्धि-लब्धि होगी–",
    option: ["105", "110", "90", "120"],
    answer: "120"
},
{
    question: "मानसिक उनमापक है-",
    option: ["वास्तविक आयु का", "बुद्धि के निरपेक्ष स्तर का", "कालानुक्रमित आयु का", "इनमें से कोई नहीं"],
    answer: "बुद्धि के निरपेक्ष स्तर का"
},
{
    question: "बुद्धि मापने के लिए सर्वप्रथम प्रयोगशाला की स्थापना कौन और कब किया?",
    option: ["वुण्ट (1879)", "गाल्टन (1883)", "स्पीयरमैन (1873)", "बिने (1883)"],
    answer: "वुण्ट (1879)"
},
{
    question: "व्यावहारिक बुद्धि का अर्थ यह है कि बुद्धि संस्कृति का उत्पाद होती हैं यह किसका कथन है?",
    option: ["स्टर्नबर्ग", "वाइगॉट्स", "सैलोवी", "मेयर"],
    answer: "स्टर्नबर्ग"
},
{
    question: "विभेदक परीक्षण का उपयोग किस मनोवैज्ञानिक ने भारतीय अनुकूलन के अनुसार विकसित किया है?",
    option: ["होरेस", "वालाश", "जे.पी. गिलफोर्ड", "जे.एम. ओझा"],
    answer: "जे.एम. ओझा"
},
{
    question: "किस अभिक्षमता को ए.एस.टी. के नाम से जाना जाता है?",
    option: ["विभेदक अभिक्षमता", "सामान्य अधिक्षमता", "आर्ड सर्विसेज अभिक्षमता", "व्यावसायिक अभिक्षमता"],
    answer: "आर्ड सर्विसेज अभिक्षमता"
},
{
    question: "शाब्दिक तर्कना, आंकिक तर्कना किस अभिक्षमता के अन्तर्गत आते हैं?",
    option: ["व्यावसायिक अभिक्षमता", "आर्ड सर्विसेज अभिक्षमता", "सामान्य अभिक्षमता", "विभेदक अभिक्षमता"],
    answer: "विभेदक अभिक्षमता"
},
{
    question: "निम्नलिखित में से संस्कृति मुक्त परीक्षण कौन-सा है?",
    option: ["बिने-साइमन परीक्षण", "वेश्लेर बुद्धि परीक्षण", "कैटेल बुद्धि परीक्षण", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "प्रतिभाशाली बालकों की सबसे बड़ी विशेषता है-",
    option: ["सूझ", "दृढ़ता", "मौलिकता", "संवेगात्मक परिपक्वता"],
    answer: "मौलिकता"
},
{
    question: "निम्नलिखित में से कौन शाब्दिक बुद्धि परीक्षण है?",
    option: ["पास एलांग परीक्षण", "घन निर्माण परीक्षण", "स्टैनफोर्ड-बिने परीक्षण", "इनमें से सभी"],
    answer: "स्टैनफोर्ड-बिने परीक्षण"
},
{
    question: "निम्नांकित में से विशिष्ट बालक नहीं है?",
    option: ["प्रतिभाशाली बालक", "सामान्य बालक", "मानसिक दुर्बल बालक", "विकलांग बालक"],
    answer: "सामान्य बालक"
},
{
    question: "रेवेन प्रोग्रेसिव मैट्रिक किस तरह की बुद्धि परीक्षण है?",
    option: ["शाब्दिक बुद्धि परीक्षण", "अशाब्टिक बुद्धि परीक्षण", "क्रियात्मक बुद्धि परीक्षण", "इनमें से कोई नहीं"],
    answer: "अशाब्टिक बुद्धि परीक्षण"
},
{
    question: "फ्रिट्ज हाइडर का संतुलन सिद्धान्त में P-O-X मॉडल में O प्रतिनिधित्व करता है-",
    option: ["दूसरे व्यक्ति को", "जिस व्यक्ति की मनोवृद्धि का अध्ययन किया", "दूसरी वस्तु को", "इनमें से कोई नहीं"],
    answer: "जिस व्यक्ति की मनोवृद्धि का अध्ययन किया"
},
{
    question: "टी.ए.टी. व्यक्तित्व मापन किस प्रकार का परीक्षण है?",
    option: ["प्रश्नावली", "आत्म विवरण आविष्कारिका", "कागज-पेन्सिल जाँच", "प्रक्षेपी"],
    answer: "प्रक्षेपी"
},
{
    question: "रोजर्स ने अपने व्यक्तित्व सिद्धान्त में केन्द्रिय स्थान दिया है-",
    option: ["आत्म को", "अचेतन को", "अधिगम को", "आवश्यकता को"],
    answer: "आत्म को"
},
{
    question: "निम्नलिखित में से कौन आनन्द सिद्धान्त से निर्देशित होता है?",
    option: ["अहं", "इदं", "पराहं", "इनमें से कोई नहीं"],
    answer: "इदं"
},
{
    question: "निम्नांकित में से कौन युंग के व्यक्तित्व प्रकार के अंतर्गत नहीं समझा जाता है?",
    option: ["बहिर्मुखी", "एंडोमॉर्फी", "अन्तर्मुखी", "उभयमुखी"],
    answer: "एंडोमॉर्फी"
},
{
    question: "आदर्श व्यवहार के सम्बन्ध में स्थाई विश्वास को कहा जाता",
    option: ["व्यक्तित्व", "मूल्य", "अभिरुचि", "अभिक्षमता"],
    answer: "मूल्य"
},
{
    question: "व्यक्तित्व सिद्धान्त के विशेषक उपागम का अग्रणी है-",
    option: ["फ्रायड", "युंग", "ऑलपोर्ट", "क्रेश्मर"],
    answer: "ऑलपोर्ट"
},
{
    question: "निम्नलिखित में से कौन युंग के व्यक्तित्व प्रकार के अन्तर्गत समझा जाता है?",
    option: ["अन्तर्मुखी", "गोलाकार", "लम्बाकार", "आयताकार"],
    answer: "अन्तर्मुखी"
},
{
    question: "कौन थार्डनाइक के सीखने का नियम नहीं है?",
    option: ["साहचर्य नियम", "तत्परता का नियम", "अभ्यास का नियम", "प्रभाव का नियम"],
    answer: "साहचर्य नियम"
},
{
    question: "सीखने के सूझ सिद्धांत के अनुसार प्राणी की सफलता मिलती है-",
    option: ["संयोगवश", "क्रमशः", "एकाएक", "इनमें से कोई नहीं"],
    answer: "एकाएक"
},
{
    question: "रोशांक परीक्षण है-",
    option: ["बुद्धि परीक्षण", "अभिक्षमता परीक्षण", "प्रक्षेपी परीक्षण", "इनमें से कोई नहीं"],
    answer: "प्रक्षेपी परीक्षण"
},
{
    question: "निम्नलिखित में से कौन शेल्डन के व्यक्तित्व प्रकार के अंतर्गत समझा जाता है?",
    option: ["अंतर्मुखी", "बहिर्मुखी", "गोलाकार", "उभयमुखी"],
    answer: "गोलाकार"
},
{
    question: "फ्रायड के अनुसार इलेक्ट्रा की अवधि मैं लड़कियाँ प्रतियोगिता करती हैं-",
    option: ["बहन से", "भाई से", "माँ से", "पिता से"],
    answer: "माँ से"
},
{
    question: "किसने आत्मसिद्धता की अवधारणा को प्रस्तुत किया?",
    option: ["मास्लो", "रोजर्स", "फ्रायड", "युंग"],
    answer: "मास्लो"
},
{
    question: "एडलर के मनोविज्ञान को कहा जाता है?",
    option: ["गत्यात्मक मनोविज्ञान", "विश्लेषणात्मक मनोविज्ञान", "मानवतावादी मनोविज्ञान", "वैयक्तिक मनोविज्ञान"],
    answer: "वैयक्तिक मनोविज्ञान"
},
{
    question: "कथानक आत्मबोध परीक्षण के निर्माता कौन हैं?",
    option: ["मार्गन एवं रोजेनविग", "मुर्रे एवं मार्गन", "कैटेल", "रोशंक एवं मुरे"],
    answer: "मुर्रे एवं मार्गन"
},
{
    question: "निम्नांकित में से कौन स्व का एक प्रकार नहीं है?",
    option: ["पहचान स्व", "व्यक्तिगत स्व", "सामाजिक स्व", "संबंधात्मक स्व"],
    answer: "पहचान स्व"
},
{
    question: "वैयक्तिक विभिन्नताओं के महत्व का सर्वप्रथम वैज्ञानिक अध्ययन किया-",
    option: ["कैटेल", "गाल्टन", "हल", "जेम्स ड्रेवर"],
    answer: "गाल्टन"
},
{
    question: "टाईप सी व्यक्तित्व का प्रतिपादन किसने किया?",
    option: ["आलपोर्ट ने", "मारिस ने", "फ्रीडमैन ने", "इनमें से कोई नहीं"],
    answer: "मारिस ने"
},
{
    question: "फ्रायड के अनुसार बच्चे विपरीत लिंग के माता-पिता से सहज जुड़ाव महसूस करते हैं। इसे क्या कहा जाता है?",
    option: ["रक्षा युक्तियाँ", "पराहम्", "इडिपस और इलेक्ट्र मनोग्रंथि", "हीनभावना मनोग्रंथि"],
    answer: "इडिपस और इलेक्ट्र मनोग्रंथि"
},
{
    question: "वैयक्तिक भिन्नता का अर्थ होता है-",
    option: ["व्यक्तियों की विशेषताओं में अंतर", "व्यक्तियों के व्यवहार पैटर्न में विभिन्नता से", "(a) और (b) दोनों", "इनमें से कोई नहीं"],
    answer: "(a) और (b) दोनों"
},
{
    question: "ड्रा-ए-परस्न परीक्षण का निर्माण किसके द्वारा किया गया था?",
    option: ["स्टैनफोर्ड", "वेश्लर", "रोजेनबिंग", "इनमें से कोई नहीं"],
    answer: "इनमें से कोई नहीं"
},
{
    question: "किसने आत्मसिद्ध की अवधारणा को प्रस्तुत किया?",
    option: ["मास्लो", "रोजर्स", "फ्रायड", "युग"],
    answer: "मास्लो"
},
{
    question: "निम्न में से कौन व्यक्तित्व विशेषता है?",
    option: ["बुद्धि", "अभिप्रेरणा", "सृजनात्मकता", "संवेग"],
    answer: "सृजनात्मकता"
},
{
    question: "निम्न में से कौन आत्म नियंत्रण की तकनीक नहीं है?",
    option: ["आत्म-निर्देशन", "आत्म-नियमन", "व्यवहार प्रेक्षण", "आत्म-प्रबलन"],
    answer: "आत्म-नियमन"
},
{
    question: "निम्नांकित में से कौन वास्तविकता का नियम से निर्देशित होता है?",
    option: ["उपाह", "पराह", "अहं", "इनमें से कोई नहीं"],
    answer: "अहं"
},
{
    question: "सामूहिक अचेतन के संप्रत्यय का प्रतिपादन किसने किया है?",
    option: ["युंग", "एडलर", "फ्रायड", "इनमें से कोई नहीं"],
    answer: "युंग"
},
{
    question: "निम्नांकित में कौन स्व अहम का संज्ञानात्मक पहलू है?",
    option: ["आत्मसंप्रत्यय", "आत्मक्षमता", "आत्मसम्मान", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "व्यक्तित्व विकास का सही क्रम है-",
    option: ["अहम-पराहम-इदम", "इदम-अहम-पराहम", "इदम-पराहम-अहम", "पराहम-अहम-इदम"],
    answer: "इदम-अहम-पराहम"
},
{
    question: "रोजर्स ने अपने व्यक्तित्व सिद्धान्त में केन्द्रीय स्थान दिया है-",
    option: ["स्व को", "अचेतन को", "अधिगम को", "आवश्यकता को"],
    answer: "स्व को"
},
{
    question: "फ्रायड के अनुसार मन के अकारात्मक मॉडल है-",
    option: ["चेतन", "उपाह", "अहम्", "पराहम"],
    answer: "उपाह"
},
{
    question: "शेल्डन के व्यक्तित्व प्रकार में नहीं है-",
    option: ["गोलाकार", "आयताकार", "लम्बाकार", "कृशकाय"],
    answer: "आयताकार"
},
{
    question: "मनोविश्लेषणात्मक सिद्धान्त में व्यक्तित्व का कार्यपालक किसे कहा गया है?",
    option: ["पराहं", "अहं", "उपाह", "इनमें से सभी को"],
    answer: "अहं"
},
{
    question: "व्यक्ति का विशेषक सिद्धान्त ….द्वारा दिया गया है?",
    option: ["फ्रायड", "ऑलपोर्ट", "सुल्लीमान", "कैटेल"],
    answer: "ऑलपोर्ट"
},
{
    question: "जीवन मूलप्रवृत्ति के संप्रत्यय का प्रतिपादन किसके द्वारा किया गया?",
    option: ["एडलर", "युंग", "वाटसन", "फ्रायड"],
    answer: "फ्रायड"
},
{
    question: "आत्म को किस रूप में समझा जा सकता है?",
    option: ["आत्मगत", "वस्तुगत", "आत्मगत और वस्तुगत", "इनमें से कोई नहीं"],
    answer: "आत्मगत और वस्तुगत"
},
{
    question: "पी.एफ. अध्ययन को किसने विकसित किया?",
    option: ["रोजेनज्विग", "हार्पर", "फ्राम", "ओइंजर"],
    answer: "रोजेनज्विग"
},
{
    question: "रोझ मसिलक्ष्म परीक्षण में कितने मसिलक्ष्म होता हैं?",
    option: ["5", "10", "15", "20"],
    answer: "10"
},
{
    question: "‘बड़े पूंच’ में निम्नलिखित में से किसे शामिल नहीं किया गया है?",
    option: ["बहिर्मुखता", "मनस्ताप", "कर्त्तव्यनिष्ठता", "प्रभुत्व"],
    answer: "प्रभुत्व"
},
{
    question: "जोधपुर बहुपक्षीय व्यक्तित्व सूची को किसने विकसित किया?",
    option: ["मल्लिक एवं जोशी", "जोशी एवं सिंह", "एम.पी. शर्मा", "ए.के. गुप्ता"],
    answer: "मल्लिक एवं जोशी"
},
{
    question: "एक प्रेक्षक की रिपोर्ट में जो प्रदत्त होते हैं, वे कैसे प्राप्त होते हैं?",
    option: ["साक्षात्कार से", "प्रेक्षण और निर्धारण से", "नाम-निर्देशन से", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "टी.ए.टी. को किसने विकसित किया?",
    option: ["फ्रायड और गार्डनर", "मरें और स्पैरा", "मॉर्गन और फ्रायड", "मॉर्गन और मरे"],
    answer: "मॉर्गन और मरे"
},
{
    question: "निम्नलिखित में किसमें व्यक्ति मुख्य रूप से अपने बारे में ही संबद्ध का अनुभव करता है?",
    option: ["व्यक्तिगत आत्म", "सामाजिक आत्म", "पारिवारिक आत्म", "इनमें से कोई नहीं"],
    answer: "व्यक्तिगत आत्म"
},
{
    question: "आत्म के बारे में बच्चे की धारणा को स्वरूप देने में किनकी भूमिका अहं होती है?",
    option: ["माता-पिता", "मित्रों", "शिक्षकों", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "निम्नलिखित में कौन आत्म-नियंत्रण के लिए मनोवैज्ञानिक तकनीक है?",
    option: ["आत्म-अनुदेश", "अपने व्यवहार का प्रेक्षण", "आत्म प्रबलन", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "व्यक्तित्व को अन्तर्मुखी तथा बहिर्मुखी प्रकारों में किसने बाँटा है?",
    option: ["क्रेश्मर", "युग", "शेल्डन", "एडलर"],
    answer: "युग"
},
{
    question: "मानवतावादी उपागम के प्रतिपादक है-",
    option: ["बी.एफ. स्कीनर", "अलबर्ट बन्दुरा", "जार्ज केली", "एब्राहम मैसलो"],
    answer: "एब्राहम मैसलो"
},
{
    question: "एक लड़की को अपने पिता से कामुक लगाव तथा माँ का स्थान लेने की इच्छा को कहा जाता है?",
    option: ["इलेक्ट्रा या पित् मनोग्रन्थि", "ओडिपस या मातृ मनोग्रन्थि", "जीवन-प्रवृत्ति", "मृत्यु-प्रवृत्ति"],
    answer: "इलेक्ट्रा या पित् मनोग्रन्थि"
},
{
    question: "इंड आधारित है-",
    option: ["वास्तविकता के सिद्धान्त पर", "नैतिकता के सिद्धान्त पर", "सुखेप्सा के सिद्धान्त पर", "सामाजिकता के सिद्धान्त पर"],
    answer: "सुखेप्सा के सिद्धान्त पर"
},
{
    question: "किसने कुंठा-आक्रमण सिद्धान्त का प्रतिपादन किया है?",
    option: ["फ्रायड", "स्कीनर", "एलडर एवं युंग", "मिलर तथा डोलार्ड"],
    answer: "मिलर तथा डोलार्ड"
},
{
    question: "कैटेल ने व्यक्तित्व के शीलगुण गुच्छों की संख्या बतलाया है?",
    option: ["12", "16", "18", "24"],
    answer: "16"
},
{
    question: "शीलगुण कहलाने के लिए आवश्यक है-",
    option: ["व्यवहार में संगतता", "व्यवहार में स्थिरता", "व्यवहार में संगतता तथा स्थिरता दोनों", "उपर्युक्त में से कोई नहीं"],
    answer: "व्यवहार में संगतता तथा स्थिरता दोनों"
},
{
    question: "सामूहिक अचेतन की अंतर्वस्तुओं के लिए युंगं द्वारा प्रयुक्त पद; अनुभव के संगठन के लिए वंशागत प्रतिरूपों को अभिव्यक्त करनेवाली प्रतिमाएँ या प्रतीक निम्नलिखित में से क्या कहलाते हैं?",
    option: ["अभिवृत्तियाँ", "स्वलीनता", "आद्यप्ररूप", "इनमें से कोई नहीं"],
    answer: "आद्यप्ररूप"
},
{
    question: "मैसलो के आवश्यकता पदानुक्रम सिद्धान्त में आत्म सम्मान का स्थान नीचे से किस स्तर पर आता है?",
    option: ["दूसरा", "तीसरा", "चौथा", "पाँचवां"],
    answer: "चौथा"
},
{
    question: "व्यक्तित्व के नैतिक पक्ष का प्रतिनिधित्व करता है?",
    option: ["इदं", "अहम", "पराहम", "अचेतन"],
    answer: "पराहम"
},
{
    question: "अन्ना फ्रायड के योगदानों को निम्नांकित में किस श्रेणी में रखेंगे?",
    option: ["मनोविश्लेषणात्मक", "नव मनोविश्लेषणात्मक", "संज्ञानात्मक", "मानवतावादी"],
    answer: "नव मनोविश्लेषणात्मक"
},
{
    question: "व्यक्तित्व के शीलगुण के आधार पर किसने व्यक्त्वि को विभाजित किया?",
    option: ["क्रेश्मर", "शेल्डन", "युंग", "इनमें से कोई नहीं"],
    answer: "शेल्डन"
},
{
    question: "निम्नलिखित में से कौन गिलफोर्ड के त्रिविमात्मक सिद्धान्त का कारक नहीं है?",
    option: ["संक्रिया", "संख्यात्मक योग्यता", "विषयवस्तु", "उत्पाद"],
    answer: "संख्यात्मक योग्यता"
},
{
    question: "एक प्रभावी मनोवैज्ञानिक की विशेषता होती है-",
    option: ["सामर्थ्य", "वैज्ञानिक मानसिकता", "उत्तरदायित्व का बोध", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "स्व के विभिन्न पक्ष की संख्या क्या है?",
    option: ["7", "6", "4", "8"],
    answer: "4"
},
{
    question: "निम्नांकित में किसे स्व का पक्ष माना गया है?",
    option: ["स्व दक्षता को", "आत्म गौरव को", "आत्म पहचान को", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "टाइप A एवं B के व्यक्तित्व का प्रतिपादन किसने किया?",
    option: ["फ्रीडमैन", "आलपोर्", "कैटेल", "मास्लो"],
    answer: "फ्रीडमैन"
},
{
    question: "टाइप A प्रकार के व्यक्तित्व में इनमें से कौन-सी विशेषता पाई जाती है?",
    option: ["प्रतियोगी भावना", "आक्रमता", "बेसब्री", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "जब व्यक्ति अपने अहं को किसी कष्टकर इच्छा के ठीक विपरीत इच्छा की प्रेरणा विकसित कर उससे उत्पन्न चिंता से अपने आपको बचाता है तो उसे कहा जाता है-",
    option: ["यौक्तिकीकरण", "प्रतिक्रया निर्माण", "प्रक्षेपण", "इनमें से कोई नहीं"],
    answer: "प्रतिक्रया निर्माण"
},
{
    question: "निम्नलिखित में कौन अपने आत्मनियन्त्रण की प्रविधि नहीं है?",
    option: ["अपने व्यवहार का स्वयं निरीक्षण", "आत्म सम्मान", "उद्दीपक नियंत्रण", "आत्म प्रवर्तन"],
    answer: "आत्म सम्मान"
},
{
    question: "एम०पी०पी०आई० अविष्कारिका किसने विकसित किया?",
    option: ["ऑलपोर्ट", "हाथवे तथा मैकिन्ले", "आइजेन्क", "कैटेल"],
    answer: "हाथवे तथा मैकिन्ले"
},
{
    question: "किसने व्यक्ति को पूर्णरूप से कार्यशील व्यक्ति माना है?",
    option: ["कार्ल रोजर्स", "मास्लो", "कार्ल युग", "एरिक फ्रॉम"],
    answer: "कार्ल रोजर्स"
},
{
    question: "व्यक्ति का कारक विश्लेषण सिद्धान्त का प्रतिपादक कौन है?",
    option: ["ऑलपोर्ट", "फ्रीडमैन", "कैटेल", "इनमें से कोई नहीं"],
    answer: "कैटेल"
},
{
    question: "किस अवस्था में जननेन्द्रियों पर फोकस होता है?",
    option: ["गुदा अवस्था", "लिंग प्रधानावस्था", "जननन्द्रियावस्था", "मुखा अवस्था"],
    answer: "जननन्द्रियावस्था"
},
{
    question: "फ्रायड द्वारा प्रतिपादित मनोविश्लेषण विधि के सम्बन्ध में कौन सा कथन सत्य है?",
    option: ["मनोविश्लेषण व्यक्तित्व का एक सिद्धान्त है।", "मनोविश्लेषण एक स्कूल है।", "मनोविश्लेषण चिकित्सा की एक विधि है।", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "संवेदनात्मक अहं किससे सम्बन्धित है?",
    option: ["आत्म सम्प्रत्यय", "आत्मरक्षा", "आत्मसम्मान", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "एनोरक्सिया नर्वोसा की विशिष्टता होती है-",
    option: ["स्नायविक दुर्बलता", "अपर्याप्त भोजन से वजन में कमी", "निद्रा व्याघात", "इनमें से कोई नहीं"],
    answer: "अपर्याप्त भोजन से वजन में कमी"
},
{
    question: "अंग्रेजी के शब्द ‘स्ट्रेस’ की उत्पत्ति किस भाषा से हुई है?",
    option: ["जर्मन", "हिन्दी", "ग्रीक", "लैटिन"],
    answer: "ग्रीक"
},
{
    question: "प्रसिद्ध मनोवैज्ञानिक हंस सेली किस क्षेत्र से संबंधित हैं?",
    option: ["अभिप्रेरकों के संघर्ष के क्षेत्र से", "तनाव के अध्ययन के क्षेत्र से", "समाजीकरण के अध्ययन के क्षेत्र से", "इनमें से किसी भी क्षेत्र से नहीं"],
    answer: "तनाव के अध्ययन के क्षेत्र से"
},
{
    question: "दबाव प्रतिरोधी व्यक्तित्व में कौन विशेषता नहीं पायी जाती है?",
    option: ["दुश्चिंता", "प्रतिबद्धता", "चुनौती", "नियंत्रण"],
    answer: "दुश्चिंता"
},
{
    question: "बाह्य आबेधक के प्रति प्रतिक्रिया को कहा जाता है-",
    option: ["अनकूलन", "बर्न-आउट", "समायोजन", "खिंचाव"],
    answer: "अनकूलन"
},
{
    question: "फ्रायड के अनुसार ऑडिपस की अवधि में चालक प्रतियोगिता करता है-",
    option: ["बहन के साथ", "भाई के साथ", "माता के साथ", "पिता के साथ"],
    answer: "पिता के साथ"
},
{
    question: "आक्रामकता का कारण कौन नहीं है?",
    option: ["मॉडलिंग", "कुंठा", "व्यवहार परक औषध", "बच्चों का पालन-पोषण"],
    answer: "व्यवहार परक औषध"
},
{
    question: "अगर किसी व्यक्ति को मनोवृत्ति प्रतिकूल से बदलकर अधिक प्रतिकूल या अनुकूल से बदलकर और अधिक अनुकूल हो जाती है तो यह एक उदाहरण होगा-",
    option: ["असंगत परिवर्तन का", "संगत परिवर्तन का", "साधारण परिवर्तन का", "जटिल परिवर्तन का"],
    answer: "संगत परिवर्तन का"
},
{
    question: "आक्रामकता का अध्ययन करने के लिए आप निम्नांकित में से किस विधि को सबसे अधिक उपयुक्त मानते हैं?",
    option: ["अन्तर्निरीक्षण", "नियंत्रित निरीक्षण", "प्राकृतिक निरीक्षण", "इनमें से कोई नहीं"],
    answer: "नियंत्रित निरीक्षण"
},
{
    question: "किस आक्रामकता में व्यक्ति का अभिप्राय छिपा रहता है?",
    option: ["वैरपूर्ण आक्रामकता में", "साधानात्मक आक्रामकता में", "हिंसा में", "इनमें से कोई नहीं"],
    answer: "साधानात्मक आक्रामकता में"
},
{
    question: "अपने संबंधियों से बातचीत करने में किस दूरी का उपयोग किया जाता है?",
    option: ["व्यक्तिगत दूरी", "सामाजिक दूरी", "सार्वजनिक दूरी", "इनमें से कोई नहीं"],
    answer: "व्यक्तिगत दूरी"
},
{
    question: "कोलाहल की विशेषताओं में किसे शामिल नहीं किया जा सकता है?",
    option: ["तीव्रता", "पूर्वानुमेयता", "नियंत्रण योग्यता", "क्रमबद्धता"],
    answer: "क्रमबद्धता"
},
{
    question: "सामाजिक दूरी में सम्प्रेषणकर्ता तथा श्रोता के बीच दूरी होती है?",
    option: ["18 इन्च से 4 फीट", "4 फीट से 10 फीट", "0 से 10 इन्च", "इनमें से कोई नहीं"],
    answer: "4 फीट से 10 फीट"
},
{
    question: "निम्नलिखित में कौन शरीर क्रियात्मक प्रभाव का उदाहरण है?",
    option: ["हृदयगति में वृद्धि", "रक्त वाहिकाओं का सिकुड़ना", "पाचक तंत्र की धीमी गति", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "दबाव के संज्ञानात्मक सिद्धांत को किसने प्रतिपादित किया?",
    option: ["लोजारस", "फोकमैन", "एंडलर", "सेल्ये"],
    answer: "लोजारस"
},
{
    question: "निम्नलिखित में कौन हमें दबाव में डालती है?",
    option: ["चुनौतियाँ", "समस्याएँ", "कठिन परिस्थितियाँ", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "यदि दबाव का ठीक से प्रबंधन किया जाए तो वह व्यक्ति की अतिजीविता की संभावना में-",
    option: ["कमी करता है", "अत्यधिक कमी करता है", "वृद्धि करता है", "कमी और वृद्धि दोनों करता है"],
    answer: "वृद्धि करता है"
},
{
    question: "निम्नलिखित में कौन-से संवेग नकारात्मक है?",
    option: ["भय", "दुश्चिंता", "उलझन", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "संज्ञानात्मक अनुक्रिया के अन्तर्गत कैसी अनुक्रियाएँ आती हैं?",
    option: ["अंतर्वेधी", "ध्यान केन्द्रित न कर पाना", "पुनरावर्ती", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "बाह्य प्रतिबल के प्रति प्रतिक्रिया को क्या कहा जाता है?",
    option: ["दबा", "तनाव", "उपागम", "इनमें से कोई नहीं"],
    answer: "तनाव"
},
{
    question: "निम्नलिखित में कौन संवेगात्मक प्रभाव के उदाहरण हैं?",
    option: ["हृदय गति में वृद्धि", "मनोवैज्ञानिक तनाव में वृद्धि", "उच्च रक्तचाप", "इनमें से कोई नहीं"],
    answer: "मनोवैज्ञानिक तनाव में वृद्धि"
},
{
    question: "नकारात्मक घटनाओं का मूल्यांकन किसके लिए किया जाता है?",
    option: ["संभावित नुकसान", "संभावित खतरा", "संभावित चुनौती", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "निम्नलिखित में कौन संज्ञानात्मक प्रभाव हो सकते हैं?",
    option: ["एकाग्रता में वृद्धि", "न्यूनीकृत अल्पकालिक समृति क्षमता", "एलर्जी", "सिरदर्द"],
    answer: "न्यूनीकृत अल्पकालिक समृति क्षमता"
},
{
    question: "वे दबाव जिन्हें हम अपने मन में उत्पन्न करते हैं उन्हें कहा जाता है-",
    option: ["भौतिक दबाव", "पर्यावरणीय दबाव", "मनोवैज्ञानिक दबाव", "इनमें से कोई नहीं"],
    answer: "मनोवैज्ञानिक दबाव"
},
{
    question: "निम्नलिखित में कौन अभिघातज घटना है?",
    option: ["अग्निकाण्ड", "बिजली-पानी की कमी", "कोलाहलपूर्ण परिवेश", "इनमें से कोई नहीं"],
    answer: "अग्निकाण्ड"
},
{
    question: "हाइपोथैलेमस कितने माध्यम से क्रिया प्रारंभ करता है?",
    option: ["एक", "चार", "तीन", "दो"],
    answer: "दो"
},
{
    question: "स्ट्रेस शब्द की उत्पत्ति लैटिन भाषा के किस शब्द से हुई है?",
    option: ["स्ट्रिक्टर", "स्ट्रिक्मटर", "स्ट्रैक्चर", "स्ट्रिर"],
    answer: "स्ट्रिक्टर"
},
{
    question: "किन हार्मोनों की वजह से रक्तचाप स्तर में परिवर्तन आता है?",
    option: ["एड्रिनलीन तथा कॉर्टिसोल", "कटिसाल एवं एड्रि", "नलीन तथा सोल", "कार्टिसाल एवं सिस्ट्रोल"],
    answer: "एड्रिनलीन तथा कॉर्टिसोल"
},
{
    question: "व्यक्तियों में शारीरिक बीमारियों में कितने प्रतिशत तक दबाब की भूमिका महत्वपूर्ण है?",
    option: ["45 से 65", "51 से 69", "52 से 71", "50 से 70"],
    answer: "50 से 70"
},
{
    question: "शारीरिक, संवेगात्मक तथा मनोवैज्ञानिक परिश्रान्ति की अवस्था को क्या कहते हैं?",
    option: ["डर्नआउट", "ग्रेनाउट", "बर्नआउट", "नाउट"],
    answer: "बर्नआउट"
},
{
    question: "विभिन्न शोधों एवं अध्ययनों द्वारा ज्ञात हुआ है कि तकरीबन प्रतिशत रोगों का कारण तनाव होता है?",
    option: ["25%", "50%", "75%", "100%"],
    answer: "75%"
},
{
    question: "तनाव के कई कारण होते हैं जिससे तनाव उत्पन्न होता है, उन्हें कहा जाता है?",
    option: ["प्रतिगमन", "प्रतिबलक", "प्रत्याहार", "अनुकरण"],
    answer: "प्रतिबलक"
},
{
    question: "‘भिड़ो या भागो अनुक्रिया’ का संबंध है-",
    option: ["डोलार्ड एवं मिलर से", "कैनन से", "कोहेन से", "ग्लास एवं सिंगर से"],
    answer: "कैनन से"
},
{
    question: "हंस सेली ने तनाव के बारे में कहा है?",
    option: ["तनाव एक अविशिष्ट अनुक्रिया है", "तनाव एक अतिविशिष्ट अनुक्रिया", "तनाव एक सामाजिक सीखना अनुक्रिया है", "तनाव एक समायोजन अनुक्रिया है"],
    answer: "तनाव एक अविशिष्ट अनुक्रिया है"
},
{
    question: "सामान्य अनुकूलन संलक्षण में कितनी अवस्थाएँ पायी जाती हैं?",
    option: ["तीन", "दो", "पाँच", "चार"],
    answer: "तीन"
},
{
    question: "समय प्रबन्ध किस श्रेणी का कौशल है?",
    option: ["वैयक्तिक", "सामूहिक", "राजनैतिक", "धार्मिक"],
    answer: "वैयक्तिक"
},
{
    question: "लक्ष्य प्राप्ति में बाधा और आवश्यकताओं एवं अभिप्रेरकों के अवरुद्ध होने से क्या उत्पन्न होता है?",
    option: ["आन्तरिक दबाव", "कुंठा", "द्वन्द्व", "इनमें से कोई नहीं"],
    answer: "कुंठा"
},
{
    question: "संवेग-अभिविन्यस्त युक्ति किसके द्वारा वर्णित दबाव की युक्ति है?",
    option: ["एडलर तथा पार्कर", "कालमैन", "काइमैन", "हिटलर"],
    answer: "एडलर तथा पार्कर"
},
{
    question: "किस मनोवैज्ञानिक ने दबाव का सामना करने हेतु संकल्पना निर्धारण एक गत्यात्मक प्रक्रिया के रूप में किया?",
    option: ["काइमैन", "हिटलर", "लेजारस तथा फोकमैन", "एडलर तथा पार्कर"],
    answer: "लेजारस तथा फोकमैन"
},
{
    question: "जैवप्रतिप्राप्ति या बायोफीडबैक की कितनी अवस्थाएँ होती हैं?",
    option: ["दो", "तीन", "चार", "एक"],
    answer: "तीन"
},
{
    question: "दबाव संचार प्रशिक्षण विधि का विकास किसके द्वारा किया गया?",
    option: ["काइमैन", "एडलर तथा पार्कर", "हिटलर", "मीचेनबॉम"],
    answer: "मीचेनबॉम"
},
{
    question: "कौन-सी क्रिया जीवन शैली में व्यापक रूप से लोकप्रिय अनुमोदन प्राप्त करने जैसा परिवर्तन लाती है?",
    option: ["आहार", "सकारात्मक चिन्तन", "व्यायाम", "सकारात्मक अभिवृत्त"],
    answer: "व्यायाम"
},
{
    question: "निम्न में से कौन अफीम से उत्पन्न औषध है?",
    option: ["मॉफिन", "हेरोइन", "मेथाडोन", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "आक्रमण एवं हिंसा को कम करने का उपाय है-",
    option: ["सामाजिक अधिगम", "विरेचन विधि", "परानुभूति", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "निम्नांकित में से कौन संघर्ष समाधान युक्ति है?",
    option: ["समझौता वार्ता", "पारस्परिक संपर्क", "अनुकूल विधान", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "संज्ञानात्मक असंवादिता से तात्पर्य है-",
    option: ["दो मानसिक दशाओं का संगत होना", "दो मानसिक दशाओं का असंगत होना", "दो मानसिक दशाओं का विपरीत होना", "दो मानसिक दशाओं का कठिन होना"],
    answer: "दो मानसिक दशाओं का असंगत होना"
},
{
    question: "लियोन फेस्टिंगर ने संज्ञानात्मक असंवादिता सिद्धान्त का प्रतिपादन किस वर्ष किया?",
    option: ["1947", "1967", "1977", "1957"],
    answer: "1957"
},
{
    question: "प्रतिबल के विपरीत अवस्था को कहते है-",
    option: ["चिन्तन", "शिथिलीकरण", "अनुकूलन", "इनमें से कोई नहीं"],
    answer: "शिथिलीकरण"
},
{
    question: "इनमें कौन असामान्य के जैविकीय कारक नहीं है?",
    option: ["शारीरिक संरचना", "आरंभिक बंचन", "अंतःस्रावी ग्रंथियों का प्रभाव", "आनुवांशिकता"],
    answer: "आरंभिक बंचन"
},
{
    question: "किसी सामान्य प्रक्रिया को असामान्य रूप से बार-बार दुहराने की व्याधि को क्या कहते हैं?",
    option: ["दुर्भांति", "आतंक", "सामान्यीकृत दुश्चिता", "मनोग्रस्ति बाध्यता"],
    answer: "मनोग्रस्ति बाध्यता"
},
{
    question: "विचारों, प्रेरणाओं, आवश्यकताओं एवं उद्देश्यों के परस्पर विरोध के फलस्वरूप पैदा हुई विक्षेभ या तनाव की स्थिति क्या कहलाती है?",
    option: ["द्वंद्व", "तर्क", "कुण्ठा", "दमन"],
    answer: "द्वंद्व"
},
{
    question: "निम्नलिखित में से कौन स्नायु विकृति नहीं है?",
    option: ["मनोविदलता", "चिन्ता विकृति", "बाध्य विकृति", "दुर्भीति"],
    answer: "मनोविदलता"
},
{
    question: "किसने सर्वप्रथम स्वीकार किया कि द्वंद्व एवं अन्तर्वैयक्तिक संबंधों में बाधा मानसिक विकारों में महत्वपूर्ण कारण है?",
    option: ["हिप्पोक्रेटस", "जॉन वेयर", "सुकरात", "गैलन"],
    answer: "सुकरात"
},
{
    question: "निम्नांकित में से कौन काय रूप विकार है?",
    option: ["पीड़ा विकार", "काय-आर्लेबिता विकार", "परिवर्तन विकार", "इनमें से कोई नहीं"],
    answer: "पीड़ा विकार"
},
{
    question: "निम्नांकित में कौन बुलिमिया विकार है?",
    option: ["भोजन विकार", "नैतिक विकार", "भावात्मक विकार", "चरित्र विकार"],
    answer: "भोजन विकार"
},
{
    question: "नलिकाविहीन ग्रंथि का नाम है-",
    option: ["बहि:स्रावी ग्रंथि", "अंत:स्रावी ग्रंथि", "एड्रीनल ग्रंथि", "कंठ ग्रंथि"],
    answer: "अंत:स्रावी ग्रंथि"
},
{
    question: "एक ध्रुवीय विषाद का दूसरा नाम क्या है?",
    option: ["विषादी मनोविकृति", "उन्मादी विषादी मनोविकृति", "उन्माद", "इनमें से कोई नहीं"],
    answer: "विषादी मनोविकृति"
},
{
    question: "द्वि-ध्रुवीय विकार के दो ध्रुव हैं-",
    option: ["तर्क संगत तथा अतर्क संगत", "उन्माद तथा विषाद", "स्नायु विकृति तथा मनोविकृति", "मनोग्रस्ति तथा बाध्यता"],
    answer: "उन्माद तथा विषाद"
},
{
    question: "किस चिकित्सा में आद्यानुकूलन के नियम प्रयुक्त होते हैं?",
    option: ["मनोगत्यात्मक चिकित्सा", "रोगी केन्द्रित चिकित्सा", "लोगों चिकित्सा", "व्यवहार चिकित्सा"],
    answer: "व्यवहार चिकित्सा"
},
{
    question: "कैटेटोनिक स्टूपर एक लक्षण है-",
    option: ["मनोविदलता का", "रूपांतर मनोविकृति का", "रोगभ्रम का", "इनमें से कोई नहीं"],
    answer: "मनोविदलता का"
},
{
    question: "निम्नलिखित में से कौन सामाजिक प्रतिबल है?",
    option: ["द्वन्द्व", "कुंठा", "भूकम्प", "विवाह-विच्छेद"],
    answer: "विवाह-विच्छेद"
},
{
    question: "निम्नांकित में किसे मनोविज्ञान में मूल्यांकन विधि के एक यंत्र के रूप में नहीं समझा जाता है?",
    option: ["मनोवैज्ञानिक परीक्षण", "केस अध्ययन", "मनश्चिकित्सा", "साक्षात्कार"],
    answer: "मनश्चिकित्सा"
},
{
    question: "ट्रोसोमी-21 का अन्य नाम क्या है?",
    option: ["डाउन संलक्षण", "एगोराफोबिया", "क्लाइनफेल्टर संलक्षण", "दुर्बल एक्स संलक्षण"],
    answer: "डाउन संलक्षण"
},
{
    question: "किसी सामान्य प्रक्रिया को असामान्य रूप से बराबर दुहराने की दन व्याधि को क्या कहते हैं?",
    option: ["फ्रायड", "दुर्भीति", "सामान्यीकृत दुश्चिंता", "मनोग्रसित बाध्यता"],
    answer: "मनोग्रसित बाध्यता"
},
{
    question: "रेशनल इमीटिव चिकित्सा का प्रतिपादन किसने किया?",
    option: ["फ्रायड", "कार्ल रोजर्स", "अलबर्ट इल्लिस", "इनमें से कोई नहीं"],
    answer: "अलबर्ट इल्लिस"
},
{
    question: "निम्नांकित में कौन मनोविदालिता का एक प्रकार नहीं है?",
    option: ["विघटित मनोविदालिता", "व्यामोहाभ मनोविदालिता", "मिश्रित मनोविदालिता", "विद्रोही मनोविदालिता"],
    answer: "विद्रोही मनोविदालिता"
},
{
    question: "इनमें से कौन मादक द्रव्य नहीं है?",
    option: ["कॉफी", "कोकेन", "अफीम", "स्मैक"],
    answer: "कॉफी"
},
{
    question: "आक्रमण के मूल प्रवृत्ति सिद्धान्त का प्रतिपादन किसने किया?",
    option: ["रोजर्स", "आलपोर्ट", "फ्रायड", "वाटसन"],
    answer: "फ्रायड"
},
{
    question: "गांजा एक प्रकार का-",
    option: ["केफीन है", "कोकीन है", "केनेबिस है", "निकोटिन है"],
    answer: "केनेबिस है"
},
{
    question: "निम्नलिखित में कौन निकोटिन की श्रेणी में आता है?",
    option: ["हशीश", "हेरोइन", "तंबाकू", "इनमें से कोई नहीं"],
    answer: "तंबाकू"
},
{
    question: "विसामान्य कष्टप्रद अपक्रियात्मक और दुःखद व्यवहार को कहा गों जाता है-",
    option: ["सामान्य व्यवहार", "अपसामान्य व्यवहार", "विचित्र व्यवहार", "इनमें से कोई नहीं"],
    answer: "अपसामान्य व्यवहार"
},
{
    question: "सभी ऐल्कोहॉल पेय पदार्थों में होता है-",
    option: ["मिथाइल ऐल्कोहॉल", "एथाइल ऐल्कोहॉल", "कीटोन", "इनमें से कोई नहीं"],
    answer: "एथाइल ऐल्कोहॉल"
},
{
    question: "निम्नलिखित में अपसामान्य व्यवहार के कौन-से परिप्रेक्ष्य नहीं हैं?",
    option: ["अतिप्राकृत", "अजैविक", "जैविक", "आंगिक"],
    answer: "अजैविक"
},
{
    question: "‘वे मानव व्यवहार और अनुभूतियाँ जो साधारण अनोखे असाधारण हैं, असामान्य समझे जाते हैं। यह कथन किसका है?",
    option: ["हिटलर", "ब्राउन", "जेम्स ड्रेवर", "किस्कर"],
    answer: "किस्कर"
},
{
    question: "मेसकालाइन एक-",
    option: ["विभ्रांति उत्पादक है", "निकोटिन है", "शामक", "ओपिऑयड है"],
    answer: "विभ्रांति उत्पादक है"
},
{
    question: "निम्नलिखित में कौन केफीन नहीं है?",
    option: ["कॉफी", "चॉकलेट", "कफ सिरप", "कोको"],
    answer: "कफ सिरप"
},
{
    question: "व्यक्ति की शारीरिक बनावट को किस मनोवैज्ञानिक ने तीन भागों",
    option: ["सिग्मण्ड फ्रॉयड", "मेक्सवेल", "पिनेल", "शैल्डन"],
    answer: "शैल्डन"
},
{
    question: "दुश्चितित व्यक्ति में कौन-से लक्षण पाए जाते हैं?",
    option: ["हृदय गति का तेज होना", "साँस की कमी होना", "दस्त होना", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "निम्नलिखित में कौन कायरूप विकार नहीं है?",
    option: ["परिवर्तन विकार", "स्वकायदुश्चिंता रोग", "विच्छेदी विकार", "पीड़ा विकार"],
    answer: "विच्छेदी विकार"
},
{
    question: "निम्नलिखित में कौन कान-आलंबिता विकार के लक्षण नहीं है?",
    option: ["खूब खाना", "सिरदर्द", "थकान", "उलटी करना"],
    answer: "खूब खाना"
},
{
    question: "निम्नलिखित में कौन ओपिऑयड नहीं है?",
    option: ["मोरफीन", "कफ सिरप", "पीडानाशक गोलियाँ", "एल.एल.डी."],
    answer: "एल.एल.डी."
},
{
    question: "हेरोइन एक प्रकार का-",
    option: ["कोकीन है", "केनेबिस है", "ओपिऑयड है", "केफीन है"],
    answer: "ओपिऑयड है"
},
{
    question: "किसी विशिष्ट वस्तु, दूसरों के साथ अंतःक्रिया तथा अपरिचित स्थितियों के प्रति अविवेकी भय का होना कहलाता है-",
    option: ["आतंक विकार", "उत्तर अभिघातमज दबाव विकार", "दुर्भीति", "इनमें से कोई नहीं"],
    answer: "दुर्भीति"
},
{
    question: "किस विकार में व्यक्ति प्रत्यावर्ती व्यक्तित्वों की कल्पना करता है जो आपस में एक-दूसरे के प्रति जानकारी रख सकते हैं या नहीं रख सकते हैं?",
    option: ["विच्छेदी पहचान विकार", "पीड़ा विकार", "विच्छेदी समृतिलोप", "इनमें से कोई नहीं"],
    answer: "विच्छेदी पहचान विकार"
},
{
    question: "उत्तर अभिघात्ज़ दबाव विकार का लक्षण होते हैं-",
    option: ["एकाग्रता में कमी", "बार-बार आने वाले स्वप्न", "सांवेगिक शून्यता का होना", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "आनुवंशिक कारकों का संबंध कहाँ पाया गया है?",
    option: ["भावदशा विकारों", "मनोविदलता", "मानसिक मंदन", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "दुश्चिंता विकार का संबंध किससे है?",
    option: ["डोपामाइन से", "गामा एमिनो ब्यूटिरिक एसिड से", "सीरोटोनिन से", "इनमें से कोई नहीं"],
    answer: "गामा एमिनो ब्यूटिरिक एसिड से"
},
{
    question: "निम्नांकित में कौन मनोवैज्ञानिक विकारों के वर्गीकरण का नवीनतम पद्धति है?",
    option: ["DSM-IIR", "DSM-IV", "ICD-9", "WHO"],
    answer: "DSM-IV"
},
{
    question: "निम्नलिखित में कौन असामान्य व्यवहार से संबंधित नहीं है?",
    option: ["मानसिक असंतुलन", "क्रोमोसोम्स असमानता.", "याददास्ता का कमजोर होना", "शरीर गठन"],
    answer: "याददास्ता का कमजोर होना"
},
{
    question: "असामान्य मनोविज्ञान के आधुनिक युग के जनक कौन माने जाते हैं?",
    option: ["सिग्मण्ड फ्रॉयड", "जेम्स ब्रेड", "ली बॉल", "मेस्लो"],
    answer: "सिग्मण्ड फ्रॉयड"
},
{
    question: "सामान्य, असामान्य तथा श्रेष्ठ में केवल का अंतर होता है?",
    option: ["मात्रा का", "क्रम का", "दूरी का", "समय का"],
    answer: "मात्रा का"
},
{
    question: "मानसिक अस्वस्थता का प्रमुख लक्षण है-",
    option: ["उल्टी-सीधी हरकतें करना", "पागलपन के लक्षण", "सन्तुलित व्यवहार न करना", "नई परिस्थिति में घूटन महसूस करना"],
    answer: "सन्तुलित व्यवहार न करना"
},
{
    question: "मनोविदलता के उप-प्रकारों में से कौन-सा एक नहीं है?",
    option: ["व्यामोहाभ प्रकार", "विसंगठित प्रकार", "अवधान-न्यूनता अतिक्रिया प्रकार", "अविभेदित प्रकार"],
    answer: "अवधान-न्यूनता अतिक्रिया प्रकार"
},
{
    question: "बिमारियों का अंतर्राष्ट्रीय वर्गीकरण का दसवां संस्करण कब प्रकाशित किया गया है?",
    option: ["1982 ई.", "1992 ई.", "2006 ई.", "2009 ई."],
    answer: "1992 ई."
},
{
    question: "अगर कोई व्यक्ति में उनमाद तथा विषाद दोनों तरह की मानसिक अवस्थाएँ क्रम होती है तो इसे DSM-IV में क्या संज्ञा दी गई है-",
    option: ["उत्साह-विषाद मनोविक्षिप्त", "द्वि ध्रुवीय विकार", "मुख्य विषाद", "मनः स्थिति विकार"],
    answer: "द्वि ध्रुवीय विकार"
},
{
    question: "किस सन् तक आंगिक दृष्टिकोण अपनी चरम सीमा पर था?",
    option: ["1925", "1914", "1912 ई.", "1915 ई."],
    answer: "1915 ई."
},
{
    question: "मनोविदालिता पद का प्रयोग सबसे पहले किसने किया था?",
    option: ["प्लियूलर", "मोरेल", "फ्रायड", "क्रेपलिन"],
    answer: "प्लियूलर"
},
{
    question: "डी.एस.एम. IV में कितने आयाम है?",
    option: ["पाँच", "छह", "चार", "सात"],
    answer: "पाँच"
},
{
    question: "मानव शरीर में काला पित्त की अधिकता से उत्पन्न होता है?",
    option: ["विषाद", "उत्साह", "विषाद तथा उत्साह दोनों", "इनमें से कोई नहीं"],
    answer: "विषाद"
},
{
    question: "DSM-IV के अनुसार निम्नांकित में से किसे दुश्चिंता विकृति की श्रेणी में नहीं रखा गया है?",
    option: ["दुर्भीति", "तीब्र प्रतिवल विकृति", "रूपांतर विकृति", "मनोग्रस्ति-बाध्यता विकृति"],
    answer: "रूपांतर विकृति"
},
{
    question: "मनोविदलता के रोगी में सबसे ज्यादा कौन-सी विभ्रांति पायी जाती है?",
    option: ["श्रवण विभ्रांति", "दैहिक विभ्रांति", "दुष्टि विभ्रांति", "स्पर्शी विभ्रांति"],
    answer: "श्रवण विभ्रांति"
},
{
    question: "निम्नांकित में से कौन से दुश्चिंता विकार नहीं है?",
    option: ["दुर्भीति विकार", "आतंक विकार", "मनोग्रस्ति-बाध्यता विकार", "मनोविच्छेदी आत्मविस्मृति"],
    answer: "मनोविच्छेदी आत्मविस्मृति"
},
{
    question: "किस मनोवैज्ञानिक ने मेस्मेरिज्म चिकित्सा सिद्धान्त की स्थापना की?",
    option: ["मेक्सवेल", "जीन एस्क्यूरल", "ग्रिंजिगर", "ऐन्टन मेस्मर"],
    answer: "ऐन्टन मेस्मर"
},
{
    question: "कायरूपू विकार निम्न में किससे सम्बन्धित है?",
    option: ["शारीरिक समस्या से", "मनोवैज्ञानिक समस्या से", "आनुवंशिक समस्या से", "दैवीय समस्या से"],
    answer: "शारीरिक समस्या से"
},
{
    question: "‘असामान्य व्यवहार या असामान्य व्यक्ति का अध्ययन ही असामान्य मनोविज्ञान है। यह कथन किसका है?",
    option: ["जेम्स ड्रेवर", "ब्राउन", "आइजनेक", "किस्कर"],
    answer: "आइजनेक"
},
{
    question: "Father of Medicine के नाम से किस मनोवैज्ञानिक को जाना जाता था?",
    option: ["हिप्पोक्रेटीज", "आइजनेक", "अरस्तु", "प्लेटो"],
    answer: "हिप्पोक्रेटीज"
},
{
    question: "सामूहिक पागलपन के प्रमाण किस शताब्दी से किस शताब्दी तक मिले?",
    option: ["10वीं से 15वीं तक", "11वीं से 16वीं तक", "10वीं से 14वीं तक", "10वीं से 16वीं तक"],
    answer: "10वीं से 16वीं तक"
},
{
    question: "Pathology of Brain नामक पुस्तक के रचयिता कौन थे?",
    option: ["हॉलर", "पिनेल", "बेन्जामिन रश", "क्रेपलिन"],
    answer: "क्रेपलिन"
},
{
    question: "संवेदन मंदक औषधियों का मुख्य कार्य होता है-",
    option: ["पीड़ादायक प्रभाव को कम करना", "उत्तेजना को बढ़ाना", "विभ्रम उत्पन्न करना", "इनमें से कोई नहीं"],
    answer: "विभ्रम उत्पन्न करना"
},
{
    question: "बन्दुरा ने कहा बच्चे असामाजिक व्यवहार सीखते हैं-",
    option: ["साधनात्मक अनुकूलता से", "प्रेक्षणात्मक अनुकूलन से", "क्लासिकी अनुकूलन से", "इनमें से कोई नहीं"],
    answer: "प्रेक्षणात्मक अनुकूलन से"
},
{
    question: "मानसिक बीमारी के वर्गीकरण की अत्यन्त नवीनतम पद्धति क्या है?",
    option: ["DSM-IV", "ICD-10", "DSM-V-TR", "इनमें से सभी"],
    answer: "DSM-V-TR"
},
{
    question: "एनोरेक्सिया नरवोसा का ऐसा विकार है जिसमें रोगी को-",
    option: ["भूख अधिक लगती है", "भूख कम लगती है", "प्यास अधिक लगती है", "प्यास कम लगती है"],
    answer: "भूख कम लगती है"
},
{
    question: "बन्दूरा ने सर्प दुर्भाति को दूर करने के लिए किस प्रविधी का उपयोग किया है?",
    option: ["क्रमबद्ध असंवेदीकरण", "व्यवस्था", "विरूचि अनुबंध", "मॉडलिंग"],
    answer: "क्रमबद्ध असंवेदीकरण"
},
{
    question: "मनोवृत्ति का निर्माण निम्नांकित में से किस कारक द्वारा प्रभावित नहीं होता है?",
    option: ["सामाजिक सीखना", "विश्वसनीय सूचनाएँ", "आवश्यकता पूर्ति", "श्रोता की विशेषताएँ"],
    answer: "श्रोता की विशेषताएँ"
},
{
    question: "आधुनिक चिकित्साशास्त्र का जनक किसे माना जाता है?",
    option: ["हिप्पोक्रेटस", "फ्रायड", "मैसलो", "रोजर्स"],
    answer: "हिप्पोक्रेटस"
},
{
    question: "मनोविश्लेषणात्मक चिकित्सा का संबंध किस व्यक्ति से है?",
    option: ["फ्रायड", "युंग", "एडलर", "मैसलो"],
    answer: "फ्रायड"
},
{
    question: "मनोगत्यात्मक चिकित्सा का प्रतिपादन किसने किया?",
    option: ["रोजर्स", "आलपोर्ट", "फ्रायड", "वाटसन"],
    answer: "फ्रायड"
},
{
    question: "सेवार्थी केन्द्रित चिकित्सा को किसने प्रतिपादित किया?",
    option: ["मास्लो", "रोजर्स", "फ्रायड", "इनमें से कोई नहीं"],
    answer: "रोजर्स"
},
{
    question: "किस चिकित्सा पद्धति में सीखने के सिद्धांतों का प्रयोग होता",
    option: ["मनोविश्लेषण चिकित्सा", "सामूहिक चिकित्सा", "व्यवहार चिकित्सा", "इनमें से कोई नहीं"],
    answer: "व्यवहार चिकित्सा"
},
{
    question: "सामूहिक अचेतन के विषय को कहा जाता है-",
    option: ["मनोग्रंथि", "आरकीटाइप", "पारसोना", "एनीमा"],
    answer: "आरकीटाइप"
},
{
    question: "मनोवृत्ति निर्माण को कौन तत्त्व प्रभावित नहीं करता?",
    option: ["श्रोता की विशेषताएँ", "विश्वसनीय सूचनाएँ", "सामाजिक सीखना", "आवश्यकता पूर्ति"],
    answer: "आवश्यकता पूर्ति"
},
{
    question: "पतंजलि का नाम किससे संबंधित है?",
    option: ["मन:चिकित्सा से", "योग से", "स्वप्न विश्लेषण से", "परामर्श से"],
    answer: "योग से"
},
{
    question: "मनोवृत्ति परिवर्तन में संतुलन का प्रतिपादन किसने किया था?",
    option: ["फेस्टिंगर", "हाईडर", "मोहसिन", "इनमें से कोई नहीं"],
    answer: "हाईडर"
},
{
    question: "श्रेणी आधृत स्कीमा को क्या कहा जाता है?",
    option: ["आदिरूंप", "रूढ़िकृति", "दर्शक प्रभाव", "इनमें से कोई नहीं"],
    answer: "रूढ़िकृति"
},
{
    question: "व्यवहार चिकित्सा किस सिद्धांत पर आधारित है?",
    option: ["अधिगम सिद्धांत", "अभिप्रेरणा सिद्धांत", "प्रत्यक्षण सिद्धांत", "विस्मरण सिद्धांत"],
    answer: "अधिगम सिद्धांत"
},
{
    question: "श्वसन अभ्यास को योग में क्या कहा जाता है?",
    option: ["मनन", "आसन", "प्राणायाम", "इनमें से कोई नहीं"],
    answer: "प्राणायाम"
},
{
    question: "परामर्श का उद्देश्य होता है-",
    option: ["विकासात्मक", "निरोधात्मक", "उपचारात्मक", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "निम्नांकित में कौन जैव-आयुर्विज्ञान चिकित्सा नहीं है?",
    option: ["सेवार्थी केन्द्रित चिकित्सा", "औषधि चिकित्सा", "आघात चिकित्सा", "शल्य चिकित्सा"],
    answer: "सेवार्थी केन्द्रित चिकित्सा"
},
{
    question: "विश्व मानसिक स्वास्थ्य दिवस मनाया जाता है-",
    option: ["11 अक्टूबर", "21 अक्टूबर", "31 अगस्त", "21 नवम्बर"],
    answer: "11 अक्टूबर"
},
{
    question: "योग एक …….है।",
    option: ["आंघात चिकित्सा", "वैकल्पिक चिकित्सा", "(a) और (b) दोनों", "इनमें से कोई नहीं"],
    answer: "वैकल्पिक चिकित्सा"
},
{
    question: "पतंजलि के प्रसिद्ध योग-सूत्र में योग के मार्ग हैं-",
    option: ["4", "6", "8", "9"],
    answer: "8"
},
{
    question: "निम्नलिखित में कौन मानसिक स्वास्थ्य का आधार है?",
    option: ["संवेगात्मक", "वास्तविक संज्ञान", "व्यक्तिक स्वतंत्रता", "तर्कपूर्ण चिंतन"],
    answer: "तर्कपूर्ण चिंतन"
},
{
    question: "योग विधि बढ़ाती है-",
    option: ["भावदशा", "ध्यान", "दबाव सहिष्णुता", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "अमेरिका में सिखाए जाने वाले योग को क्या कहते हैं?",
    option: ["योग", "कुंडलिनी योग", "सुदर्शन योग", "निष्ठा योग"],
    answer: "कुंडलिनी योग"
},
{
    question: "निम्नलिखित में किसमें मंत्रों के उच्चारण के साथ श्वसन तकनीक या प्राणायाम को संयुक्त किया जाता है?",
    option: ["ध्यान", "सुदर्शन योग", "कुंडलिनी योग", "उपचार"],
    answer: "सुदर्शन योग"
},
{
    question: "मानसिक रोगियों के पुनः स्थापन का उद्देश्य होता है?",
    option: ["रोगी को सशक्त बनाना", "रोगी की देखभाल करना", "रोगी को घर देना", "इनमें से कोई नहीं"],
    answer: "रोगी को सशक्त बनाना"
},
{
    question: "मानसिक रोगियों के पुनः स्थापना में किस प्रकार का प्रशिक्षण दिया जाता है?",
    option: ["व्यावसायिक चिकित्सा", "सामाजिक कौशल प्रशिक्षण", "व्यावसायिक प्रशिक्षण", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "अपर्याप्त वैवाहिक, व्यावसायिक तथा सामाजिक समायोजन की यह आवश्यकता होती है कि व्यक्ति के पर्यावरण में परिवर्तन किए जाएँ-",
    option: ["वैयक्तिक", "सामाजिक", "आर्थिक", "इनमें से कोई नहीं"],
    answer: "वैयक्तिक"
},
{
    question: "मनोचिकित्सा की विशिष्ट प्रविधि है-",
    option: ["मनो अभिनव", "सम्मोहन चिकित्सा", "क्रीड़ा विधि", "उन्मोचन विधि"],
    answer: "सम्मोहन चिकित्सा"
},
{
    question: "निम्नलिखित में निर्वचन के विश्लेषणात्मक तकनीक कौन-सी है?",
    option: ["प्रतिरोधी", "स्पष्टीकरण", "(a) और (b) दोनों", "इनमें से कोई नहीं"],
    answer: "(a) और (b) दोनों"
},
{
    question: "अंत:मनोद्वंद्व को बाहर निकालने के लिए किस विधि का उपयोग होता है?",
    option: ["मुक्त साहचर्य विधि", "अन्यारोपण विधि", "स्पष्टीकरण विधि", "इनमें से कोई नहीं"],
    answer: "मुक्त साहचर्य विधि"
},
{
    question: "निम्नलिखित में किसमें सेवार्थी चिकित्सक को पूजण करने लगता है?",
    option: ["नकारात्मक अन्यारोपण", "सकारात्मक अन्यारोपण", "अन्यारोपण तंत्रिकाताप", "इनमें से कोई नहीं"],
    answer: "सकारात्मक अन्यारोपण"
},
{
    question: "निम्नलिखित में किसमें अचेतन स्मृतियाँ लगातार सचेतन अभिज्ञता में समाकलित होती रहती है?",
    option: ["अंतर्दृष्टि", "अन्यारोपण", "स्वप्न विधि", "इनमें से कोई नहीं"],
    answer: "अंतर्दृष्टि"
},
{
    question: "निम्नलिखित में कौन सेवार्थी को कष्ट प्रदान करते हैं?",
    option: ["अपक्रियात्मक व्यवहार", "क्रियात्मक व्यवहार", "व्यक्तिगत व्यवहार", "उपरोक्त सभी"],
    answer: "अपक्रियात्मक व्यवहार"
},
{
    question: "निम्नलिखित में कौन रोगी को अपने आपको और अपनी समस्या के स्रोत को समझने में बाहर आई सामग्री को अपने अहं में समाकलित करने में सहायता करता है?",
    option: ["प्रतिरोधी", "स्पष्टीकरण", "अन्यारोपन", "समाकलन कार्य"],
    answer: "समाकलन कार्य"
},
{
    question: "क्रामिक विसंवेदनीकरण को किसने प्रतिपादित किया?",
    option: ["अल्बर्ट एलिस", "वोल्प", "विक्टर फ्रेंकल", "जॉन पर्ल्स"],
    answer: "वोल्प"
},
{
    question: "‘दुश्चिता रोग की प्रमुख विशेषता रोगी की व्यापक और दिशाहीन चिन्ता है। यह कथन किसका है?",
    option: ["कोलमैन", "कैमरान", "कोलीन", "ग्रेगरी"],
    answer: "कोलमैन"
},
{
    question: "मनोविदलता की चिकित्सा के सम्बन्ध में सर्वप्रथम किस चिकित्सक ने अध्ययन किया?",
    option: ["मोरेल ने", "क्रेपलिन ने", "ब्लूलर ने", "कोलमैन ने"],
    answer: "ब्लूलर ने"
},
{
    question: "शारीरिक बनावट पर सर्वाधिक प्रभाव किस तत्व या शक्ति का पड़ता है?",
    option: ["परिवार", "शारीरिक बनावट", "वंशानुक्रम", "शारीरिक रचना"],
    answer: "वंशानुक्रम"
},
{
    question: "मनःस्नायु विकृति के रोग का मस्तिष्क लक्षण है-",
    option: ["भय", "आशंका", "रोग", "कष्ट"],
    answer: "आशंका"
},
{
    question: "दुर्भाति या फोबिया क्या है?",
    option: ["चिन्ता क्षोभान्माद", "मानसिक विकृति", "अतार्किक चिन्ता", "असंगत भय"],
    answer: "असंगत भय"
},
{
    question: "दुर्भीति का ठीक उपचार क्या है?",
    option: ["आत्म-निर्देशन", "आत्म-पुनर्बल", "कल्पनात्मक गुण", "शल्य क्रिया"],
    answer: "आत्म-निर्देशन"
},
{
    question: "मनःस्नायु विकृति के रचनाकार कौन हैं?",
    option: ["फिशर", "कोलमैन", "मेयर", "रोगेन ग्रेगरी"],
    answer: "फिशर"
},
{
    question: "निम्नलिखित में से दुर्भीति का लक्षण है-",
    option: ["पेट में विकार", "सिरदर्द", "शरीर में दर्द", "मन्द. हृदय गति"],
    answer: "पेट में विकार"
},
{
    question: "मनोविदलता के रोगी का उपचार होता है-",
    option: ["इन्सुलिन से", "आघात चिकित्सा से", "शल्य क्रिया से", "औषधि से"],
    answer: "इन्सुलिन से"
},
{
    question: "किस मनोविकृति में विद्युत पद्धति का प्रयोग किया जाता है?",
    option: ["चिन्ता पर", "भ्रम पर", "विषाद पर", "उत्साह पर"],
    answer: "विषाद पर"
},
{
    question: "आधुनिक युग में मानसिक स्वास्थ्य पर किसका प्रभाव पड़ता है?",
    option: ["अपराधों का", "जीवम की अस्थिरता का", "आराधना का", "भौतिकता का"],
    answer: "जीवम की अस्थिरता का"
},
{
    question: "फ्रायड के मनोविश्लेषण का एक रूप है-",
    option: ["प्रतिरोध", "संक्रमण", "प्रेम व स्नेह", "मुक्त साहचर्य"],
    answer: "मुक्त साहचर्य"
},
{
    question: "निम्नांकित में से व्यवहार चिकित्सा किस सिद्धान्त पर आधारित है?",
    option: ["अभिप्रेरणा के सिद्धान्त पर", "प्रत्यक्षण के सिद्धान्त पर", "सीखने के सिद्धान्त पर", "इनमें से सभी के सिद्धान्तों पर"],
    answer: "सीखने के सिद्धान्त पर"
},
{
    question: "योग में सम्मिलित होता है-",
    option: ["ध्यान", "मुद्रा", "नियम", "ज्ञान"],
    answer: "ध्यान"
},
{
    question: "सहायक मनोचिकित्सक की एक विधि है-",
    option: ["रोग निवारण", "परामर्श", "पुनश्विासन", "संसूचना"],
    answer: "पुनश्विासन"
},
{
    question: "एक स्कीमा या अन्विति योजना है-",
    option: ["मानसिक संरचना", "शारीरिक संरचना", "सामाजिक संरचना", "इनमें से कोई नहीं"],
    answer: "मानसिक संरचना"
},
{
    question: "मानसिक रूप से स्वस्थ व्यक्तियों के जीवन दर्शन में-",
    option: ["निश्चिंतता पाई जाती है", "दूसरों के जीवन दर्शन की नकल पाई जाती है", "अपूर्वता पाई जाती है", "भावी योजनाओं की झलक पाई जाती है"],
    answer: "निश्चिंतता पाई जाती है"
},
{
    question: "व्यक्ति के अचेतन प्रक्रियाओं को बाहर लाने की विधि कहलाती है-",
    option: ["जीवन-वृत विधि", "साक्षात्कार विधि", "प्रक्षेपण विधि", "प्रश्नावलियाँ"],
    answer: "प्रक्षेपण विधि"
},
{
    question: "योग के ‘अष्टांग साधन’ का संबंध है-",
    option: ["कर्म योग", "राज योग", "ज्ञान योग", "मंत्र योग"],
    answer: "राज योग"
},
{
    question: "व्यक्ति का मूल्यांकन करने के लिए सबसे अधिक उपयोग की जानेवाली तकनीकों के अन्तर्गत कौन-सा नहीं आता है?",
    option: ["मनोमितिक परीक्षण", "आत्म-प्रतिवेदन माप", "प्रक्षेपी तकनीक", "सेवार्थी केन्द्रित चिकित्सा"],
    answer: "सेवार्थी केन्द्रित चिकित्सा"
},
{
    question: "जर्मन शब्द ‘गेस्टाल्ट’ का अर्थ है-",
    option: ["विकृति", "समग्र", "दुश्चिंता", "इनमें से कोई नहीं"],
    answer: "समग्र"
},
{
    question: "व्यवहार चिकित्सा की जिस प्रविधि में रोगी को वास्तविक परिस्थिति में रखकर इसमें काफी मात्रा में चिन्ता उत्पन्न कर दी जाती है, उसे कहा जाता है-",
    option: ["फ्लडिंग", "विरुचि चिकित्सा", "अन्तः स्फोटात्मक चिकित्सा", "इनमें से कोई नहीं"],
    answer: "फ्लडिंग"
},
{
    question: "गोस्टाल्ट चिकित्सा का मुख्य उद्देश्य इस तथ्य पर बल डालना होता है कि-",
    option: ["रोगी क्यों किसी खास ढंग से व्यवहार कर रहा है", "रोगी के वर्तमान भाव क्या हैं", "रोगी किस तरह से व्यवहार कर रहा है", "(b) तथा (c) दोनों पहलुओं को समझना"],
    answer: "(b) तथा (c) दोनों पहलुओं को समझना"
},
{
    question: "मनोचिकित्सा का क्या लक्ष्य है?",
    option: ["पर्यावरण के बीच", "रोगी की समस्याओं का समाधान", "रोगियों को राहत पहुँचाना", "मनोवैज्ञानिक विधियों का प्रयोग"],
    answer: "रोगियों को राहत पहुँचाना"
},
{
    question: "मनोचिकित्सा का क्या स्तर है?",
    option: ["प्रतिरोध करना", "आत्मीयता-सम्बन्ध की स्थापना", "अन्तर्दृष्टि का रूप", "संक्रमण का होना"],
    answer: "आत्मीयता-सम्बन्ध की स्थापना"
},
{
    question: "निम्नांकित में से किस अंतरण में क्लायंट चिकित्सक के प्रति घृणा, ईर्ष्या आदि को दिखलाता है?",
    option: ["धनात्मक", "ऋणात्मक", "धनात्मक तथा ऋणात्मक दोनों", "इनमें से कोई नहीं"],
    answer: "ऋणात्मक"
},
{
    question: "मनोविश्लेषणात्मक चिकित्सा में निम्नांकित में से किसका महत्व सर्वाधिक बतलाया गया है?",
    option: ["स्थानान्तरण", "प्रतिरोध", "स्वतंत्र साहचर्य", "स्वप्न विश्लेषण"],
    answer: "स्वप्न विश्लेषण"
},
{
    question: "गेस्टाल्ट चिकित्सा एक तरह का है-",
    option: ["समूह चिकित्सा", "वैयक्तिक चिकित्सा", "अंशत: समूह तथा अंशतः वैयक्तिक चिकित्सा", "न समूह चिकित्सा न वैयक्तिक चिकित्सा"],
    answer: "समूह चिकित्सा"
},
{
    question: "मनोचिकित्सा विधि क्या है?",
    option: ["सामूहिक चिकित्सा", "साधारण रोगों का उपचार", "संवेगों की चिकित्सा", "विक्षेभों का उपचार"],
    answer: "विक्षेभों का उपचार"
},
{
    question: "मनोचिकित्सा का रोगी क्या प्रतिरोध करता है?",
    option: ["लैंगिक समस्या", "असामाजिक बातें", "गम्भीर रोग", "दमित भावनाएँ"],
    answer: "लैंगिक समस्या"
},
{
    question: "मनोचिकित्सा की विधि है-",
    option: ["सहायक चिकित्सा", "पुनर्रचनात्मक मनोचिकित्सा", "मनोविश्लेषण चिकित्सा", "पुनर्शिक्षात्मक मनोचिकित्सा"],
    answer: "पुनर्शिक्षात्मक मनोचिकित्सा"
},
{
    question: "निम्न में से कौन परामर्श का क्षेत्र नहीं है?",
    option: ["निजी", "शैक्षिक", "निर्देशन", "व्यवसायात्मक"],
    answer: "शैक्षिक"
},
{
    question: "मनोशल्य चिकित्सा पद्धति को किसने विकसित किया?",
    option: ["इगास मोनिज", "कार्ल रोजर्स", "एफ पर्ल्स", "इनमें से कोई नहीं"],
    answer: "इगास मोनिज"
},
{
    question: "विद्युत आघात चिकित्सा को किसने विकसित किया?",
    option: ["कार्ल रोजर्स", "इगास मोनिज", "सरलेटी तथा बिनी", "एफ० पर्ल्स"],
    answer: "सरलेटी तथा बिनी"
},
{
    question: "निम्नलिखित में किसे योग के पिता के रूप में आदर प्राप्त है?",
    option: ["महेश योगी", "गौतम बुद्ध", "महर्षि पतंजलि", "रजनीश"],
    answer: "महर्षि पतंजलि"
},
{
    question: "अलबर्ट एलिस ने निम्नांकित में किस चिकित्सा विधि का प्रतिपादन किया है?",
    option: ["संज्ञानात्मक चिकित्सा", "व्यवहार चिकित्सा", "अस्तित्वात्मक चिकित्सा", "इनमें से कोई नहीं"],
    answer: "संज्ञानात्मक चिकित्सा"
},
{
    question: "उत्तम स्वास्थ्य हेतु किस भारतीय मनीषी ने अष्टांग मार्ग को प्रतिपादित किया है?",
    option: ["गौतम", "पतंजलि", "याज्ञवल्क्य", "सुकरात"],
    answer: "पतंजलि"
},
{
    question: "मनोवृत्ति परिवर्तन के दो स्तरीय संप्रत्यय का प्रतिपादन किसने किया?",
    option: ["मुहम्मद सुलैमान", "ए.के. सिंह", "एम.एम. मुहसीन", "जे.पी. दास"],
    answer: "एम.एम. मुहसीन"
},
{
    question: "पूर्वाग्रह में घटकों की संख्या कितनी होती है?",
    option: ["दो", "तीन", "चार", "पाँच"],
    answer: "तीन"
},
{
    question: "पूर्वाग्रह एक प्रकार है-",
    option: ["मनोवृत्ति का", "मूल प्रवृत्ति का", "संवेग का", "प्रेरणा का"],
    answer: "मनोवृत्ति का"
},
{
    question: "मनोवृत्ति परिवर्तन प्रक्रिया में सन्तुलन या पी-ओ-एक्स का संप्रत्यय किसने प्रस्तावित किया?",
    option: ["मुहम्मद सुलेमान", "एस.एस. मोहसीन", "फ्रिट्ज हाइडर", "एब्राहम मसलो"],
    answer: "फ्रिट्ज हाइडर"
},
{
    question: "सामान्य अनुकूलन संलक्षण या जी.ए.एस. के संप्रत्यय को किसने प्रस्तुत किया?",
    option: ["मिम्बार्डो", "हेंस सेली", "मार्टिन सेलिगमैन", "इनमें से कोई नहीं"],
    answer: "हेंस सेली"
},
{
    question: "निम्न में से कौन कारक पूर्वधारणा को कम नहीं करता?",
    option: ["अंतर्समूह सम्पर्क", "पूर्वाग्रह विरोधी प्रचार", "शिक्षा", "रूढिबद्ध"],
    answer: "रूढिबद्ध"
},
{
    question: "किसने ‘आदर्श सकारात्मक आदर’ का संप्रत्यय दिया है?",
    option: ["फ्रायड", "मैकिन्ले", "रोजर्स", "एडलर"],
    answer: "रोजर्स"
},
{
    question: "मनोवृत्ति परिवर्तन प्रक्रिया में संज्ञानात्मक विसंवादिता का संप्रत्यय प्रतिपादित किया-",
    option: ["एब्राहम मैसलो ने", "फ्रिट्ज हाइडर ने", "लियॉन फेंस्टिंगर", "नार्मन ट्रिपलेट ने"],
    answer: "लियॉन फेंस्टिंगर"
},
{
    question: "श्रेणी आधारित स्कीमा को कहा जाता है-",
    option: ["आदि रूप", "रूढिबद्ध", "दर्शक प्रभाव", "इनमें से कोई नहीं"],
    answer: "रूढिबद्ध"
},
{
    question: "पहले प्रस्तुत की जाने वाली सूचनाओं का प्रभाव अंत में प्रस्तुत की जाने वाली सूचना से अधिक प्रबल होता है। इस प्रभाव को क्या कहते हैं?",
    option: ["प्रथम प्रभाव", "परिवेश प्रभाव", "आसन्नता प्रभाव", "कर्ता-प्रेक्षक प्रभाव"],
    answer: "प्रथम प्रभाव"
},
{
    question: "एक व्यक्ति सुव्यस्थित एवं समयनिष्ठ है फिर भी हम लोगों में यह सोचने की संभावना होती है कि उसे परिश्रमी भी होना चाहिए। यह कौन-सा प्रभाव है?",
    option: ["प्रथम प्रभाव", "परिवेश प्रभाव", "आसन्नता प्रभाव", "उपर्युक्त सभी"],
    answer: "परिवेश प्रभाव"
},
{
    question: "पी-ओ-एक्स त्रिकोण में पी कौन है?",
    option: ["वह व्यक्ति है जिसकी अभिवृत्ति का अध्ययन करता है", "एक दूसरा व्यक्ति है", "एक विषय-वस्तु है जिसके प्रति अभिवृत्ति का अध्ययन करता है है", "उपरोक्त में से कोई नहीं"],
    answer: "वह व्यक्ति है जिसकी अभिवृत्ति का अध्ययन करता है"
},
{
    question: "द्विस्तरीय संप्रत्यय के अनुसार अभिवृत्ति में परिवर्तन कितने स्तरों पर या चरणों में होता है?",
    option: ["दो", "तीन", "चार", "एक"],
    answer: "दो"
},
{
    question: "छवि निर्माण की प्रक्रिया में निम्न में से कौन भी उप-प्रक्रिया होता है?",
    option: ["चयन", "अनुमान", "संगठन", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "एक अभिवृत्ति में परिवर्तन हो सकता है-",
    option: ["सर्वसम या संगत", "सर्वमय या संगत और विसंगत", "विसंगत", "नहीं होता"],
    answer: "सर्वमय या संगत और विसंगत"
},
{
    question: "एक भारतीय वैज्ञानिक एम.एम. मोहसिन ने किस संप्रत्यय प्रतिपादित किया?",
    option: ["संतुलन का संप्रत्यय", "द्विस्तरीय संप्रत्यय", "संज्ञानात्मक विसंवादिता या संप्रत्यय", "उपरोक्त में से कोई नहीं"],
    answer: "द्विस्तरीय संप्रत्यय"
},
{
    question: "अभिवृत्ति की कौन-सी विशेषता यह इंगित करती है कि अभिवृत्ति किसी सीमा तक सकारात्मक है या नकारात्मक?",
    option: ["कर्षण-शक्ति", "चरम सीमा", "सरलता या जटिलता", "केन्द्रिकता"],
    answer: "चरम सीमा"
},
{
    question: "अभिवृत्ति के विचारपरक घटक को कहा जाता है?",
    option: ["संज्ञानात्मक पक्ष", "भावात्मक पक्ष", "व्यवहारात्मक पक्ष", "इनमें से कोई नहीं"],
    answer: "संज्ञानात्मक पक्ष"
},
{
    question: "भावात्मक पक्ष के रूप में जाना जाता है-",
    option: ["क्रियात्मक घटक", "विचारपरक घटक", "सांवेगिक घटक", "उपरोक्त सभी"],
    answer: "सांवेगिक घटक"
},
{
    question: "निम्नलिखित में से कौन-से कारक अभिवृत्तियों के अधिगम के लिए एक संदर्भ प्रदान करते हैं?",
    option: ["व्यक्तिगत अनुभव", "परिवार एवं विद्यालय का परिवेश", "संदर्भ समूह", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "वह व्यक्ति जो छवि बनाता है, उसे क्या कहते हैं?",
    option: ["लक्ष्य", "प्रत्यक्षणकर्ता", "प्रतिभागी", "स्रोत"],
    answer: "प्रत्यक्षणकर्ता"
},
{
    question: "एक स्कीमो या अन्विति योजना है।",
    option: ["मानसिक संरचना", "शारीरिक संरचना", "सामाजिक संरचना", "इनमें से कोई नहीं"],
    answer: "मानसिक संरचना"
},
{
    question: "निम्नलिखित में से कौन-सा लक्ष्य का गुण नहीं है?",
    option: ["अनुनयता", "बुद्धि", "आत्मसम्मान", "आलस्य"],
    answer: "आलस्य"
},
{
    question: "मनोवृत्ति का निर्माण निम्नांकित में से किस कारक द्वारा प्रभावित नहीं होता है?",
    option: ["सामाजिक सीखना", "विश्वसनीय सूचनाएँ", "आवश्यकता पूर्ति", "श्रोता की विशेषताएँ"],
    answer: "श्रोता की विशेषताएँ"
},
{
    question: "निम्नांकित में से कौन पूर्वाग्रह में तेजी से कमी लाता है?",
    option: ["शिक्षा", "अंतर्समूह संपर्क", "पूर्वाग्रह-विरोधी प्रचार", "सामाजिक विधान"],
    answer: "पूर्वाग्रह-विरोधी प्रचार"
},
{
    question: "निम्नलिखित में से मनोवृत्ति के विकास पर किसका प्रभाव अधिक",
    option: ["परिवार का", "बुद्धि का", "आयु का", "जाति का"],
    answer: "परिवार का"
},
{
    question: "पूर्वधारणा से मनोवृत्ति किस दृष्टिकोण से भिन्न है?",
    option: ["बैर भाव", "सम्बद्धता", "आवेष्टन", "इनमें से कोई नहीं"],
    answer: "आवेष्टन"
},
{
    question: "‘तदनुभूति’ अनुभव करने की क्षमता अधिक रखनेवालों में सबसे उपयुक्त उदाहरण है-",
    option: ["मदर टेरेसा", "हेमवती नन्दन बहुगुणा", "मेधा पाटेकर", "इनमें से कोई नहीं"],
    answer: "मदर टेरेसा"
},
{
    question: "मनोवृत्ति के भावात्मक संघटक से तात्पर्य होता है-",
    option: ["मनोवृत्ति वस्तु के प्रति भाव से", "मनोवृत्ति वस्तु के प्रति संवेग से", "मनोवृत्ति वस्तु के प्रति भाव एवं संवेग दोनों", "इनमें से किसी से भी नहीं"],
    answer: "मनोवृत्ति वस्तु के प्रति भाव एवं संवेग दोनों"
},
{
    question: "पी.ओ.एक्स मॉडल के संदर्भ में कौन कथन सही है?",
    option: ["इस मॉडल में सिर्फ एक व्यक्ति होता है", "इस मॉडल में सिर्फ दो व्यक्ति होते हैं", "इस मॉडल में सिर्फ तीन व्यक्ति होते हैं", "इस मॉडल में कम से कम"],
    answer: "इस मॉडल में सिर्फ तीन व्यक्ति होते हैं"
},
{
    question: "संज्ञानात्मक असंवादिता के सम्प्रत्यय को विकसित किया है-",
    option: ["थर्स्टन", "फेस्टिंगर", "लिकर्ट", "बोगार्डस"],
    answer: "फेस्टिंगर"
},
{
    question: "प्रो. कैली व वोलकार्ट के मतानुसार ‘समूह की निर्धारित अभिवृत्ति को समूह के नये सदस्य’ किस प्रकार ग्रहण करते हैं?",
    option: ["शीघ्रता से", "विलम्ब से", "एकजुट होकर", "इनमें से कोई नहीं"],
    answer: "शीघ्रता से"
},
{
    question: "मनोवृत्ति निर्माण के सांस्कृतिक कारक की भूमिका पर बल दिया-",
    option: ["बन्डूरा", "सुलेमान", "मीड एवं बेनेडिक्ट", "इन्सको तथा नेलसन"],
    answer: "सुलेमान"
},
{
    question: "किसी विशिष्ट समूह के प्रति नकारात्मक अभिवृत्ति को कहते हैं?",
    option: ["अभिक्षमता", "अभिरुचि", "पूर्वाग्रह", "इनमें से कोई नहीं"],
    answer: "पूर्वाग्रह"
},
{
    question: "निम्नलिखित में कौन मानसिक स्वास्थ्य का आधार है?",
    option: ["संवेगात्मक स्थिरता", "वास्तविक संज्ञान", "व्यक्तिक स्वतंत्रता", "तर्कपूर्ण चिंतन"],
    answer: "तर्कपूर्ण चिंतन"
},
{
    question: "समाजोपकारी व्यवहार प्रायः किससे प्रभावित होता है?",
    option: ["अधिगम से", "प्रतिक्रिया से", "पूर्वाग्रह से", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "‘जो हमारी सहायता करते हैं हमें उनकी सहायता अवश्य करनी चाहिए’ क्या कहलाता है?",
    option: ["पूर्वाग्रह स्थिति", "सामाजिक स्थिति", "परस्परता स्थिति", "सामूहिक स्थिति"],
    answer: "परस्परता स्थिति"
},
{
    question: "पूर्वाग्रह किसी विशेष समूह के प्रति किस बात का उदाहरण है?",
    option: ["अभिरुचि", "अभिवृत्ति", "अभिमत", "अभिक्षमता"],
    answer: "अभिवृत्ति"
},
{
    question: "सामाजिक अनन्यता की भावना समूह के प्रति कौन-सी अभिवृत्ति का बोध कराती है?",
    option: ["सकारात्मक अभिवृत्ति", "नकारात्मक अभिवृत्ति", "उत्तरात्मक अभिवृत्ति", "पूर्वाग्रहात्मक अभिवृत्ति"],
    answer: "नकारात्मक अभिवृत्ति"
},
{
    question: "आर्मन ट्रिपलेट ने कब यह पाया कि लोग दूसरों की उपस्थिति में बेहतर प्रदर्शन करते हैं?",
    option: ["सन् 1897", "सन् 1902", "सन् 1898", "उपर्युक्त में कोई नहीं"],
    answer: "सन् 1898"
},
{
    question: "व्यक्ति दूसरों की उपस्थिति में बेहतर प्रदर्शन क्यों करता है?",
    option: ["सहजता के कारण", "भाषा प्रबोधन के कारण", "परस्परता के कारण", "सामाजिक अनन्यता के कारण"],
    answer: "परस्परता के कारण"
},
{
    question: "भाव प्रबोधन क्रिया में व्यक्ति द्वारा मूल्यांकन अनुभव को कॉटरेल ने क्या नाम दिया है?",
    option: ["सहायता करना", "मूल्यांकन बोध", "प्राकृतिक विपत्तियों का सामना करना", "इनमें से कोई नहीं"],
    answer: "मूल्यांकन बोध"
},
{
    question: "‘हमें दूसरों व्यक्तियों की मदद करनी चाहिए’ इस व्यवहार को कौन-सा व्यवहार कहा जाता है?",
    option: ["समाजोन्मुखी व्यवहार", "समाजोपकारी व्यवहार", "सामाजिक व्यवहार", "इनमें से सभी"],
    answer: "समाजोपकारी व्यवहार"
},
{
    question: "विचारपरक घटक को किस नाम से जाना जाता है?",
    option: ["व्यवहारपरक", "क्रियात्मक", "भावात्मक", "संज्ञानात्मक"],
    answer: "संज्ञानात्मक"
},
{
    question: "संज्ञानात्मक, भावात्मक, व्यवहारपरक घटकों को संक्षेप में अभिवृत्ति के किस घटक के नाम से जाना जाता है?",
    option: ["ए.-बी.-सी.", "ए. बी. डी.", "ए.-सी. बी.", "ए.-डी.-बी."],
    answer: "ए.-बी.-सी."
},
{
    question: "‘व्यापक अभिवृत्ति के अन्तर्गत कितनी अभिवृत्तियाँ होती है। अभिवृत्ति की किस विशेषता का सम्बन्ध इस कथन से है?",
    option: ["केन्द्रिकता", "कर्षण शक्ति", "सरलता या जटिलता", "चरम सीमा"],
    answer: "सरलता या जटिलता"
},
{
    question: "किस सन में स्टिम्बर ने अपने अध्ययन में पाया कि शिक्षा के स्तर के बढ़ने से पूर्व-धारणा मिटने लगती है?",
    option: ["1962", "1960", "1963", "1961"],
    answer: "1961"
},
{
    question: "दूसरों की उपस्थिति में लोग कभी-कभी अधिक गलतियां करते है। निष्पादन पर दूसरों की उपस्थिति का यह खराब प्रभाव कहलाता हैं-",
    option: ["सामाजिक सरलीकरण", "सामाजिक श्रमावनयन", "सामाजिक अवरोध", "इनमें से कोई नहीं"],
    answer: "सामाजिक अवरोध"
},
{
    question: "निम्न में से कौन छवि निर्माण की प्रक्रिया में सम्मिलित नहीं है?",
    option: ["चयन", "संगठन", "भूमिका निर्वाह", "अनुमान"],
    answer: "भूमिका निर्वाह"
},
{
    question: "निम्न में से कौन समूह संरचना का तत्व नहीं है?",
    option: ["समीपता", "समानता", "असुरक्षा तथा चिंता का भाव", "अनुमान"],
    answer: "असुरक्षा तथा चिंता का भाव"
},
{
    question: "फ्रिटज हाइडर का संतुलन सिद्धान्त में P-0-X मॉडल में 0 प्रतिनिधित्व करते हैं-",
    option: ["दूसरे व्यक्ति को", "जिस व्यक्ति की मनोवृत्ति का अध्ययन किया जाता है", "दूसरे वस्तु को", "उपर्युक्त में से कोई नहीं"],
    answer: "जिस व्यक्ति की मनोवृत्ति का अध्ययन किया जाता है"
},
{
    question: "एक सामाजिक समूह की संरचना के लिए कम-से-कम कितने सदस्यों की आवश्यकता होती है?",
    option: ["पाँच", "चार", "तीन", "दो"],
    answer: "दो"
},
{
    question: "यदि एक मुसलमान अपने हिन्दू मित्र का अभिवादन दोनों हाथों को जोड़ कर करता है, तो वह ऐसा किस समूह के प्रभाव के अन्तर्गत करता है?",
    option: ["प्राथमिक", "द्वितीयक", "संदर्भ", "इनमें से कोई नहीं"],
    answer: "द्वितीयक"
},
{
    question: "परिवार एक समूह का उदाहरण है-",
    option: ["प्राथमिक", "द्वितीयक", "संदर्भ", "इनमें से कोई नहीं"],
    answer: "प्राथमिक"
},
{
    question: "निम्न में से कौन अन्र्द्वन्द्र की परिणति है-",
    option: ["उत्तम समूह संप्रेषण", "सामूहिक विश्वास की स्थिति", "द्वन्द्व कारक में वृद्धि करने की", "इनमें से कोई नहीं"],
    answer: "द्वन्द्व कारक में वृद्धि करने की"
},
{
    question: "कोलमैन के अनुसार सामाजिक प्रभाव का कौन एक प्रकार नहीं है?",
    option: ["अनुपालन", "आज्ञापालन", "तादात्मय", "आंतरीकरण"],
    answer: "अनुपालन"
},
{
    question: "निम्नांकित में कौन समूह संरचना का तत्व नहीं है?",
    option: ["भूमिका", "मानक", "पदवी", "समूह सोच"],
    answer: "समूह सोच"
},
{
    question: "‘इन द माइण्ड ऑफ मेन’ के लेखक कौन हैं?",
    option: ["टुकमैन", "डियुश", "मर्फी", "शेरिफ"],
    answer: "डियुश"
},
{
    question: "बैंडबैगन प्रभाव किसका एक कारण है?",
    option: ["समूह समग्रता", "समूह मानक", "समूह ध्रुवीकरण", "समूह सोच"],
    answer: "समूह ध्रुवीकरण"
},
{
    question: "निम्नांकित में से कौन सामाजिक प्रभाव का सबसे अप्रत्यक्ष प्रारूप होता है?",
    option: ["अनुरूपता", "आज्ञापालन", "अनुपालन", "इनमें से कोई नहीं"],
    answer: "अनुपालन"
},
{
    question: "समूह निर्माण की किस अवस्था में अंतर्समूह द्वंद्व होता है?",
    option: ["निर्माणावस्था में", "हो-हंगामा की अवस्था में", "मानक स्थापित करने की अवस्था में", "इनमें से कोई नहीं"],
    answer: "मानक स्थापित करने की अवस्था में"
},
{
    question: "निम्नलिखित में कौन अंतर द्वंद्व की परिणति है?",
    option: ["भूमिकाएँ", "प्रतिमान", "प्रतिष्ठा", "इनमें से कोई नहीं"],
    answer: "प्रतिमान"
},
{
    question: "निम्नलिखित में कौन औपचारिक समूह का उदाहरण है?",
    option: ["परिवार", "जाति", "विश्वविद्यालय", "धर्म"],
    answer: "विश्वविद्यालय"
},
{
    question: "सामाजिक स्वैराचार को किसके प्रयोगों द्वारा दर्शाया गया है?",
    option: ["शेरिफ", "स्टर्नबर्ग", "लताने", "होरेस"],
    answer: "लताने"
},
{
    question: "सामाजिक स्वैराचार सामूहिक कार्य करने में व्यक्तिगत प्रयास की-",
    option: ["अधिकता है", "कमी है", "प्रचुरता है", "इनमें से कोई नहीं"],
    answer: "कमी है"
},
{
    question: "समूह में अंतःक्रिया और विचार-विमर्श के परिणामस्वरूप समूह की प्रारंभिक स्थिति की प्रबलता को कहा जाता है-",
    option: ["समूह ध्रुवीकरण", "अनुपालन", "आज्ञापालन", "इनमें से कोई नहीं"],
    answer: "समूह ध्रुवीकरण"
},
{
    question: "सामाजिक स्वैराचार सामूहिक कार्य का एक उदाहरण है-",
    option: ["क्रिकेट का खेल", "रस्साकशी का खेल", "हॉकी का खेल", "बैंडमिंटन का खेल"],
    answer: "रस्साकशी का खेल"
},
{
    question: "निम्नलिखित में द्वंद्व समाधान की युक्ति कौन-सी है?",
    option: ["समझौता वार्ता", "अंतर-समूह संपर्क को बढ़ाना", "प्रत्यक्षण में परिवर्तन करना", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "द्वितीयक समूह के सदस्यों में-",
    option: ["संबंध अप्रत्यक्ष होते हैं", "संबंध कम निर्वैयक्तिक होते हैं", "संबंध प्रत्यक्ष होते हैं", "संबंध अधिक आकृति वाले होते हैं"],
    answer: "संबंध अप्रत्यक्ष होते हैं"
},
{
    question: "समूह दो या दो से अधिक व्यक्तियों की एक संगठित व्यवस्था होती है-",
    option: ["जो एक-दूसरे से अंत:क्रिया करते हैं", "जो परस्पर निर्भर होते हैं", "जिनकी एक जैसी अभिप्रेरणाएँ होती हैं", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "भीड़ में-",
    option: ["कोई संरचना नहीं होती है", "आत्मीयता की भावना नहीं होती है", "लोगों का व्यवहार अविवेकी होता है", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "समूह संरचना कब विकसित होती है?",
    option: ["जब सदस्य अलग-अलग क्रिया करते हैं", "जब सदस्य परस्पर अंत:क्रिया करते हैं", "जब कोई सदस्य अकेले कोई कार्य करता है", "इनमें से कोई नहीं"],
    answer: "जब सदस्य परस्पर अंत:क्रिया करते हैं"
},
{
    question: "जाति-",
    option: ["प्राथमिकता समूह के उदाहरण हैं", "द्वितीयक समूह के उदाहरण हैं", "औपचारिक समूह के उदाहरण हैं", "बाह्य समूह के उदाहरण हैं"],
    answer: "प्राथमिकता समूह के उदाहरण हैं"
},
{
    question: "समूह में लोगों के सम्मिलित होने का कारण है-",
    option: ["सुरक्षा", "प्रतिष्ठा", "आत्म-सम्मान", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "किसने समूह का वर्गीकरण प्राथमिक समूह तथा द्वितीयक समूह में किया है?",
    option: ["मैकाइवर", "आलपोर्ट", "डब्ल्यू जी समनर", "चार्ल्स कूले"],
    answer: "मैकाइवर"
},
{
    question: "एक संदर्भ समूह के लिए सर्वाधिक वांछित अवस्था है-",
    option: ["समूह का आकार", "समूह का प्रभाव", "समूह की सदस्यता", "समूह के साथ सम्बद्धता"],
    answer: "समूह के साथ सम्बद्धता"
},
{
    question: "सामाजिक समूह के निम्नलिखित किस प्रकार में सर्वाधिक एकता होती है?",
    option: ["अंत: समूह", "बाह्य समूह", "गतिशील समूह", "इनमें से कोई नहीं"],
    answer: "अंत: समूह"
},
{
    question: "समूह चिंतन का आविष्कार किसने किया?",
    option: ["इरविंग जेनिस", "सैलोवी", "जे.एम. ओझा", "वालाश"],
    answer: "इरविंग जेनिस"
},
{
    question: "अनुरूपता पर अग्रगमन प्रयोग किन मनोवैज्ञानिकों द्वारा किया गया हैं?",
    option: ["शेम्स", "शैरिफ एवं ऐश", "मेयर", "स्टर्नबर्ग"],
    answer: "शैरिफ एवं ऐश"
},
{
    question: "किसके अन्तर्गत व्यक्ति अपरिचित लोगों के आदेश का पालन करते हैं?",
    option: ["किलोग्राम", "मिलीग्राम", "सीलीग्राम", "मिलग्राम"],
    answer: "मिलग्राम"
},
{
    question: "सभी प्रयोज्यों में कितने प्रतिशत ने सम्पूर्ण आज्ञापालन को प्रदर्शित किया?",
    option: ["65 प्रतिशत", "70 प्रतिशत", "64 प्रतिशत", "60 प्रतिशत"],
    answer: "65 प्रतिशत"
},
{
    question: "अनुरूपता सामाजिक प्रभाव का कौन-सा रूप है?",
    option: ["प्रत्यक्ष रूप", "प्रत्यक्ष एवं अप्रत्यक्ष", "अप्रत्यक्ष रूप", "इनमें में से कोई नहीं"],
    answer: "अप्रत्यक्ष रूप"
},
{
    question: "आज्ञापालन सामाजिक प्रभाव का कौन-सा रूप है?",
    option: ["अप्रत्यक्ष रूप", "प्रत्यक्ष रूप", "प्रत्यक्ष एवं अप्रत्यक्", "इनमें से कोई नहीं"],
    answer: "प्रत्यक्ष रूप"
},
{
    question: "अनुपालन सामाजिक प्रभाव का कौन-सा रूप है?",
    option: ["अप्रत्यक्ष रूप", "प्रत्यक्ष रूप", "प्रत्यक्ष व अप्रत्यक्ष का मध्य रूप", "इनमें से कोई नहीं"],
    answer: "प्रत्यक्ष व अप्रत्यक्ष का मध्य रूप"
},
{
    question: "दो व्यक्तियों के समूह को किस समूह के अंतर्गत रखा जा सकता है?",
    option: ["संगठित समूह", "द्वितीयक समूह", "प्राथमिक समूह", "अस्थायी समूह"],
    answer: "प्राथमिक समूह"
},
{
    question: "विचारों, प्रेरणाओं, आवश्यकताओं अथवा उद्देश्यों के परस्पर विरोध के फलस्वरूप पैदा हुई विक्षोभ या तनाव की स्थिति क्या कहलातीहै?",
    option: ["द्वन्द्व", "तर्क", "कुण्ठी", "दमन"],
    answer: "द्वन्द्व"
},
{
    question: "कब से कब तक राष्ट्रपति लिंडन जॉनसन और संयुक्त राष्ट्र में उनके सलाहकारों ने वियतनाम युद्ध को आगे बढ़ाया था?",
    option: ["1965 से 1968 तक", "1963 से 1966 तक", "1967 से 1969 तक", "1964 से 1967 तक"],
    answer: "1965 से 1968 तक"
},
{
    question: "निम्नलिखित में कौन द्वितीयक समूह नहीं है?",
    option: ["परिवार", "विद्यालय", "राजनैतिक दल", "क्लब"],
    answer: "परिवार"
},
{
    question: "सामाजिक प्रभाव के समूह प्रभाव प्रक्रमों में निम्नलिखित में से कौन-सा एक शमिल है?",
    option: ["अनुपालना", "आंतरिकीकरण", "अनुपंथीकरण", "इनमें से कोई नहीं"],
    answer: "अनुपालना"
},
{
    question: "सामाजिक प्रभाव का कौन एक प्रक्रिया निम्नांकित में से नहीं है?",
    option: ["अनुरूपता", "अनुपालन", "आज्ञापालन", "सामाजिक श्रमावनयन"],
    answer: "सामाजिक श्रमावनयन"
},
{
    question: "स्टोकोल्स नामक मनोवैज्ञानिक ने किस सन् में तीन उपागमों का वर्णन किया?",
    option: ["1990", "1980", "1989", "1991"],
    answer: "1990"
},
{
    question: "जीवन की गुणवत्ता को खराब बना रहे हैं-",
    option: ["शोर", "प्रदूषण", "भीड़", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "वैयक्तिक दूरी कितने फीट से लेकर कितने फीट तक होती है?",
    option: ["15 इंच से 7 फीट", "4 फीट से 12 फीट", "18 इंच से 4फीट", "10 इंच से 6 फीट"],
    answer: "18 इंच से 4फीट"
},
{
    question: "4 फीट से लेकर 25 फीट तक की दूरी कौन-सी होती है?",
    option: ["सामाजिक दूरी", "सार्वजनिक दूरी", "वैयक्तिक दूरी", "अन्तरंग दूरी"],
    answer: "सार्वजनिक दूरी"
},
{
    question: "प्रत्यक्षित असमता द्वन्द्व का कौन-सा कारण है?",
    option: ["दूसरा", "पहला", "चौथा", "तीसरा"],
    answer: "दूसरा"
},
{
    question: "किस मनोवैज्ञानिक के अध्ययन ने यह प्रदर्शित किया कि उच्चकोटि लक्ष्यों का निर्धारण करके अन्तर-समूह द्वन्द्व को कम कर सकता है?",
    option: ["वालाश", "शेरिफ", "वाकर मेंहदी", "पासी"],
    answer: "शेरिफ"
},
{
    question: "निम्नलिखित में से कौन सामजिक प्रभाव उत्पन्न करते हैं?",
    option: ["मित्र", "रेडियो", "टेलीविजन", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "निम्नलिखित में से किसमें प्रोत्साहक परस्पर निर्भरता पाई जाती है-",
    option: ["सहयोगी पारितोषिक संरचना", "प्रतिस्पर्धात्मक पारितोषिक संरचना", "अंतर्वैयक्तिक संप्रेषण", "इनमें से कोई नहीं"],
    answer: "सहयोगी पारितोषिक संरचना"
},
{
    question: "किस मनोवैज्ञानिक ने समूह के पाँच अनुक्रमों को बताया था?",
    option: ["टकमैन", "इरविंग जेनिस", "जेनिस", "ऐश"],
    answer: "टकमैन"
},
{
    question: "निम्न में से कौन अनुरूपता का निर्धारक है?",
    option: ["समूह का आकार", "समूह का संघटन", "समूह की शक्ति", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "विद्यार्थी को महाविद्यालय में निर्धारित ड्रेस में जाना, खेल के मैदान में खेल के नियमों को अपनाना आदि उदाहरण हैं-",
    option: ["अनुपालन", "अनुरूपता", "आज्ञापालन", "इनमें से कोई नहीं"],
    answer: "आज्ञापालन"
},
{
    question: "चाटुकारिता, पारस्परिकता तथा बहु अनुरोध प्रविधियाँ हैं-",
    option: ["अनुरूपता के", "अनुपालन के", "आज्ञापालन के", "इनमें से कोई नहीं"],
    answer: "अनुपालन के"
},
{
    question: "इनमें से कौन समानुभूति की विशेषता नहीं है?",
    option: ["समानुभूति आधारित सहज सम्बन्ध", "संवाद में एकरूपता", "लाभार्थी के मानसिक जगत को लगभग पूरी तरह से समझ पाने का अनुभव", "सहानुभूति"],
    answer: "सहानुभूति"
},
{
    question: "उच्चतम संगठित समूह है-",
    option: ["देश", "परिवार", "सेना", "औद्योगिक संगठन"],
    answer: "देश"
},
{
    question: "समूह ध्रुवीकरण से संप्रत्यय का प्रतिपादन किसके द्वारा किया गया?",
    option: ["फ्रेशनर तथा म्यूलर", "फ्रेशनर एवं शेल्डन", "मोसकोविसी एवं फ्रेजर", "इनमें से कोई नहीं"],
    answer: "फ्रेशनर एवं शेल्डन"
},
{
    question: "शोर या ध्वनि को नापने के लिए किस इकाई का प्रयोग किया जाता है?",
    option: ["बेल", "माइक्रोबेल", "डेसीबेल", "डी.पी."],
    answer: "डेसीबेल"
},
{
    question: "शुद्ध वायु कहलाती है-",
    option: ["78.98%N₂, 20.94%O₂ तथा 0.03%CO₂", "20.94%N₂, 78.98%O₂ तथा 0.03%CO₂", "60.30%N₂, 39.20%O₂ तथा 0.03%CO₂", "इनमें से कोई नहीं"],
    answer: "78.98%N₂, 20.94%O₂ तथा 0.03%CO₂"
},
{
    question: "सड़क, बोध आदि उदाहरण हैं-",
    option: ["पर्यावरण का", "निर्मित पर्यावरण का", "प्राकृतिक पर्यावरण का", "इनमें से कोई नहीं"],
    answer: "निर्मित पर्यावरण का"
},
{
    question: "भारतीय परिप्रेक्ष्य में निर्धन किसे कहेंगे?",
    option: ["आमदनी कम एवं जीवन अपर्याप्त हो", "आमदनी अधिक हो पर आवश्यकता कम हो", "आमदनी और आवश्यकता दोनों अधिक हो", "इनमें से कोई नहीं"],
    answer: "आमदनी कम एवं जीवन अपर्याप्त हो"
},
{
    question: "पर्यावरणीय मनोवैज्ञानिकों ने पर्यावरण संरक्षण के किस माध्यम पर बल दिया है?",
    option: ["पूर्व व्यवहार अनुबोधक", "पश्च व्यवहार पुनर्बलन", "पर्यावरणीय शिक्षा", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "प्लास्टिक थैलों का उपयोग पर्यावरण के लिए एक बड़ी समस्या है, क्योंकि प्लास्टिक थैले-",
    option: ["जैविक क्षरणशील होते हैं", "जैविक अक्षरणशील होते हैं", "ज्वलनशील होते हैं", "उपर्युक्त सभी होते हैं"],
    answer: "जैविक अक्षरणशील होते हैं"
},
{
    question: "निम्नलिखित में से कौन-से निर्मित पर्यावरण के उदाहरण हैं?",
    option: ["नगर", "बाँध", "पुल", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "मानव-निर्मित विपदा के उदाहरण नहीं हैं-",
    option: ["युद्ध", "कारखानों में विषैले गैस का रिसाव", "महामारी", "तूफान"],
    answer: "तूफान"
},
{
    question: "मानव-पर्यावरण सम्बन्ध का विवरण प्रस्तुत करने के लिए निम्न में किस मनोवैज्ञानिक ने तीन उपागमों का वर्णन किया?",
    option: ["स्टोकोल्स", "जॉन डोलॉर्ड", "एलबर्ट बंदूरा", "एडवर्ड हॉल"],
    answer: "स्टोकोल्स"
},
{
    question: "अवशिष्ट पदार्थ जो जैविक रूप से क्षरणशील नहीं होते-",
    option: ["प्लास्टिक", "धातु से बने पात्र", "टीन", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "निम्न में से किन कारणों से अभिघातज उत्तर दबाव विकार उत्पन्न होते हैं-",
    option: ["शोर", "प्राकृतिक विपदाएँ", "प्रदूषण", "भीड़"],
    answer: "प्राकृतिक विपदाएँ"
},
{
    question: "अंतर्वैयक्तिक भौतिक दूरी में व्यक्ति किस प्रकार की दूरी बनाए रखता है?",
    option: ["भौतिक (शारीरिक)", "आर्थिक", "मानसिक", "इनमें से कोई नहीं"],
    answer: "भौतिक (शारीरिक)"
},
{
    question: "दबाव एक स्थिति है-",
    option: ["मनोवैज्ञानिक", "सामाजिक", "आर्थिक", "इनमें से कोई नहीं"],
    answer: "मनोवैज्ञानिक"
},
{
    question: "सी.एफ.सी. या क्लोरो-फ्लोरो कार्बन किसे प्रदूषित करते हैं?",
    option: ["मृदा", "जल", "वायु", "इनमें से कोई नहीं"],
    answer: "वायु"
},
{
    question: "कार्य निष्पादन पर शोर के प्रभाव को शोर की कौन-सी विशेषता निर्धारित करती है?",
    option: ["शोर की तीव्रता", "भविष्य कथनीयता", "नियंत्रणीयता", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "भोपाल गैस त्रासदी कब हुई थी?",
    option: ["दिसंबर, 1984", "दिसंबर, 1986", "मई, 1984", "जनवरी, 1981"],
    answer: "दिसंबर, 1984"
},
{
    question: "पर्यावरण के विषय में पारंपरिक भारतीय दृष्टिकोण किस परिप्रेक्ष्य को मान्यता देता है?",
    option: ["अल्पतमवादी परिप्रेक्ष्य", "नैमित्तिक परिप्रेक्ष्य", "आध्यात्मिक परिप्रेक्ष्य", "इनमें से सभी"],
    answer: "आध्यात्मिक परिप्रेक्ष्य"
},
{
    question: "उत्तराखंड क्षेत्र के ‘चिपको आंदोलन’ मानव-पर्यावरण संबंध में किस परिप्रेक्ष्य का उदाहरण है?",
    option: ["आध्यात्मिक परिप्रेक्ष्य", "नैमित्तिक परिप्रेक्ष्य", "अल्पतमवादी परिप्रेक्ष्य", "इनमें से कोई नहीं"],
    answer: "आध्यात्मिक परिप्रेक्ष्य"
},
{
    question: "निम्न में से कौन पर्यावरणी दबाव कारकों के उदाहरण हैं?",
    option: ["शोर", "भीड़", "प्राकृतिक विपदाएँ", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "‘पर्यावरण को क्षतिग्रस्त करना’ मानव पर्यावरण संबंध के किस परिप्रेक्ष्य को दर्शाता है?",
    option: ["अल्पमतवादी परिप्रेक्ष्य", "नैमित्तिक परिप्रेक्ष्य", "आध्यात्मिक परिप्रेक्ष्य", "इनमें से कोई नहीं"],
    answer: "नैमित्तिक परिप्रेक्ष्य"
},
{
    question: "पर्यावरण-उन्मुख व्यवहार नहीं है-",
    option: ["पर्यावरण की समस्याओं से संरक्षण करना", "पर्यावरण को नष्ट करना", "स्वस्थ पर्यावरण को उन्नत करना", "पर्यावरण मित्र वस्तुओं का उपयोग करना"],
    answer: "पर्यावरण को नष्ट करना"
},
{
    question: "किस मनोवैज्ञानिक ने स्थिति पर निर्भरता के आधार पर चार प्रकार की अंतर्वयक्तिक दूरी को बताया है?",
    option: ["जॉन डोलॉर्ड", "स्टोकोल्स", "एडवर्ड हॉल", "एलबर्ट बंदूरा"],
    answer: "एडवर्ड हॉल"
},
{
    question: "निम्न में से किस पर निर्धनता तथा वंचन का प्रतिकूल प्रभाव पड़ता है?",
    option: ["अभिप्रेरणा", "संज्ञानात्मक प्रक्रियाओं", "व्यक्तित्व", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "निम्नलिखित में से अन्तर्राष्ट्रीय समूह कौन-सा है?",
    option: ["ऐक्शन एड", "सेवर्शन एड", "वॅवशन एड", "इनमें से कोई नहीं"],
    answer: "ऐक्शन एड"
},
{
    question: "किस मनोवैज्ञानिक ने अध्ययन द्वारा आक्रमकता के अधिगम में मॉडल की भूमिका को प्रदर्शित किया है?",
    option: ["वुडवर्थ", "जॉन स्मिथ", "वुण्ट", "एलबर्ट बंदूरा"],
    answer: "एलबर्ट बंदूरा"
},
{
    question: "प्राकृतिक विपदाएँ निम्नलिखित में से कौन-सी हैं?",
    option: ["भूकम्प", "बाढ़", "तूफान", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "किस वैज्ञानिक ने कुंठा आक्रामकता सिद्धान्त का परीक्षण करने के लिए अध्ययन किया?",
    option: ["जान डोलार्ड", "स्मिथ", "एलबर्ट बंदूरा", "जॉन"],
    answer: "जान डोलार्ड"
},
{
    question: "एच.आई.वी, किसे कहते हैं?",
    option: ["मलेरिया", "जुकाम", "एड्स", "कैंसर"],
    answer: "एड्स"
},
{
    question: "अमेरिकी मनोवैज्ञानिक संघ ने किस सन में कार्यदल की स्थापना की थी?",
    option: ["1973", "1974", "1975", "1972"],
    answer: "1973"
},
{
    question: "सामान्यतः हमें कितने प्रकार के मनोवैज्ञानिक चाहिए?",
    option: ["एक", "चार", "तीन", "दो"],
    answer: "दो"
},
{
    question: "साक्षात्कार कौशल वह साधन है जिसके द्वारा मौखिक अथवा लिखित वार्तालापों की अभिव्यक्ति होती है। यह कथन किसने लिखा है?",
    option: ["सी-आइजनेक", "जे.पी. दास", "व्हाइट", "ट्राम्स"],
    answer: "सी-आइजनेक"
},
{
    question: "किस अवस्था में साक्षात्कारदाता से उन प्रश्नों को पूछा जाता है जो कि साक्षात्कार के उद्देश्य को पूरा करते हैं?",
    option: ["प्रारम्भिक अवस्था", "मुख्य भाग या मध्य अवस्था", "समापन अवस्था", "उपर्युक्त सभी"],
    answer: "मुख्य भाग या मध्य अवस्था"
},
{
    question: "किस देश के मनोवैज्ञानिक संघ द्वारा गठित कार्य दल कौशलों के तीन सुमुच्चय हैं?",
    option: ["चीन", "जापान", "फ्रांस", "अमेरिका"],
    answer: "अमेरिका"
},
{
    question: "परामर्श के सम्बन्ध होता है-",
    option: ["सामाजिक", "सहायतापरक", "व्यक्तिपरक", "वस्तुपरक"],
    answer: "सहायतापरक"
},
{
    question: "प्रभावी परामर्शदाता के आवश्यक गुण होते हैं-",
    option: ["प्रामाणिकता एवं पुनर्वाक्यविन्यास", "दूसरों के प्रति सकारात्मकता", "तद्नुभूति", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "परामर्शदाता के अन्दर एक सर्वाधिक महत्वपूर्ण कौशल होता है-",
    option: ["तद्नुभूति", "वैयक्तिक मूल्यांकन", "सहायताग्राह्यता", "इनमें से कोई नहीं"],
    answer: "तद्नुभूति"
},
{
    question: "सेवार्थी-परामर्शदाता का सम्बन्ध होता है-",
    option: ["सामाजिक आधार", "व्यावसायिक आधार", "राजनैतिक आधार", "नैतिक आधार"],
    answer: "नैतिक आधार"
},
{
    question: "प्रभावी मनोवैज्ञानिक के रूप में विकसित होने के लिए जरूरी है-",
    option: ["अखण्डता का होना", "सक्षमता का होना", "सार्थकता व वैज्ञानिकता", "उपयुक्त सभी"],
    answer: "सक्षमता का होना"
},
{
    question: "परामर्श सम्बन्धी अनुक्रिया को सेवार्थी के प्रति करना होता है-",
    option: ["विचारों के प्रति", "क्रियाओं के प्रति", "भावनाओं के प्रति", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "संदेशों के प्रति जानकारी एवं संवेदनशीलता परामर्शदाता के लिए आवश्यक है-",
    option: ["प्रभाविता के लिए", "सामाजिकता के लिए", "विषयपरकता के लिए", "इनमें से कोई नहीं"],
    answer: "प्रभाविता के लिए"
},
{
    question: "प्रभावी संप्रेक्षण की प्रति प्राप्त की जा सकती है-",
    option: ["उचित संदेश द्वारा", "पर्यावरणीय शोर नियंत्रित करके", "कुशलता का प्रयोग करके", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "श्रवण प्रक्रिया का एक प्रारम्भिक चरण है,",
    option: ["संदेश को संप्रेषित करना", "संदेश प्रक्रिया अपनाना", "उद्दीपक या संदेश का अभिग्रहण करना", "संदेश ग्रहण कर भण्डारण करना"],
    answer: "उद्दीपक या संदेश का अभिग्रहण करना"
},
{
    question: "पर्यावरणीय मनोवैज्ञानिक किन माध्यमों द्वारा पर्यावरण संरक्षण पर बल देते हैं।",
    option: ["पर्यावरणीय शिक्षा", "पूर्व व्यवहार अनुबोधक", "पश्च व्यवहार पुनर्बलन", "इनमें से सभी"],
    answer: "पर्यावरणीय शिक्षा"
},
{
    question: "ग्रिफ्रिट का योगदान निम्नलिखित में से किस क्षेत्र में है?",
    option: ["प्रकाश", "शोरगुल", "वायु-प्रदूषण", "तापमान"],
    answer: "तापमान"
},
{
    question: "विश्व पर्यावरण दिवस मनाया जाता है-",
    option: ["5 अप्रैल", "5 मई", "5 जून", "5 जुलाई"],
    answer: "5 जून"
},
{
    question: "भूकम्प एक संकट है-",
    option: ["प्राकृतिक", "राजनैतिक", "सामाजिक", "धार्मिक"],
    answer: "प्राकृतिक"
},
{
    question: "जिन प्रक्रिया द्वारा व्यक्ति अपने वातावरण के सतत् आवाज के साथ समंजन स्थापित कर लेता है, उसे कहा जाता है-",
    option: ["अभ्यसन", "सीखना", "आदत बनाना", "इनमें से कोई नहीं"],
    answer: "अभ्यसन"
},
{
    question: "मनोविज्ञान की वह शाखा जो मानव-पर्यावरण अन्तःक्रियाओं का अध्ययन करती है-",
    option: ["पर्यावरणीय मनोविज्ञान", "समाज-पर्यावरण मनोविज्ञान", "समाज मनोविज्ञान", "बाल मनोविज्ञान"],
    answer: "पर्यावरणीय मनोविज्ञान"
},
{
    question: "वातावरणीय प्रदूषण किस रूप में हो सकता है?",
    option: ["वायु प्रदूषण", "जल प्रदूषण", "मिट्टी प्रदूषण", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "आक्रमण को किसने इस रूप में प्रमाणित किया है? आक्रमण से तात्पर्य दूसरों के प्रति किए गए सभिप्राय क्षति से होता है”",
    option: ["हिलगार्ड", "फ्रायड", "बर्कोबिट्ज", "इनमें से कोई नहीं"],
    answer: "फ्रायड"
},
{
    question: "सहभागी प्रेक्षण का मुख्य गुण",
    option: ["स्वाभाविकता", "लचीलापन", "परिशुद्धता", "वस्तुनिष्ठता"],
    answer: "लचीलापन"
},
{
    question: "किस प्रेक्षण में प्रेक्षक, प्रेक्षित समूह के साथ घुल मिल कर घटना का अवलोकन प्राकृतिक रूप से करता है?",
    option: ["सहभागी", "असहभागी", "प्रकृतिवादी", "इनमें से कोई नहीं"],
    answer: "सहभागी"
},
{
    question: "साक्षात्कार का उद्देश्य है-",
    option: ["आमने-सामने के सम्पर्क से सूचना प्राप्त करना", "परिकल्पनाओं के स्रोत", "अवलोकन के लिए अवसर पाना", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "मनोविज्ञान की वस्तुनिष्ठ निरीक्षण विधि का प्रवर्तक कौन है?",
    option: ["उंट", "विलियम जेम्स", "वाटसन", "इनमें से कोई नहीं"],
    answer: "उंट"
},
{
    question: "आमने-सामने का संबंध आवश्यक है-",
    option: ["प्रश्नावली विधि में", "साक्षात्कार विधि में", "केसू अध्ययन विधि में", "रेटिंग विधि में"],
    answer: "साक्षात्कार विधि में"
},
{
    question: "निम्नलिखित में से कौन संचार का तत्व नहीं है?",
    option: ["बोलना", "सुनना", "शारीरिक भाषा", "परानुभूति"],
    answer: "परानुभूति"
},
{
    question: "एक साक्षात्कार में एक पूर्व निर्धारित अनुगमन किया जाता है।…….. प्रश्न शृंखला का",
    option: ["असंरचित", "अर्द्ध संरचित", "आभासी संरचित्", "संरचित"],
    answer: "संरचित"
},
{
    question: "निम्नलिखित में किसे मनोविज्ञान में मूल्यांकन विधि के यंत्र के रूप में नहीं समझा जाता है?",
    option: ["मनोवैज्ञानिक परीक्षण", "केस अध्ययन", "मनश्चिकित्सा", "साक्षात्कार"],
    answer: "मनश्चिकित्सा"
},
{
    question: "निम्नांकित में से कौन प्रभावी परामर्शदाता का गुण नहीं है?",
    option: ["परानुभूति", "प्रामाणिकता", "भावानुवाद", "सशर्त सम्मान"],
    answer: "सशर्त सम्मान"
},
{
    question: "एक प्रभावी मनोवैज्ञानिक बनने के लिए किस तरह के कौशल की जरूरत होती है?",
    option: ["सामान्य कौशल", "प्रेक्षणात्मक कौशल", "विशिष्ट कौशल", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "व्यक्ति के शारीरिक हावभाव किस श्रेणी का कौशल है?",
    option: ["परामर्श कौशल", "मनोवैज्ञानिक परीक्षण कार्य कौशल", "साक्षात्कार कार्य कौशल", "संचार कौशल"],
    answer: "संचार कौशल"
},
{
    question: "अंतर्वैयक्तिक संप्रेक्षण संबंधित होता है-",
    option: ["स्वयं से", "दो या दो से अधिक व्यक्तियों से", "जनसभा से", "भीड़ से"],
    answer: "दो या दो से अधिक व्यक्तियों से"
},
{
    question: "अंतर्वैयक्तिक संप्रेषण के प्रकार हैं-",
    option: ["साक्षात्कार", "मध्यस्थ आधारित वार्तालाप", "लघु समूह परिचर्चा", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "प्रेक्षण का वह तरीका जिससे हम सिखते हैं कि लोग भिन्न परिस्थितियों में कैसे व्यवहार करते हैं, कहलाता है-",
    option: ["प्रकृतिवादी प्रेक्षण", "सामान्य प्रेक्षण", "सहभागी प्रेक्षण", "इनमें से कोई नहीं"],
    answer: "प्रकृतिवादी प्रेक्षण"
},
{
    question: "मनोवैज्ञानिक अपने परिवेश के किन पक्षों के विभिन्न पहलुओं के बारे में प्रेक्षण करता है?",
    option: ["घटनाएँ", "व्यक्ति", "दोनों", "इनमें से कोई नहीं"],
    answer: "दोनों"
},
{
    question: "अपनी बातों को रेडियो या टेलीविजन के माध्यम से वक्ता द्वारा कहने को कहते हैं-",
    option: ["सार्वजनिक संप्रेषण", "अंतरावैयक्तिक संप्रेषण", "अंतर्वैयक्तिक स्रपेक्षण", "इनमें से कोई नहीं"],
    answer: "सार्वजनिक संप्रेषण"
},
{
    question: "गरम स्टोव को छूने पर अंगुलियों का खींचना और हमारी आँखों में आँसू आना किसका उदाहरण है-",
    option: ["वाचिक संप्रेषण", "अवाचिक संप्रेषण", "भाषायी संप्रेषण", "इनमें से कोई नहीं"],
    answer: "अवाचिक संप्रेषण"
},
{
    question: "संप्रेषण एक प्रक्रिया है-",
    option: ["सचेतन", "अचेतन", "साभिप्राय", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "व्यक्ति की स्वयं से संवाद करने की क्रिया को कहते हैं-",
    option: ["अन्तयर्वैयक्तिक संप्रेषण", "अंतर्वैयक्तिक संप्रेषण", "सार्वजनिक संप्रेषण", "इनमें से कोई नहीं"],
    answer: "अन्तयर्वैयक्तिक संप्रेषण"
},
{
    question: "अमेरिकी मनोवैज्ञानिक संघ के ने एक कार्यदल गठित किया जिसका उद्देश्य किनके लिए आवश्यक कौशलों की पहचान करना था?",
    option: ["समाजशास्त्रियों", "व्यावसायिक मनोवैज्ञानिकों", "अर्थशास्त्रियों", "इनमें से कोई नहीं"],
    answer: "व्यावसायिक मनोवैज्ञानिकों"
},
{
    question: "श्रवण प्रक्रिया में किन अंगों की भूमिका नहीं होती है?",
    option: ["कान", "मस्तिष्क", "नाक", "आँख"],
    answer: "नाक"
},
{
    question: "शरीर भाषा में निम्न में से कौन-से कारक शामिल हैं?",
    option: ["हावभाव", "हाथ की गति", "भंगिमा", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "साक्षात्कार के किस भाग में साक्षात्कारकर्ता सूचना और प्रदत्त प्राप्त करने के उद्देश्य से प्रश्न पूछता है?",
    option: ["प्रारंभ", "मुख्य भाग", "समापन", "इनमें से कोई नहीं"],
    answer: "मुख्य भाग"
},
{
    question: "मनोवैज्ञानिक परीक्षणों का उपयोग करते समय आवश्यक है-",
    option: ["वस्तुनिष्ठता", "वैज्ञानिक उन्मुखता", "मानकीकृत व्याख्या", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "श्रवण में कौन-सी विशेषता नहीं होनी चाहिए?",
    option: ["धैर्यवान", "अधैर्यवान", "अनिर्णयात्मक", "ध्यान सक्रियता"],
    answer: "अधैर्यवान"
},
{
    question: "सुनने वाला द्वारा हमारी की गई बातों को अपनी समझ से बातों या विचारों को पुनर्कथित कहलाता है-",
    option: ["पुनर्वाक्यविन्यास", "अभिग्रहण", "ध्यान", "आरोपण"],
    answer: "पुनर्वाक्यविन्यास"
},
{
    question: "एक प्रेक्षणकर्ता द्वारा उसी शॉपिंग मॉल की दुकान में अंशकालिक नौकरी लेकर अंदर का व्यक्ति बनकर ग्राहकों के व्यवहार में भिन्नताओं का प्रेक्षण कहलाता है-",
    option: ["प्रकृतिवादी प्रेक्षण", "सहभागी प्रेक्षण", "आत्म प्रत्यक्षण", "मूल्यांकन प्रेक्षण"],
    answer: "सहभागी प्रेक्षण"
},
{
    question: "एक प्रभावी परामर्शदाता के गुणे नहीं हैं.",
    option: ["प्रामाणिकता", "दूसरों के प्रति सकारात्मक आदर", "तद्नुभूति की योग्यता", "दूसरों के प्रति सकारात्मक अनादूर"],
    answer: "दूसरों के प्रति सकारात्मक अनादूर"
},
{
    question: "साक्षात्कार की तीन अवस्थाएँ होती हैं, निम्नांकित में कौन उन अवस्थाओं में नहीं है?",
    option: ["प्रारंभिक तैयारी", "प्रश्नोत्तर काल", "समापन की अवस्थाएँ", "संबंध बनाने की अवस्थाएँ"],
    answer: "संबंध बनाने की अवस्थाएँ"
},
{
    question: "किस प्रेक्षण से प्रेक्षक, प्रेक्षित समूह के साथ घुल मिल कर घटना का अवलोकन करता है?",
    option: ["सहभागी", "असहभागी", "प्रकृतिवादी", "इनमें से कोई नहीं"],
    answer: "सहभागी"
},
{
    question: "दो या अधिक व्यक्तियों के बीच वार्तालाप और अन्तःक्रिया है-",
    option: ["परीक्षण", "साक्षात्कार", "परामर्श", "प्रयोग"],
    answer: "साक्षात्कार"
},
{
    question: "संचार कौशल के लिए कौन-सा कौशल अनिवार्य नहीं है?",
    option: ["पेभावी बोलना", "प्रभावी ढंग से सुनना", "अशाब्दिक संचार", "सांवेगिक स्थिरता"],
    answer: "अशाब्दिक संचार"
},
{
    question: "संचार कूट संकेतन की विशेषता कौन है?",
    option: ["कूट संकेतन में व्यक्ति अपनी अनुभूति में परिवर्तन लाता है।", "कूट संकेतन में व्यक्ति अपनी सांवेगिक उत्तेजना पर नियंत्रण करता है।", "कूट संकेतन में व्यक्ति अपने विचारों को विशेष अर्थ प्रदान करता है।", "कूट संकेतन में व्यक्ति अपनी भावनाओं को विकसित करता है।"],
    answer: "कूट संकेतन में व्यक्ति अपने विचारों को विशेष अर्थ प्रदान करता है।"
},
{
    question: "किस कौशल को तीन भागों में विभाजित किया गया है?",
    option: ["सामान्य कौशल", "आधारभूत कौशल", "विशिष्ट कौशल", "परामर्श कौशल"],
    answer: "आधारभूत कौशल"
},
{
    question: "किस कौशल का उपयोग मनोवैज्ञानिक व्यवहार के विषय में अन्तर्दृष्टि का विकास करने हेतु प्रारम्भिक अवस्था में किया जाता है?",
    option: ["प्रेक्षण कौशल", "विशिष्ट कौशल", "परीक्षण कौशल", "परामर्श कौशल"],
    answer: "प्रेक्षण कौशल"
},
{
    question: "श्रवण प्रक्रिया का एक प्रारम्भिक चरण है-",
    option: ["संदेश को संप्रेषित करना", "संदेश प्रक्रिया अपनाना", "उद्दीपक या संदेश का अभिग्रहण करना", "संदेश ग्रहण कर भण्डारण करना"],
    answer: "उद्दीपक या संदेश का अभिग्रहण करना"
},
{
    question: "साक्षात्कार कौशल एक प्रक्रिया है-",
    option: ["मुखोन्मुख वार्तालाप", "दूरभाष वार्तालाप", "प्रश्नावली भरना", "अनुसूची की प्रक्रिया"],
    answer: "मुखोन्मुख वार्तालाप"
},
{
    question: "साक्षात्कार में कौन चरण नहीं है?",
    option: ["प्रारंभिक तैयारी", "साक्षात्कार में संबंध को प्रगाढ़ता", "साक्षात्कार का संचालन या प्रश्नोत्तर सत्र", "साक्षात्कार समापन"],
    answer: "साक्षात्कार में संबंध को प्रगाढ़ता"
},
{
    question: "इनमें से कौन परामर्श की प्रविधियाँ नहीं है?",
    option: ["निर्देशक परामर्श", "अनिर्देशक परामर्श", "समझौतावादी परामर्श", "प्रोत्साहन परामर्श"],
    answer: "प्रोत्साहन परामर्श"
},

];

// English Questions
const psychologyEnglish = [
{
    question: "buddhi of vissy on shodh function doing which before mnovaiknowledgeik thaa",
    option: ["bine", "spiiyrmain", "thoNmsn", "gilphordd"],
    answer: "bine"
},
{
    question: "sNvegaatmk buddhi’ pd of prtipaadn who done?",
    option: ["gaalttn", "vudd and vudd", "sailove and meyr", "None of these"],
    answer: "sailove and meyr"
},
{
    question: "who buddhi to one saarvbhaumik capacity maanaa is?",
    option: ["veshlr", "bine", "gaarddnr", "None of these"],
    answer: "veshlr"
},
{
    question: "thrsttn according to, buddhi in how many primary mental yogytaaeN upsthit occursN?",
    option: ["5", "6", "7", "8"],
    answer: "7"
},
{
    question: "following in which one person of shiilgunn is?",
    option: ["buddhi", "abhiprernnaa", "sRjnaatmktaa", "sNveg"],
    answer: "buddhi"
},
{
    question: "jin vyktiyoN of buddhi-lbdhi 90 from 100 between occurs, unheN called are-",
    option: ["water", "muuddh'", "normal", "prtibhaashaalii"],
    answer: "normal"
},
{
    question: "who said ki ‘amuurt cintn of yogytaa only buddhi is?",
    option: ["bine", "ttrmn", "rebr", "None of these"],
    answer: "rebr"
},
{
    question: "jin vyktiyoN of buddhi-lbdhi 80 from 89 between occurs, unheN called are-",
    option: ["prtibhaashaalii", "muuddh'", "sust", "average"],
    answer: "muuddh'"
},
{
    question: "kisn buddhi lbdhi of sNprtyy to viksit done?",
    option: ["bine", "ttrmn", "sttrn", "saaimn"],
    answer: "sttrn"
},
{
    question: "person of life in success of what percentage sNvegaatmk buddhi from determined is?",
    option: ["approximately 60 percent", "approximately 70 percent", "approximately 80 percent", "approximately 100 percent"],
    answer: "approximately 80 percent"
},
{
    question: "primary mental yogytaa of principle who prstut done?",
    option: ["likrtt", "gilphordd", "thrsttn", "gaarddnr"],
    answer: "thrsttn"
},
{
    question: "In which year buddhi of near moNddle viksit was?",
    option: ["1984", "1994", "1954", "1964"],
    answer: "1994"
},
{
    question: "mental age of sNprtyy to who viksit done?",
    option: ["bine", "sttrn", "ttrmn", "bine and saaimn"],
    answer: "bine"
},
{
    question: "buddhi of kinke principle to one-kaarkiiy principle said was is?",
    option: ["gilphordd", "jensn", "thrsttn", "bine"],
    answer: "bine"
},
{
    question: "which children of buddhi lbdhi 35-49 occurs, use which shrennii in rkhaa jaa can is?",
    option: ["saumy mental durbltaa", "saadhaarnn mental durbltaa", "gmbhiir mental durbltaa", "ati gmbhiir mental durbltaa"],
    answer: "saadhaarnn mental durbltaa"
},
{
    question: "aagmnaatmk trknaa to who buddhi of one kaark maanaa?",
    option: ["jensn", "spiiyrmain", "thrsttn", "gilphordd"],
    answer: "thrsttn"
},
{
    question: "mnovaiknowledgeik of bauddhik skill to which shrennii in rkhaa jaaegaa?",
    option: ["normal skill", "prekssnnaatmk skill", "special skill", "None of these"],
    answer: "prekssnnaatmk skill"
},
{
    question: "gaarddnr according to nimnaaNkit in kise buddhi of one shrennii not maanaa was is?",
    option: ["taarkik gnnitiiy", "jii kaark", "sthaanik", "antraavai bhktik"],
    answer: "jii kaark"
},
{
    question: "near moNddl of vistaarit form what is?",
    option: ["scheme, avdhaan bhaav, prbodhn, shkaalik anukrmik", "avdhaan bhaav prbodhn, shkaalik anukrmik scheme", "shkaalik anukrmik scheme, avdhaan bhaav prbodhn", "None of these"],
    answer: "shkaalik anukrmik scheme, avdhaan bhaav prbodhn"
},
{
    question: "buddhi sNrgram moNddl who viksit done?",
    option: ["gaarddnr", "gilphordd", "jensn", "None of these"],
    answer: "gilphordd"
},
{
    question: "person of srjnaatmktaa of capacity to which mnovaiknowledgeik ne prbhaavii aashcry’ of name given is?",
    option: ["bruunr", "paasii", "baakr mehdii", "ttorens"],
    answer: "bruunr"
},
{
    question: "sNvegaatmk buddhi of ttvoN in following in from kise not rkhaa jaa can is?",
    option: ["apne sNvegoN of correct jaankaarii keep", "svyN to prerit to do", "another to dhmkii give", "another of sNvegoN to phcaannaa"],
    answer: "another to dhmkii give"
},
{
    question: "which children of buddhi-lbdhi 33-49 occurs, use which shrennii in rkhaa jaa can is?",
    option: ["saumy mental durbltaa", "saadhaarnn mental durbltaa", "gmbhiir mental durbltaa", "ati gmbhiir durbltaa"],
    answer: "saadhaarnn mental durbltaa"
},
{
    question: "buddhi of dvi-kaark principle of prtipaadn who done?",
    option: ["caarls spiiyrmain", "bine", "rebr", "None of these"],
    answer: "caarls spiiyrmain"
},
{
    question: "Which of the following srjnaatmk cintn of stage is not?",
    option: ["styaapn", "udbhvn", "dhaarnnaa", "taiyaarii"],
    answer: "dhaarnnaa"
},
{
    question: "buddhi of bhuttv principle of prtipaadn which done?",
    option: ["thrsttn", "bine", "rebr", "spiiyr main"],
    answer: "thrsttn"
},
{
    question: "thaarnddaaik ne buddhi to how many vrgoN in vibhaajit done?",
    option: ["five", "three", "two", "ch:"],
    answer: "three"
},
{
    question: "25 from below buddhi-lbdhi which people to which class in rkhaa jaaegaa?",
    option: ["muurkh", "kssiinn buddhi", "alpmti", "jdd' buddhi"],
    answer: "jdd' buddhi"
},
{
    question: "vunntt where of rhne which the?",
    option: ["phraaNs", "iNglainndd", "jrmnii", "ittlii"],
    answer: "jrmnii"
},
{
    question: "vaishlr ne adult buddhi test done-",
    option: ["1964 ii. in", "1963 ii. in", "1961 ii. in", "1955 ii. in"],
    answer: "1955 ii. in"
},
{
    question: "near-eloNg test which done-",
    option: ["alekjennddr ne", "bine ne", "spiiyrmain ne", "gaarddnr ne"],
    answer: "alekjennddr ne"
},
{
    question: "group khnndd principle of prtipaadn who done thaa?",
    option: ["gaarddnr", "spiiyrmain", "bine", "alekjennddr"],
    answer: "spiiyrmain"
},
{
    question: "human vishesstaaoN of adhyyn doing for gaalttn ne when pryogshaalaa establishment done?",
    option: ["1882 ii. in", "1883 ii. in", "1884 ii. in", "1885 ii. in"],
    answer: "1882 ii. in"
},
{
    question: "gaarddnr ne abhii up to kul how many types of buddhi of phcaan done is?",
    option: ["five", "six", "seven", "eight"],
    answer: "eight"
},
{
    question: "ne and muulyvaanN vicaaroN to giving of capacity to said goes is?",
    option: ["buddhi", "suujh", "abhikssmtaa", "srjnshiiltaa"],
    answer: "srjnshiiltaa"
},
{
    question: "if any person of psychic incomeu and Real incomeu approximately braabr-braabr be then vh is called is-",
    option: ["tiivr buddhi of person", "mNd buddhi of person", "normal buddhi of person", "prtibhaashlii buddhi of person"],
    answer: "normal buddhi of person"
},
{
    question: "gilphordd of buddhi moNddl in bauddhik kssmtaaoN of shrenniyaaN are-",
    option: ["180", "100", "120", "150"],
    answer: "150"
},
{
    question: "person of any special field of special yogytaa khlaatii is-",
    option: ["vyktitv", "abhikssmtaa", "abhivRtti", "abhiruci"],
    answer: "abhikssmtaa"
},
{
    question: "spiiyrmain according to buddhi of tttv are-",
    option: ["3", "2", "1", "4"],
    answer: "2"
},
{
    question: "buddhi of ‘scheme, avdhaan-bhaav prbodhn and shkaalik-anukrmik moNddl’ to prstaavit done-",
    option: ["je.pii. daas-naagliirii-kirbii", "bine-ttrmn-krbii", "naagliirii-bine-ttrmn", "None of these"],
    answer: "je.pii. daas-naagliirii-kirbii"
},
{
    question: "“sttrnvrg’ according to buddhi of shrennii is-",
    option: ["55", "2", "1", "3"],
    answer: "3"
},
{
    question: "if any children of Real incomeu 100 mhiinaa is and psychic incomeu 120 mhiinaa is then uskii buddhi-lbdhi hogii–",
    option: ["105", "110", "90", "120"],
    answer: "120"
},
{
    question: "mental unmaapk is-",
    option: ["Real incomeu of", "buddhi of nirpekss level of", "kaalaanukrmit age of", "None of these"],
    answer: "buddhi of nirpekss level of"
},
{
    question: "buddhi maapne for srvprthm pryogshaalaa establishment which and when did?",
    option: ["vunntt (1879)", "gaalttn (1883)", "spiiyrmain (1873)", "bine (1883)"],
    answer: "vunntt (1879)"
},
{
    question: "vyaavhaarik buddhi of meaning this is ki buddhi sNskRti of product occursN this whose kthn is?",
    option: ["sttrnbrg", "vaaigoNtts", "sailovii", "meyr"],
    answer: "sttrnbrg"
},
{
    question: "vibhedk test use of which mnovaiknowledgeik ne Indian anukuuln according to viksit done is?",
    option: ["hores", "vaalaash", "je.pii. gilphordd", "je.em. ojhaa"],
    answer: "je.em. ojhaa"
},
{
    question: "which abhikssmtaa to e.es.ttii. of name from go goes is?",
    option: ["vibhedk abhikssmtaa", "normal adhikssmtaa", "aardd srvisej abhikssmtaa", "vyaafatyik abhikssmtaa"],
    answer: "aardd srvisej abhikssmtaa"
},
{
    question: "shaabdik trknaa, aaNkik trknaa which abhikssmtaa of under come are?",
    option: ["vyaafatyik abhikssmtaa", "aardd srvisej abhikssmtaa", "normal abhikssmtaa", "vibhedk abhikssmtaa"],
    answer: "vibhedk abhikssmtaa"
},
{
    question: "following in from sNskRti mukt test which-saa is?",
    option: ["bine-saaimn test", "veshler buddhi test", "kaittel buddhi test", "All of these"],
    answer: "All of these"
},
{
    question: "prtibhaashaalii children of most bdd'ii characteristic is-",
    option: ["suujh", "dRddh'taa", "mauliktaa", "sNvegaatmk pripkvtaa"],
    answer: "mauliktaa"
},
{
    question: "Which of the following shaabdik buddhi test is?",
    option: ["near elaaNg test", "ghn construction test", "sttainphordd-bine test", "All of these"],
    answer: "sttainphordd-bine test"
},
{
    question: "nimnaaNkit in from special child is not?",
    option: ["prtibhaashaalii child", "normal child", "mental durbl child", "disabled child"],
    answer: "normal child"
},
{
    question: "reven progresiv maittrik which trh of buddhi test is?",
    option: ["shaabdik buddhi test", "ashaabttik buddhi test", "motor buddhi test", "None of these"],
    answer: "ashaabttik buddhi test"
},
{
    question: "phrittj haaiddr of sNtuln principle in P-O-X moNddl in O prtinidhitv does is-",
    option: ["another person to", "which person of mnovRddhi of adhyyn done", "duusrii item to", "None of these"],
    answer: "which person of mnovRddhi of adhyyn done"
},
{
    question: "ttii.e.ttii. vyktitv maapn what type of test is?",
    option: ["prshnaavlii", "aatm vivrnn aavisskaarikaa", "kaagj-pensil test", "prkssepii"],
    answer: "prkssepii"
},
{
    question: "rojrs ne apne vyktitv principle in kendriy place given is-",
    option: ["aatm to", "acetn to", "adhigm to", "requirement to"],
    answer: "aatm to"
},
{
    question: "Which of the following aannd principle from nirdeshit is?",
    option: ["ahN", "idN", "praahN", "None of these"],
    answer: "idN"
},
{
    question: "nimnaaNkit in from which yuNg of vyktitv type under not smjhaa goes is?",
    option: ["bhirmukhii", "eNddomoNrphii", "antrmukhii", "ubhymukhii"],
    answer: "eNddomoNrphii"
},
{
    question: "aadrsh behavior of smbndh in sthaaii vishvaas to said goes",
    option: ["vyktitv", "value", "abhiruci", "abhikssmtaa"],
    answer: "value"
},
{
    question: "vyktitv principle of vishessk upaagm of agrnnii is-",
    option: ["phraaydd", "yuNg", "oNlportt", "kreshmr"],
    answer: "oNlportt"
},
{
    question: "Which of the following yuNg of vyktitv type of under smjhaa goes is?",
    option: ["antrmukhii", "golaakaar", "lmbaakaar", "aaytaakaar"],
    answer: "antrmukhii"
},
{
    question: "which thaarddnaaik of siikhne of niym is not?",
    option: ["saahcry niym", "ttprtaa of niym", "abhyaas of niym", "effect of niym"],
    answer: "saahcry niym"
},
{
    question: "siikhne of suujh siddhaaNt according to praannii success of is received is-",
    option: ["sNyogvsh", "krmshH", "ekaaek", "None of these"],
    answer: "ekaaek"
},
{
    question: "roshaaNk test is-",
    option: ["buddhi test", "abhikssmtaa test", "prkssepii test", "None of these"],
    answer: "prkssepii test"
},
{
    question: "Which of the following shelddn of vyktitv type under smjhaa goes is?",
    option: ["aNtrmukhii", "bhirmukhii", "golaakaar", "ubhymukhii"],
    answer: "golaakaar"
},
{
    question: "phraaydd according to ilekttraa of period maiN ldd'kiyaaN prtiyogitaa does are-",
    option: ["sister from", "brother from", "mother from", "pitaa from"],
    answer: "mother from"
},
{
    question: "who aatmsiddhtaa of avdhaarnnaa to prstut done?",
    option: ["maaslo", "rojrs", "phraaydd", "yuNg"],
    answer: "maaslo"
},
{
    question: "eddlr of mnoviknowledge to said goes is?",
    option: ["gtyaatmk mnoviknowledge", "vishlessnnaatmk mnoviknowledge", "maanvtaavaadii mnoviknowledge", "vaiyktik mnoviknowledge"],
    answer: "vaiyktik mnoviknowledge"
},
{
    question: "kthaank aatmbodh test of nirmaataa which are?",
    option: ["maargn and rojenvig", "murre and maargn", "kaittel", "roshNk and mure"],
    answer: "murre and maargn"
},
{
    question: "nimnaaNkit in from which sv of one type is not?",
    option: ["phcaan sv", "personal sv", "social sv", "sNbNdhaatmk sv"],
    answer: "phcaan sv"
},
{
    question: "vaiyktik vibhinntaaoN of mhtv of srvprthm vaiknowledgeik adhyyn done-",
    option: ["kaittel", "gaalttn", "hl", "jems ddrevr"],
    answer: "gaalttn"
},
{
    question: "ttaaiip sii vyktitv of prtipaadn who done?",
    option: ["aalportt ne", "maaris ne", "phriiddmain ne", "None of these"],
    answer: "maaris ne"
},
{
    question: "phraaydd according to children vipriit liNg of Parents from shj judd'aav mhsuus do haiN /  ise what said goes is?",
    option: ["protection yuktiyaaN", "praahm", "iddips and ilekttr mnogrNthi", "hiinbhaavnaa mnogrNthi"],
    answer: "iddips and ilekttr mnogrNthi"
},
{
    question: "vaiyktik bhinntaa of meaning is-",
    option: ["vyktiyoN characteristic ofoN in aNtr", "vyktiyoN of behavior paittrn in variety from", "(a) and (b) both", "None of these"],
    answer: "(a) and (b) both"
},
{
    question: "ddraa-e-prsn test production of by whom done was thaa?",
    option: ["sttainphordd", "veshlr", "rojenbiNg", "None of these"],
    answer: "None of these"
},
{
    question: "who aatmsiddh of avdhaarnnaa to prstut done?",
    option: ["maaslo", "rojrs", "phraaydd", "yug"],
    answer: "maaslo"
},
{
    question: "Which of the following vyktitv characteristic is?",
    option: ["buddhi", "abhiprernnaa", "sRjnaatmktaa", "sNveg"],
    answer: "sRjnaatmktaa"
},
{
    question: "Which of the following aatm control of tkniik is not?",
    option: ["aatm-nirdeshn", "aatm-niymn", "behavior prekssnn", "aatm-prbln"],
    answer: "aatm-niymn"
},
{
    question: "nimnaaNkit in from which vaastviktaa of niym from nirdeshit is?",
    option: ["upaah", "praah", "ahN", "None of these"],
    answer: "ahN"
},
{
    question: "saamuuhik acetn of sNprtyy of prtipaadn who done is?",
    option: ["yuNg", "eddlr", "phraaydd", "None of these"],
    answer: "yuNg"
},
{
    question: "nimnaaNkit in which sv ahm of sNknowledgeaatmk aspect is?",
    option: ["aatmsNprtyy", "aatmkssmtaa", "aatmsmmaan", "All of these"],
    answer: "All of these"
},
{
    question: "vyktitv development of correct krm is-",
    option: ["ahm-praahm-idm", "idm-ahm-praahm", "idm-praahm-ahm", "praahm-ahm-idm"],
    answer: "idm-ahm-praahm"
},
{
    question: "rojrs ne apne vyktitv principle in kendriiy place given is-",
    option: ["sv to", "acetn to", "adhigm to", "requirement to"],
    answer: "sv to"
},
{
    question: "phraaydd according to mn of akaaraatmk moNddl is-",
    option: ["cetn", "upaah", "ahm", "praahm"],
    answer: "upaah"
},
{
    question: "shelddn of vyktitv type in is not-",
    option: ["golaakaar", "aaytaakaar", "lmbaakaar", "kRshkaay"],
    answer: "aaytaakaar"
},
{
    question: "mnovishlessnnaatmk principle in vyktitv function ofpaalk kise said was is?",
    option: ["praahN", "ahN", "upaah", "All of these to"],
    answer: "ahN"
},
{
    question: "person of vishessk principle ….by given was is?",
    option: ["phraaydd", "oNlportt", "sulliimaan", "kaittel"],
    answer: "oNlportt"
},
{
    question: "life muulprvRtti of sNprtyy of prtipaadn by whom done was?",
    option: ["eddlr", "yuNg", "vaattsn", "phraaydd"],
    answer: "phraaydd"
},
{
    question: "aatm to which form in smjhaa jaa can is?",
    option: ["aatmgt", "vstugt", "aatmgt and vstugt", "None of these"],
    answer: "aatmgt and vstugt"
},
{
    question: "pii.eph. adhyyn to who viksit done?",
    option: ["rojenjvig", "haarpr", "phraam", "oiNjr"],
    answer: "rojenjvig"
},
{
    question: "rojh msilkssm test in how many msilkssm isN?",
    option: ["5", "10", "15", "20"],
    answer: "10"
},
{
    question: "‘elder puuNc’ in following in from kise shaamil not done was is?",
    option: ["bhirmukhtaa", "mnstaap", "krttvynisstthtaa", "prbhutv"],
    answer: "prbhutv"
},
{
    question: "jodhpur bhupkssiiy vyktitv suucii to who viksit done?",
    option: ["mllik and joshii", "joshii and siNh", "em.pii. shrmaa", "e.of. guptaa"],
    answer: "mllik and joshii"
},
{
    question: "one prekssk of riportt in jo prdtt are, ve how obtained are?",
    option: ["saakssaatkaar from", "prekssnn and nirdhaarnn from", "name-nirdeshn from", "All of the above"],
    answer: "All of the above"
},
{
    question: "ttii.e.ttii. to who viksit done?",
    option: ["phraaydd and gaarddnr", "mreN and spairaa", "moNrgn and phraaydd", "moNrgn and mre"],
    answer: "moNrgn and mre"
},
{
    question: "following in in which person main form from apne baare in only sNbddh of anubhv does is?",
    option: ["personal aatm", "social aatm", "family aatm", "None of these"],
    answer: "personal aatm"
},
{
    question: "aatm of baare in children of dhaarnnaa to svruup giving in kinkii bhuumikaa ahN occurs?",
    option: ["Parents", "mitroN", "shiksskoN", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "following in which aatm-control for mnovaiknowledgeik tkniik is?",
    option: ["aatm-anudesh", "apne behavior of prekssnn", "aatm prbln", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "vyktitv to antrmukhii and bhirmukhii prkaaroN in who baaNttaa is?",
    option: ["kreshmr", "yug", "shelddn", "eddlr"],
    answer: "yug"
},
{
    question: "maanvtaavaadii upaagm towardspaadk is-",
    option: ["bii.eph. skiinr", "albrtt bnduraa", "jaarj kelii", "ebraahm maislo"],
    answer: "ebraahm maislo"
},
{
    question: "one girl to apne pitaa from kaamuk lgaav and mother of place lene of icchaa to said goes is?",
    option: ["ilekttraa or pit mnogrnthi", "oddips or maatR mnogrnthi", "life-prvRtti", "death-prvRtti"],
    answer: "ilekttraa or pit mnogrnthi"
},
{
    question: "iNdd aadhaarit is-",
    option: ["vaastviktaa of principle on", "naitiktaa of principle on", "sukhepsaa of principle on", "saamaajiktaa of principle on"],
    answer: "sukhepsaa of principle on"
},
{
    question: "who kuNtthaa-aakrmnn principle of prtipaadn done is?",
    option: ["phraaydd", "skiinr", "elddr and yuNg", "milr and ddolaardd"],
    answer: "milr and ddolaardd"
},
{
    question: "kaittel ne vyktitv of shiilgunn gucchoN of sNkhyaa btlaayaa is?",
    option: ["12", "16", "18", "24"],
    answer: "16"
},
{
    question: "shiilgunn khlaane for necessary is-",
    option: ["behavior in sNgttaa", "behavior in sthirtaa", "behavior in sNgttaa and sthirtaa both", "above-mentioned in from any not"],
    answer: "behavior in sNgttaa and sthirtaa both"
},
{
    question: "saamuuhik acetn of aNtrvstuoN for yuNgN by pryukt pd; anubhv of sNgtthn for vNshaagt prtiruupoN to abhivykt krnevaalii prtimaaeN or prtiik following in from what khlaate are?",
    option: ["abhivRttiyaaN", "svliintaa", "aadyprruup", "None of these"],
    answer: "aadyprruup"
},
{
    question: "maislo of requirement pdaanukrm principle in aatm smmaan of place below from which level on comes is?",
    option: ["duusraa", "tiisraa", "cauthaa", "paaNcvaaN"],
    answer: "cauthaa"
},
{
    question: "vyktitv of naitik pkss of prtinidhitv does is?",
    option: ["idN", "ahm", "praahm", "acetn"],
    answer: "praahm"
},
{
    question: "annaa phraaydd of yogdaanoN to nimnaaNkit in which shrennii in rkheNge?",
    option: ["mnovishlessnnaatmk", "nv mnovishlessnnaatmk", "sNknowledgeaatmk", "maanvtaavaadii"],
    answer: "nv mnovishlessnnaatmk"
},
{
    question: "vyktitv of shiilgunn of basis on who vyktvi to vibhaajit done?",
    option: ["kreshmr", "shelddn", "yuNg", "None of these"],
    answer: "shelddn"
},
{
    question: "Which of the following gilphordd of trivimaatmk principle of kaark is not?",
    option: ["sNkriyaa", "sNkhyaatmk yogytaa", "vissyvstu", "product"],
    answer: "sNkhyaatmk yogytaa"
},
{
    question: "one prbhaavii mnovaiknowledgeik characteristic of occurs-",
    option: ["saamrthy", "vaiknowledgeik maansiktaa", "uttrdaayitv of bodh", "All of these"],
    answer: "All of these"
},
{
    question: "sv of vibhinn pkss of sNkhyaa what is?",
    option: ["7", "6", "4", "8"],
    answer: "4"
},
{
    question: "nimnaaNkit in kise sv of pkss maanaa was is?",
    option: ["sv dksstaa to", "aatm gaurv to", "aatm phcaan to", "All of these"],
    answer: "All of these"
},
{
    question: "ttaaip A and B of vyktitv of prtipaadn who done?",
    option: ["phriiddmain", "aalpor", "kaittel", "maaslo"],
    answer: "phriiddmain"
},
{
    question: "ttaaip A type of vyktitv in Which of these-sii characteristic paaii goes is?",
    option: ["prtiyogii bhaavnaa", "aakrmtaa", "besbrii", "All of these"],
    answer: "All of these"
},
{
    question: "when person apne ahN to any kssttkr icchaa of tthiik vipriit icchaa of prernnaa viksit by usse produced ciNtaa from apne aapko bcaataa is then use said goes is-",
    option: ["yauktikiikrnn", "prtikryaa construction", "prkssepnn", "None of these"],
    answer: "prtikryaa construction"
},
{
    question: "following in which apne aatmniyntrnn of prvidhi is not?",
    option: ["apne behavior of svyN niriikssnn", "aatm smmaan", "uddiipk control", "aatm prvrtn"],
    answer: "aatm smmaan"
},
{
    question: "em0pii0pii0aaii0 avisskaarikaa who viksit done?",
    option: ["oNlportt", "haathve and maikinle", "aaijenk", "kaittel"],
    answer: "haathve and maikinle"
},
{
    question: "who person to puurnnruup from kaaryshiil person maanaa is?",
    option: ["kaarl rojrs", "maaslo", "kaarl yug", "erik phroNm"],
    answer: "kaarl rojrs"
},
{
    question: "person of kaark vishlessnn principle of prtipaadk which is?",
    option: ["oNlportt", "phriiddmain", "kaittel", "None of these"],
    answer: "kaittel"
},
{
    question: "which stage in jnnendriyoN on phoks is?",
    option: ["gudaa stage", "liNg prdhaanaavsthaa", "jnnndriyaavsthaa", "mukhaa stage"],
    answer: "jnnndriyaavsthaa"
},
{
    question: "phraaydd by prtipaadit mnovishlessnn method of smbndh in which saa kthn sty is?",
    option: ["mnovishlessnn vyktitv of one principle hai / ", "mnovishlessnn one school hai / ", "mnovishlessnn medical treatment of one method hai / ", "All of the above"],
    answer: "All of the above"
},
{
    question: "sNvednaatmk ahN from whom smbndhit is?",
    option: ["aatm smprtyy", "aatmrkssaa", "aatmsmmaan", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "enorksiyaa nrvosaa of vishisstttaa occurs-",
    option: ["snaayvik durbltaa", "apryaapt dining from weight in lack", "sleep vyaaghaat", "None of these"],
    answer: "apryaapt dining from weight in lack"
},
{
    question: "aNgrejii of shbd ‘sttres’ of utptti which language from was is?",
    option: ["jrmn", "hindii", "griik", "laittin"],
    answer: "griik"
},
{
    question: "prsiddh mnovaiknowledgeik hNs selii which field related to are?",
    option: ["abhiprerkoN of sNghrss of field from", "tnaav of adhyyn of field from", "smaajiikrnn of adhyyn of field from", "among these from any also field from not"],
    answer: "tnaav of adhyyn of field from"
},
{
    question: "dbaav prtirodhii vyktitv in which characteristic not paayii goes is?",
    option: ["dushciNtaa", "prtibddhtaa", "cunautii", "control"],
    answer: "dushciNtaa"
},
{
    question: "baahy aabedhk towards prtikriyaa to said goes is-",
    option: ["ankuuln", "brn-aautt", "smaayojn", "khiNcaav"],
    answer: "ankuuln"
},
{
    question: "phraaydd according to oNddips of period in caalk prtiyogitaa does is-",
    option: ["sister of with", "brother of with", "mother of with", "pitaa of with"],
    answer: "pitaa of with"
},
{
    question: "aakraamktaa of cause which is not?",
    option: ["moNddliNg", "kuNtthaa", "behavior prk aussdh", "children of paaln-nutrition"],
    answer: "behavior prk aussdh"
},
{
    question: "agr any person to mnovRtti prtikuul from bdlkr more prtikuul or anukuul from bdlkr and more anukuul be goes is then this one udaahrnn hogaa-",
    option: ["asNgt change of", "sNgt change of", "saadhaarnn change of", "jttil change of"],
    answer: "sNgt change of"
},
{
    question: "aakraamktaa of adhyyn doing for aap nimnaaNkit in from which method to most more appropriate maante are?",
    option: ["antrniriikssnn", "controlled niriikssnn", "natural niriikssnn", "None of these"],
    answer: "controlled niriikssnn"
},
{
    question: "which aakraamktaa in person of abhipraay chipaa remains is?",
    option: ["vairpuurnn aakraamktaa in", "saadhaanaatmk aakraamktaa in", "hiNsaa in", "None of these"],
    answer: "saadhaanaatmk aakraamktaa in"
},
{
    question: "apne sNbNdhiyoN from baatciit doing in which distance of is used?",
    option: ["personal distance", "social distance", "public distance", "None of these"],
    answer: "personal distance"
},
{
    question: "kolaahl characteristic ofoN in kise shaamil not done jaa can is?",
    option: ["tiivrtaa", "puurvaanumeytaa", "control yogytaa", "krmbddhtaa"],
    answer: "krmbddhtaa"
},
{
    question: "social distance in smpressnnkrtaa and shrotaa between distance occurs?",
    option: ["18 inc from 4 phiitt", "4 phiitt from 10 phiitt", "0 from 10 inc", "None of these"],
    answer: "4 phiitt from 10 phiitt"
},
{
    question: "following in which body motor effect of udaahrnn is?",
    option: ["hRdygti in growth", "blood vaahikaaoN of sikudd'naa", "paack system of dhiimii gti", "All of the above"],
    answer: "All of the above"
},
{
    question: "dbaav of sNknowledgeaatmk siddhaaNt to who prtipaadit done?",
    option: ["lojaars", "phokmain", "eNddlr", "selye"],
    answer: "lojaars"
},
{
    question: "following in which hmeN dbaav in ddaaltii is?",
    option: ["cunautiyaaN", "smsyaaeN", "ktthin pristhitiyaaN", "All of the above"],
    answer: "All of the above"
},
{
    question: "if dbaav of tthiik from prbNdhn done jaae then vh person of atijiivitaa of sNbhaavnaa in-",
    option: ["lack does is", "excessive lack does is", "growth does is", "lack and growth both does is"],
    answer: "growth does is"
},
{
    question: "following in which-from sNveg nkaaraatmk is?",
    option: ["bhy", "dushciNtaa", "uljhn", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "sNknowledgeaatmk anukriyaa of under kaisii anukriyaaeN aatii are?",
    option: ["aNtrvedhii", "dhyaan kendrit n by paanaa", "punraavrtii", "All of the above"],
    answer: "All of the above"
},
{
    question: "baahy prtibl towards prtikriyaa to what said goes is?",
    option: ["dbaa", "tnaav", "upaagm", "None of these"],
    answer: "tnaav"
},
{
    question: "following in which sNvegaatmk effect of udaahrnn are?",
    option: ["heart gti in growth", "mnovaiknowledgeik tnaav in growth", "high blood pressure", "None of these"],
    answer: "mnovaiknowledgeik tnaav in growth"
},
{
    question: "nkaaraatmk ghttnaaoN of evaluation For whom is done?",
    option: ["sNbhaavit nuksaan", "sNbhaavit khtraa", "sNbhaavit cunautii", "All of the above"],
    answer: "All of the above"
},
{
    question: "following in which sNknowledgeaatmk effect be can are?",
    option: ["ekaagrtaa in growth", "nyuuniikRt alpkaalik smRti capacity", "elrjii", "sirdrd"],
    answer: "nyuuniikRt alpkaalik smRti capacity"
},
{
    question: "ve dbaav jinheN hm apne mn in produced do are unheN said goes is-",
    option: ["physical dbaav", "pryaavrnniiy dbaav", "mnovaiknowledgeik dbaav", "None of these"],
    answer: "mnovaiknowledgeik dbaav"
},
{
    question: "following in which abhighaatj ghttnaa is?",
    option: ["agnikaanndd", "bijlii-water deficiency of", "kolaahlpuurnn environment", "None of these"],
    answer: "agnikaanndd"
},
{
    question: "haaipothailems how many maadhym from activity praarNbh does is?",
    option: ["one", "four", "three", "two"],
    answer: "two"
},
{
    question: "sttres shbd of utptti laittin language of which shbd from was is?",
    option: ["sttrikttr", "sttrikmttr", "sttraikcr", "sttrir"],
    answer: "sttrikttr"
},
{
    question: "which haarmonoN of vjh from blood pressure level in change comes is?",
    option: ["eddrinliin and koNrttisol", "kttisaal and eddri", "nliin and sol", "kaarttisaal and sisttrol"],
    answer: "eddrinliin and koNrttisol"
},
{
    question: "vyktiyoN in physical biimaariyoN in how many percent up to dbaab of bhuumikaa important is?",
    option: ["45 from 65", "51 from 69", "52 from 71", "50 from 70"],
    answer: "50 from 70"
},
{
    question: "physical, sNvegaatmk and mnovaiknowledgeik prishraanti of stage to what called are?",
    option: ["ddrnaautt", "grenaautt", "brnaautt", "naautt"],
    answer: "brnaautt"
},
{
    question: "vibhinn shodhoN and adhyynoN by jnyaat was is ki tkriibn percent diseases of cause tnaav is?",
    option: ["25%", "50%", "75%", "100%"],
    answer: "75%"
},
{
    question: "tnaav of kii cause are jisse tnaav produced is, unheN said goes is?",
    option: ["prtigmn", "prtiblk", "prtyaahaar", "anukrnn"],
    answer: "prtiblk"
},
{
    question: "‘bhidd'o or bhaago anukriyaa’ of relation is-",
    option: ["ddolaardd and milr from", "kainn from", "kohen from", "glaas and siNgr from"],
    answer: "kainn from"
},
{
    question: "hNs selii ne tnaav of baare in said is?",
    option: ["tnaav one avishisstt anukriyaa is", "tnaav one ativishisstt anukriyaa", "tnaav one social siikhnaa anukriyaa is", "tnaav one smaayojn anukriyaa is"],
    answer: "tnaav one avishisstt anukriyaa is"
},
{
    question: "normal anukuuln sNlkssnn in how many avsthaaeN paayii goes are?",
    option: ["three", "two", "five", "four"],
    answer: "three"
},
{
    question: "time management which shrennii of skill is?",
    option: ["vaiyktik", "saamuuhik", "raajnaitik", "dhaarmik"],
    answer: "vaiyktik"
},
{
    question: "lkssy obtaining in disturbance and aavshyktaaoN and abhiprerkoN of avruddh being from what produced is?",
    option: ["interior dbaav", "kuNtthaa", "dvndv", "None of these"],
    answer: "kuNtthaa"
},
{
    question: "sNveg-abhivinyst yukti by whom vrnnit dbaav of yukti is?",
    option: ["eddlr and paarkr", "kaalmain", "kaaimain", "hittlr"],
    answer: "eddlr and paarkr"
},
{
    question: "which mnovaiknowledgeik ne dbaav of saamnaa doing for sNklpnaa nirdhaarnn one gtyaatmk prkriyaa as done?",
    option: ["kaaimain", "hittlr", "lejaars and phokmain", "eddlr and paarkr"],
    answer: "lejaars and phokmain"
},
{
    question: "jaivprtipraapti or baayophiiddbaik of how many avsthaaeN occursN?",
    option: ["two", "three", "four", "one"],
    answer: "three"
},
{
    question: "dbaav sNcaar training method of development by whom done was?",
    option: ["kaaimain", "eddlr and paarkr", "hittlr", "miicenboNm"],
    answer: "miicenboNm"
},
{
    question: "which-sii activity life style in vyaapk form from lokpriy anumodn obtained doing jaisaa change laatii is?",
    option: ["diet", "skaaraatmk cintn", "vyaayaam", "skaaraatmk abhivRtt"],
    answer: "vyaayaam"
},
{
    question: "Which of the following aphiim from produced aussdh is?",
    option: ["moNphin", "heroin", "methaaddon", "All of these"],
    answer: "All of these"
},
{
    question: "aakrmnn and hiNsaa to less doing of upaay is-",
    option: ["social adhigm", "virecn method", "praanubhuuti", "All of these"],
    answer: "All of these"
},
{
    question: "nimnaaNkit in from which sNghrss smaadhaan yukti is?",
    option: ["smjhautaa vaartaa", "paarsprik sNprk", "anukuul vidhaan", "All of these"],
    answer: "All of these"
},
{
    question: "sNknowledgeaatmk asNvaaditaa from taatpry is-",
    option: ["two mental dshaaoN of sNgt honaa", "two mental dshaaoN of asNgt honaa", "two mental dshaaoN of vipriit honaa", "two mental dshaaoN of ktthin honaa"],
    answer: "two mental dshaaoN of asNgt honaa"
},
{
    question: "liyon phesttiNgr ne sNknowledgeaatmk asNvaaditaa principle of prtipaadn In which year done?",
    option: ["1947", "1967", "1977", "1957"],
    answer: "1957"
},
{
    question: "prtibl of vipriit stage to called is-",
    option: ["cintn", "shithiliikrnn", "anukuuln", "None of these"],
    answer: "shithiliikrnn"
},
{
    question: "among these which asaamaany of jaivikiiy kaark is not?",
    option: ["physical sNrgram", "aarNbhik bNcn", "endocrine grNthiyoN of effect", "aanuvaaNshiktaa"],
    answer: "aarNbhik bNcn"
},
{
    question: "any normal prkriyaa to asaamaany form from times-times duhraane of vyaadhi to what called are?",
    option: ["durbhaaNti", "aatNk", "saamaanyiikRt dushcitaa", "mnogrsti baadhytaa"],
    answer: "mnogrsti baadhytaa"
},
{
    question: "vicaaroN, prernnaaoN, aavshyktaaoN and uddeshyoN of prspr virodh of phlsvruup paidaa was vikssebh or tnaav of condition what khlaatii is?",
    option: ["dvNdv", "trk", "kunntthaa", "dmn"],
    answer: "dvNdv"
},
{
    question: "Which of the following snaayu vikRti is not?",
    option: ["mnovidltaa", "cintaa vikRti", "baadhy vikRti", "durbhiiti"],
    answer: "mnovidltaa"
},
{
    question: "who srvprthm sviikaar done ki dvNdv and antrvaiyktik sNbNdhoN in disturbance mental vikaaroN in important cause is?",
    option: ["hippokretts", "joNn veyr", "sukraat", "gailn"],
    answer: "sukraat"
},
{
    question: "nimnaaNkit in from which kaay form vikaar is?",
    option: ["piidd'aa vikaar", "kaay-aarlebitaa vikaar", "change vikaar", "None of these"],
    answer: "piidd'aa vikaar"
},
{
    question: "nimnaaNkit in which bulimiyaa vikaar is?",
    option: ["dining vikaar", "naitik vikaar", "bhaavaatmk vikaar", "critr vikaar"],
    answer: "dining vikaar"
},
{
    question: "nlikaavihiin gland of name is-",
    option: ["bhi:sraavii gland", "aNt:sraavii gland", "eddriinl gland", "kNtth gland"],
    answer: "aNt:sraavii gland"
},
{
    question: "one dhruviiy vissaad of duusraa name what is?",
    option: ["vissaadii mnovikRti", "unmaadii vissaadii mnovikRti", "unmaad", "None of these"],
    answer: "vissaadii mnovikRti"
},
{
    question: "dvi-dhruviiy vikaar of two dhruv are-",
    option: ["trk sNgt and atrk sNgt", "unmaad and vissaad", "snaayu vikRti and mnovikRti", "mnogrsti and baadhytaa"],
    answer: "unmaad and vissaad"
},
{
    question: "which medical treatment in aadyaanukuuln of niym pryukt are?",
    option: ["mnogtyaatmk medical treatment", "patient kendrit medical treatment", "people medical treatment", "behavior medical treatment"],
    answer: "behavior medical treatment"
},
{
    question: "kaittettonik sttuupr one lkssnn is-",
    option: ["mnovidltaa of", "ruupaaNtr mnovikRti of", "rogbhrm of", "None of these"],
    answer: "mnovidltaa of"
},
{
    question: "Which of the following social prtibl is?",
    option: ["dvndv", "kuNtthaa", "bhuukmp", "marriage-vicched"],
    answer: "marriage-vicched"
},
{
    question: "nimnaaNkit in kise mnoviknowledge in evaluation method of one device as not smjhaa goes is?",
    option: ["mnovaiknowledgeik test", "kes adhyyn", "mnshcikitsaa", "saakssaatkaar"],
    answer: "mnshcikitsaa"
},
{
    question: "ttrosomii-21 of other name what is?",
    option: ["ddaaun sNlkssnn", "egoraaphobiyaa", "klaainphelttr sNlkssnn", "durbl eks sNlkssnn"],
    answer: "ddaaun sNlkssnn"
},
{
    question: "any normal prkriyaa to asaamaany form from braabr duhraane of dn vyaadhi to what called are?",
    option: ["phraaydd", "durbhiiti", "saamaanyiikRt dushciNtaa", "mnogrsit baadhytaa"],
    answer: "mnogrsit baadhytaa"
},
{
    question: "reshnl imiittiv medical treatment of prtipaadn who done?",
    option: ["phraaydd", "kaarl rojrs", "albrtt illis", "None of these"],
    answer: "albrtt illis"
},
{
    question: "nimnaaNkit in which mnovipulsesitaa of one type is not?",
    option: ["vighttit mnovipulsesitaa", "vyaamohaabh mnovipulsesitaa", "mishrit mnovipulsesitaa", "vidrohii mnovipulsesitaa"],
    answer: "vidrohii mnovipulsesitaa"
},
{
    question: "Which of these maadk agent is not?",
    option: ["coffee", "koken", "aphiim", "smaik"],
    answer: "coffee"
},
{
    question: "aakrmnn of muul prvRtti principle of prtipaadn who done?",
    option: ["rojrs", "aalportt", "phraaydd", "vaattsn"],
    answer: "phraaydd"
},
{
    question: "gaaNjaa one type of-",
    option: ["kephiin is", "kokiin is", "kenebis is", "nikottin is"],
    answer: "kenebis is"
},
{
    question: "following in which nikottin of shrennii in comes is?",
    option: ["hshiish", "heroin", "tNbaakuu", "None of these"],
    answer: "tNbaakuu"
},
{
    question: "visaamaany kssttprd apkriyaatmk and duHkhd behavior to said goN goes is-",
    option: ["normal behavior", "apsaamaany behavior", "vicitr behavior", "None of these"],
    answer: "apsaamaany behavior"
},
{
    question: "all ailkohoNl beverage substances in is-",
    option: ["mithaail ailkohoNl", "ethaail ailkohoNl", "kiitton", "None of these"],
    answer: "ethaail ailkohoNl"
},
{
    question: "following in apsaamaany behavior of which-from priprekssy is notN?",
    option: ["atipraakRt", "ajaivik", "jaivik", "aaNgik"],
    answer: "ajaivik"
},
{
    question: "‘ve human behavior and anubhuutiyaaN jo saadhaarnn anokhe asaadhaarnn are, asaamaany smjhe go haiN /  this kthn whose is?",
    option: ["hittlr", "braaun", "jems ddrevr", "kiskr"],
    answer: "kiskr"
},
{
    question: "meskaalaain one-",
    option: ["vibhraaNti utpaadk is", "nikottin is", "shaamk", "opioNydd is"],
    answer: "vibhraaNti utpaadk is"
},
{
    question: "following in which kephiin is not?",
    option: ["coffee", "coNklett", "kph sirp", "koko"],
    answer: "kph sirp"
},
{
    question: "person of physical construction to which mnovaiknowledgeik ne three bhaagoN",
    option: ["sigmnndd phroNydd", "meksvel", "pinel", "shailddn"],
    answer: "shailddn"
},
{
    question: "dushcitit person in which-from lkssnn found go are?",
    option: ["heart gti of tej honaa", "saaNs deficiency of honaa", "dst honaa", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "following in which kaayruup vikaar is not?",
    option: ["change vikaar", "svkaaydushciNtaa disease", "vicchedii vikaar", "piidd'aa vikaar"],
    answer: "vicchedii vikaar"
},
{
    question: "following in which kaan-aalNbitaa vikaar of lkssnn is not?",
    option: ["khuub food", "sirdrd", "thkaan", "ulttii to do"],
    answer: "khuub food"
},
{
    question: "following in which opioNydd is not?",
    option: ["morphiin", "kph sirp", "piiddaanaashk goliyaaN", "el.el.ddii."],
    answer: "el.el.ddii."
},
{
    question: "heroin one type of-",
    option: ["kokiin is", "kenebis is", "opioNydd is", "kephiin is"],
    answer: "opioNydd is"
},
{
    question: "any special item, duusroN of with aNtHkriyaa and apricit sthitiyoN towards avivekii bhy of honaa is called is-",
    option: ["aatNk vikaar", "uttr abhighaatmj dbaav vikaar", "durbhiiti", "None of these"],
    answer: "durbhiiti"
},
{
    question: "which vikaar in person prtyaavrtii vyktitvoN of klpnaa does is jo aaps in one-another towards jaankaarii rkh can are or not rkh can are?",
    option: ["vicchedii phcaan vikaar", "piidd'aa vikaar", "vicchedii smRtilop", "None of these"],
    answer: "vicchedii phcaan vikaar"
},
{
    question: "uttr abhighaatj' dbaav vikaar of lkssnn are-",
    option: ["ekaagrtaa in lack", "times-times coming which svpn", "saaNvegik shuunytaa of honaa", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "aanuvNshik kaarkoN of relation where found was is?",
    option: ["bhaavdshaa vikaaroN", "mnovidltaa", "mental mNdn", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "dushciNtaa vikaar of relation from whom is?",
    option: ["ddopaamaain from", "gaamaa emino byuuttirik esidd from", "siirottonin from", "None of these"],
    answer: "gaamaa emino byuuttirik esidd from"
},
{
    question: "nimnaaNkit in which mnovaiknowledgeik vikaaroN of vrgiikrnn of nviintm pddhti is?",
    option: ["DSM-IIR", "DSM-IV", "ICD-9", "WHO"],
    answer: "DSM-IV"
},
{
    question: "following in which asaamaany behavior related to is not?",
    option: ["mental asNtuln", "kromosoms asmaantaa.", "yaaddaastaa of kmjor honaa", "body gtthn"],
    answer: "yaaddaastaa of kmjor honaa"
},
{
    question: "asaamaany mnoviknowledge of aadhunik yug of jnk which maane go are?",
    option: ["sigmnndd phroNydd", "jems bread", "lii boNl", "meslo"],
    answer: "sigmnndd phroNydd"
},
{
    question: "normal, asaamaany and shresstth in only of aNtr is?",
    option: ["quantity of", "krm of", "distance of", "time of"],
    answer: "quantity of"
},
{
    question: "mental asvsthtaa of prmukh lkssnn is-",
    option: ["vomiting-siidhii hrkteN to do", "paaglpn of lkssnn", "sntulit behavior n to do", "nii pristhiti in ghuuttn mhsuus to do"],
    answer: "sntulit behavior n to do"
},
{
    question: "mnovidltaa of up-prkaaroN in from which-saa one is not?",
    option: ["vyaamohaabh type", "visNgtthit type", "avdhaan-deficiency atikriyaa type", "avibhedit type"],
    answer: "avdhaan-deficiency atikriyaa type"
},
{
    question: "bimaariyoN of aNtrraassttriiy vrgiikrnn of dsvaaN sNskrnn when prkaashit done was is?",
    option: ["1982 ii.", "1992 ii.", "2006 ii.", "2009 ii."],
    answer: "1992 ii."
},
{
    question: "agr any person in unmaad and vissaad both trh of mental avsthaaeN krm occurs then ise DSM-IV in what sNjnyaa dii was is-",
    option: ["utsaah-vissaad mnovikssipt", "dvi dhruviiy vikaar", "main vissaad", "mnH condition vikaar"],
    answer: "dvi dhruviiy vikaar"
},
{
    question: "which sn up to aaNgik dRssttikonn apnii crm siimaa on thaa?",
    option: ["1925", "1914", "1912 ii.", "1915 ii."],
    answer: "1915 ii."
},
{
    question: "mnovipulsesitaa pd use of sbbefore who done thaa?",
    option: ["pliyuulr", "morel", "phraaydd", "kreplin"],
    answer: "pliyuulr"
},
{
    question: "ddii.es.em. IV in how many aayaam is?",
    option: ["five", "six", "four", "seven"],
    answer: "five"
},
{
    question: "human body in black pitt of adhiktaa from produced is?",
    option: ["vissaad", "utsaah", "vissaad and utsaah both", "None of these"],
    answer: "vissaad"
},
{
    question: "DSM-IV according to nimnaaNkit in from kise dushciNtaa vikRti of shrennii in not rkhaa was is?",
    option: ["durbhiiti", "tiibr prtivl vikRti", "ruupaaNtr vikRti", "mnogrsti-baadhytaa vikRti"],
    answer: "ruupaaNtr vikRti"
},
{
    question: "mnovidltaa of patient in most more which-sii vibhraaNti paayii goes is?",
    option: ["shrvnn vibhraaNti", "daihik vibhraaNti", "dusstti vibhraaNti", "sprshii vibhraaNti"],
    answer: "shrvnn vibhraaNti"
},
{
    question: "nimnaaNkit in from which from dushciNtaa vikaar is not?",
    option: ["durbhiiti vikaar", "aatNk vikaar", "mnogrsti-baadhytaa vikaar", "mnovicchedii aatmvismRti"],
    answer: "mnovicchedii aatmvismRti"
},
{
    question: "which mnovaiknowledgeik ne mesmerijm medical treatment principle establishment of?",
    option: ["meksvel", "jiin eskyuurl", "griNjigr", "ainttn mesmr"],
    answer: "ainttn mesmr"
},
{
    question: "kaayruupuu vikaar following in from whom smbndhit is?",
    option: ["physical problem from", "mnovaiknowledgeik problem from", "aanuvNshik problem from", "daiviiy problem from"],
    answer: "physical problem from"
},
{
    question: "‘asaamaany behavior or asaamaany person of adhyyn only asaamaany mnoviknowledge hai /  this kthn whose is?",
    option: ["jems ddrevr", "braaun", "aaijnek", "kiskr"],
    answer: "aaijnek"
},
{
    question: "Father of Medicine of name from which mnovaiknowledgeik to go goes thaa?",
    option: ["hippokrettiij", "aaijnek", "arstu", "pletto"],
    answer: "hippokrettiij"
},
{
    question: "saamuuhik paaglpn of proof which shtaabdii from which shtaabdii up to mile?",
    option: ["10viiN from 15viiN up to", "11viiN from 16viiN up to", "10viiN from 14viiN up to", "10viiN from 16viiN up to"],
    answer: "10viiN from 16viiN up to"
},
{
    question: "Pathology of Brain naamk book of rcyitaa which the?",
    option: ["hoNlr", "pinel", "benjaamin rsh", "kreplin"],
    answer: "kreplin"
},
{
    question: "sNvedn mNdk aussdhiyoN of main function is-",
    option: ["piidd'aadaayk effect to less to do", "uttejnaa to bddh'aanaa", "vibhrm produced to do", "None of these"],
    answer: "vibhrm produced to do"
},
{
    question: "bnduraa ne said children asaamaajik behavior siikhte are-",
    option: ["saadhnaatmk anukuultaa from", "prekssnnaatmk anukuuln from", "klaasikii anukuuln from", "None of these"],
    answer: "prekssnnaatmk anukuuln from"
},
{
    question: "mental disease of vrgiikrnn of atynt nviintm pddhti what is?",
    option: ["DSM-IV", "ICD-10", "DSM-V-TR", "All of these"],
    answer: "DSM-V-TR"
},
{
    question: "enoreksiyaa nrvosaa of such vikaar is jismeN patient to-",
    option: ["bhuukh more seems is", "bhuukh less seems is", "pyaas more seems is", "pyaas less seems is"],
    answer: "bhuukh less seems is"
},
{
    question: "bnduuraa ne srp durbhaati to far doing for which prvidhii use of done is?",
    option: ["krmbddh asNvediikrnn", "arrangement", "viruuci anubNdh", "moNddliNg"],
    answer: "krmbddh asNvediikrnn"
},
{
    question: "mnovRtti production of nimnaaNkit in from which kaark by prbhaavit does not occur is?",
    option: ["social siikhnaa", "vishvsniiy suugrameN", "requirement puurti", "shrotaa characteristic ofeN"],
    answer: "shrotaa characteristic ofeN"
},
{
    question: "aadhunik cikitsaashaastr of jnk kise maanaa goes is?",
    option: ["hippokretts", "phraaydd", "maislo", "rojrs"],
    answer: "hippokretts"
},
{
    question: "mnovishlessnnaatmk medical treatment of relation which person from is?",
    option: ["phraaydd", "yuNg", "eddlr", "maislo"],
    answer: "phraaydd"
},
{
    question: "mnogtyaatmk medical treatment of prtipaadn who done?",
    option: ["rojrs", "aalportt", "phraaydd", "vaattsn"],
    answer: "phraaydd"
},
{
    question: "sevaarthii kendrit medical treatment to who prtipaadit done?",
    option: ["maaslo", "rojrs", "phraaydd", "None of these"],
    answer: "rojrs"
},
{
    question: "which medical treatment pddhti in siikhne of siddhaaNtoN use of is",
    option: ["mnovishlessnn medical treatment", "saamuuhik medical treatment", "behavior medical treatment", "None of these"],
    answer: "behavior medical treatment"
},
{
    question: "saamuuhik acetn of vissy to said goes is-",
    option: ["mnogrNthi", "aarkiittaaip", "paarsonaa", "eniimaa"],
    answer: "aarkiittaaip"
},
{
    question: "mnovRtti construction to which tttv prbhaavit not does?",
    option: ["shrotaa characteristic ofeN", "vishvsniiy suugrameN", "social siikhnaa", "requirement puurti"],
    answer: "requirement puurti"
},
{
    question: "ptNjli of name whichrelated to is?",
    option: ["mn:medical treatment from", "yog from", "svpn vishlessnn from", "praamrsh from"],
    answer: "yog from"
},
{
    question: "mnovRtti change in sNtuln of prtipaadn who done thaa?",
    option: ["phesttiNgr", "haaiiddr", "mohsin", "None of these"],
    answer: "haaiiddr"
},
{
    question: "shrennii aadhRt skiimaa to what said goes is?",
    option: ["aadiruuNp", "ruuddh'ikRti", "drshk effect", "None of these"],
    answer: "ruuddh'ikRti"
},
{
    question: "behavior medical treatment which siddhaaNt on aadhaarit is?",
    option: ["adhigm siddhaaNt", "abhiprernnaa siddhaaNt", "prtykssnn siddhaaNt", "vismrnn siddhaaNt"],
    answer: "adhigm siddhaaNt"
},
{
    question: "shvsn abhyaas to yog in what said goes is?",
    option: ["mnn", "aasn", "praannaayaam", "None of these"],
    answer: "praannaayaam"
},
{
    question: "praamrsh of uddeshy is-",
    option: ["vikaasaatmk", "nirodhaatmk", "upcaaraatmk", "All of these"],
    answer: "All of these"
},
{
    question: "nimnaaNkit in which jaiv-aayurviknowledge medical treatment is not?",
    option: ["sevaarthii kendrit medical treatment", "aussdhi medical treatment", "impact medical treatment", "shly medical treatment"],
    answer: "sevaarthii kendrit medical treatment"
},
{
    question: "world mental health day mnaayaa goes is-",
    option: ["11 October", "21 October", "31 agst", "21 November"],
    answer: "11 October"
},
{
    question: "yog one …….hai / ",
    option: ["aaNghaat medical treatment", "vaiklpik medical treatment", "(a) and (b) both", "None of these"],
    answer: "vaiklpik medical treatment"
},
{
    question: "ptNjli of prsiddh yog-suutr in yog of maarg are-",
    option: ["4", "6", "8", "9"],
    answer: "8"
},
{
    question: "following in which mental health of basis is?",
    option: ["sNvegaatmk", "real sNknowledge", "vyktik svtNtrtaa", "trkpuurnn ciNtn"],
    answer: "trkpuurnn ciNtn"
},
{
    question: "yog method bddh'aatii is-",
    option: ["bhaavdshaa", "dhyaan", "dbaav shissnnutaa", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "amerikaa in sikhaae going which yog to what called are?",
    option: ["yog", "kuNddlinii yog", "sudrshn yog", "nisstthaa yog"],
    answer: "kuNddlinii yog"
},
{
    question: "following in in which mNtroN of uccaarnn of with shvsn tkniik or praannaayaam to combined is done?",
    option: ["dhyaan", "sudrshn yog", "kuNddlinii yog", "upcaar"],
    answer: "sudrshn yog"
},
{
    question: "mental rogiyoN of punH sthaapn of uddeshy is?",
    option: ["patient to sshkt making", "patient of care to do", "patient to home give", "None of these"],
    answer: "patient to sshkt making"
},
{
    question: "mental rogiyoN of punH establishment in what type of training is given?",
    option: ["vyaafatyik medical treatment", "social skill training", "vyaafatyik training", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "apryaapt vaivaahik, vyaafatyik and social smaayojn of this requirement occurs ki person of environment in change done jaaeN-",
    option: ["vaiyktik", "social", "economic", "None of these"],
    answer: "vaiyktik"
},
{
    question: "mnocikitsaa of special prvidhi is-",
    option: ["mno abhinv", "smmohn medical treatment", "kriidd'aa method", "unmocn method"],
    answer: "smmohn medical treatment"
},
{
    question: "following in nirvcn of vishlessnnaatmk tkniik which-sii is?",
    option: ["prtirodhii", "spssttiikrnn", "(a) and (b) both", "None of these"],
    answer: "(a) and (b) both"
},
{
    question: "aNt:mnodvNdv to outside nikaalne for which method use of is?",
    option: ["mukt saahcry method", "anyaaropnn method", "spssttiikrnn method", "None of these"],
    answer: "mukt saahcry method"
},
{
    question: "following in in which sevaarthii cikitsk to puujnn doing seems is?",
    option: ["nkaaraatmk anyaaropnn", "skaaraatmk anyaaropnn", "anyaaropnn tNtrikaataap", "None of these"],
    answer: "skaaraatmk anyaaropnn"
},
{
    question: "following in in which acetn smRtiyaaN continuously scetn abhijnytaa in smaaklit is rhtii is?",
    option: ["aNtrdRsstti", "anyaaropnn", "svpn method", "None of these"],
    answer: "aNtrdRsstti"
},
{
    question: "following in which sevaarthii to ksstt provide do are?",
    option: ["apkriyaatmk behavior", "motor behavior", "personal behavior", "uprokt all"],
    answer: "apkriyaatmk behavior"
},
{
    question: "following in which patient to apne aapko and apnii problem of source to smjhne in outside aaii materials to apne ahN in smaaklit doing in assistance does is?",
    option: ["prtirodhii", "spssttiikrnn", "anyaaropn", "smaakln function"],
    answer: "smaakln function"
},
{
    question: "kraamik visNvedniikrnn to who prtipaadit done?",
    option: ["albrtt elis", "volp", "vikttr phreNkl", "joNn prls"],
    answer: "volp"
},
{
    question: "‘dushcitaa disease of prmukh characteristic patient of vyaapk and dishaahiin cintaa hai /  this kthn whose is?",
    option: ["kolmain", "kaimraan", "koliin", "gregrii"],
    answer: "kolmain"
},
{
    question: "mnovidltaa of medical treatment of smbndh in srvprthm which cikitsk ne adhyyn done?",
    option: ["morel ne", "kreplin ne", "bluulr ne", "kolmain ne"],
    answer: "bluulr ne"
},
{
    question: "physical construction on srvaadhik effect which element or power of falls is?",
    option: ["family", "physical construction", "vNshaanukrm", "physical rgram"],
    answer: "vNshaanukrm"
},
{
    question: "mnHsnaayu vikRti of disease of mstissk lkssnn is-",
    option: ["bhy", "aashNkaa", "disease", "ksstt"],
    answer: "aashNkaa"
},
{
    question: "durbhaati or phobiyaa what is?",
    option: ["cintaa kssobhaanmaad", "mental vikRti", "ataarkik cintaa", "asNgt bhy"],
    answer: "asNgt bhy"
},
{
    question: "durbhiiti of tthiik upcaar what is?",
    option: ["aatm-nirdeshn", "aatm-punrbl", "klpnaatmk quality", "shly activity"],
    answer: "aatm-nirdeshn"
},
{
    question: "mnHsnaayu vikRti of rgramkaar which are?",
    option: ["phishr", "kolmain", "meyr", "rogen gregrii"],
    answer: "phishr"
},
{
    question: "following in from durbhiiti of lkssnn is-",
    option: ["pett in vikaar", "sirdrd", "body in drd", "mnd. heart gti"],
    answer: "pett in vikaar"
},
{
    question: "mnovidltaa of patient of upcaar is-",
    option: ["insulin from", "impact medical treatment from", "shly activity from", "aussdhi from"],
    answer: "insulin from"
},
{
    question: "which mnovikRti in vidyut pddhti of is used?",
    option: ["cintaa on", "bhrm on", "vissaad on", "utsaah on"],
    answer: "vissaad on"
},
{
    question: "aadhunik yug in mental health on whose effect falls is?",
    option: ["apraadhoN of", "jiivm of asthirtaa of", "aaraadhnaa of", "physicaltaa of"],
    answer: "jiivm of asthirtaa of"
},
{
    question: "phraaydd of mnovishlessnn of one form is-",
    option: ["prtirodh", "infection", "prem v affection", "mukt saahcry"],
    answer: "mukt saahcry"
},
{
    question: "nimnaaNkit in from behavior medical treatment which principle on aadhaarit is?",
    option: ["abhiprernnaa of principle on", "prtykssnn of principle on", "siikhne of principle on", "All of these of siddhaantoN on"],
    answer: "siikhne of principle on"
},
{
    question: "yog in smmilit is-",
    option: ["dhyaan", "money", "niym", "knowledge"],
    answer: "dhyaan"
},
{
    question: "shaayk mnocikitsk of one method is-",
    option: ["disease nivaarnn", "praamrsh", "punshviaasn", "sNsuugram"],
    answer: "punshviaasn"
},
{
    question: "one skiimaa or anviti scheme is-",
    option: ["mental sNrgram", "physical sNrgram", "social sNrgram", "None of these"],
    answer: "mental sNrgram"
},
{
    question: "mental form from healthy vyktiyoN of life drshn in-",
    option: ["nishciNttaa paaii goes is", "duusroN of life drshn of nkl paaii goes is", "apuurvtaa paaii goes is", "bhaavii yojnaaoN of jhlk paaii goes is"],
    answer: "nishciNttaa paaii goes is"
},
{
    question: "person of acetn prkriyaaoN to outside laane method of khlaatii is-",
    option: ["life-vRt method", "saakssaatkaar method", "prkssepnn method", "prshnaavliyaaN"],
    answer: "prkssepnn method"
},
{
    question: "yog of ‘assttaaNg means’ of relation is-",
    option: ["krm yog", "raaj yog", "knowledge yog", "mNtr yog"],
    answer: "raaj yog"
},
{
    question: "person of evaluation doing for most more use of jaanevaalii tkniikoN of under which-saa not comes is?",
    option: ["mnomitik test", "aatm-prtivedn maap", "prkssepii tkniik", "sevaarthii kendrit medical treatment"],
    answer: "sevaarthii kendrit medical treatment"
},
{
    question: "jrmn shbd ‘gesttaaltt’ means-",
    option: ["vikRti", "smgr", "dushciNtaa", "None of these"],
    answer: "smgr"
},
{
    question: "behavior medical treatment of which prvidhi in patient to real pristhiti in keeping ismeN kaaphii quantity in cintaa produced by dii goes is, use said goes is-",
    option: ["phlddiNg", "viruci medical treatment", "antH sphottaatmk medical treatment", "None of these"],
    answer: "phlddiNg"
},
{
    question: "gosttaaltt medical treatment of main uddeshy this tthy on force ddaalnaa is ki-",
    option: ["patient why any khaas ddhNg from behavior by rhaa is", "patient of vrtmaan bhaav what are", "patient which trh from behavior by rhaa is", "(b) and (c) both phluoN to smjhnaa"],
    answer: "(b) and (c) both phluoN to smjhnaa"
},
{
    question: "mnocikitsaa of what lkssy is?",
    option: ["environment between", "patient of smsyaaoN of smaadhaan", "rogiyoN to raaht phuNcaanaa", "mnovaiknowledgeik vidhiyoN use of"],
    answer: "rogiyoN to raaht phuNcaanaa"
},
{
    question: "mnocikitsaa of what level is?",
    option: ["prtirodh to do", "aatmiiytaa-smbndh establishment", "antrdRsstti of form", "infection of honaa"],
    answer: "aatmiiytaa-smbndh establishment"
},
{
    question: "nimnaaNkit in from which aNtrnn in klaayNtt cikitsk towards ghRnnaa, iirssyaa aadi to dikhlaataa is?",
    option: ["dhnaatmk", "Rnnaatmk", "dhnaatmk and Rnnaatmk both", "None of these"],
    answer: "Rnnaatmk"
},
{
    question: "mnovishlessnnaatmk medical treatment in nimnaaNkit in from whose mhtv srvaadhik btlaayaa was is?",
    option: ["sthaanaantrnn", "prtirodh", "svtNtr saahcry", "svpn vishlessnn"],
    answer: "svpn vishlessnn"
},
{
    question: "gesttaaltt medical treatment one trh of is-",
    option: ["group medical treatment", "vaiyktik medical treatment", "aNsht: group and aNshtH vaiyktik medical treatment", "n group medical treatment n vaiyktik medical treatment"],
    answer: "group medical treatment"
},
{
    question: "mnocikitsaa method what is?",
    option: ["saamuuhik medical treatment", "saadhaarnn diseases of upcaar", "sNvegoN of medical treatment", "vikssebhoN of upcaar"],
    answer: "vikssebhoN of upcaar"
},
{
    question: "mnocikitsaa of patient what prtirodh does is?",
    option: ["sexual problem", "asaamaajik baateN", "gmbhiir disease", "dmit bhaavnaaeN"],
    answer: "sexual problem"
},
{
    question: "mnocikitsaa method of is-",
    option: ["shaayk medical treatment", "punrrgramtmk mnocikitsaa", "mnovishlessnn medical treatment", "punreducationtmk mnocikitsaa"],
    answer: "punreducationtmk mnocikitsaa"
},
{
    question: "Which of the following praamrsh of field is not?",
    option: ["private", "shaikssik", "nirdeshn", "vyfatyaatmk"],
    answer: "shaikssik"
},
{
    question: "mnoshly medical treatment pddhti to who viksit done?",
    option: ["igaas monij", "kaarl rojrs", "eph prls", "None of these"],
    answer: "igaas monij"
},
{
    question: "vidyut impact medical treatment to who viksit done?",
    option: ["kaarl rojrs", "igaas monij", "srlettii and binii", "eph0 prls"],
    answer: "srlettii and binii"
},
{
    question: "following in kise yog of pitaa as aadr obtained is?",
    option: ["mhesh yogii", "gautm buddh", "mhrssi ptNjli", "rjniish"],
    answer: "mhrssi ptNjli"
},
{
    question: "albrtt elis ne nimnaaNkit in which medical treatment method of prtipaadn done is?",
    option: ["sNknowledgeaatmk medical treatment", "behavior medical treatment", "astitvaatmk medical treatment", "None of these"],
    answer: "sNknowledgeaatmk medical treatment"
},
{
    question: "best health for which Indian mniissii ne assttaaNg maarg to prtipaadit done is?",
    option: ["gautm", "ptNjli", "yaajnyvlky", "sukraat"],
    answer: "ptNjli"
},
{
    question: "mnovRtti change of two striiy sNprtyy of prtipaadn who done?",
    option: ["muhmmd sulaimaan", "e.of. siNh", "em.em. muhsiin", "je.pii. daas"],
    answer: "em.em. muhsiin"
},
{
    question: "puurvaagrh in ghttkoN of sNkhyaa how many occurs?",
    option: ["two", "three", "four", "five"],
    answer: "three"
},
{
    question: "puurvaagrh one type is-",
    option: ["mnovRtti of", "muul prvRtti of", "sNveg of", "prernnaa of"],
    answer: "mnovRtti of"
},
{
    question: "mnovRtti change prkriyaa in sntuln or pii-o-eks of sNprtyy who prstaavit done?",
    option: ["muhmmd sulemaan", "es.es. mohsiin", "phrittj haaiddr", "ebraahm mslo"],
    answer: "phrittj haaiddr"
},
{
    question: "normal anukuuln sNlkssnn or jii.e.es. of sNprtyy to who prstut done?",
    option: ["mimbaarddo", "heNs selii", "maarttin seligmain", "None of these"],
    answer: "heNs selii"
},
{
    question: "Which of the following kaark puurvdhaarnnaa to less not does?",
    option: ["aNtrsmuuh smprk", "puurvaagrh virodhii prcaar", "education", "ruuddhibddh"],
    answer: "ruuddhibddh"
},
{
    question: "who ‘aadrsh skaaraatmk aadr’ of sNprtyy given is?",
    option: ["phraaydd", "maikinle", "rojrs", "eddlr"],
    answer: "rojrs"
},
{
    question: "mnovRtti change prkriyaa in sNknowledgeaatmk visNvaaditaa of sNprtyy prtipaadit done-",
    option: ["ebraahm maislo ne", "phrittj haaiddr ne", "liyoNn pheNsttiNgr", "naarmn ttriplett ne"],
    answer: "liyoNn pheNsttiNgr"
},
{
    question: "shrennii aadhaarit skiimaa to said goes is-",
    option: ["aadi form", "ruuddhibddh", "drshk effect", "None of these"],
    answer: "ruuddhibddh"
},
{
    question: "before prstut of going which suugramoN of effect aNt in prstut of going which suugram from more prbl is /  this effect to what called are?",
    option: ["prthm effect", "environment effect", "aasnntaa effect", "krtaa-prekssk effect"],
    answer: "prthm effect"
},
{
    question: "one person suvysthit and smynisstth is phir also hm people in this socne of sNbhaavnaa occurs ki use prishrmii also should be /  this which-saa effect is?",
    option: ["prthm effect", "environment effect", "aasnntaa effect", "All of the above"],
    answer: "environment effect"
},
{
    question: "pii-o-eks trikonn in pii which is?",
    option: ["vh person is jiskii abhivRtti of adhyyn does is", "one duusraa person is", "one vissy-item is whichtowards abhivRtti of adhyyn does is is", "uprokt in from any not"],
    answer: "vh person is jiskii abhivRtti of adhyyn does is"
},
{
    question: "dvistriiy sNprtyy according to abhivRtti in change how many stroN on or crnnoN in is?",
    option: ["two", "three", "four", "one"],
    answer: "two"
},
{
    question: "chvi construction of prkriyaa in Which of the following also up-prkriyaa is?",
    option: ["choice", "anumaan", "sNgtthn", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "one abhivRtti in change may cause-",
    option: ["srvsm or sNgt", "srvmy or sNgt and visNgt", "visNgt", "does not occur"],
    answer: "srvmy or sNgt and visNgt"
},
{
    question: "one Indian vaiknowledgeik em.em. mohsin ne which sNprtyy prtipaadit done?",
    option: ["sNtuln of sNprtyy", "dvistriiy sNprtyy", "sNknowledgeaatmk visNvaaditaa or sNprtyy", "uprokt in from any not"],
    answer: "dvistriiy sNprtyy"
},
{
    question: "abhivRtti of which-sii characteristic this iNgit does is ki abhivRtti any siimaa up to skaaraatmk is or nkaaraatmk?",
    option: ["krssnn-power", "crm siimaa", "srltaa or jttiltaa", "kendriktaa"],
    answer: "crm siimaa"
},
{
    question: "abhivRtti of vicaarprk ghttk to said goes is?",
    option: ["sNknowledgeaatmk pkss", "bhaavaatmk pkss", "vyvhaaraatmk pkss", "None of these"],
    answer: "sNknowledgeaatmk pkss"
},
{
    question: "bhaavaatmk pkss as go goes is-",
    option: ["motor ghttk", "vicaarprk ghttk", "saaNvegik ghttk", "uprokt all"],
    answer: "saaNvegik ghttk"
},
{
    question: "Which of the following-from kaark abhivRttiyoN of adhigm for one sNdrbh provide do are?",
    option: ["personal anubhv", "family and school of environment", "sNdrbh group", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "vh person jo chvi bnaataa is, use what called are?",
    option: ["lkssy", "prtykssnnkrtaa", "prtibhaagii", "source"],
    answer: "prtykssnnkrtaa"
},
{
    question: "one skiimo or anviti scheme hai / ",
    option: ["mental sNrgram", "physical sNrgram", "social sNrgram", "None of these"],
    answer: "mental sNrgram"
},
{
    question: "Which of the following lkssy of quality is not?",
    option: ["anunytaa", "buddhi", "aatmsmmaan", "aalsy"],
    answer: "aalsy"
},
{
    question: "mnovRtti production of nimnaaNkit in from which kaark by prbhaavit does not occur is?",
    option: ["social siikhnaa", "vishvsniiy suugrameN", "requirement puurti", "shrotaa characteristic ofeN"],
    answer: "shrotaa characteristic ofeN"
},
{
    question: "nimnaaNkit in from which puurvaagrh in tejii from lack laataa is?",
    option: ["education", "aNtrsmuuh sNprk", "puurvaagrh-virodhii prcaar", "social vidhaan"],
    answer: "puurvaagrh-virodhii prcaar"
},
{
    question: "following in from mnovRtti of development on whose effect more",
    option: ["family of", "buddhi of", "age of", "jaati of"],
    answer: "family of"
},
{
    question: "puurvdhaarnnaa from mnovRtti which dRssttikonn from bhinn is?",
    option: ["bair bhaav", "smbddhtaa", "aavessttn", "None of these"],
    answer: "aavessttn"
},
{
    question: "‘tdnubhuuti’ anubhv doing of capacity more rkhnevaaloN in most appropriate udaahrnn is-",
    option: ["mdr tteresaa", "hemvtii nndn bhugunnaa", "medhaa paattekr", "None of these"],
    answer: "mdr tteresaa"
},
{
    question: "mnovRtti of bhaavaatmk sNghttk from taatpry is-",
    option: ["mnovRtti item towards bhaav from", "mnovRtti item towards sNveg from", "mnovRtti item towards bhaav and sNveg both", "among these from any from also not"],
    answer: "mnovRtti item towards bhaav and sNveg both"
},
{
    question: "pii.o.eks moNddl of sNdrbh in which kthn correct is?",
    option: ["this moNddl in only one person is", "this moNddl in only two person are", "this moNddl in only three person are", "this moNddl in at least"],
    answer: "this moNddl in only three person are"
},
{
    question: "sNknowledgeaatmk asNvaaditaa of smprtyy to viksit done is-",
    option: ["thrsttn", "phesttiNgr", "likrtt", "bogaardds"],
    answer: "phesttiNgr"
},
{
    question: "pro. kailii v volkaartt of mtaanusaar ‘group of determined abhivRtti to group of nye member’ which type intake do are?",
    option: ["shiighrtaa from", "vilmb from", "ekjutt hokr", "None of these"],
    answer: "shiighrtaa from"
},
{
    question: "mnovRtti construction of saaNskRtik kaark of bhuumikaa on force given-",
    option: ["bndduuraa", "sulemaan", "miidd and beneddiktt", "insko and nelsn"],
    answer: "sulemaan"
},
{
    question: "any special group towards nkaaraatmk abhivRtti to called are?",
    option: ["abhikssmtaa", "abhiruci", "puurvaagrh", "None of these"],
    answer: "puurvaagrh"
},
{
    question: "following in which mental health of basis is?",
    option: ["sNvegaatmk sthirtaa", "real sNknowledge", "vyktik svtNtrtaa", "trkpuurnn ciNtn"],
    answer: "trkpuurnn ciNtn"
},
{
    question: "smaajopkaarii behavior praayH from whom prbhaavit is?",
    option: ["adhigm from", "prtikriyaa from", "puurvaagrh from", "All of the above"],
    answer: "All of the above"
},
{
    question: "‘jo hmaarii assistance do are hmeN unkii assistance avshy krnii should’ what is called is?",
    option: ["puurvaagrh condition", "social condition", "prsprtaa condition", "saamuuhik condition"],
    answer: "prsprtaa condition"
},
{
    question: "puurvaagrh any special group towards which baat of udaahrnn is?",
    option: ["abhiruci", "abhivRtti", "abhimt", "abhikssmtaa"],
    answer: "abhivRtti"
},
{
    question: "social annytaa of bhaavnaa group towards which-sii abhivRtti of bodh kraatii is?",
    option: ["skaaraatmk abhivRtti", "nkaaraatmk abhivRtti", "uttraatmk abhivRtti", "puurvaagrhaatmk abhivRtti"],
    answer: "nkaaraatmk abhivRtti"
},
{
    question: "aarmn ttriplett ne when this found ki log duusroN of upsthiti in behtr prdrshn do are?",
    option: ["sn 1897", "sn 1902", "sn 1898", "above-mentioned in any not"],
    answer: "sn 1898"
},
{
    question: "person duusroN of upsthiti in behtr prdrshn why does is?",
    option: ["shjtaa because of", "language prbodhn because of", "prsprtaa because of", "social annytaa because of"],
    answer: "prsprtaa because of"
},
{
    question: "bhaav prbodhn activity in person by evaluation anubhv to koNttrel ne what name given is?",
    option: ["assistance to do", "evaluation bodh", "natural vipttiyoN of saamnaa to do", "None of these"],
    answer: "evaluation bodh"
},
{
    question: "‘hmeN duusroN vyktiyoN of help krnii should’ this behavior to which-saa behavior said goes is?",
    option: ["smaajonmukhii behavior", "smaajopkaarii behavior", "social behavior", "All of these"],
    answer: "smaajopkaarii behavior"
},
{
    question: "vicaarprk ghttk to which name from go goes is?",
    option: ["vyvhaarprk", "motor", "bhaavaatmk", "sNknowledgeaatmk"],
    answer: "sNknowledgeaatmk"
},
{
    question: "sNknowledgeaatmk, bhaavaatmk, vyvhaarprk ghttkoN to sNkssep in abhivRtti of which ghttk of name from go goes is?",
    option: ["e.-bii.-sii.", "e. bii. ddii.", "e.-sii. bii.", "e.-ddii.-bii."],
    answer: "e.-bii.-sii."
},
{
    question: "‘vyaapk abhivRtti of under how many abhivRttiyaaN occurs /  abhivRtti of which characteristic of smbndh this kthn from is?",
    option: ["kendriktaa", "krssnn power", "srltaa or jttiltaa", "crm siimaa"],
    answer: "srltaa or jttiltaa"
},
{
    question: "In which year sttimbr ne apne adhyyn in found ki education of level of bddh'ne from puurv-dhaarnnaa mittne seems is?",
    option: ["1962", "1960", "1963", "1961"],
    answer: "1961"
},
{
    question: "duusroN of upsthiti in log kbhii-kbhii more gltiyaaN do hai /  nisspaadn on duusroN of upsthiti of this bad effect is called are-",
    option: ["social srliikrnn", "social shrmaavnyn", "social avrodh", "None of these"],
    answer: "social avrodh"
},
{
    question: "Which of the following chvi construction of prkriyaa in smmilit is not?",
    option: ["choice", "sNgtthn", "bhuumikaa nirvaah", "anumaan"],
    answer: "bhuumikaa nirvaah"
},
{
    question: "Which of the following group sNrgram of element is not?",
    option: ["smiiptaa", "smaantaa", "asurkssaa and ciNtaa of bhaav", "anumaan"],
    answer: "asurkssaa and ciNtaa of bhaav"
},
{
    question: "phrittj haaiddr of sNtuln principle in P-0-X moNddl in 0 prtinidhitv do are-",
    option: ["another person to", "which person of mnovRtti of adhyyn is done", "another item to", "above-mentioned in from any not"],
    answer: "which person of mnovRtti of adhyyn is done"
},
{
    question: "one social group of sNrgram for less-from-less how many members need for occurs?",
    option: ["five", "four", "three", "two"],
    answer: "two"
},
{
    question: "if one muslmaan apne hinduu mitr of abhivaadn both haathoN to jodd' by does is, then vh such which group of effect of under does is?",
    option: ["primary", "secondary", "sNdrbh", "None of these"],
    answer: "secondary"
},
{
    question: "family one group of udaahrnn is-",
    option: ["primary", "secondary", "sNdrbh", "None of these"],
    answer: "primary"
},
{
    question: "Which of the following anrdvndr of prinnti is-",
    option: ["best group sNpressnn", "saamuuhik vishvaas of condition", "dvndv kaark in growth doing of", "None of these"],
    answer: "dvndv kaark in growth doing of"
},
{
    question: "kolmain according to social effect of which one type is not?",
    option: ["anupaaln", "aajnyaapaaln", "taadaatmy", "aaNtriikrnn"],
    answer: "anupaaln"
},
{
    question: "nimnaaNkit in which group sNrgram of element is not?",
    option: ["bhuumikaa", "standard", "pdvii", "group soc"],
    answer: "group soc"
},
{
    question: "‘these d maainndd of men’ of lekhk which are?",
    option: ["ttukmain", "ddiyush", "mrphii", "sheriph"],
    answer: "ddiyush"
},
{
    question: "baiNddbaign effect whose one cause is?",
    option: ["group smgrtaa", "group standard", "group dhruviikrnn", "group soc"],
    answer: "group dhruviikrnn"
},
{
    question: "nimnaaNkit in from which social effect of most indirect praaruup is?",
    option: ["anuruuptaa", "aajnyaapaaln", "anupaaln", "None of these"],
    answer: "anupaaln"
},
{
    question: "group construction of which stage in aNtrsmuuh dvNdv is?",
    option: ["nirmaannaavsthaa in", "be-hNgaamaa of stage in", "standard sthaapit doing of stage in", "None of these"],
    answer: "standard sthaapit doing of stage in"
},
{
    question: "following in which aNtr dvNdv of prinnti is?",
    option: ["bhuumikaaeN", "prtimaan", "status", "None of these"],
    answer: "prtimaan"
},
{
    question: "following in which aupcaarik group of udaahrnn is?",
    option: ["family", "jaati", "vishvvidyaaly", "dhrm"],
    answer: "vishvvidyaaly"
},
{
    question: "social svairaacaar to whose pryogoN by drshaayaa was is?",
    option: ["sheriph", "sttrnbrg", "ltaane", "hores"],
    answer: "ltaane"
},
{
    question: "social svairaacaar saamuuhik function doing in personal pryaas of-",
    option: ["adhiktaa is", "lack is", "prcurtaa is", "None of these"],
    answer: "lack is"
},
{
    question: "group in aNtHkriyaa and vicaar-vimrsh of prinnaamsvruup group of praarNbhik condition of prbltaa to said goes is-",
    option: ["group dhruviikrnn", "anupaaln", "aajnyaapaaln", "None of these"],
    answer: "group dhruviikrnn"
},
{
    question: "social svairaacaar saamuuhik function of one udaahrnn is-",
    option: ["krikett of play", "rssaakshii of play", "hoNkii of play", "baiNddmiNttn of play"],
    answer: "rssaakshii of play"
},
{
    question: "following in dvNdv smaadhaan of yukti which-sii is?",
    option: ["smjhautaa vaartaa", "aNtr-group sNprk to bddh'aanaa", "prtykssnn in change to do", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "secondary group of members in-",
    option: ["relation indirect are", "relation less nirvaiyktik are", "relation direct are", "relation more shape which are"],
    answer: "relation indirect are"
},
{
    question: "group two or two from more vyktiyoN of one sNgtthit arrangement occurs-",
    option: ["jo one-another from aNt:activity do are", "jo prspr depends are", "jinkii one jaisii abhiprernnaaeN occursN", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "bhiidd' in-",
    option: ["any sNrgram does not occur is", "aatmiiytaa of bhaavnaa does not occur is", "people of behavior avivekii is", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "group sNrgram when viksit occurs?",
    option: ["when member different-different activity do are", "when member prspr aNt:activity do are", "when any member akele any function does is", "None of these"],
    answer: "when member prspr aNt:activity do are"
},
{
    question: "jaati-",
    option: ["primarytaa group of udaahrnn are", "secondary group of udaahrnn are", "aupcaarik group of udaahrnn are", "baahy group of udaahrnn are"],
    answer: "primarytaa group of udaahrnn are"
},
{
    question: "group in people of smmilit being of cause is-",
    option: ["security", "status", "aatm-smmaan", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "who group of vrgiikrnn primary group and secondary group in done is?",
    option: ["maikaaivr", "aalportt", "ddblyuu jii smnr", "caarls kuule"],
    answer: "maikaaivr"
},
{
    question: "one sNdrbh group for srvaadhik vaaNchit stage is-",
    option: ["group of aakaar", "group of effect", "group of sdsytaa", "group of with smbddhtaa"],
    answer: "group of with smbddhtaa"
},
{
    question: "social group of following which type in srvaadhik ektaa occurs?",
    option: ["aNt: group", "baahy group", "gtishiil group", "None of these"],
    answer: "aNt: group"
},
{
    question: "group ciNtn of aavisskaar who done?",
    option: ["irviNg jenis", "sailovii", "je.em. ojhaa", "vaalaash"],
    answer: "irviNg jenis"
},
{
    question: "anuruuptaa on agrgmn use which mnovaiknowledgeikoN by done was are?",
    option: ["shems", "shairiph and aish", "meyr", "sttrnbrg"],
    answer: "shairiph and aish"
},
{
    question: "whose under person apricit people of aadesh of paaln do are?",
    option: ["kilograam", "mg", "siiliigraam", "milgraam"],
    answer: "milgraam"
},
{
    question: "all pryojyoN in how many percent ne smpuurnn aajnyaapaaln to prdrshit done?",
    option: ["65 percent", "70 percent", "64 percent", "60 percent"],
    answer: "65 percent"
},
{
    question: "anuruuptaa social effect of which-saa form is?",
    option: ["direct form", "direct and indirect", "indirect form", "among these in from any not"],
    answer: "indirect form"
},
{
    question: "aajnyaapaaln social effect of which-saa form is?",
    option: ["indirect form", "direct form", "direct and aprtyk", "None of these"],
    answer: "direct form"
},
{
    question: "anupaaln social effect of which-saa form is?",
    option: ["indirect form", "direct form", "direct v indirect of mdhy form", "None of these"],
    answer: "direct v indirect of mdhy form"
},
{
    question: "two vyktiyoN of group to which group under rkhaa jaa can is?",
    option: ["sNgtthit group", "secondary group", "primary group", "temporary group"],
    answer: "primary group"
},
{
    question: "vicaaroN, prernnaaoN, aavshyktaaoN athvaa uddeshyoN of prspr virodh of phlsvruup paidaa was vikssobh or tnaav of condition what khlaatiihai?",
    option: ["dvndv", "trk", "kunntthii", "dmn"],
    answer: "dvndv"
},
{
    question: "when from when up to raassttrpti liNddn joNnsn and combined raassttr in unke slaahkaaroN ne viytnaam yuddh to front bddh'aayaa thaa?",
    option: ["1965 from 1968 up to", "1963 from 1966 up to", "1967 from 1969 up to", "1964 from 1967 up to"],
    answer: "1965 from 1968 up to"
},
{
    question: "following in which secondary group is not?",
    option: ["family", "school", "raajnaitik dl", "klb"],
    answer: "family"
},
{
    question: "social effect of group effect prkrmoN in Which of the following one shmil is?",
    option: ["anupaalnaa", "aaNtrikiikrnn", "anupNthiikrnn", "None of these"],
    answer: "anupaalnaa"
},
{
    question: "social effect of which one prkriyaa nimnaaNkit in from is not?",
    option: ["anuruuptaa", "anupaaln", "aajnyaapaaln", "social shrmaavnyn"],
    answer: "social shrmaavnyn"
},
{
    question: "sttokols naamk mnovaiknowledgeik ne which sn in three upaagmoN of vrnnn done?",
    option: ["1990", "1980", "1989", "1991"],
    answer: "1990"
},
{
    question: "life of quality to bad bnaa rhe are-",
    option: ["shor", "pollution", "bhiidd'", "All of the above"],
    answer: "All of the above"
},
{
    question: "vaiyktik distance how many phiitt from lekr how many phiitt up to occurs?",
    option: ["15 iNc from 7 phiitt", "4 phiitt from 12 phiitt", "18 iNc from 4phiitt", "10 iNc from 6 phiitt"],
    answer: "18 iNc from 4phiitt"
},
{
    question: "4 phiitt from lekr 25 phiitt up to of distance which-sii occurs?",
    option: ["social distance", "public distance", "vaiyktik distance", "antrNg distance"],
    answer: "public distance"
},
{
    question: "prtykssit asmtaa dvndv of which-saa cause is?",
    option: ["duusraa", "first", "cauthaa", "tiisraa"],
    answer: "duusraa"
},
{
    question: "which mnovaiknowledgeik of adhyyn ne this prdrshit done ki ucckotti lkssyoN of nirdhaarnn by doing antr-group dvndv to less by can is?",
    option: ["vaalaash", "sheriph", "vaakr meNhdii", "paasii"],
    answer: "sheriph"
},
{
    question: "Which of the following saamjik effect produced do are?",
    option: ["mitr", "reddiyo", "tteliivijn", "All of the above"],
    answer: "All of the above"
},
{
    question: "following in from in which protsaahk prspr dependence paaii goes is-",
    option: ["shyogii paaritossik sNrgram", "prtisprdhaatmk paaritossik sNrgram", "aNtrvaiyktik sNpressnn", "None of these"],
    answer: "shyogii paaritossik sNrgram"
},
{
    question: "which mnovaiknowledgeik ne group of five anukrmoN to btaayaa thaa?",
    option: ["ttkmain", "irviNg jenis", "jenis", "aish"],
    answer: "ttkmain"
},
{
    question: "Which of the following anuruuptaa of nirdhaark is?",
    option: ["group of aakaar", "group of sNghttn", "group of power", "All of these"],
    answer: "All of these"
},
{
    question: "vidyaarthii to mhaavidyaaly in determined ddres in go, play of maidaan in play of niymoN to apnaanaa aadi udaahrnn are-",
    option: ["anupaaln", "anuruuptaa", "aajnyaapaaln", "None of these"],
    answer: "aajnyaapaaln"
},
{
    question: "caattukaaritaa, paarspriktaa and bhu anurodh prvidhiyaaN are-",
    option: ["anuruuptaa of", "anupaaln of", "aajnyaapaaln of", "None of these"],
    answer: "anupaaln of"
},
{
    question: "Which of these smaanubhuuti characteristic of is not?",
    option: ["smaanubhuuti aadhaarit shj smbndh", "sNvaad in ekruuptaa", "laabhaarthii of mental jgt to approximately entire trh from smjh obtaining of anubhv", "shaanubhuuti"],
    answer: "shaanubhuuti"
},
{
    question: "ucctm sNgtthit group is-",
    option: ["desh", "family", "senaa", "industrial sNgtthn"],
    answer: "desh"
},
{
    question: "group dhruviikrnn from sNprtyy of prtipaadn by whom done was?",
    option: ["phreshnr and myuulr", "phreshnr and shelddn", "moskovisii and phrejr", "None of these"],
    answer: "phreshnr and shelddn"
},
{
    question: "shor or noise to naapne for which unit of is used?",
    option: ["bel", "maaikrobel", "ddesiibel", "ddii.pii."],
    answer: "ddesiibel"
},
{
    question: "pure air khlaatii is-",
    option: ["78.98%N₂, 20.94%O₂ and 0.03%CO₂", "20.94%N₂, 78.98%O₂ and 0.03%CO₂", "60.30%N₂, 39.20%O₂ and 0.03%CO₂", "None of these"],
    answer: "78.98%N₂, 20.94%O₂ and 0.03%CO₂"
},
{
    question: "sdd'k, bodh aadi udaahrnn are-",
    option: ["environment of", "made environment of", "natural environment of", "None of these"],
    answer: "made environment of"
},
{
    question: "Indian priprekssy in poor kise kheNge?",
    option: ["income less and life apryaapt be", "income more be on requirement less be", "income and requirement both more be", "None of these"],
    answer: "income less and life apryaapt be"
},
{
    question: "pryaavrnniiy mnovaiknowledgeikoN ne environment preservation of which maadhym on force given is?",
    option: ["puurv behavior anubodhk", "pshc behavior punrbln", "pryaavrnniiy education", "All of the above"],
    answer: "All of the above"
},
{
    question: "plastic thailoN use of environment for one bdd'ii problem is, kyoNki plastic thaile-",
    option: ["jaivik kssrnnshiil are", "jaivik akssrnnshiil are", "jvlnshiil are", "All of the above are"],
    answer: "jaivik akssrnnshiil are"
},
{
    question: "Which of the following-from made environment of udaahrnn are?",
    option: ["ngr", "baaNdh", "pul", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "human-made vipdaa of udaahrnn is notN-",
    option: ["yuddh", "kaarkhaanoN in vissaile gas of risaav", "mhaamaarii", "tuuphaan"],
    answer: "tuuphaan"
},
{
    question: "human-environment smbndh of vivrnn prstut doing for following in which mnovaiknowledgeik ne three upaagmoN of vrnnn done?",
    option: ["sttokols", "joNn ddoloNrdd", "elbrtt bNduuraa", "eddvrdd hoNl"],
    answer: "sttokols"
},
{
    question: "avshisstt substance jo jaivik form from kssrnnshiil not are-",
    option: ["plastic", "dhaatu from made paatr", "ttiin", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "following in from which kaarnnoN from abhighaatj uttr dbaav vikaar produced are-",
    option: ["shor", "natural vipdaaeN", "pollution", "bhiidd'"],
    answer: "natural vipdaaeN"
},
{
    question: "aNtrvaiyktik physical distance in person what type of distance bnaae keeps is?",
    option: ["physical (physical)", "economic", "mental", "None of these"],
    answer: "physical (physical)"
},
{
    question: "dbaav one condition is-",
    option: ["mnovaiknowledgeik", "social", "economic", "None of these"],
    answer: "mnovaiknowledgeik"
},
{
    question: "sii.eph.sii. or kloro-phloro carbon kise polluted do are?",
    option: ["mRdaa", "water", "air", "None of these"],
    answer: "air"
},
{
    question: "function nisspaadn on shor of effect to shor of which-sii characteristic determined does is?",
    option: ["shor of tiivrtaa", "bhvissy kthniiytaa", "niyNtrnniiytaa", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "bhopaal gas traasdii when was thii?",
    option: ["disNbr, 1984", "disNbr, 1986", "May, 1984", "jnvrii, 1981"],
    answer: "disNbr, 1984"
},
{
    question: "environment of vissy in paarNprik Indian dRssttikonn which priprekssy to maanytaa gives is?",
    option: ["alptmvaadii priprekssy", "naimittik priprekssy", "aadhyaatmik priprekssy", "All of these"],
    answer: "aadhyaatmik priprekssy"
},
{
    question: "uttraakhNdd field of ‘cipko aaNdoln’ human-environment relation in which priprekssy of udaahrnn is?",
    option: ["aadhyaatmik priprekssy", "naimittik priprekssy", "alptmvaadii priprekssy", "None of these"],
    answer: "aadhyaatmik priprekssy"
},
{
    question: "Which of the following pryaavrnnii dbaav kaarkoN of udaahrnn are?",
    option: ["shor", "bhiidd'", "natural vipdaaeN", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "‘environment to ksstigrst to do’ human environment relation of which priprekssy to drshaataa is?",
    option: ["alpmtvaadii priprekssy", "naimittik priprekssy", "aadhyaatmik priprekssy", "None of these"],
    answer: "naimittik priprekssy"
},
{
    question: "environment-unmukh behavior is not-",
    option: ["environment of smsyaaoN from preservation to do", "environment to destroyed to do", "healthy environment to unnt to do", "environment mitr vstuoN use of to do"],
    answer: "environment to destroyed to do"
},
{
    question: "which mnovaiknowledgeik ne condition on dependence of basis on four type of aNtrvyktik distance to btaayaa is?",
    option: ["joNn ddoloNrdd", "sttokols", "eddvrdd hoNl", "elbrtt bNduuraa"],
    answer: "eddvrdd hoNl"
},
{
    question: "following in from which on poverty and vNcn of prtikuul effect falls is?",
    option: ["abhiprernnaa", "sNknowledgeaatmk prkriyaaoN", "vyktitv", "All of the above"],
    answer: "All of the above"
},
{
    question: "following in from antrraassttriiy group which-saa is?",
    option: ["aikshn edd", "sevrshn edd", "veNvshn edd", "None of these"],
    answer: "aikshn edd"
},
{
    question: "which mnovaiknowledgeik ne adhyyn by aakrmktaa of adhigm in moNddl of bhuumikaa to prdrshit done is?",
    option: ["vuddvrth", "joNn Smith", "vunntt", "elbrtt bNduuraa"],
    answer: "elbrtt bNduuraa"
},
{
    question: "natural vipdaaeN Which of the following-sii are?",
    option: ["bhuukmp", "baaddh'", "tuuphaan", "All of the above"],
    answer: "All of the above"
},
{
    question: "which vaiknowledgeik ne kuNtthaa aakraamktaa principle of test doing for adhyyn done?",
    option: ["jaan ddolaardd", "Smith", "elbrtt bNduuraa", "joNn"],
    answer: "jaan ddolaardd"
},
{
    question: "ec.aaii.vii, kise called are?",
    option: ["malaria", "jukaam", "edds", "kaiNsr"],
    answer: "edds"
},
{
    question: "amerikii mnovaiknowledgeik sNgh ne In which year kaarydl establishment of thii?",
    option: ["1973", "1974", "1975", "1972"],
    answer: "1973"
},
{
    question: "generally hmeN how many types of mnovaiknowledgeik should?",
    option: ["one", "four", "three", "two"],
    answer: "two"
},
{
    question: "saakssaatkaar skill vh means is jiske by maukhik athvaa likhit vaartaalaapoN of expression occurs /  this kthn who likhaa is?",
    option: ["sii-aaijnek", "je.pii. daas", "vhaaitt", "ttraams"],
    answer: "sii-aaijnek"
},
{
    question: "which stage in saakssaatkaardaataa from those prshnoN to puuchaa goes is jo ki saakssaatkaar of uddeshy to full do are?",
    option: ["praarmbhik stage", "main part or mdhy stage", "smaapn stage", "All of the above"],
    answer: "main part or mdhy stage"
},
{
    question: "which desh of mnovaiknowledgeik sNgh by gtthit function dl kaushloN of three sumuccy are?",
    option: ["ciin", "jaapaan", "phraaNs", "amerikaa"],
    answer: "amerikaa"
},
{
    question: "praamrsh of smbndh is-",
    option: ["social", "shaaytaaprk", "vyktiprk", "vstuprk"],
    answer: "shaaytaaprk"
},
{
    question: "prbhaavii praamrshdaataa of necessary quality are-",
    option: ["praamaanniktaa and punrvaakyvinyaas", "duusroN towards skaaraatmktaa", "tdnubhuuti", "All of the above"],
    answer: "All of the above"
},
{
    question: "praamrshdaataa of andr one srvaadhik important skill is-",
    option: ["tdnubhuuti", "vaiyktik evaluation", "shaaytaagraahytaa", "None of these"],
    answer: "tdnubhuuti"
},
{
    question: "sevaarthii-praamrshdaataa of smbndh is-",
    option: ["social basis", "vyaafatyik basis", "raajnaitik basis", "naitik basis"],
    answer: "naitik basis"
},
{
    question: "prbhaavii mnovaiknowledgeik as viksit being for jruurii is-",
    option: ["akhnnddtaa of honaa", "skssmtaa of honaa", "saarthktaa v vaiknowledgeiktaa", "appropriate all"],
    answer: "skssmtaa of honaa"
},
{
    question: "praamrsh smbndhii anukriyaa to sevaarthii towards to do is-",
    option: ["vicaaroN towards", "kriyaaoN towards", "bhaavnaaoN towards", "All of the above"],
    answer: "All of the above"
},
{
    question: "sNdeshoN towards jaankaarii and sNvednshiiltaa praamrshdaataa for necessary is-",
    option: ["prbhaavitaa for", "saamaajiktaa for", "vissyprktaa for", "None of these"],
    answer: "prbhaavitaa for"
},
{
    question: "prbhaavii sNprekssnn of prti obtained of jaa sktii is-",
    option: ["proper sNdesh by", "pryaavrnniiy shor controlled by doing", "kushltaa use of by doing", "All of these"],
    answer: "All of these"
},
{
    question: "shrvnn prkriyaa of one praarmbhik crnn is,",
    option: ["sNdesh to sNpressit to do", "sNdesh prkriyaa apnaanaa", "uddiipk or sNdesh of abhigrhnn to do", "sNdesh intake by bhnnddaarnn to do"],
    answer: "uddiipk or sNdesh of abhigrhnn to do"
},
{
    question: "pryaavrnniiy mnovaiknowledgeik which maadhymoN by environment preservation on force dete haiN / ",
    option: ["pryaavrnniiy education", "puurv behavior anubodhk", "pshc behavior punrbln", "All of these"],
    answer: "pryaavrnniiy education"
},
{
    question: "griphritt of yogdaan following in from which field in is?",
    option: ["prkaash", "shorgul", "air-pollution", "temperature"],
    answer: "temperature"
},
{
    question: "world environment day mnaayaa goes is-",
    option: ["5 April", "5 May", "5 June", "5 July"],
    answer: "5 June"
},
{
    question: "bhuukmp one sNktt is-",
    option: ["natural", "raajnaitik", "social", "dhaarmik"],
    answer: "natural"
},
{
    question: "jin prkriyaa by person apne vaataavrnn of stt aavaaj of with smNjn sthaapit by letaa is, use said goes is-",
    option: ["abhysn", "siikhnaa", "aadt making", "None of these"],
    answer: "abhysn"
},
{
    question: "mnoviknowledge of vh shaakhaa jo human-environment antHkriyaaoN of adhyyn does is-",
    option: ["pryaavrnniiy mnoviknowledge", "society-environment mnoviknowledge", "society mnoviknowledge", "child mnoviknowledge"],
    answer: "pryaavrnniiy mnoviknowledge"
},
{
    question: "vaataavrnniiy pollution which form in may cause?",
    option: ["Air pollution", "Water pollution", "soil pollution", "All of these"],
    answer: "All of these"
},
{
    question: "aakrmnn to who this form in prmaannit done is? aakrmnn from taatpry duusroN towards done were sbhipraay kssti from is”",
    option: ["hilgaardd", "phraaydd", "brkobittj", "None of these"],
    answer: "phraaydd"
},
{
    question: "shbhaagii prekssnn of main quality",
    option: ["svaabhaaviktaa", "lciilaapn", "prishuddhtaa", "vstunisstthtaa"],
    answer: "lciilaapn"
},
{
    question: "which prekssnn in prekssk, prekssit group of with ghul mil by ghttnaa of avlokn natural form from does is?",
    option: ["shbhaagii", "ashbhaagii", "prkRtivaadii", "None of these"],
    answer: "shbhaagii"
},
{
    question: "saakssaatkaar of uddeshy is-",
    option: ["aamne-saamne of smprk from suugram obtained to do", "priklpnaaoN of source", "avlokn for opportunity paanaa", "All of these"],
    answer: "All of these"
},
{
    question: "mnoviknowledge of vstunisstth niriikssnn method of prvrtk which is?",
    option: ["uNtt", "viliym jems", "vaattsn", "None of these"],
    answer: "uNtt"
},
{
    question: "aamne-saamne of relation necessary is-",
    option: ["prshnaavlii method in", "saakssaatkaar method in", "kesuu adhyyn method in", "rettiNg method in"],
    answer: "saakssaatkaar method in"
},
{
    question: "Which of the following sNcaar of element is not?",
    option: ["speaking", "sunnaa", "physical language", "praanubhuuti"],
    answer: "praanubhuuti"
},
{
    question: "one saakssaatkaar in one puurv determined anugmn is done / …….. question shRNkhlaa of",
    option: ["asNrcit", "arddh sNrcit", "aabhaasii sNrcit", "sNrcit"],
    answer: "sNrcit"
},
{
    question: "following in kise mnoviknowledge in evaluation method of device as not smjhaa goes is?",
    option: ["mnovaiknowledgeik test", "kes adhyyn", "mnshcikitsaa", "saakssaatkaar"],
    answer: "mnshcikitsaa"
},
{
    question: "nimnaaNkit in from which prbhaavii praamrshdaataa of quality is not?",
    option: ["praanubhuuti", "praamaanniktaa", "bhaavaanuvaad", "sshrt smmaan"],
    answer: "sshrt smmaan"
},
{
    question: "one prbhaavii mnovaiknowledgeik bnne for which trh of skill need occurs?",
    option: ["normal skill", "prekssnnaatmk skill", "special skill", "All of these"],
    answer: "All of these"
},
{
    question: "person of physical haavbhaav which shrennii of skill is?",
    option: ["praamrsh skill", "mnovaiknowledgeik test function skill", "saakssaatkaar function skill", "sNcaar skill"],
    answer: "sNcaar skill"
},
{
    question: "aNtrvaiyktik sNprekssnn related is-",
    option: ["svyN from", "two or two from more vyktiyoN from", "jnsbhaa from", "bhiidd' from"],
    answer: "two or two from more vyktiyoN from"
},
{
    question: "aNtrvaiyktik sNpressnn of type are-",
    option: ["saakssaatkaar", "mdhysth aadhaarit vaartaalaap", "small group pricrcaa", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "prekssnn of vh triikaa jisse hm sikhte are ki log bhinn pristhitiyoN in how behavior do are, is called is-",
    option: ["prkRtivaadii prekssnn", "normal prekssnn", "shbhaagii prekssnn", "None of these"],
    answer: "prkRtivaadii prekssnn"
},
{
    question: "mnovaiknowledgeik apne environment of which pkssoN of vibhinn phluoN of baare in prekssnn does is?",
    option: ["ghttnaaeN", "person", "both", "None of these"],
    answer: "both"
},
{
    question: "apnii baatoN to reddiyo or tteliivijn of maadhym from vktaa by khne to called are-",
    option: ["public sNpressnn", "aNtraavaiyktik sNpressnn", "aNtrvaiyktik srpekssnn", "None of these"],
    answer: "public sNpressnn"
},
{
    question: "grm sttov to chuune on aNguliyoN of khiiNgram and hmaarii eyes in aaNsuu aanaa whose udaahrnn is-",
    option: ["vaacik sNpressnn", "avaacik sNpressnn", "bhaassaayii sNpressnn", "None of these"],
    answer: "avaacik sNpressnn"
},
{
    question: "sNpressnn one prkriyaa is-",
    option: ["scetn", "acetn", "saabhipraay", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "person of svyN from sNvaad doing of activity to called are-",
    option: ["antyrvaiyktik sNpressnn", "aNtrvaiyktik sNpressnn", "public sNpressnn", "None of these"],
    answer: "antyrvaiyktik sNpressnn"
},
{
    question: "amerikii mnovaiknowledgeik sNgh of ne one kaarydl gtthit done jiskaa uddeshy whichfor necessary kaushloN of phcaan to do thaa?",
    option: ["smaajshaastriyoN", "vyaafatyik mnovaiknowledgeikoN", "arthshaastriyoN", "None of these"],
    answer: "vyaafatyik mnovaiknowledgeikoN"
},
{
    question: "shrvnn prkriyaa in which organs of bhuumikaa does not occur is?",
    option: ["kaan", "mstissk", "naak", "aaNkh"],
    answer: "naak"
},
{
    question: "body language in Which of the following-from kaark shaamil are?",
    option: ["haavbhaav", "hand of gti", "bhNgimaa", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "saakssaatkaar of which part in saakssaatkaarkrtaa suugram and prdtt obtained doing of uddeshy from question puuchtaa is?",
    option: ["praarNbh", "main part", "smaapn", "None of these"],
    answer: "main part"
},
{
    question: "mnovaiknowledgeik priikssnnoN use of do time necessary is-",
    option: ["vstunisstthtaa", "vaiknowledgeik unmukhtaa", "maankiikRt vyaakhyaa", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "shrvnn in which-sii characteristic not honii should?",
    option: ["dhairyvaan", "adhairyvaan", "anirnnyaatmk", "dhyaan skriytaa"],
    answer: "adhairyvaan"
},
{
    question: "hearing which by hmaarii of was baatoN to apnii smjh from baatoN or vicaaroN to punrkthit is called is-",
    option: ["punrvaakyvinyaas", "abhigrhnn", "dhyaan", "aaropnn"],
    answer: "punrvaakyvinyaas"
},
{
    question: "one prekssnnkrtaa by usii shoNpiNg moNl of shop in aNshkaalik job lekr inside of person bnkr graahkoN of behavior in bhinntaaoN of prekssnn is called is-",
    option: ["prkRtivaadii prekssnn", "shbhaagii prekssnn", "aatm prtykssnn", "evaluation prekssnn"],
    answer: "shbhaagii prekssnn"
},
{
    question: "one prbhaavii praamrshdaataa of gunne is notN.",
    option: ["praamaanniktaa", "duusroN towards skaaraatmk aadr", "tdnubhuuti of yogytaa", "duusroN towards skaaraatmk anaaduur"],
    answer: "duusroN towards skaaraatmk anaaduur"
},
{
    question: "saakssaatkaar of three avsthaaeN occursN, nimnaaNkit in which those avsthaaoN in is not?",
    option: ["praarNbhik taiyaarii", "prshnottr kaal", "smaapn of avsthaaeN", "relation making of avsthaaeN"],
    answer: "relation making of avsthaaeN"
},
{
    question: "which prekssnn from prekssk, prekssit group of with ghul mil by ghttnaa of avlokn does is?",
    option: ["shbhaagii", "ashbhaagii", "prkRtivaadii", "None of these"],
    answer: "shbhaagii"
},
{
    question: "two or more vyktiyoN between vaartaalaap and antHkriyaa is-",
    option: ["test", "saakssaatkaar", "praamrsh", "use"],
    answer: "saakssaatkaar"
},
{
    question: "sNcaar skill for which-saa skill anivaary is not?",
    option: ["pebhaavii speaking", "prbhaavii ddhNg from sunnaa", "ashaabdik sNcaar", "saaNvegik sthirtaa"],
    answer: "ashaabdik sNcaar"
},
{
    question: "sNcaar kuutt sNketn characteristic of which is?",
    option: ["kuutt sNketn in person apnii anubhuuti in change laataa hai / ", "kuutt sNketn in person apnii saaNvegik uttejnaa on control does hai / ", "kuutt sNketn in person apne vicaaroN to special meaning provide does hai / ", "kuutt sNketn in person apnii bhaavnaaoN to viksit does hai / "],
    answer: "kuutt sNketn in person apne vicaaroN to special meaning provide does hai / "
},
{
    question: "which skill to three bhaagoN in vibhaajit done was is?",
    option: ["normal skill", "aadhaarbhuut skill", "special skill", "praamrsh skill"],
    answer: "aadhaarbhuut skill"
},
{
    question: "which skill use of mnovaiknowledgeik behavior of vissy in antrdRsstti of development doing for praarmbhik stage in is done?",
    option: ["prekssnn skill", "special skill", "test skill", "praamrsh skill"],
    answer: "prekssnn skill"
},
{
    question: "shrvnn prkriyaa of one praarmbhik crnn is-",
    option: ["sNdesh to sNpressit to do", "sNdesh prkriyaa apnaanaa", "uddiipk or sNdesh of abhigrhnn to do", "sNdesh intake by bhnnddaarnn to do"],
    answer: "uddiipk or sNdesh of abhigrhnn to do"
},
{
    question: "saakssaatkaar skill one prkriyaa is-",
    option: ["mukhonmukh vaartaalaap", "duurbhaass vaartaalaap", "prshnaavlii bhrnaa", "anusuucii of prkriyaa"],
    answer: "mukhonmukh vaartaalaap"
},
{
    question: "saakssaatkaar in which crnn is not?",
    option: ["praarNbhik taiyaarii", "saakssaatkaar in relation to prgaaddh'taa", "saakssaatkaar of operation or prshnottr str", "saakssaatkaar smaapn"],
    answer: "saakssaatkaar in relation to prgaaddh'taa"
},
{
    question: "Which of these praamrsh of prvidhiyaaN is not?",
    option: ["nirdeshk praamrsh", "anirdeshk praamrsh", "smjhautaavaadii praamrsh", "protsaahn praamrsh"],
    answer: "protsaahn praamrsh"
},

];

// --- Helper: Shuffle questions ---
const shuffleQuestions = (questions) => {
  const shuffled = [...questions];
  for (let i = shuffled.length - 1; i > 0; i--) {
    const j = Math.floor(Math.random() * (i + 1));
    [shuffled[i], shuffled[j]] = [shuffled[j], shuffled[i]];
  }
  return shuffled;
};

// --- Component ---
export default function Psychology12thQuiz() {
  const [started, setStarted] = useState(false);
  const [submitted, setSubmitted] = useState(false);
  const [timer, setTimer] = useState(3600); // 60 minutes = 3600 seconds
  const [language, setLanguage] = useState('hi');
  const [questions, setQuestions] = useState([]);
  const [current, setCurrent] = useState(0);
  const [answers, setAnswers] = useState({});
  const [score, setScore] = useState(0);
  const [resultDetails, setResultDetails] = useState([]);
  const [showTimerWarning, setShowTimerWarning] = useState(false);
  const resultRef = useRef(null);

  useEffect(() => {
    if (started && !submitted && timer > 0) {
      const t = setInterval(() => {
        setTimer((p) => {
          if (p <= 60) setShowTimerWarning(true);
          return p - 1;
        });
      }, 1000);
      return () => clearInterval(t);
    }
    if (timer === 0 && started && !submitted) {
      submitExam();
    }
  }, [started, submitted, timer]);

  const startExam = () => {
    const questionBank = language === 'hi' ? psychologyHindi : psychologyEnglish;
    // Select only 100 questions (all of them)
    const selectedQuestions = shuffleQuestions(questionBank).slice(0, 100);
    setQuestions(selectedQuestions);
    setStarted(true);
    setTimer(3600);
    setAnswers({});
    setCurrent(0);
    setShowTimerWarning(false);
  };

  const submitExam = () => {
    let s = 0;
    const details = questions.map((q, i) => {
      const isCorrect = answers[i] === q.answer;
      if (isCorrect) s++;
      return {
        question: q.question,
        option: q.option,
        correctAnswer: q.answer,
        userAnswer: answers[i] || (language === 'hi' ? "प्रयास नहीं किया" : "Not Attempted"),
        isCorrect: isCorrect,
        isAttempted: answers[i] !== undefined,
      };
    });
    setScore(s);
    setResultDetails(details);
    setSubmitted(true);
  };

  const toggleLanguage = () => {
    if (!started) {
      setLanguage(language === 'hi' ? 'en' : 'hi');
    }
  };

  const downloadResult = () => {
    if (resultRef.current) {
      const printWindow = window.open('', '_blank');
      if (printWindow) {
        const content = resultRef.current.innerHTML;
        printWindow.document.write(`
          <html>
            <head>
              <title>${language === 'hi' ? 'मनोविज्ञान 12वीं परिणाम' : 'Psychology 12th Result'}</title>
              <style>
                body { font-family: Arial, sans-serif; padding: 20px; }
                .result-container { max-width: 800px; margin: 0 auto; }
                .header { text-align: center; padding: 20px; background: linear-gradient(135deg, #1a237e, #3f51b5); color: white; border-radius: 10px; margin-bottom: 20px; }
                .score-card { text-align: center; padding: 20px; border: 2px solid #1a237e; border-radius: 10px; margin-bottom: 20px; }
                .score { font-size: 40px; font-weight: bold; color: #1a237e; }
                .status { font-size: 20px; margin: 10px 0; }
                .pass { color: #28a745; }
                .fail { color: #dc3545; }
                .question-item { padding: 15px; margin: 10px 0; border-radius: 8px; border-left: 4px solid #48bb78; background: #f8f9fa; }
                .question-item.wrong { border-left-color: #dc3545; background: #fff5f5; }
                .question-item .q { font-weight: bold; font-size: 14px; }
                .question-item .your-answer { margin-top: 5px; font-size: 13px; }
                .question-item .correct-answer { margin-top: 3px; font-size: 13px; color: #28a745; font-weight: bold; }
                .wrong-answer { color: #dc3545; }
                .correct-answer-text { color: #28a745; }
                .not-attempted { color: #ffc107; }
                .footer { text-align: center; margin-top: 20px; padding: 10px; color: #666; font-size: 12px; border-top: 1px solid #ddd; }
              </style>
            </head>
            <body>
              <div class="result-container">
                ${content}
              </div>
            </body>
          </html>
        `);
        printWindow.document.close();
        printWindow.print();
      }
    }
  };

  const getText = (key) => {
    const texts = {
      'title': { hi: '🧠 मनोविज्ञान 12वीं', en: '🧠 Psychology 12th' },
      'subtitle': { hi: 'कक्षा 12 मनोविज्ञान प्रश्नोत्तरी', en: 'Class 12 Psychology Quiz' },
      'questions': { hi: '📝 प्रश्न', en: '📝 Questions' },
      'time': { hi: '⏱️ समय', en: '⏱️ Time' },
      'instructions': { hi: '📋 निर्देश:', en: '📋 Instructions:' },
      'compulsory': { hi: 'सभी प्रश्न अनिवार्य हैं', en: 'All questions are compulsory' },
      'marks': { hi: 'प्रत्येक प्रश्न 1 अंक का है', en: 'Each question carries 1 mark' },
      'negative': { hi: 'कोई नकारात्मक अंकन नहीं', en: 'No negative marking' },
      'start': { hi: '🚀 क्विज़ शुरू करें', en: '🚀 Start Quiz' },
      'answered': { hi: 'उत्तर दिए:', en: 'Answered:' },
      'prev': { hi: '⬅ पिछला', en: '⬅ Prev' },
      'next': { hi: 'अगला ➡', en: 'Next ➡' },
      'submit': { hi: '📤 जमा करें', en: '📤 Submit' },
      'navigator': { hi: 'प्रश्न नेविगेटर', en: 'Question Navigator' },
      'answered_status': { hi: '🟢 उत्तर दिया', en: '🟢 Answered' },
      'current_status': { hi: '🔵 वर्तमान', en: '🔵 Current' },
      'unanswered_status': { hi: '⚪ अनुत्तरित', en: '⚪ Unanswered' },
      'congrats': { hi: '🎉 शानदार प्रदर्शन!', en: '🎉 Excellent Performance!' },
      'practice': { hi: '📖 सीखते रहें!', en: '📖 Keep Learning!' },
      'passed': { hi: '✔️ उत्तीर्ण', en: '✔️ Passed' },
      'failed': { hi: '❌ सुधार की आवश्यकता', en: '❌ Needs Improvement' },
      'review': { hi: '📋 उत्तर समीक्षा', en: '📋 Answer Review' },
      'your_answer': { hi: 'आपका उत्तर:', en: 'Your Answer:' },
      'correct_answer': { hi: 'सही उत्तर:', en: 'Correct Answer:' },
      'new_quiz': { hi: '🔄 नई क्विज़ लें', en: '🔄 Take New Quiz' },
      'warning': { hi: '⚠️ 1 मिनट से कम समय शेष!', en: '⚠️ Less than 1 minute remaining!' },
      'download': { hi: '📥 परिणाम डाउनलोड करें', en: '📥 Download Result' },
      'status': { hi: 'स्थिति', en: 'Status' },
      'correct': { hi: 'सही', en: 'Correct' },
      'wrong': { hi: 'गलत', en: 'Wrong' },
      'not_attempted': { hi: 'प्रयास नहीं किया', en: 'Not Attempted' },
    };
    return texts[key]?.[language] || texts[key]?.['en'] || key;
  };

  // Home Page
  if (!started) {
    return (
      <div style={{
        minHeight: "100vh",
        display: "flex",
        justifyContent: "center",
        alignItems: "center",
        background: "linear-gradient(135deg, #1a237e 0%, #283593 50%, #3f51b5 100%)",
        fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif",
        padding: "20px"
      }}>
        <div style={{
          backgroundColor: "white",
          padding: "25px 20px",
          borderRadius: "16px",
          boxShadow: "0 20px 60px rgba(0,0,0,0.6)",
          textAlign: "center",
          maxWidth: "500px",
          width: "100%",
          animation: "fadeInUp 0.6s ease"
        }}>
          <div style={{ fontSize: "48px", marginBottom: "5px" }}>🧠</div>
          <h1 style={{ 
            color: "#1a237e", 
            marginBottom: "3px", 
            fontSize: "22px",
            fontWeight: "700"
          }}>
            {getText('title')}
          </h1>
          <p style={{ color: "#666", fontSize: "12px", marginBottom: "15px" }}>
            {getText('subtitle')}
          </p>
          <div style={{
            height: "3px",
            background: "linear-gradient(90deg, #1a237e, #3f51b5)",
            margin: "10px auto",
            width: "60px"
          }}></div>

          {/* Language Toggle */}
          <div style={{
            display: "flex",
            justifyContent: "center",
            alignItems: "center",
            gap: "12px",
            marginTop: "15px",
            marginBottom: "15px"
          }}>
            <span style={{ 
              fontSize: "14px", 
              fontWeight: language === 'hi' ? "700" : "400",
              color: language === 'hi' ? "#1a237e" : "#999"
            }}>हिन्दी</span>
            <button
              onClick={toggleLanguage}
              style={{
                width: "50px",
                height: "26px",
                borderRadius: "13px",
                background: language === 'hi' ? "#3f51b5" : "#4a90d9",
                border: "none",
                cursor: "pointer",
                position: "relative",
                transition: "all 0.3s ease"
              }}
            >
              <div style={{
                width: "20px",
                height: "20px",
                borderRadius: "50%",
                background: "white",
                position: "absolute",
                top: "3px",
                left: language === 'hi' ? "3px" : "27px",
                transition: "all 0.3s ease",
                boxShadow: "0 2px 4px rgba(0,0,0,0.2)"
              }}></div>
            </button>
            <span style={{ 
              fontSize: "14px", 
              fontWeight: language === 'en' ? "700" : "400",
              color: language === 'en' ? "#1a237e" : "#999"
            }}>English</span>
          </div>

          <div style={{
            display: "grid",
            gridTemplateColumns: "1fr 1fr",
            gap: "10px",
            marginTop: "10px"
          }}>
            <div style={{ 
              backgroundColor: "#e8f0fe", 
              padding: "12px", 
              borderRadius: "10px"
            }}>
              <div style={{ fontSize: "11px", color: "#666" }}>{getText('questions')}</div>
              <div style={{ fontSize: "22px", fontWeight: "bold", color: "#1a237e" }}>100</div>
            </div>
            <div style={{ 
              backgroundColor: "#e8f0fe", 
              padding: "12px", 
              borderRadius: "10px"
            }}>
              <div style={{ fontSize: "11px", color: "#666" }}>{getText('time')}</div>
              <div style={{ fontSize: "22px", fontWeight: "bold", color: "#1a237e" }}>60 Mins</div>
            </div>
          </div>

          <div style={{
            backgroundColor: "#e8f0fe",
            padding: "10px",
            borderRadius: "10px",
            marginTop: "10px",
            fontSize: "12px",
            color: "#1a237e"
          }}>
            💡 {language === 'hi' ? 'कक्षा 12 मनोविज्ञान के सभी अध्यायों की व्यापक कवरेज' : 'Comprehensive coverage of all Class 12 Psychology chapters'}
          </div>

          <div style={{
            backgroundColor: "#f8f9fa",
            padding: "10px",
            borderRadius: "10px",
            marginTop: "10px",
            fontSize: "12px",
            color: "#555",
            textAlign: "left"
          }}>
            <strong>{getText('instructions')}</strong>
            <ul style={{ margin: "5px 0 0 0", paddingLeft: "18px" }}>
              <li>{getText('compulsory')}</li>
              <li>{getText('marks')}</li>
              <li>{getText('negative')}</li>
            </ul>
          </div>

          <button
            onClick={startExam}
            style={{
              padding: "14px 40px",
              fontSize: "18px",
              fontWeight: "bold",
              background: "linear-gradient(135deg, #1a237e 0%, #3f51b5 100%)",
              color: "white",
              border: "none",
              borderRadius: "50px",
              cursor: "pointer",
              marginTop: "20px",
              width: "100%",
              transition: "transform 0.3s, box-shadow 0.3s",
              boxShadow: "0 4px 15px rgba(63, 81, 181, 0.4)"
            }}
            onMouseEnter={(e) => e.target.style.transform = "scale(1.02)"}
            onMouseLeave={(e) => e.target.style.transform = "scale(1)"}
          >
            {getText('start')}
          </button>
        </div>
      </div>
    );
  }

  // Result Page
  if (submitted) {
    const percentage = ((score / questions.length) * 100).toFixed(2);
    const isPassed = percentage >= 60;
    return (
      <div style={{
        minHeight: "100vh",
        background: "#f5f7fa",
        padding: "15px",
        fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif"
      }}>
        <div style={{
          maxWidth: "800px",
          margin: "0 auto"
        }}>
          {/* Result Card - For Download */}
          <div ref={resultRef} style={{
            backgroundColor: "white",
            borderRadius: "16px",
            padding: "25px 20px",
            boxShadow: "0 10px 40px rgba(0,0,0,0.1)",
            textAlign: "center",
            marginBottom: "20px",
            animation: "slideIn 0.5s ease"
          }}>
            <div className="header" style={{
              background: "linear-gradient(135deg, #1a237e, #3f51b5)",
              color: "white",
              padding: "15px",
              borderRadius: "10px",
              marginBottom: "15px"
            }}>
              <h1 style={{ margin: "0", fontSize: "22px" }}>{getText('title')}</h1>
              <p style={{ margin: "5px 0 0", fontSize: "12px", opacity: 0.9 }}>
                {language === 'hi' ? 'कक्षा 12 मनोविज्ञान क्विज़' : 'Class 12 Psychology Quiz'}
              </p>
            </div>
            
            <h2 style={{ 
              fontSize: "20px", 
              marginBottom: "5px",
              color: "#2d3748"
            }}>
              {isPassed ? getText('congrats') : getText('practice')}
            </h2>
            <div style={{
              width: "80px",
              height: "80px",
              borderRadius: "50%",
              background: isPassed ? "#d4edda" : "#f8d7da",
              display: "flex",
              alignItems: "center",
              justifyContent: "center",
              margin: "15px auto",
              fontSize: "32px"
            }}>
              {isPassed ? "✅" : "📝"}
            </div>
            <div style={{ fontSize: "40px", fontWeight: "bold", color: "#1a237e" }}>
              {score} <span style={{ fontSize: "20px", color: "#888" }}>/ {questions.length}</span>
            </div>
            <div style={{ 
              fontSize: "18px", 
              color: isPassed ? "#28a745" : "#dc3545", 
              marginTop: "5px",
              fontWeight: "600"
            }}>
              {percentage}% {isPassed ? getText('passed') : getText('failed')}
            </div>
            <div style={{
              marginTop: "10px",
              fontSize: "13px",
              color: "#718096"
            }}>
              {language === 'hi' ? "भाषा: हिन्दी" : "Language: English"} • {getText('negative')}
            </div>

            <div style={{
              marginTop: "15px",
              display: "grid",
              gridTemplateColumns: "1fr 1fr 1fr",
              gap: "10px",
              fontSize: "13px"
            }}>
              <div style={{ backgroundColor: "#d4edda", padding: "8px", borderRadius: "8px", color: "#155724" }}>
                ✅ {getText('correct')}: {resultDetails.filter(r => r.isCorrect).length}
              </div>
              <div style={{ backgroundColor: "#f8d7da", padding: "8px", borderRadius: "8px", color: "#721c24" }}>
                ❌ {getText('wrong')}: {resultDetails.filter(r => !r.isCorrect && r.isAttempted).length}
              </div>
              <div style={{ backgroundColor: "#fff3cd", padding: "8px", borderRadius: "8px", color: "#856404" }}>
                ⚪ {getText('not_attempted')}: {resultDetails.filter(r => !r.isAttempted).length}
              </div>
            </div>
          </div>

          {/* Download Button */}
          <div style={{ textAlign: "center", marginBottom: "20px" }}>
            <button
              onClick={downloadResult}
              style={{
                padding: "12px 30px",
                fontSize: "15px",
                fontWeight: "bold",
                background: "linear-gradient(135deg, #48bb78 0%, #38a169 100%)",
                color: "white",
                border: "none",
                borderRadius: "50px",
                cursor: "pointer",
                boxShadow: "0 4px 15px rgba(72, 187, 120, 0.4)",
                transition: "all 0.3s ease"
              }}
              onMouseEnter={(e) => e.target.style.transform = "scale(1.02)"}
              onMouseLeave={(e) => e.target.style.transform = "scale(1)"}
            >
              {getText('download')}
            </button>
          </div>

          {/* Answer Review */}
          <div style={{
            backgroundColor: "white",
            borderRadius: "16px",
            padding: "20px 15px",
            boxShadow: "0 10px 40px rgba(0,0,0,0.1)"
          }}>
            <h2 style={{ 
              borderBottom: "2px solid #eee", 
              paddingBottom: "12px", 
              marginBottom: "15px",
              fontSize: "18px",
              color: "#2d3748"
            }}>
              {getText('review')}
            </h2>
            {resultDetails.map((item, index) => (
              <div
                key={index}
                className={item.isCorrect ? '' : 'wrong'}
                style={{
                  backgroundColor: item.isCorrect ? "#f0fff4" : 
                                   item.isAttempted ? "#fff5f5" : "#fff3cd",
                  borderLeft: `4px solid ${item.isCorrect ? "#48bb78" : 
                              item.isAttempted ? "#fc8181" : "#ffc107"}`,
                  padding: "12px 15px",
                  marginBottom: "12px",
                  borderRadius: "8px",
                  animation: `fadeIn 0.3s ease ${index * 0.05}s`
                }}
              >
                <div style={{ display: "flex", justifyContent: "space-between", alignItems: "flex-start" }}>
                  <h4 style={{ 
                    margin: "0", 
                    fontSize: "14px", 
                    color: "#2d3748",
                    flex: 1,
                    marginRight: "10px"
                  }}>
                    Q{index + 1}. {item.question}
                  </h4>
                  <span style={{ fontSize: "18px", flexShrink: 0 }}>
                    {item.isCorrect ? "✅" : item.isAttempted ? "❌" : "⚪"}
                  </span>
                </div>
                <div style={{ marginTop: "8px", marginLeft: "5px", fontSize: "13px" }}>
                  <p style={{ margin: "3px 0" }}>
                    <strong>{getText('your_answer')}</strong>{" "}
                    <span style={{ 
                      color: item.isCorrect ? "#48bb78" : 
                             item.isAttempted ? "#dc3545" : "#ffc107",
                      fontWeight: item.isAttempted ? "bold" : "normal"
                    }}>
                      {item.userAnswer}
                    </span>
                    {!item.isAttempted && (
                      <span style={{ color: "#ffc107", marginLeft: "5px" }}>
                        ({getText('not_attempted')})
                      </span>
                    )}
                  </p>
                  {!item.isCorrect && (
                    <p style={{ margin: "3px 0" }}>
                      <strong>{getText('correct_answer')}</strong>{" "}
                      <span style={{ color: "#48bb78", fontWeight: "bold" }}>{item.correctAnswer}</span>
                    </p>
                  )}
                </div>
              </div>
            ))}
          </div>

          <div style={{ textAlign: "center", marginTop: "20px" }}>
            <button
              onClick={() => {
                setStarted(false);
                setSubmitted(false);
                setAnswers({});
                setResultDetails([]);
                setTimer(3600);
                setShowTimerWarning(false);
                setQuestions([]);
              }}
              style={{
                padding: "14px 35px",
                fontSize: "16px",
                fontWeight: "bold",
                background: "linear-gradient(135deg, #1a237e 0%, #3f51b5 100%)",
                color: "white",
                border: "none",
                borderRadius: "50px",
                cursor: "pointer",
                width: "100%",
                maxWidth: "300px",
                boxShadow: "0 4px 15px rgba(63, 81, 181, 0.4)",
                transition: "transform 0.3s ease"
              }}
              onMouseEnter={(e) => e.target.style.transform = "scale(1.02)"}
              onMouseLeave={(e) => e.target.style.transform = "scale(1)"}
            >
              {getText('new_quiz')}
            </button>
          </div>
        </div>
      </div>
    );
  }

  // Exam Page
  const q = questions[current] || { question: "", option: [], answer: "" };
  const answeredCount = Object.keys(answers).length;

  return (
    <div style={{
      minHeight: "100vh",
      background: "#f5f7fa",
      padding: "10px",
      fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif"
    }}>
      <div style={{
        maxWidth: "800px",
        margin: "0 auto"
      }}>
        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "10px 14px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginBottom: "10px",
          display: "flex",
          justifyContent: "space-between",
          alignItems: "center"
        }}>
          <div style={{ flex: 1 }}>
            <p style={{ 
              margin: "0", 
              fontSize: "11px", 
              color: "#718096"
            }}>
              Q{current + 1}/{questions.length}
            </p>
            <p style={{ 
              margin: "2px 0 0", 
              fontSize: "10px", 
              color: "#a0aec0"
            }}>
              {getText('answered')} {answeredCount}/{questions.length}
            </p>
          </div>
          <div style={{
            fontSize: "20px",
            fontWeight: "bold",
            color: timer < 60 ? "#fc8181" : "#1a237e",
            display: "flex",
            alignItems: "center",
            gap: "6px"
          }}>
            <span style={{ fontSize: "16px" }}>⏱️</span>
            <span>{Math.floor(timer / 60)}:{String(timer % 60).padStart(2, "0")}</span>
          </div>
        </div>

        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "16px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginBottom: "10px",
          animation: "fadeIn 0.3s ease"
        }}>
          <div style={{
            display: "inline-block",
            backgroundColor: "#e8f0fe",
            padding: "2px 10px",
            borderRadius: "12px",
            fontSize: "11px",
            color: "#1a237e",
            marginBottom: "12px"
          }}>
            📌 {language === 'hi' ? 'मनोविज्ञान 12वीं' : 'Psychology 12th'}
          </div>
          <h3 style={{
            fontSize: "16px",
            color: "#1a237e",
            marginBottom: "16px",
            fontWeight: "600",
            lineHeight: "1.5"
          }}>
            {q.question}
          </h3>

          <div style={{ marginTop: "5px" }}>
            {q.option && q.option.map((op, idx) => (
              <div
                key={idx}
                style={{
                  padding: "10px 12px",
                  margin: "5px 0",
                  backgroundColor: answers[current] === op ? "#ebf8ff" : "#f7fafc",
                  border: answers[current] === op ? "2px solid #3f51b5" : "2px solid transparent",
                  borderRadius: "8px",
                  cursor: "pointer",
                  transition: "all 0.3s ease",
                  display: "flex",
                  alignItems: "center",
                  transform: answers[current] === op ? "scale(1.01)" : "scale(1)"
                }}
                onClick={() => setAnswers({ ...answers, [current]: op })}
                onMouseEnter={(e) => {
                  if (answers[current] !== op) {
                    e.currentTarget.style.backgroundColor = "#f0f0f0";
                    e.currentTarget.style.transform = "scale(1.005)";
                  }
                }}
                onMouseLeave={(e) => {
                  if (answers[current] !== op) {
                    e.currentTarget.style.backgroundColor = "#f7fafc";
                    e.currentTarget.style.transform = "scale(1)";
                  }
                }}
              >
                <input
                  type="radio"
                  id={`q${current}-opt${idx}`}
                  name={`question-${current}`}
                  checked={answers[current] === op}
                  onChange={() => {}}
                  style={{ marginRight: "10px", width: "16px", height: "16px", flexShrink: 0 }}
                />
                <label
                  htmlFor={`q${current}-opt${idx}`}
                  style={{
                    fontSize: "14px",
                    cursor: "pointer",
                    flex: 1,
                    margin: "0",
                    color: "#2d3748"
                  }}
                >
                  {op}
                </label>
              </div>
            ))}
          </div>
        </div>

        <div style={{
          display: "flex",
          gap: "8px",
          flexWrap: "wrap",
          justifyContent: "space-between"
        }}>
          <div style={{ display: "flex", gap: "8px" }}>
            <button
              onClick={() => setCurrent(Math.max(0, current - 1))}
              disabled={current === 0}
              style={{
                padding: "8px 14px",
                fontSize: "13px",
                backgroundColor: current === 0 ? "#e2e8f0" : "#3f51b5",
                color: current === 0 ? "#a0aec0" : "white",
                border: "none",
                borderRadius: "8px",
                cursor: current === 0 ? "not-allowed" : "pointer",
                fontWeight: "600",
                transition: "all 0.3s ease"
              }}
              onMouseEnter={(e) => {
                if (current !== 0) {
                  e.target.style.transform = "scale(1.05)";
                  e.target.style.boxShadow = "0 4px 12px rgba(63, 81, 181, 0.3)";
                }
              }}
              onMouseLeave={(e) => {
                e.target.style.transform = "scale(1)";
                e.target.style.boxShadow = "none";
              }}
            >
              {getText('prev')}
            </button>
            <button
              onClick={() => setCurrent(Math.min(questions.length - 1, current + 1))}
              disabled={current === questions.length - 1}
              style={{
                padding: "8px 14px",
                fontSize: "13px",
                backgroundColor: current === questions.length - 1 ? "#e2e8f0" : "#3f51b5",
                color: current === questions.length - 1 ? "#a0aec0" : "white",
                border: "none",
                borderRadius: "8px",
                cursor: current === questions.length - 1 ? "not-allowed" : "pointer",
                fontWeight: "600",
                transition: "all 0.3s ease"
              }}
              onMouseEnter={(e) => {
                if (current !== questions.length - 1) {
                  e.target.style.transform = "scale(1.05)";
                  e.target.style.boxShadow = "0 4px 12px rgba(63, 81, 181, 0.3)";
                }
              }}
              onMouseLeave={(e) => {
                e.target.style.transform = "scale(1)";
                e.target.style.boxShadow = "none";
              }}
            >
              {getText('next')}
            </button>
          </div>

          <button
            onClick={submitExam}
            style={{
              padding: "8px 18px",
              fontSize: "13px",
              backgroundColor: "#48bb78",
              color: "white",
              border: "none",
              borderRadius: "8px",
              cursor: "pointer",
              fontWeight: "600",
              transition: "all 0.3s ease",
              boxShadow: "0 2px 8px rgba(72, 187, 120, 0.3)"
            }}
            onMouseEnter={(e) => {
              e.target.style.transform = "scale(1.05)";
              e.target.style.boxShadow = "0 4px 15px rgba(72, 187, 120, 0.5)";
            }}
            onMouseLeave={(e) => {
              e.target.style.transform = "scale(1)";
              e.target.style.boxShadow = "0 2px 8px rgba(72, 187, 120, 0.3)";
            }}
          >
            {getText('submit')}
          </button>
        </div>

        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "12px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginTop: "10px"
        }}>
          <p style={{ 
            margin: "0 0 8px 0", 
            color: "#718096", 
            fontSize: "11px", 
            fontWeight: "600" 
          }}>
            {getText('navigator')}
          </p>
          <div style={{
            display: "flex",
            flexWrap: "wrap",
            gap: "5px"
          }}>
            {questions.map((_, idx) => (
              <button
                key={idx}
                onClick={() => setCurrent(idx)}
                style={{
                  width: "32px",
                  height: "32px",
                  fontSize: "11px",
                  backgroundColor: answers[idx] ? "#48bb78" : 
                                   current === idx ? "#3f51b5" : "#e2e8f0",
                  color: answers[idx] ? "white" :
                         current === idx ? "white" : "#4a5568",
                  border: current === idx ? "2px solid #3f51b5" : "none",
                  borderRadius: "6px",
                  cursor: "pointer",
                  fontWeight: "bold",
                  transition: "all 0.3s ease",
                  transform: answers[idx] ? "scale(1.05)" : "scale(1)"
                }}
                onMouseEnter={(e) => {
                  e.target.style.transform = "scale(1.1)";
                }}
                onMouseLeave={(e) => {
                  e.target.style.transform = answers[idx] ? "scale(1.05)" : "scale(1)";
                }}
              >
                {idx + 1}
              </button>
            ))}
          </div>
          <div style={{
            display: "flex",
            gap: "12px",
            marginTop: "8px",
            fontSize: "10px",
            color: "#4a5568",
            flexWrap: "wrap"
          }}>
            <span>{getText('answered_status')}</span>
            <span>{getText('current_status')}</span>
            <span>{getText('unanswered_status')}</span>
          </div>
        </div>

        {showTimerWarning && (
          <div style={{
            position: "fixed",
            bottom: "15px",
            right: "15px",
            left: "15px",
            backgroundColor: "#fc8181",
            color: "white",
            padding: "12px 18px",
            borderRadius: "10px",
            boxShadow: "0 4px 15px rgba(252, 129, 129, 0.4)",
            textAlign: "center",
            fontSize: "14px",
            fontWeight: "600",
            animation: "pulse 1.5s ease-in-out infinite",
            maxWidth: "400px",
            margin: "0 auto"
          }}>
            {getText('warning')}
          </div>
        )}
      </div>
      <style>
        {`
          @keyframes pulse {
            0% { opacity: 1; transform: scale(1); }
            50% { opacity: 0.6; transform: scale(0.98); }
            100% { opacity: 1; transform: scale(1); }
          }
          @keyframes fadeInUp {
            from { opacity: 0; transform: translateY(20px); }
            to { opacity: 1; transform: translateY(0); }
          }
          @keyframes fadeIn {
            from { opacity: 0; transform: translateX(-10px); }
            to { opacity: 1; transform: translateX(0); }
          }
          @keyframes slideIn {
            from { opacity: 0; transform: translateY(-30px); }
            to { opacity: 1; transform: translateY(0); }
          }
        `}
      </style>
    </div>
  );
}