// Sociology12thQuiz.jsx
import React, { useState, useEffect, useRef } from "react";

// --- 12th Sociology Question Bank (100 questions) - Hindi & English ---

// Hindi Questions
const sociologyHindi = [
  {
    question: "निम्न में से किसने ‘सोशियोलॉजी’ शब्दावली का सृजन किया ?",
    option: ["स्पेंसर", "अगस्त कॉम्ट", "दुखीम", "कार्ल मार्क्स"],
    answer: "अगस्त कॉम्ट"
},
{
    question: "समाजशास्त्र को ‘सामाजिक स्थैतिक’ एवं सामाजिक गतिक’ में किसने विभाजित किया ?",
    option: ["मेकाईवर एवं पेज", "जॉनसन", "अगस्त कॉम्ट", "दुखीम"],
    answer: "दुखीम"
},
{
    question: "मनुस्मृति के रचनाकार कौन हैं ?",
    option: ["तुलसीदास", "वेदव्यास", "चाणक्य", "मनु"],
    answer: "मनु"
},
{
    question: "समाजशास्त्र का जन्म किस वर्ष हुआ ?",
    option: ["1838", "1836", "1898", "1810"],
    answer: "1838"
},
{
    question: "किस समाजशास्त्री के समुदाय की – परिभाषा में’हम भावना’ का स्पष्ट उल्लेख किया गया है ?",
    option: ["बोगार्डस की", "गिंसबर्ग की", "मैकाइवर", "किंग्सले डेविस की"],
    answer: "बोगार्डस की"
},
{
    question: "निम्नलिखित में कौन समुदाय का उदाहरण है ?",
    option: ["क्रिकेट टीम", "राज्य", "कॉलेज का छात्रावास", "संघ लोक सेवा आयोग"],
    answer: "राज्य"
},
{
    question: "“भारत में भिन्नता में एकता निहित है, परन्तु मौलिक एकता उतनी स्पष्ट नहीं है, जितनी बाह्य भिन्नता।” ऐसा किसने कहा है ?",
    option: ["फिक्टर ने", "स्मिथ ने", "ग्रीन ने", "टॉयलर"],
    answer: "स्मिथ ने"
},
{
    question: "राष्ट्रीय एकीकरण के लिए सबसे अधिक आवश्यक क्या है ?",
    option: ["आर्थिक उन्नति", "धार्मिक स्वतंत्रता", "धार्मिक सहिष्णुता", "शिक्षा का प्रसार"],
    answer: "धार्मिक सहिष्णुता"
},
{
    question: "राष्ट्रीयता का तात्पर्य क्या है ?",
    option: ["सामान्य सामाजिक पृष्ठभूमि", "सामान्य जातिगत पृष्ठभूमि", "सामान्य भौगोलिक पृष्ठभूमि", "उपर्युक्त कोई सही नहीं"],
    answer: "सामान्य भौगोलिक पृष्ठभूमि"
},
{
    question: "भारत छोड़ो आंदोलन का आरंभ कब से हुआ ?",
    option: ["9 अगस्त, 1917 से", "9 अगस्त, 1939 से", "9 अगस्त, 1942 से", "9 अगस्त 1947 से"],
    answer: "9 अगस्त, 1942 से"
},
{
    question: "‘पुनर्जन्म’ की अवधारणा किस धर्म से संबंधित है ?",
    option: ["हिन्दू", "इस्लाम", "ईसाई", "इनमें से सभी"],
    answer: "हिन्दू"
},
{
    question: "राष्ट्रीय समन्वय के मार्ग में कौन-सा तत्व बाधक नहीं है ?",
    option: ["जातीय भावना", "धार्मिक भावना", "अल्पसंख्यक की सुरक्षा", "आर्थिक विषमता"],
    answer: "अल्पसंख्यक की सुरक्षा"
},
{
    question: "“प्रजनन क्षमता में कमी होने के पहले नैतिकता के स्तर में ह्रास होना जरूरी है।” यह विचाकिसने व्यक्त की है ?",
    option: ["डब्लयू० नोटेस्टेन", "माल्थस", "थामसन", "के० डेविस"],
    answer: "डब्लयू० नोटेस्टेन"
},
{
    question: "उग्र राष्ट्रवादियों का काल कब कहा जाता है ?",
    option: ["1905 से 1918", "1885 से 1905", "1919 से 1947", "इनमें कोई नहीं"],
    answer: "1905 से 1918"
},
{
    question: "निम्नलिखित में किस विद्वान ने भारतीय गाँव को एक जीवन विधि माना है ?",
    option: ["मजूमदार", "श्रीनिवास", "मैकिम मैरियट", "बेली"],
    answer: "मजूमदार"
},
{
    question: "संस्था शब्द का उपयोग सर्वप्रथम किस विद्वान ने किया था ?",
    option: ["दुर्थीम", "स्पेन्सर", "काम्ट", "एम० एन० श्रीनिवास"],
    answer: "स्पेन्सर"
},
{
    question: "स्पेन्सर की पुस्तक ‘First Principles’ में सर्वप्रथम किस शब्द का उपयोग किया गया ?",
    option: ["संस्था", "समिति", "प्राथमिक समूह", "जाति"],
    answer: "संस्था"
},
{
    question: "किस विद्वान ने समुदाय की परिभाषा में हम की भावना’ का स्पष्ट उल्लेख किया है ?",
    option: ["बोगार्डस ने", "गिंसबर्ग ने", "मैकाइवर ने", "किंग्सले डेविस ने"],
    answer: "बोगार्डस ने"
},
{
    question: "निम्नलिखित में से किस समाज में महिलाओं की प्रस्थिति अपेक्षाकृत बेहतर है ?",
    option: ["औद्योगिक समाज", "आदिवासी समाज", "कृषि समाज", "उपर्युक्त सभी में"],
    answer: "औद्योगिक समाज"
},
{
    question: "जब मृत्यु दर बढ़ती है और जन्म दर में गिरावट आती है तो उसके फलस्वरूप –",
    option: ["जनसंख्या में वृद्धि होती है", "जनसंख्या में गिरावट आती है", "जनसंख्या स्थिर रहती है", "जनसंख्या में गतिशीलता आती है"],
    answer: "जनसंख्या में गिरावट आती है"
},
{
    question: "वह आंदोलन जिसको माल्थस के अनुयायियों ने संतति निग्रह एवं अन्य उपायों द्वारा जनसंख्या कम करने के लिए चलाया, कहलाता है—",
    option: ["नव-माल्थसवाद", "माल्थसवाद", "मार्क्सवाद", "नव-मार्क्सवाद"],
    answer: "नव-माल्थसवाद"
},
{
    question: "निम्नलिखित में किसने विचलन को समाज के लिए प्रकार्यात्मक माना है ?",
    option: ["ए० कोहन", "ई० दुर्खाइम", "आर० के० मर्टन", "एल० के० व्वाइट"],
    answer: "ई० दुर्खाइम"
},
{
    question: "इनमें कौन समुदाय का उदाहरण है ?",
    option: ["विद्यालय", "गाँव", "धर्म", "जाति"],
    answer: "जाति"
},
{
    question: "समुदाय में हम की भावना विकसित होती है –",
    option: ["आर्थिक समानता से", "राजनीतिक आधारों से", "सदस्यों की संख्या से", "इनमें से किसी से नहीं"],
    answer: "इनमें से किसी से नहीं"
},
{
    question: "” गाँव एक लघु गणराज्य हैं” । किसने कहा ?",
    option: ["मेटकॉफ", "ए० आर० देसाई", "कार्ल मार्क्स", "महात्मा गाँधी"],
    answer: "मेटकॉफ"
},
{
    question: "भारत में ईस्ट इंडिया कंपनी का शासन कब ब्रिटिश शासन के रूप में परिवर्तित हुआ ?",
    option: ["सन् 1839", "सन् 1858", "सन् 1862", "सन् 1885"],
    answer: "सन् 1858"
},
{
    question: "भारत में राष्ट्रीय जनसंख्या आयोग के अध्यक्ष कौन हैं ?",
    option: ["राष्ट्रपति", "प्रधानमंत्री", "स्वास्थ्य मंत्री", "गृहमंत्री"],
    answer: "प्रधानमंत्री"
},
{
    question: "भारत के लोग मुख्य रूप से आश्रित हैं—",
    option: ["नौकरी पर", "कृषि पर", "व्यवसाय पर", "उद्योग पर"],
    answer: "कृषि पर"
},
{
    question: "निम्न में से ग्रामीण समुदाय की प्रमुख विशेषता कौन हैं ?",
    option: ["सामाजिक गतिशीलता", "बड़ा आकार", "स्त्रियों की उच्च प्रस्थिति", "कृषि पर आधारित"],
    answer: "कृषि पर आधारित"
},
{
    question: "भारत में जनाधिक्य का मूल कारण क्या है ?",
    option: ["पर्यावरण", "प्रजनन शक्ति", "सामाजिक-सांस्कृतिक कारक", "इनमें से कोई नहीं"],
    answer: "सामाजिक-सांस्कृतिक कारक"
},
{
    question: "भारतीय ग्रामीण समुदाय की विशेषताएँ है –",
    option: ["सामान्य निश्चित क्षेत्र", "सामुदायिक एकता", "प्राथमिक संबंधों की प्रधानता", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "पार्सन्स द्वारा कितने प्रकार के प्रतिमानित विकल्पों का वर्णन किया गया है ?",
    option: ["तीन", "चार", "पाँच", "छः"],
    answer: "तीन"
},
{
    question: "नैसर्गिक प्रतिबन्ध किसकी अवधारणा है ?",
    option: ["माल्थस", "सैडलर", "कैनन", "डाल्टन"],
    answer: "माल्थस"
},
{
    question: "कब राष्ट्रीय कांग्रेस का अधिवेशन में मूल अधिकार की घोषणा की गई ?",
    option: ["1930", "1931", "1932", "1933"],
    answer: "1931"
},
{
    question: "नैसर्गिक प्रतिबंध किसकी अवधारणा है ?",
    option: ["माल्थस", "सैडलर", "कैनन", "डाल्टन"],
    answer: "माल्थस"
},
{
    question: "2001 ई० की जनगणना के अनुसार भारत में सर्वाधिक लिंगानुपात वाला राज्य कौन-सा था ?",
    option: ["सिक्किम", "मध्यप्रदेश", "केरल", "बिहार"],
    answer: "केरल"
},
{
    question: "2001 ई० की जनगणना के अनुसार भारत के न्यूनतम लिंगानुपात वाला राज्य कौन-सा था ?",
    option: ["हरियाणा", "मध्यप्रदेश", "केरल", "बिहार"],
    answer: "हरियाणा"
},
{
    question: "शिशु मृत्यु दर में कितने वर्ष के बच्चों की गणना की जाती है ?",
    option: ["दो वर्ष", "एक वर्ष", "चार वर्ष", "पाँच वर्ष"],
    answer: "एक वर्ष"
},
{
    question: "राष्ट्रीय जनसंख्या नीति-2000 के अंतर्गत निम्न में से किन बातों को शामिल किया गया है ?",
    option: ["तत्कालिक उद्देश्य", "मध्यकालीन उद्देश्य", "दीर्घकालिक उद्देश्य", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "माल्थस के अनुसार बढ़ती हुई जनसंख्या को नियंत्रित करने के निम्नलिखित में से कौन-से उपाय उपयुक्त हैं ?",
    option: ["नैसर्गिक प्रतिबंध", "निरोधक प्रतिबंध", "दोनों", "उपर्युक्त में कोई नहीं"],
    answer: "निरोधक प्रतिबंध"
},
{
    question: "भारत के किस विश्वविद्यालय से समाजशास्त्र की पढ़ाई शुरू हुयी थी ?",
    option: ["बम्बई विश्वविद्यालय", "कलकत्ता विश्वविद्यालय", "पटना विश्वविद्यालय", "दिल्ली विश्वविद्यालय"],
    answer: "बम्बई विश्वविद्यालय"
},
{
    question: "समाजशास्त्र की उत्पत्ति किन भाषाओं से हुई है ?",
    option: ["लैटिन एवं फ्रेंच", "लैटिन एवं ग्रीक", "लैटिन एवं अंग्रेजी", "ग्रीक एवं अंग्रेजी"],
    answer: "लैटिन एवं ग्रीक"
},
{
    question: "निम्नलिखित में से किसको नगरीकरण बढ़ावा देती है ?",
    option: ["गुमनामिता", "भीड़", "प्रदूषण", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "निम्न में से कौन भारत का सबसे अधिक नगरीयकृत राज्य है ?",
    option: ["पश्चिम बंगाल", "महाराष्ट्र", "आध्र प्रदेश", "केरल"],
    answer: "महाराष्ट्र"
},
{
    question: "शहरीकरण का लक्षण है –",
    option: ["व्यापार में विकास", "एक शहर के चारों ओर केंद्रों का विकास", "ग्रामीण से शहरी प्रवसन", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "धर्म निरपेक्षता का अर्थ क्या है ?",
    option: ["विभिन्न धर्मों का सह अस्तित्व", "अन्य धर्मो के प्रति श्रद्धा", "राज्य का अपना कोई धर्म न होना है", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "2001 की जनगणना के अनुसार भारत में प्रति 1000 पुरुष पर स्त्रियों की संख्या है –",
    option: ["967", "933", "947", "955"],
    answer: "933"
},
{
    question: "1931 में भारतीय राष्ट्रीय कांग्रेस का अधिवेशन किस स्थान पर हुआ था ?",
    option: ["कराची", "लाहौर", "दिल्ली", "कलकत्ता"],
    answer: "कराची"
},
{
    question: "सामुदायिक पहचान क्या होती है ?",
    option: ["अर्जित", "प्रदत्त", "अर्जित व प्रदत्त दोनों", "इनमें से कोई नहीं"],
    answer: "प्रदत्त"
},
{
    question: "निम्न में से किसने ‘ग्रामीण-नगरीय सातव्य’ की अवधारणा के विकास में योगदान दिया ?",
    option: ["एस० सी० दूबे०", "सोरोकिन", "रेडफील्ड", "कॉम्ट"],
    answer: "रेडफील्ड"
},
{
    question: "भारत में परिवार नियोजन कार्यक्रम कब लागू किया गया ?",
    option: ["1948", "1950", "1952", "1954"],
    answer: "1952"
},
{
    question: "स्त्रियों का सबसे अधिक प्रतिशत किस राज्य में है ?",
    option: ["बिहार", "पश्चिम बंगाल", "उत्तर प्रदेश", "केरल"],
    answer: "केरल"
},
{
    question: "मानव समाज एवं संस्कृति का इतिहास कहाँ से शुरू होता है ?",
    option: ["गाँव से", "शहर से", "नगर से", "इनमें से कोई नहीं"],
    answer: "गाँव से"
},
{
    question: "भारतीय समाज का इतिहास कितने वर्षों की अवधि का है ?",
    option: ["2000 वर्ष", "3000 वर्ष", "4000 वर्ष", "5000 वर्ष"],
    answer: "4000 वर्ष"
},
{
    question: "इनमें से कौन-सी विशेषता गाँव की नहीं है ?",
    option: ["कृषि व्यवसाय", "एकाकी परिवार", "सजातीयता", "रूढ़िवादिता"],
    answer: "रूढ़िवादिता"
},
{
    question: "इनमें से जनसंख्या वृद्धि का परिणाम कौन नहीं है ?",
    option: ["खाद्य समस्या", "आवास की समस्या", "रोजगार की समस्या", "ठंडे मौसम में सर्दी लगना"],
    answer: "ठंडे मौसम में सर्दी लगना"
},
{
    question: "उपनिवेशवाद किस सोच का प्रतिफल है ?",
    option: ["साम्राज्यवाद", "समाजवाद", "मानवतावाद", "अंतरराष्ट्रीयतावाद"],
    answer: "साम्राज्यवाद"
},
{
    question: "भारत में ब्रिटिश उपनिवेशवाद की स्थापना तथा इसके विस्तार में कौन सहायक था ?",
    option: ["लॉर्ड कार्नवालिस", "लॉर्ड क्लाइव", "वारेन हेस्टिग्ज", "उपर्युक्त सी"],
    answer: "उपर्युक्त सी"
},
{
    question: "डेमोग्राफी (जनांकिकी) शब्द का प्रयोग सबसे पहले किस विद्वान द्वारा गया था ?",
    option: ["गुईलार्ड", "सोरोकिन", "लेविस", "वार्कले"],
    answer: "गुईलार्ड"
},
{
    question: "‘ग्रामीण क्षेत्रों का नगरीय क्षेत्रों में परिवर्तित होने की प्रक्रिया को नगरीकरण कहते हैं’, यह किसका कथन है ?",
    option: ["फेयर चाइल्ड", "एम० एस० ए० राव", "एम० एन० श्रीनिवास", "इ० एफ० बर्गेस"],
    answer: "इ० एफ० बर्गेस"
},
{
    question: "नई राष्ट्रीय जनसंख्या नीति कब घोषित की गयी ?",
    option: ["1999", "2000", "2001", "2002"],
    answer: "2000"
},
{
    question: "समुदाय का सर्वमहत्त्वपूर्ण लक्षण निम्नलिखित में क्या है ?",
    option: ["हम भावना", "समान भू-भाग", "सामुदायिक भावना", "समान नियम"],
    answer: "सामुदायिक भावना"
},
{
    question: "जनसंख्या सूची स्तंभ किससे जुड़ा है ?",
    option: ["आयु और विवाह संरचना", "आयु और लिंग संरचना", "आयु और श्रम बल संरचना", "आयु और साक्षरता संरचना"],
    answer: "आयु और लिंग संरचना"
},
{
    question: "जनसंख्या से संबंधित सूचना प्राप्त करने की प्राथमिक विधि क्या है ?",
    option: ["सेन्सस", "सर्वे विधि", "सेम्पल विधि", "इनमें कोई नहीं"],
    answer: "सेन्सस"
},
{
    question: "भारत में जनसंख्या में वृद्धि और घनत्व प्रत्यक्ष रूप से निर्धारित होता है—",
    option: ["क्षेत्र की महिलाओं की संख्या द्वारा", "प्रजनन दर तथा मृत्यु दर द्वारा", "देश के विभिन्न भागों में प्रव्रजनवैमिन्य के द्वारा", "पुरुषों पर भारतीय महिलाओं की बौद्धिक श्रेष्ठता द्वारा"],
    answer: "प्रजनन दर तथा मृत्यु दर द्वारा"
},
{
    question: "जनांकिकी विज्ञान है –",
    option: ["पर्यावरण अध्ययन का", "जनसंख्या अध्ययन का", "वन अध्ययन का", "जल अध्ययन का"],
    answer: "जनसंख्या अध्ययन का"
},
{
    question: "इनमें कौन नगरीय समुदाय की विशेषता है ?",
    option: ["अधिक जनसंख्या", "सामाजिक विभिन्नता", "स्थानीय पृथककरण", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "जनांकिकी शब्द का प्रयोग सबसे पहले कब किया गया ?",
    option: ["सन् 1855", "सन् 1856", "सन् 1857", "सन् 1860"],
    answer: "सन् 1855"
},
{
    question: "उदारीकरण, भूमंडलीकरण का किस प्रकार का तत्त्व है ?",
    option: ["सामाजिक", "आर्थिक", "राजनैतिक", "सांस्कृतिक"],
    answer: "आर्थिक"
},
{
    question: "भारत में अनियंत्रित जनसंख्या वृद्धि के लिए उत्तरदायी कारक है –",
    option: ["बाल-विवाह", "राजनीतिक चेतना", "आर्थिक विकास", "इनमें से कोई नहीं"],
    answer: "बाल-विवाह"
},
{
    question: "भारतीय जनसंख्या के इतिहास में कौन-सा वर्ष ‘ग्रेट डिवाइड’ माना जाता है ?",
    option: ["1901", "1921", "1951", "1961"],
    answer: "1921"
},
{
    question: "निम्नलिखित में कौन यह विश्वास करता है कि जनसंख्या वृद्धि होती है ?",
    option: ["ए० ड्युमो", "फ्रेंक फेटर", "एफ० एस० नीटो", "यू० स्ट्रेनबर्ग"],
    answer: "एफ० एस० नीटो"
},
{
    question: "विवेकपूर्ण जनसंख्या नीति के आवश्यक तत्त्व क्या है ?",
    option: ["परिवार नियोजन कार्यक्रम का प्रचार और प्रसार", "सामाजिक वातावरण में परिवर्तन", "प्रवासी-प्रवृति को प्रोत्साहन", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "राष्ट्रवाद का अर्थ है",
    option: ["सामान्य सामाजिक पृष्ठभूमि", "सामान्य जाति पृष्ठभूमि", "सामान्य भौगोलिक पृष्ठभूमि", "इनमें से कोई नहीं"],
    answer: "सामान्य भौगोलिक पृष्ठभूमि"
},
{
    question: "निम्नलिखित में से कौन भारतीय समाज की विशेषता है ?",
    option: ["अनेकता में एकता", "संस्कारों द्वारा समाजीकरण", "पुरुषार्थ", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "‘सोसाइटी’ नामक पुस्तक का रचयिता कौन है ?",
    option: ["मेकाइवर एण्ड पेज", "पी० जीस्वर्ट", "एच० एम० जॉनसन", "इनमें से कोई नहीं"],
    answer: "मेकाइवर एण्ड पेज"
},
{
    question: "उदारीकरण से क्या अर्थ निकलता है ?",
    option: ["समाजवाद", "मनुष्य का उदार होना", "काफी उन्नति होना", "मुक्त बाजार व्यवस्था"],
    answer: "मुक्त बाजार व्यवस्था"
},
{
    question: "सन् 2001 की जनगणना के अनुसार भारत की ग्रामीण जनसंख्या है लगभग –",
    option: ["56 प्रतिशत", "65 प्रतिशत", "72 प्रतिशत", "80 प्रतिशत"],
    answer: "72 प्रतिशत"
},
{
    question: "भारतीय राष्ट्रीय कांग्रेस की स्थापना कब हुई ?",
    option: ["दिसम्बर, 1885 में", "दिसम्बर, 1857 में", "दिसम्बर, 1947 में", "दिसम्बर, 1917 में"],
    answer: "दिसम्बर, 1885 में"
},
{
    question: "”The Population of India & Pakistan” नामक पुस्तक के लेखक कौन हैं ?",
    option: ["डेविस", "मर्टन", "मिर्डल", "माल्थस"],
    answer: "डेविस"
},
{
    question: "चम्पारण में नील आंदोलन’ कब आरम्भ हुआ ?",
    option: ["1917 ई०", "1918 ई०", "1919 ई०", "इनमें से कोई नहीं"],
    answer: "1917 ई०"
},
{
    question: "स्त्री-पुरुष अनुपात किस राज्य में सबसे कम है ?",
    option: ["बिहार", "पश्चिम बंगाल", "उड़ीसा", "तमिलनाडु"],
    answer: "बिहार"
},
{
    question: "निम्न में से कौन राष्ट्रीय एकीकरण में बाधक है ?",
    option: ["धर्मनिरपेक्षता", "सांप्रदायिकता", "दोनों", "उपर्युक्त में से कोई नहीं"],
    answer: "सांप्रदायिकता"
},
{
    question: "बिहार में समाजशास्त्र की पढ़ाई सर्वप्रथम किस विश्वविद्यालय में शुरू हुई थी ?",
    option: ["पटना विश्वविद्यालय", "मुंगेर विश्वविद्यालय", "पाटलिपुत्र विश्वविद्यालय", "भागलपुर विश्वविद्यालय"],
    answer: "पटना विश्वविद्यालय"
},
{
    question: "अगस्त कॉम्ट के गुरू कौन थे ?",
    option: ["मेकाईवर", "अरस्तू", "सेंट साइमन", "मार्क्स"],
    answer: "सेंट साइमन"
},
{
    question: "किसने कहा, “समाजशास्त्र समाज का विज्ञान है” ?",
    option: ["वार्ड", "मेकाईवर", "गिडिग्स", "स्पेंसर"],
    answer: "वार्ड"
},
{
    question: "“पॉजिटिव फिलास्फी” नामक पुस्तक के रचयिता कौन थे ?",
    option: ["कॉम्ट", "सोरोकिन", "मार्क्स", "हीगले"],
    answer: "कॉम्ट"
},
{
    question: "बम्बई विश्वविद्यालय में समाजशास्त्र विभाग की स्थापना किनकी अध्यक्षता में हुई ?",
    option: ["जी०एस०घुर्ये", "पैट्रिक गिड्स", "आर०के०मुखर्जी", "डी०एन०मुखर्जी"],
    answer: "पैट्रिक गिड्स"
},
{
    question: "इनमें से कौन भारतीय संस्कृति का मूल तत्व है ?",
    option: ["आध्यात्मवाद", "कर्म संबंधी विश्वास", "सामूहिकता", "ये सभी"],
    answer: "ये सभी"
},
{
    question: "निम्न में से कौन समाज की विशेषता नहीं है ?",
    option: ["समाज मूर्त है", "परिवर्तनशीलता", "पारस्परिक निर्भरता", "पारस्परिक जागरूकता"],
    answer: "समाज मूर्त है"
},
{
    question: "किसने कहा, “समाज संघर्ष मिश्रित सहयोग है” ?",
    option: ["बोगार्डस", "मैकाईवर", "अगस्त कॉम्ट", "जॉर्ज सिमेल"],
    answer: "मैकाईवर"
},
{
    question: "किसने कहा, “प्रत्येक व्यक्ति यह जानता है कि नगर क्या है, किन्तु किसी ने भी संतोषजनक परिभाषा नहीं दी है” ?",
    option: ["बर्गेल", "एण्डरसन", "बिल कॉक्स", "मेकाईवर"],
    answer: "बर्गेल"
},
{
    question: "किस प्रमुख ऐतिहासिक घटना से भारत में राष्ट्रवाद की भावना का उदय हुआ ?",
    option: ["1857 का सिपाही विद्रोह", "भारत छोड़ो आन्दोलन", "असहयोग आन्दोलन", "सविनय अवज्ञा आन्दोलन"],
    answer: "1857 का सिपाही विद्रोह"
},
{
    question: "‘वानप्रस्थ आश्रम’ आश्रम व्यवस्था का कौन सा स्तर है ?",
    option: ["प्रथम", "द्वितीय", "तृतीय", "चतुर्थ"],
    answer: "तृतीय"
},
{
    question: "बंगाल में स्वदेशी आन्दोलन किसने आरम्भ किया ?",
    option: ["राजनारायण बसु", "रामसिंह कूका", "वासुदेव जोशी", "महात्मा गाँधी"],
    answer: "राजनारायण बसु"
},
{
    question: "भारत की वर्तमान आबादी कितनी है ?",
    option: ["एक अरब के ऊपर", "एक अरब से नीचे", "100 लाख", "इनमें से कोई नहीं"],
    answer: "एक अरब के ऊपर"
},
{
    question: "निम्न में से भारत के किस राज्य में साक्षरता दर सबसे कम है ?",
    option: ["उत्तर प्रदेश", "झारखण्ड", "मध्य प्रदेश", "बिहार"],
    answer: "बिहार"
},
{
    question: "भारत में जनाधिक्य का मूल कारण क्या है ?",
    option: ["पर्यावरण", "सामाजिक – सांस्कृतिक कारक", "प्रजनन शक्ति", "इनमें से कोई नहीं"],
    answer: "प्रजनन शक्ति"
},
{
    question: "नई राष्ट्रीय जनसंख्या नीति कब घोषित की गयी ?",
    option: ["1999 ई. में", "2000 ई. में", "2001 ई. में", "2002 ई. में"],
    answer: "2000 ई. में"
},
{
    question: "भारत में प्रथम बार जनगणना कब हुआ था ?",
    option: ["1873", "1872", "1856", "1874"],
    answer: "1872"
},
{
    question: "अल्पसंख्यक एक",
    option: ["सामजशास्त्रीय संकल्पना है", "गणितीय संकल्पना है", "राजनैतिक संकल्पना है", "मनोवैज्ञानिक संकल्पना है"],
    answer: "राजनैतिक संकल्पना है"
},
{
    question: "लैंगिक विषमता का सम्बन्ध है",
    option: ["सामाजिक मूल्यों से", "आर्थिकी से", "राजनैतिक मूल्यों से", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "किसने लैंगिक असमानता के सात प्रकार का उल्लेख किया है ?",
    option: ["पाणिकर", "मजूमदार", "दूबे", "आमर्त्यसेन"],
    answer: "आमर्त्यसेन"
},
{
    question: "ग्रामीण एवं नगरीय समाज के बीच निम्नलिखित में कौन अंतर का आधार है ?",
    option: ["जनसंख्यात्मक आधार", "समुदाय का आकार", "सामाजिक गतिशीलता की प्रकृति", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "टी.के. उम्मन ने संप्रदायवाद के कितने आयामों को रेखांकित किया है ?",
    option: ["दो आयामों को", "चार आयामों को", "छः आयामों को", "आठ आयामों को"],
    answer: "दो आयामों को"
},
{
    question: "रेडिकल नारीवाद के अनुसार लैंगिक असमानता का मूल कारण क्या है ?",
    option: ["पितृसत्ता है", "मातृसत्ता है ।", "दोनों में कोई भी नहीं", "नहीं कह सकते"],
    answer: "पितृसत्ता है"
},
{
    question: "सामाजिक वर्ग एक समुदाय का कोई भाग है जो सामाजिक स्थिति के आधार पर शेष भाग से पृथक किया जा सके । यह कथन किसका है ?",
    option: ["ऑगबर्न तथा निमकॉफ", "मैकाइवर एवं पेज", "बोगार्डस", "गॉन एच टैण्डल"],
    answer: "मैकाइवर एवं पेज"
},
{
    question: "राष्ट्र से अभिप्राय एक जाति अथवा वंशगत विशेषताओं वाला मानव संगठन है । यह कथन किसका है ?",
    option: ["बर्गेस", "मैकाइवर एवं पेज", "लीकॉक", "बोगार्डस"],
    answer: "बर्गेस"
},
{
    question: "भारतीय समाज का विभाजन का आधारों पर हुआ है, यह विभाजन ही कहलाता",
    option: ["समुदाय", "उपनिवेशवाद", "राष्ट्रवाद", "वर्ग"],
    answer: "समुदाय"
},
{
    question: "आर्थिक आधार पर समाज कितने वर्गों में विभक्त है ?",
    option: ["चार", "पाँच", "तीन", "दो"],
    answer: "तीन"
},
{
    question: "2011 के जनगणना के अनुसार किस राज्य की जनसंख्या घटी है ?",
    option: ["बिहार", "महाराष्ट्र", "नागालैण्ड", "सिक्किम"],
    answer: "नागालैण्ड"
},
{
    question: "भारत में सबसे अधिक जनसंख्या पनल वाला राज्य है",
    option: ["पश्चिम बंगाल", "झारखंड", "बिहार", "छत्तीसगढ़"],
    answer: "पश्चिम बंगाल"
},
{
    question: "भारत में सबसे अधिक शिक्षित महिलाओं वाला राज्य है",
    option: ["मध्य प्रदेश", "केरल", "बिहार", "उत्तर प्रदेश"],
    answer: "केरल"
},
{
    question: "भारत में सबसे कम साक्षरता वाला राज्य है ।",
    option: ["राजस्थान", "गुजरात", "मध्य प्रदेश", "बिहार"],
    answer: "बिहार"
},
{
    question: "भारत की जनसंख्या विश्व की जनसंख्या का कुल कितना प्रतिशत है ।",
    option: ["20 प्रतिशत", "16 प्रतिशत", "10 प्रतिशत", "40 प्रतिशत"],
    answer: "16 प्रतिशत"
},
{
    question: "‘जनसांख्यिकी’ शब्द किस भाषा से लिया गया है ?",
    option: ["उर्दू", "संस्कृत", "ग्रीक", "फ्रेंच"],
    answer: "ग्रीक"
},
{
    question: "जनसंख्या अध्ययन को क्या कहते",
    option: ["न्यूमेसमेटिक्स", "डेमेग्राफी", "इपीग्राफी", "इनमें से कोई नहीं"],
    answer: "डेमेग्राफी"
},
{
    question: "जनांकिकी (जनसांखिकी) का जनक कहा जाता",
    option: ["माल्थस", "गुर्डलाई", "जॉन ग्रान्ट", "एडम स्मिथ"],
    answer: "जॉन ग्रान्ट"
},
{
    question: "जनसंख्या की दृष्टि से भारत का विश्व में कौन – सा स्थान है ?",
    option: ["दूसरा", "तीसरा", "पाँचवां", "आठवां"],
    answer: "दूसरा"
},
{
    question: "वर्ष 2011 की जनगणना के अनुसार भारत में साक्षरता की दर (लगभग) है",
    option: ["65 %", "68 %", "74 %", "76 %"],
    answer: "74 %"
},
{
    question: "भारत में पहली बार किस वर्ष राष्ट्रीय जनसंख्या नीति घोषित की गयी ?",
    option: ["सन् 1974 में", "सन् 1976 में", "सन् 1956 में", "सन् 1982 में"],
    answer: "सन् 1976 में"
},
{
    question: "निम्नलिखित में से किसका सम्बन्ध ‘जनसंख्या के स्वयं समायोजन चक्र’ से है ?",
    option: ["एडम स्मिथ", "चाइल्ड", "माल्थस", "इनमें से कोई नहीं"],
    answer: "एडम स्मिथ"
},
{
    question: "भारत में परिवार नियोजन कार्यक्रम की शुरूआत की गयी",
    option: ["सन् 1944 में", "सन् 1952 में", "सन् 1956 में", "सन् 1960 में"],
    answer: "सन् 1952 में"
},
{
    question: "निम्नलिखित में से जनसंख्या के किस परिप्रेक्ष्य को ‘जनांकिकीय पारगमन त्रि – स्तरीय मॉडल’ के नाम से जाना जाता है ?",
    option: ["जनाकिकी परिप्रेक्ष्य", "समाजशास्त्रीय परिप्रेक्ष्य", "आर्थिक परिप्रेक्ष्य", "ऐतिहासिक परिप्रेक्ष्य"],
    answer: "ऐतिहासिक परिप्रेक्ष्य"
},
{
    question: "जनसांख्यिकी के अध्ययन में निन में से किसे सम्मिलित किया गया है ?",
    option: ["जनसंख्या के आकार में परिवर्तन", "जनसंख्या की बनावट", "जनसंख्या का वितरण", "इनमें से कोई नहीं"],
    answer: "जनसंख्या के आकार में परिवर्तन"
},
{
    question: "भारत में जनसंख्या वृद्धि का प्रमुख कारण है",
    option: ["धार्मिक एवं भाग्यवादी मान्यताओं का प्रभाव", "अज्ञानता एवं अशिक्षा", "उपर्युक्त दोनों", "इनमें से कोई नहीं"],
    answer: "उपर्युक्त दोनों"
},
{
    question: "भारत में राष्ट्रीय जनसंख्या नीति (1976) में निम्न में से कौन – सा प्रावधान किया गया ?",
    option: ["विवाह हेतु न्यूनतम आयु क्रमशः लड़के की 21 वर्ष और लड़की की 18 वर्ष निर्धारित की गयी", "केन्द्रीय सहायता का 8 % भाग परिवार कल्याण कार्यक्रम पर व्यय करने का प्रावधान", "औपचारिक विद्यालयी शिक्षा में जनसंख्या शिक्षा की अनिवार्यता", "उपर्युक्त सभी"],
    answer: "केन्द्रीय सहायता का 8 % भाग परिवार कल्याण कार्यक्रम पर व्यय करने का प्रावधान"
},
{
    question: "निम्नलिखित में से माल्थस के जनसंख्या सिद्धान्त की मान्यता है",
    option: ["मनुष्य को जीवित रखने के लिए भोजन आवश्यक है", "कृषि में उत्पत्ति ह्रास नियम लागू होता है", "जनसंख्या आवश्यक रूप से जीविका के साधनों द्वारा निर्धारित होती", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "किसने कहा “मनुष्य को यह समझ लेना चाहिए कि वह अपनी गरीबी का स्वयं ही कारण है ?”",
    option: ["सोरोकिन", "रिचर्ड डेवी", "बर्गेल", "माल्थस"],
    answer: "माल्थस"
},
{
    question: "2001 की जनगणना के अनुसार भारत में प्रति 1000 पुरुष पर स्त्रियों की संख्या है",
    option: ["967", "933", "947", "955"],
    answer: "933"
},
{
    question: "कौन – सी परिस्थिति जनसंख्या वृद्धि के लिए उत्तरदायी है ?",
    option: ["सामाजिक मूल्य", "जीवन पद्धति", "शैक्षणिक स्तर", "आर्थिक विकास"],
    answer: "शैक्षणिक स्तर"
},
{
    question: "भारतीय समाज का इतिहास कितने वर्षों की अवधि का है ?",
    option: ["2000 वर्ष", "3000 वर्ष", "4000 वर्ष", "5000 वर्ष"],
    answer: "3000 वर्ष"
},
{
    question: "इनमें से जनसंख्या वृद्धि का परिणाम कौन नहीं है ?",
    option: ["खाद्य समस्या", "आवास की समस्या", "रोजगार की समस्या", "ठंडे मौसम में सर्दी लगना"],
    answer: "ठंडे मौसम में सर्दी लगना"
},
{
    question: "बिहार में बेरोजगारी भत्ता किस आयु समूह को दिया जाता है ?",
    option: ["21 से 31", "18 से 25", "18 से 27", "16 से 27"],
    answer: "21 से 31"
},
{
    question: "“संयुक्त परिवार एक ऐसा परिवार है जिसमें लोग समान आवास में रहते हैं, एक चूल्हा का बना खाते हैं, समान सम्पत्ति के हकदार होते हैं और समान पूजा–पाठ में भाग लेते हैं।” संयुक्त परिवार की ऐसी परिभाषा किसने दी है?",
    option: ["इरावतीकार्वे", "आई ० पी ० देसाई", "ए ० आर ० देसाई", "एम ० एन ० श्रीनिवास"],
    answer: "एम ० एन ० श्रीनिवास"
},
{
    question: "निम्न में कौन जनजातीय धर्म का स्वरूप है?",
    option: ["ब्रह्मवाद", "टोटमवाद", "ओझागिरी", "इनमेंसभी"],
    answer: "टोटमवाद"
},
{
    question: "परीक्षा विवाह किस जनजाति में होती है?",
    option: ["मुंडा", "संथाल", "नागा", "भील"],
    answer: "भील"
},
{
    question: "भारत में अनुसूचित जातियों के लिए आरक्षण का प्रावधान किस धारा के अन्तर्गत की गयी है?",
    option: ["धारा-355", "धारा-379", "धारा-302", "धारा-330"],
    answer: "धारा-355"
},
{
    question: "निम्नलिखित में कौन एक जाति है?",
    option: ["वैश्य", "राजपूत", "शूद्र", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "भारतीय सामाजिक व्यवस्था का महत्वपूर्ण पहन क्या है?",
    option: ["संयुक्त परिवार", "जाति–व्यवस्था", "धर्म", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "निम्न में कौन एक संस्था है?",
    option: ["गाँव", "राष्ट्र", "विवाह", "किसान संघ"],
    answer: "विवाह"
},
{
    question: "निम्न में से भारत के किस राज्य में आदिवासी आबादी सर्वाधिक है?",
    option: ["पश्चिम बंगाल", "छत्तीसगढ़", "उत्तर प्रदेश", "गुजरात"],
    answer: "गुजरात"
},
{
    question: "जाति–व्यवस्था की उत्पत्ति से सम्बन्धित प्रजातीय सिद्धान्त के प्रतिपादक निम्न में से कौन–सा विद्वान है",
    option: ["हट्टन", "रिजले", "नेसफील्ड", "श्रीनिवास"],
    answer: "रिजले"
},
{
    question: "निम्न में से कौन एक संस्था है?",
    option: ["राष्ट्र", "गाँव", "परिवार", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "निम्न में से कौन जाति–व्यवस्था की एक मौलिक विशेषता नहीं है?",
    option: ["संस्तरण", "समाज का खण्डात्मक विभाजन", "सामाजिक गतिशीलता", "अन्तर्विवाह"],
    answer: "सामाजिक गतिशीलता"
},
{
    question: "भारत का सबसे बड़ा जनजातीय समूह कौन है?",
    option: ["संथाल", "मुंडा", "गारो", "गोंड"],
    answer: "गारो"
},
{
    question: "भारतीय संविधान के किस अनुच्छेद के द्वारा लोकसभा अनुसूचित जाति एवं जनजाति के सदस्यों के लिए स्थान आरक्षित किया गया है?",
    option: ["अनुच्छेद-334", "अनुच्छेद-332", "अनुच्छेद-330", "अनुच्छेद-338"],
    answer: "अनुच्छेद-330"
},
{
    question: "खस या खासी बहुपति विवाह किस जनजाति में पाया जाता है?",
    option: ["संथल", "टोडा", "मुंडा", "खस"],
    answer: "खस"
},
{
    question: "किसने कहा, ‘जाति एक बंद वर्ग है’",
    option: ["मैक्स वेबर", "मजूमदार एवं मदन", "रिजले", "मैकाइवर एवं पेज"],
    answer: "मजूमदार एवं मदन"
},
{
    question: "कौन सा आदिवासी समाज मातृ प्रधान है?",
    option: ["संथाल", "मुंडा", "भील", "इनमेंसे कोई नहीं"],
    answer: "इनमेंसे कोई नहीं"
},
{
    question: "कौन भारतीय समाज की सबसे प्रमुख विशेषता है?",
    option: ["वर्ण व्यवस्था", "अनेकतामें एकता", "यजमानीव्यवस्था", "इनमेंसभी"],
    answer: "इनमेंसभी"
},
{
    question: "निम्न में से कौन जनजातीय समाज की समस्या नहीं है?",
    option: ["भूमिविलगाव", "छुआछूत", "( a ) एवं ( b ) दोनों", "इनमेंसे कोई नहीं"],
    answer: "( a ) एवं ( b ) दोनों"
},
{
    question: "निम्नलिखित में से कौन परिवार की विशेषता है",
    option: ["सार्वभौमिकता", "सीमित आकार", "भावात्मक आधार", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "निम्न में से कौन जनजाति की विशेषता है?",
    option: ["सामान्य भू–भाग", "सामान्य भाषा", "सामान्य संस्कृति", "इनमेंसभी"],
    answer: "इनमेंसभी"
},
{
    question: "निम्नलिखित में से बन्द स्तरीकरण का उदाहरण कौन–सा है",
    option: ["वर्ग", "सत्ता", "जाति", "उपर्युक्त सभी"],
    answer: "जाति"
},
{
    question: "निम्न में से कौन से कारक भारतीय जाति व्यवस्था में परिवर्तन के उत्तरदायी है?",
    option: ["औद्योगिकरण", "पंचायतीराज", "जजमानीव्यवस्था", "प्रभुजाति"],
    answer: "पंचायतीराज"
},
{
    question: "भील नामक जनजाति किस राज्य में निवास करती है?",
    option: ["असम", "प्रदेश", "पश्चिम बंगाल", "बिहार"],
    answer: "प्रदेश"
},
{
    question: "निम्न में से कौन जाति की विशेषता नहीं है?",
    option: ["संस्तरण", "अन्तःविवाह", "शुद्धता", "खुलापन"],
    answer: "खुलापन"
},
{
    question: "‘चाचा’ नातेदारी के किस श्रेणी के अन्तर्गत आता है?",
    option: ["प्राथमिक", "द्वितीयक", "तृतीयक", "इनमेंसे कोई नहीं"],
    answer: "द्वितीयक"
},
{
    question: "निम्न में से कौन–सा नातेदारी से स्पष्ट रूप से नहीं आता है?",
    option: ["वंश परम्परा", "विवाह अन्य संबंध", "प्रस्थिति", "समकक्ष समूह"],
    answer: "विवाह अन्य संबंध"
},
{
    question: "जाति व्यवस्था की उत्पत्ति–संबंधी देवत्व का सिद्धांत किस वेद में वर्णित है?",
    option: ["अथर्ववेद", "सामवेद", "ऋग्वेद", "यजुर्वेद"],
    answer: "सामवेद"
},
{
    question: "निम्न में से कौन भारतीय ने जाजातियों के लिए ‘अलगाव की नीति’ की वकालत की?",
    option: ["बेली", "घुरिये", "एल्विन", "डॉ. मजूमदार"],
    answer: "डॉ. मजूमदार"
},
{
    question: "जनजाति समाजों में निम्न में से क्या नहीं पाया जाता है?",
    option: ["श्रम–विभाजन", "युवागृह", "महिलाकी आजादी", "सरल अर्थव्यवस्था"],
    answer: "महिलाकी आजादी"
},
{
    question: "घुमकुरिया किस जनजाति में पाया जाता है?",
    option: ["मुंडा", "संथाल", "उराँव", "हो"],
    answer: "उराँव"
},
{
    question: "जाति व्यवस्था का व्यावसायारत्यक सिद्धांत के प्रतिपादक कौन है?",
    option: ["रिजले", "घुरिये", "नेसफील्ड", "मार्क्स"],
    answer: "रिजले"
},
{
    question: "जाति का आधार क्या है?",
    option: ["भाग्य", "कर्म", "पुनर्जन्म", "जन्म"],
    answer: "जन्म"
},
{
    question: "निम्न में से कौन द्विज नहीं कहलाते हैं?",
    option: ["ब्राह्मण", "क्षत्रिय", "वैश्य", "शूद्र"],
    answer: "शूद्र"
},
{
    question: "किस समाज में हुतु विवाह का प्रचलन है?",
    option: ["हिन्दूसमाज में", "जनजातीय समाज में", "मुस्लिम समाज में", "इनमेंसे कोई नहीं"],
    answer: "जनजातीय समाज में"
},
{
    question: "मुस्लिम विबाह है एक",
    option: ["संस्कार", "समझौता", "मित्रता", "इनमेंसे कोई नहीं"],
    answer: "समझौता"
},
{
    question: "निम्न में से कौन सा हिन्दू विवाह का उद्देश्य है",
    option: ["धार्मिक कर्त्तव्य", "पुत्र प्राप्ति", "रति", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "वर्ग व्यवस्था है एक",
    option: ["खुलीव्यवस्था", "बन्द व्यवस्था", "न ही खुली न ही बन्द", "इनमेंसे कोई नहीं"],
    answer: "खुलीव्यवस्था"
},
{
    question: "सामाजिक परिवर्तन का तात्पर्य है",
    option: ["सामाजिक संबंधों मेंपरिवर्तन", "सामाजिक समूहों में परिवर्तन", "सामाजिक अन्तः क्रियाओं मेंपरिवर्तन", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "सहपलायन विवाह, विवाह का एक प्रकार है–",
    option: ["जनजातीय समाज में", "हिन्दूसमाज में", "मुस्लिम समाज में", "ईसाई समाज में"],
    answer: "जनजातीय समाज में"
},
{
    question: "किसने कहा धर्म किसी आध्यात्मिक शक्ति में विश्वास है?",
    option: ["टायलर", "फ्रेजर", "दुखीम", "मॉलिनोस्की"],
    answer: "टायलर"
},
{
    question: "निम्न में से कौन एक वर्ग नहीं है?",
    option: ["डॉक्टर", "शिक्षक", "ब्राह्मण", "वकील"],
    answer: "ब्राह्मण"
},
{
    question: "परिवीक्षा विवाह, विवाह का एक प्रकार है",
    option: ["जनजातीय समाज में", "हिन्दूसमाज में", "मुस्लिम समाज में", "ईसाई समाज में"],
    answer: "जनजातीय समाज में"
},
{
    question: "हिन्दूओं में विवाह के कितने स्वरूप माने जाते ह",
    option: ["दस", "पाँच", "आठ", "चार"],
    answer: "आठ"
},
{
    question: "”भारत में विवाह और परिवार” किसने लिखी?",
    option: ["ए.एम. शाह", "जी.एस. घुर्ये", "के.एम. कपाडिया", "डब्ल्यू. आई. वार्नर"],
    answer: "के.एम. कपाडिया"
},
{
    question: "डेन्जरस ड्रग्स एक्ट किस वर्ष में पारित किया गया?",
    option: ["1930", "1931", "1938", "1933"],
    answer: "1938"
},
{
    question: "परिवार सामाजिक नियंत्रण के किस प्रकार के साधनों के अन्तर्गत आता है",
    option: ["औपचारिक नियंत्रण", "अनौपचारिक नियंत्रण के साधन", "उपर्युक्त दोनों", "इनमें से कोई नहीं"],
    answer: "अनौपचारिक नियंत्रण के साधन"
},
{
    question: "“परिवार निश्चित यौन सम्बन्धों द्वारा परिभाषित एक ऐसा समूह है, जो बच्चों के जनन एवं पालन–पोषण की व्यवस्था करता है।” उपर्युक्त परिभाषा दी है",
    option: ["लसूमेयर ने", "बोगार्ड्स ने", "मैकाइवर एवं पेज ने", "बर्गेस एवं लॉक ने"],
    answer: "मैकाइवर एवं पेज ने"
},
{
    question: "किस विद्वान ने परिवार को ‘मानव स्वभाव की पोधिका’ कहा है?",
    option: ["मरडॉक", "चार्ल्स कूले", "मैकाइवर", "इनमेंसे कोई नहीं"],
    answer: "चार्ल्स कूले"
},
{
    question: "इनमें से कौन जाति व्यवस्था की देन है?",
    option: ["शोषण", "असमानता", "जातिवाद", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "किस प्रकार के परिवार को ‘दो–पीढ़ी परिवार’ कहा जाता है?",
    option: ["बृहत्संयुक्त परिवार", "संयुक्त परिवार", "एकाकीपरिवार", "इनमेंसे कोई नहीं"],
    answer: "एकाकीपरिवार"
},
{
    question: "निम्नलिखित में से परिवार का प्रकार्य है",
    option: ["सन्तानोत्पत्ति", "यौन इच्छाओं कीपूर्ति", "प्रजातिकी निरन्तरता", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "”नातेदारी सामाजिक उद्देश्यों के लिए स्वीकृत वंश सम्बन्ध है, जो कि सामाजिक सम्बन्धों के परम्परागत सम्बन्धों का आधार है।” उपर्युक्त कथन का सम्बन्ध है",
    option: ["रिवर्स", "जी.डी. माइकेल", "रैडक्लिफ ब्राउन", "मरडॉक"],
    answer: "रैडक्लिफ ब्राउन"
},
{
    question: "‘मानवशास्त्रीय शब्दकोष’ नामक पुस्तक के लेखक हैं",
    option: ["चार्ल्स विनिक", "इरावतीकर्वे", "मैकाइवर एवं पेज", "आर. के. ब्राउन"],
    answer: "चार्ल्स विनिक"
},
{
    question: "मॉर्गन ने नातेदारी संज्ञाओं के कितने प्रकारों का उल्लेख किया है?",
    option: ["एक", "दो", "तीन", "चार"],
    answer: "दो"
},
{
    question: "यह किसका कथन है कि “परिहास सम्बन्धों के द्वारा नातेदारों के बीच सहजतापूर्ण व घनिष्ठ मैत्रीपूर्ण सम्बन्धों का विकास होता है।”",
    option: ["आर.के. ब्राउन", "जे. फ्रेजर", "वेस्टरमार्क", "टॉयलर"],
    answer: "वेस्टरमार्क"
},
{
    question: "संयुक्त परिवार व्यवस्था पायी जाती है",
    option: ["औद्योगिक समाज में", "नगरीय समाज में", "ग्रामीण समाज में", "इनमेंसे कोई नहीं"],
    answer: "ग्रामीण समाज में"
},
{
    question: "संयुक्त परिवार की कौन–सी विशेषता है?",
    option: ["बड़ाआकार", "सामान्य सम्पत्ति", "सामान्य निवास", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "प्रायः संयुक्त परिवार कर्ता कौन होता है?",
    option: ["सबसेबुजुर्ग पुरुष", "सबसेबुजुर्ग महिला", "पढ़ा–लिखा व्यक्ति", "ज्येष्ठ पुत्र"],
    answer: "सबसेबुजुर्ग पुरुष"
},
{
    question: "निम्नलिखित में क्या संयुक्त परिवार का प्रकार्य नहीं है?",
    option: ["सामाजिक सुरक्षा", "आर्थिक सुरक्षा", "व्यक्तिवादिता", "मानसिक सुरक्षा"],
    answer: "व्यक्तिवादिता"
},
{
    question: "जन्ममूलक परिवार एवं प्रजनन मूलक परिवार की व्याख्या किस विद्वान ने की है?",
    option: ["लिण्टन", "डेविस", "मैकाइवर", "बोगार्डस"],
    answer: "डेविस"
},
{
    question: "”एक जनजाति के रूप में क्षेत्र, भाषा, सांस्कृतिक समरूपता तथा एक सूत्र में बाँधने वाले सामाजिक संगठन को लेते हैं, जिसमें गोत्र या गाँव सम्मिलित होते हैं।” जनजाति की उक्त परिभाषा दी है",
    option: ["हरबर्ट स्पेन्सन", "चार्ल्स विनिक", "डी.एन. मजूमदार", "मैकाइवर एवं पेज"],
    answer: "चार्ल्स विनिक"
},
{
    question: "निम्न में से सामान्य निषेध ‘(टेव) का सम्बन्ध है",
    option: ["खान–पान से", "विवाह से", "व्यवसाय से", "इन में सभी से"],
    answer: "इन में सभी से"
},
{
    question: "प्रो. एस.सी. दुबे ने भौगोलिक दृष्टि से भारतीय जनजातियों को निम्न में से कितने भागों में विभक्त किया है?",
    option: ["दो", "तीन", "चार", "पाँच"],
    answer: "चार"
},
{
    question: "निम्नलिखित में से शिकार एवं खाद्य संग्रहण जनजाति समूह है।",
    option: ["कुका", "मुण्डा", "भील", "गोंड"],
    answer: "कुका"
},
{
    question: "किस मानवशास्त्री ने पर–संस्कृतिग्रहण को जनजाति संस्कृति के विघटन के लिए उत्तरदायी माना है?",
    option: ["एम.एन. श्रीनिवास", "रैडक्लिफ ब्राउन", "किंग्सले डेविस", "मजूमदार एवं मदान"],
    answer: "मजूमदार एवं मदान"
},
{
    question: "किस संविधान संशोधन के तहत अनुसूचित जाति, जनजाति अत्याचार निरोधक अधिनियम पारित किया गया?",
    option: ["32 वें", "65 वें", "44 वें", "66 वें"],
    answer: "65 वें"
},
{
    question: "संविधान के किस अनुच्छेद के अन्तर्गत यह प्रावधान किया गया कि सम्बन्धित राज्य का राज्यपाल, राष्ट्रपति की अनुमति से किसी भी जनजाति को अनुसूचित जनजाति में सम्मिलित कर सकता है?",
    option: ["अनुच्छेद-342", "अनुच्छेद-338", "अनुच्छेद-339", "उपर्युक्त सभी"],
    answer: "अनुच्छेद-342"
},
{
    question: "जनजातियों को ‘पिछड़े हिन्दू’ कहकर किस समाजशास्त्री ने सम्बोधित किया है?",
    option: ["आर.के. मुखर्जी", "जी.एस. घुरये", "आर.के. ब्राउन", "एस.सी. दुबे"],
    answer: "जी.एस. घुरये"
},
{
    question: "बी.एस. गुहा ने उत्तरी–पूर्वी क्षेत्र के अन्तर्गत किस सीमावर्ती राज्य को सम्मिलित किया है?",
    option: ["मध्य प्रदेश", "झारखण्ड", "पूर्वीपंजाब", "आन्ध्र प्रदेश"],
    answer: "पूर्वीपंजाब"
},
{
    question: "निम्न में से जनजाति की विशेषता है",
    option: ["सामान्य संस्कृति", "एक विशिष्ट नाम", "बहिर्विवाहीसमूह", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "निम्न में से द्रविड़ भाषायी परिवार से सम्बन्धित जनजाति है",
    option: ["गोंड", "उराँव", "( a ) और ( b ) दोनों", "इनमेंसे कोई नहीं"],
    answer: "( a ) और ( b ) दोनों"
},
{
    question: "भारतीय समाज में सामाजिक स्तरीकरण का बुनियादी आधार क्या है",
    option: ["धन एवं सम्पत्ति", "जाति", "परिवार", "धर्म"],
    answer: "धर्म"
},
{
    question: "प्रभुजाति की अवधारणा देन है",
    option: ["पी.एन. प्रभु की", "मजूमदार की", "रिजलेकी", "श्रीनिवास की"],
    answer: "श्रीनिवास की"
},
{
    question: "निम्न में से किसने जाति प्रथा की उत्पत्ति पर प्रजातीय दृष्टिकोण प्रस्तुत किया है?",
    option: ["मॉर्गन", "रिजले", "नेसफील्ड", "ए.आर. देसाई"],
    answer: "रिजले"
},
{
    question: "निम्न में से कौन जनजाति की विशेषता है?",
    option: ["सामान्य भूभाग", "सामान्य भाषा", "सामान्य संस्कृति", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "निम्न में से किसने सामाजिक–धार्मिक सुधार आन्दोलनों में अग्रणी भूमिका निभायी?",
    option: ["राजाराममोहन राय", "दयानन्द सरस्वती", "उपर्युक्त दोनों", "उपर्युक्त में से कोई नहीं"],
    answer: "उपर्युक्त दोनों"
},
{
    question: "निम्न में से किसने भारतीय जनजातियों के लिए ‘अलगाव की नीति’ की वकालत की?",
    option: ["बेली", "घुरिये", "एल्विन", "मजूमदार"],
    answer: "एल्विन"
},
{
    question: "जनजाति समाजों में निम्न में से क्या नहीं पाया जाता है?",
    option: ["श्रम विभाजन", "युवागृह", "महिलाकी आजादी", "सरल अर्थव्यवस्था"],
    answer: "श्रम विभाजन"
},
{
    question: "भारत सरकार द्वारा ‘दहेज निरोधक अधिनियम’ किस वर्ष पारित किया गया?",
    option: ["सन्1961 में", "सन्1965 में", "सन्1968 में", "सन्1971 में"],
    answer: "सन्1961 में"
},
{
    question: "उराँव निवासी हैं राज्य के।",
    option: ["बिहार", "झारखण्ड", "ओडिशा", "मध्य प्रदेश"],
    answer: "झारखण्ड"
},
{
    question: "युवा संगठन पायाजाता है",
    option: ["ग्रामीण समाज में", "नगरीय समाज में", "जनजातीय समाज में", "औद्योगिक समाज में"],
    answer: "जनजातीय समाज में"
},
{
    question: "कौन समस्या जनजातीय जीवन से सम्बन्धित नहीं है?",
    option: ["छूआछूत", "युवाआवासशाला", "जातिसंस्तरण काविकास", "भूमिनिष्कासन"],
    answer: "छूआछूत"
},
{
    question: "एक विचारधारा के रूप में ‘जाति–व्यवस्था’ का अध्ययन निम्न में से किस समाजशास्त्री ने किया है?",
    option: ["लुई ड्यूमाँ", "एम.एस. श्रीनिवास", "मैकम मैरियट", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "जाति व्यवस्था में परिवर्तन के लिए निम्नलिखित में से कौन–सा कारण उत्तरदायी है?",
    option: ["शिक्षाका प्रसार", "धर्म के प्रभाव मेंकमी", "पश्चिमीसभ्यता का प्रभाव", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "किस समाजशास्त्री ने ‘जाति’ की अवधारणा का प्रयोग ‘प्रजाति’ के सन्दर्भ में किया है?",
    option: ["मैक्स वेबर", "अब्बेडुवॉयस", "केतकर", "रिजले"],
    answer: "अब्बेडुवॉयस"
},
{
    question: "यह कथन किसका है कि “जब एक वर्ग लगभग पूर्ण रूप से वंशानुक्रमण पर आधारित होता है, तब उसे हम जाति कहते हैं”?",
    option: ["चार्ल्स कूले", "लुई ड्यूमा", "एम.एन. श्रीनिवास", "आन्द्रेबेताई"],
    answer: "चार्ल्स कूले"
},
{
    question: "‘द्विधर प्रतिकूलता का सिद्धान्त’ दिया है",
    option: ["एस.सी. दुबे", "एम.एन. श्रीनिवास", "आन्द्रे बेताई", "लुई ड्यूमा"],
    answer: "लुई ड्यूमा"
},
{
    question: "सर हरबर्ट रिजले के नेतृत्व में किस वर्ष जाति आधारित जनगणना आयोजित की गयी?",
    option: ["सन्1971 में", "सन्1981 में", "सन्1901 में", "सन्1921 में"],
    answer: "सन्1901 में"
},
{
    question: "निम्नलिखित में से जाति व्यवस्था की विशेषता है",
    option: ["खान–पान एवं सामाजिक सहवास पर प्रतिबन्ध", "खुलीव्यवस्था", "एक अन्तर्विवाही समूह", "इनमेंसे सभी"],
    answer: "खान–पान एवं सामाजिक सहवास पर प्रतिबन्ध"
},
{
    question: "नातेदारी की कितनी श्रेणियाँ होती हैं?",
    option: ["दो", "तीन", "चार", "पाँच"],
    answer: "तीन"
},
{
    question: "धर्म की उत्पत्ति के ‘आत्मवाद’ का सिद्धान्त किसने दिया?",
    option: ["टायलर", "दुर्थीम", "मैक्स मूलर", "फ्रेजर"],
    answer: "टायलर"
},
{
    question: "निम्न में से कौन जातिवाद का दुष्परिणाम है?",
    option: ["औद्यौगिक प्रतिस्पर्धा", "सामाजिक समस्याओं मेंवृद्धि", "जजमानीव्यवस्था", "नारीशिक्षा"],
    answer: "सामाजिक समस्याओं मेंवृद्धि"
},
{
    question: "निम्न में से कौन बिहार में अनुसूचित जाति नहीं है?",
    option: ["पासवान", "मांझी", "रविदास", "कुर्मी"],
    answer: "कुर्मी"
},
{
    question: "भारतीय समाज कितने आश्रमों में विभाजित था?",
    option: ["चार", "पाँच", "तीन", "सात"],
    answer: "चार"
},
{
    question: "‘दादी’ नातेदारी की किस श्रेणी के अन्तर्गत आती है?",
    option: ["प्राथमिक", "द्वितीयक", "तृतीयक", "इनमेंसे कोई नहीं"],
    answer: "द्वितीयक"
},
{
    question: "निम्न में से कौन–सा एक वर्ण है?",
    option: ["ब्राह्मण", "यादव", "त्यागी", "अग्रवाल"],
    answer: "ब्राह्मण"
},
{
    question: "किस समाज में ‘पैशाच विवाह’ का प्रचलन था?",
    option: ["हिन्दूसमाज में", "मुस्लिम समाज में", "सिख समाज में", "आदिवासी समाज में"],
    answer: "हिन्दूसमाज में"
},
{
    question: "मरडॉक के अनुसार विवाह का क्या उद्देश्य है?",
    option: ["यौन इच्छा की पूर्ति", "बच्चोंका पालन पोषण", "आर्थिक सहयोग", "इनमेंसे सभी"],
    answer: "यौन इच्छा की पूर्ति"
},
{
    question: "‘अहिंसा परमो धर्मः’ किस धर्म की शिक्षा है?",
    option: ["हिन्दू", "बौद्ध", "सिख", "जैन"],
    answer: "हिन्दू"
},
{
    question: "निम्न में से कौन जाति नहीं है?",
    option: ["ब्राह्मण", "शूद्र", "कुशवाहा", "रविदास"],
    answer: "शूद्र"
},
{
    question: "घरेलू हिंसा का क्या तात्पर्य है?",
    option: ["ग्रामीण हिंसा", "सामुदायिक हिंसा", "धार्मिक हिंसा", "पारिवारिक हिंसा"],
    answer: "पारिवारिक हिंसा"
},
{
    question: "निम्न में से कौन जनजाति नहीं है?",
    option: ["भील", "संथाल", "खासी", "चौपाल"],
    answer: "चौपाल"
},
{
    question: "जाति का प्रजातीय सिद्धान्त किसने प्रतिपादित किया?",
    option: ["नेसफील्ड", "एस ० सी ० दूबे", "होकार्ट", "हर्बर्ट रिजले"],
    answer: "नेसफील्ड"
},
{
    question: "निम्न में से कौन एक वर्ग नहीं है?",
    option: ["प्रधानाचार्य", "चिकित्सक", "न्यायाधीश", "राजपूत"],
    answer: "राजपूत"
},
{
    question: "हिन्दू विवाह के किस स्वरूप में एक जोड़े बैल एवं गाय की माँग की जाती है?",
    option: ["दैव विवाह", "ब्रह्म विवाह", "आर्ष विवाह", "प्रजापत्य विवाह"],
    answer: "आर्ष विवाह"
},
{
    question: "हिन्दू विवाह का निम्न में से कौन–सा प्रकार अमान्य है?",
    option: ["ब्रह्म विवाह", "दैव विवाह", "प्रजापत्य विवाह", "असुर विवाह"],
    answer: "असुर विवाह"
},
{
    question: "जनजातियों में जीवन साथी प्राप्त करने की कितनी पद्धतियाँ हैं?",
    option: ["आठ", "सात", "पाँच", "ग्यारह"],
    answer: "सात"
},
{
    question: "समाज का निर्माण निम्न में से किससे होता है?",
    option: ["व्यक्तियोंसे", "संस्थाओंसे", "सामाजिक संबंधों से", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "प्राचीन भारतीय समाज कितने वर्षों में विभाजित था?",
    option: ["तीन", "चार", "पाँच", "दो"],
    answer: "चार"
},
{
    question: "हिन्दू विवाह का कौन–सा प्रकार परस्पर प्रेम पर आधारित है?",
    option: ["गंधर्व", "प्रजापत्य", "असुर", "राक्षस"],
    answer: "गंधर्व"
},
{
    question: "निम्न में से कौन नातेदारी की रीतियाँ नहीं है?",
    option: ["परिहार", "वर्गीकृत संज्ञाएँ", "परिहास सम्बन्ध", "माध्यमिक संबोधन"],
    answer: "वर्गीकृत संज्ञाएँ"
},
{
    question: "निम्न में से किसने जाति व्यवस्था की उत्पत्ति के धार्मिक सिद्धान्त की वकालत की?",
    option: ["होकार्ट एवं सेनार्ट", "हबर्ट रिजले", "मजूमदार एवं मदान", "जी० एस० घुर्ये"],
    answer: "होकार्ट एवं सेनार्ट"
},
{
    question: "किस समाज में सेवा विवाह का प्रचलन है?",
    option: ["हिन्दूसमाज में", "मुस्लिम समाज में", "जनजातीय समाज में", "सिख समाज में"],
    answer: "जनजातीय समाज में"
},
{
    question: "बाजार क्या है ?",
    option: ["एक संस्था", "एक सामाजिक समूह", "एक समुदाय", "इनमें से कोई नहीं"],
    answer: "इनमें से कोई नहीं"
},
{
    question: "बाजार किस चीज का केन्द्र है ?",
    option: ["विनिमय", "खपत", "वितरण", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "दो पक्षों के के मध्य होने वाले ऐच्छिक, वैधानिक एवं पारस्परिक धन के हस्तांतरण को विनिमय कहते हैं। यह किसका कथन है ?",
    option: ["मार्शल", "थॉमस", "स्मिथ", "डॉ. मजूमदार"],
    answer: "मार्शल"
},
{
    question: "एक वस्तु से दूसरी वस्तु के प्रत्यक्ष विनिमय को ही वस्तु विनिमय हैं कहते। यह कथन किसका है ?",
    option: ["मार्शल", "थॉमस", "एडम स्मिथ", "ब्लेयर"],
    answer: "थॉमस"
},
{
    question: "घोराई किस राज्य में है ?",
    option: ["बिहार", "झारखंड", "मध्य प्रदेश", "छत्तीसगढ़"],
    answer: "छत्तीसगढ़"
},
{
    question: "‘द वेल्थ ऑफ नेशन्स’ के रचयिता हैं",
    option: ["मैक्स वेबर", "एडम स्मिथ", "कार्ल मार्क्स", "कॉलिन्स"],
    answer: "एडम स्मिथ"
},
{
    question: "बाजार स्थिति से अर्थ विनिमय के किसी भी विषय के लिए उसे द्रव में बदलने के उन तमाम अवसरों से होता है, जिनके बारे में बाजार स्थिति में सहभागी को पता है कि वे उन्हें प्राप्त हैं और वे दामों तथा प्रतिस्पर्द्धा की दृष्टि से उनकी मनोवृत्तियों के लिए सन्दर्भपूर्ण हैं। बाजार की उक्त परिभाषा दी है",
    option: ["मैक्स वेबर", "सिजविक", "एडम स्मिथ", "मैकाइवर एवं पेज"],
    answer: "सिजविक"
},
{
    question: "‘अदृश हाथ’ की अवधारणा का सम्बन्ध किस समाज वैज्ञानिक से है ?",
    option: ["आर. के. ब्राउन", "मार्शल", "स्पेन्सर", "स्मिथ"],
    answer: "स्मिथ"
},
{
    question: "प्राचीन काल में भारत में ‘विनिमय बिल’ या हुण्डी का प्रचलन किस प्रकार की व्यवस्था से सम्बन्धित था ?",
    option: ["बैंकिंग व्यवस्था से", "जाति व्यवस्था से", "वर्ग व्यवस्था से", "इनमें से किसी से नहीं"],
    answer: "बैंकिंग व्यवस्था से"
},
{
    question: "ग्रामीण भारत में ‘वस्तु विनिमय’ किस नाम से जाना जाता है ? पर आधारित अर्थव्यवस्था को",
    option: ["सती प्रथा", "जजमानी प्रथा", "जौहर प्रथा", "ये सभी"],
    answer: "जजमानी प्रथा"
},
{
    question: "वह बाजार जो किसी भी प्रकार की राष्ट्रीय अथवा अन्य रोकथाम से पूर्णतः मुक्त होता है, कहलाता है",
    option: ["मुक्त या खुला बाजार", "बन्द बाजार", "उपर्युक्त दोनों", "इनमें से कोई नहीं"],
    answer: "मुक्त या खुला बाजार"
},
{
    question: "यह किसका कथन है कि सभी आर्थिक व्यवस्थाएँ सामाजिक व्यवस्थाएँ भी हैं। प्रत्येक उत्पादन विधि विशेष उत्पादन सम्बन्धों से निर्मित होती है, जो अन्ततः एक विशिष्ट वर्ग संरचना का निर्माण करती है।",
    option: ["जॉर्ज सिमैल", "मैक्स वेबर", "कार्ल मार्क्स", "लुईस वर्थ"],
    answer: "कार्ल मार्क्स"
},
{
    question: "भारत में भूमण्डलीकरण का आरम्भ किस दशक से माना जाता है ?",
    option: ["1960 ई. में", "1990 ई. में", "1980 ई. में", "इनमें से कोई नहीं"],
    answer: "1990 ई. में"
},
{
    question: "वह प्रक्रिया जिसमें कोई भी वस्तु जो पूर्व में बाजार का हिस्सा नहीं थी, वह अब बाजार में बिकने वाली वस्तु बन गयी है अर्थात् वह अब बाजार का एक हिस्सा बन गयी है, कहलाती है",
    option: ["पण्यीकरण", "पूँजीवाद", "उपभोग", "उदारवाद"],
    answer: "पण्यीकरण"
},
{
    question: "निम्नलिखित में से बाजार की प्रमुख विशेषता है",
    option: ["बाजार में वस्तुओं का मूल्य उसकी माँग एवं पूर्ति द्वारा निर्धारित किया जाता है।", "बाजार में सभी सेवाएँ भी अन्य वस्तुओं की भाँति खरीदी व बेची जाती है।", "बाजार में श्रम विभाजन एवं विशिष्टीकरण पाया जाता हैं।", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "निम्न में से बाजार का स्वरूप है",
    option: ["साप्ताहिक बाजार (हाट)", "औद्योगिक बाजार", "पूर्ण एवं अपूर्ण बाजार", "ये सभी"],
    answer: "ये सभी"
},
{
    question: "किस वर्ष बाल श्रम पर एक राष्ट्रीय नीति बनाई गई ?",
    option: ["1986", "1991", "1948", "1952"],
    answer: "1986"
},
{
    question: "निम्न में से कौन वैश्वीकरण के प्रमुख प्रेरक हैं ?",
    option: ["बाजार की खोज", "प्रौद्योगिकी, इलेक्ट्रॉनिक एवं कम्प्यूटर नेटवर्क", "बहुराष्ट्रीय विनियोग", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "भारत में किस वर्ष समेकित बाल विकास सेवा कार्यक्रम प्रारंभ किया गया ?",
    option: ["1975", "1974", "2011", "1985"],
    answer: "1975"
},
{
    question: "बाल अधिकार संरक्षण हेतु किन्हें नोबेल शांति पुरस्कार से सम्मानित किया गया ?",
    option: ["मलाला युसुफजाई", "कैलाश सत्यार्थी", "मदर टेरेसा", "अमर्त्य सेन"],
    answer: "कैलाश सत्यार्थी"
},
{
    question: "‘बचपन बचाओ आन्दोलन’ के संस्थापक कौन हैं ?",
    option: ["कैलाश सत्यार्थी", "मेधा पाटेकर", "नीरा देसाई", "मदर टेरेसा"],
    answer: "कैलाश सत्यार्थी"
},
{
    question: "जनजातियों के पिछड़ेपन के निम्न में कौन एक कारक है ?",
    option: ["अशिक्षा", "धर्म", "जंगल", "नशाखोरी"],
    answer: "अशिक्षा"
},
{
    question: "मुस्लिम महिलाओं को सम्पत्ति के अधिकार के विवाद से किसका नाम जुड़ा हुआ है ?",
    option: ["शाहबानो", "नूर फातिमा", "शाबाना आजमी", "चाँद बीबी"],
    answer: "शाहबानो"
},
{
    question: "भारत सरकार ने सर्वप्रथम अल्पसंख्यक आयोग की स्थापना किस वर्ष की ?",
    option: ["1978 ई. में", "1992 ई. में", "1999 ई. में", "1988 ई. में"],
    answer: "1978 ई. में"
},
{
    question: "छुआछूत को संविधान के किस अनुच्छेद के अंतर्गत प्रतिबन्धित किया गया है ?",
    option: ["अनुच्छेद -23", "अनुच्छेद -14", "अनुच्छेद -17", "अनुच्छेद -25"],
    answer: "अनुच्छेद -17"
},
{
    question: "भारत के किस प्रांत में हिन्दू अल्पसंख्यक हैं ?",
    option: ["हरियाणा", "पंजाब", "जम्मू – कश्मीर", "केरल"],
    answer: "जम्मू – कश्मीर"
},
{
    question: "निम्न में से भारत के किस राज्य में ईसाइयों की संख्या सर्वाधिक है ?",
    option: ["बिहार", "मध्य प्रदेश", "तमिलनाडु", "केरल"],
    answer: "केरल"
},
{
    question: "निम्न समूहों में से किससे आप भारत के सबसे छोटी धार्मिक अल्पसंख्यक सम्प्रदाय मानते हैं ?",
    option: ["मुस्लिम", "ईसाई", "सिक्ख", "पारसी"],
    answer: "पारसी"
},
{
    question: "जातीय पूर्वाग्रह का क्या अर्थ है ?",
    option: ["जाति वर्गीकरण", "जाति संघर्ष", "किसी जाति में प्रवेश पाने के लिए किया गया प्रयास", "किसी जाति से सम्बन्धित अवैज्ञानिक एवं गलत अवधारणा"],
    answer: "किसी जाति से सम्बन्धित अवैज्ञानिक एवं गलत अवधारणा"
},
{
    question: "बिहार में जतीय तनाव का मुख्य कारण है",
    option: ["जमीन", "फैशन", "शिक्षा", "इनमें से कोई नहीं"],
    answer: "जमीन"
},
{
    question: "हिन्दू विवाह अधिनियम पारित हुआ",
    option: ["1950 ई. में", "1954 ई. में", "1955 ई. में", "1976 ई. में"],
    answer: "1955 ई. में"
},
{
    question: "भारत सरकार द्वारा अनुसूचित जातियों की अधिकृत अनुसूची कब घोषित की गई ?",
    option: ["सन् 1955", "सन् 1950", "सन् 1935", "सन् 1952"],
    answer: "सन् 1950"
},
{
    question: "अन्य पिछड़ा वर्ग के लिए सरकार ने कितना आरक्षण प्रदान किया है ?",
    option: ["33 प्रतिशत", "27 प्रतिशत", "11 प्रतिशत", "44 प्रतिशत"],
    answer: "27 प्रतिशत"
},
{
    question: "निम्नलिखित में से कौन एक सामाजिक समस्या है ?",
    option: ["प्रेम विवाह", "नगरीकरण", "भिक्षावृति", "आधुनिकीकरण"],
    answer: "भिक्षावृति"
},
{
    question: "पारसन्स ने बच्चों के समाजीकरण में",
    option: ["तीन अवस्थाओं का उल्लेख किया है", "तीन अवस्थाओं का उल्लेख किया है", "पाँच अवस्थाओं का उल्लेख किया है", "छः अवस्थाओं का उल्लेख किया है"],
    answer: "पाँच अवस्थाओं का उल्लेख किया है"
},
{
    question: "भारतीय समाज में सामाजिक स्तरीकरण का बुनियाद क्या है ?",
    option: ["धन एवं सम्पत्ति", "जाति", "परिवार", "धर्म"],
    answer: "जाति"
},
{
    question: "भारतीय इतिहास के कस काल को भारतीय स्त्री जाति का ‘काला युग’ कहा जाता है ?",
    option: ["ऋग्वैदिक काल", "उत्तर वैदिक काल", "ब्रिटिश काल", "मध्य काल"],
    answer: "मध्य काल"
},
{
    question: "कब वृद्धों के लिए राष्ट्रीय नीति की घोषणा की गई ?",
    option: ["1999 ई. में", "1998 ई. में", "1997 ई. में", "2000 ई. में"],
    answer: "1999 ई. में"
},
{
    question: "निम्न में किस अधिनियम के द्वारा वैवाहिक संबंधों की स्थापना में धर्म तथा जाति के मददों को वैधानिक तौर पर समाप्त किया गया है ?",
    option: ["सती प्रथा निषेध अधिनियम, 1829", "हिन्दू विधवा पुनर्विवाह अधिनियम, 1856", "हिन्दू स्त्रियों का संपति पर अधिकार अधिनियम, 1937", "विशेष विवाह अधिनियम, 1954"],
    answer: "विशेष विवाह अधिनियम, 1954"
},
{
    question: "‘मेहर’ शब्द किस धर्म से संबंधित है ?",
    option: ["हिन्दू", "मुस्लिम", "सिक्ख", "इनमें से कोई नहीं"],
    answer: "मुस्लिम"
},
{
    question: "‘पुनर्जन्म’ की अवधारणा किस धर्म से संबंधित है ?",
    option: ["हिन्दू", "इस्लाम", "ईसाई", "इनमें सभी"],
    answer: "हिन्दू"
},
{
    question: "पिछड़ा वर्ग वित्त व विकास निगम की स्थापना कब की गई ?",
    option: ["1992 ई. में", "2004 ई. में", "1995 ई. में", "2007 ई. में"],
    answer: "1992 ई. में"
},
{
    question: "राष्ट्रीय स्तर पर भारत में कुल कितने समुदायों को अल्पसंख्यकों के रूप में मान्यता दी गई है ?",
    option: ["दस", "आठ", "पाँच", "चार"],
    answer: "पाँच"
},
{
    question: "भारत की कुल जनसंख्या का कितना प्रतिशत हिन्दू हैं ?",
    option: ["82.42 %", "88.42 %", "77.92 %", "66.42 %"],
    answer: "82.42 %"
},
{
    question: "संविधान के किस अनुच्छेद में जनजातियों के लिए नौकरियों में आरक्षण का प्रावधान है ?",
    option: ["335", "244", "341", "15"],
    answer: "335"
},
{
    question: "भारतीय समाज में सामाजिक स्तरीकरण का बुनियादी अधार क्या है ?",
    option: ["धन एवं सम्पत्ति", "जाति", "वंश", "धर्म"],
    answer: "जाति"
},
{
    question: "भारत में किस प्रांत में मुसलमानों की संख्या सर्वाधिक है ?",
    option: ["आंध्र प्रदेश", "केरल", "असम", "कश्मीर"],
    answer: "कश्मीर"
},
{
    question: "निम्नलिखित में से किसको किसी एक जाति को अनुसूचित जाति घोषित करने का अधिकार है ?",
    option: ["भारत के राष्ट्रपति", "राज्य का राज्यपाल", "अनुसूचित जाति आयुक्त", "केन्द्रीय मंत्रीमंडल"],
    answer: "भारत के राष्ट्रपति"
},
{
    question: "संविधान के किस अनुच्छेद द्वारा लोकसभा में अनुसूचित जाति एवं अनुसूचित जनजाति के सदस्यों के लिए सीट का आरक्षण किया गया है ?",
    option: ["अनुच्छेद -330", "अनुच्छेद -332", "अनुच्छेद -320", "अनुच्छेद -338"],
    answer: "अनुच्छेद -330"
},
{
    question: "संविधान के किस अनुच्छेद में अस्पृश्यता निवारण का प्रावधान किया गया है ?",
    option: ["अनुच्छेद -23", "अनुच्छेद -17", "अनुच्छेद–29", "अनुच्छेद–25"],
    answer: "अनुच्छेद -17"
},
{
    question: "अनुसूचित जनजाति को पहले निम्नलिखित में किस नाम से पुकारा जाता था ?",
    option: ["आदिवासी", "जंगली जाति", "वनजाति", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "भारत में अनुसूचित जातियों जनजातियों के लिए आरक्षण का प्रावधान संविधान के किस धारा में किया गया है ?",
    option: ["धारा 335", "धारा 379", "धारा 369", "धारा 330"],
    answer: "धारा 335"
},
{
    question: "2001 की जनगणना के अनुसार भारत में अनुसूचित जाति की संख्या कितना प्रतिशत है ?",
    option: ["10 प्रतिशत", "13 प्रतिशत", "15 प्रतिशत", "18 प्रतिशत"],
    answer: "15 प्रतिशत"
},
{
    question: "हिन्दू विवाह का उद्देश्य धर्म, प्रजनन, रीति तथा कुछ अन्य दायित्वों का निर्वहन है",
    option: ["पूर्णत: सही है", "आंशिक रूप से सही है", "गलत है", "नहीं कह सकते"],
    answer: "आंशिक रूप से सही है"
},
{
    question: "अनुसूचित जातियों को आरक्षण दिया जाता है, उनकी",
    option: ["गरीबी के संदर्भ में", "आर्थिक आवश्यकताओं के संदर्भ में", "संख्या के संदर्भ में", "निम्न अनुष्ठानिक स्थिति के संदर्भ में"],
    answer: "निम्न अनुष्ठानिक स्थिति के संदर्भ में"
},
{
    question: "किस धर्म में विवाह को एक संविदा माना जाता है ?",
    option: ["हिन्दू", "इस्लाम", "सिख", "पारसी"],
    answer: "इस्लाम"
},
{
    question: "निम्न में से कौन मादक द्रव्य व्यसन एवं मद्यपान का कारण है ?",
    option: ["सुख की इच्छा", "निराशा", "बुरी संगत", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "निम्न में से कौन पिछड़ा वर्ग आयोग के अध्यक्ष थे ?",
    option: ["काका कलेलकर", "कर्पूरी ठाकुर", "धनिकलाल मंडल", "राम मनोहर लोहिया"],
    answer: "काका कलेलकर"
},
{
    question: "सार्वजनिक जीवन में भ्रष्टाचार निम्न में से किस दशा से संबंधित है ?",
    option: ["नैतिक पतन से", "गरीबी से", "मद्यपान से", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "निम्न में से कौन सामाजिक समस्या नहीं है ?",
    option: ["बाल श्रम", "भ्रष्टाचार", "तस्करी", "आधुनिकीकरण"],
    answer: "आधुनिकीकरण"
},
{
    question: "निम्न में से किस वर्ष काम के बदले अनाज योजना शुरू की गई?",
    option: ["1975", "1976", "1977", "1948"],
    answer: "1977"
},
{
    question: "निम्न में से कौन एक अनुसूचित जाति नहीं है ?",
    option: ["मुसहर", "दुसाध", "रजक", "धनुक"],
    answer: "रजक"
},
{
    question: "किस वर्ष संसद में ”तीन तलाक” पास हुआ ?",
    option: ["2016", "2017", "2018", "2019"],
    answer: "2019"
},
{
    question: "किस वर्ष घरेलू हिंसा कानून पास हुआ ?",
    option: ["2005", "2007", "1998", "2009"],
    answer: "2005"
},
{
    question: "संयुक्त राष्ट्र संघ द्वारा अन्तर्राष्ट्रीय महिला दशक कब गया ?",
    option: ["1975-85", "1980-90", "1985-95", "1990-2000"],
    answer: "1975-85"
},
{
    question: "किसने यांत्रिक एकता एवं सावयवी एकता की अवधारणाओं का निरूपण किया है ?",
    option: ["मैक्स वेबर", "पैरेटो", "मर्टन", "दुर्खीम"],
    answer: "दुर्खीम"
},
{
    question: "क्षेत्रवाद की समस्या का मूल कारण है",
    option: ["आर्थिक भिन्नता", "सांस्कृतिक भिन्नता", "जैविकीय भिन्नता", "नैतिक भिन्नता"],
    answer: "आर्थिक भिन्नता"
},
{
    question: "भारत में कितनी भाषाएँ हैं ।",
    option: ["179", "185", "220", "100"],
    answer: "179"
},
{
    question: "भारत में कितनी बोलियाँ हैं ?",
    option: ["200", "444", "344", "544"],
    answer: "200"
},
{
    question: "हिन्दी को राजभाषा का दर्जा प्राप्त हुआ",
    option: ["14 सितम्बर, 1950", "14 सितम्बर 1949", "14 सितम्बर, 1951", "14 सितम्बर 1947"],
    answer: "14 सितम्बर 1949"
},
{
    question: "पंजाब और हरियाणा अलग – अलग राज्य बना",
    option: ["1966 ई. में", "1953 ई. में", "1965 ई. में", "1980 ई. में"],
    answer: "1966 ई. में"
},
{
    question: "भाषा के आधार पर आंध्र प्रदेश की स्थापना कब हुई ?",
    option: ["1955 ई. में", "1953 ई. में", "1952 ई. में", "195 ई. में"],
    answer: "1953 ई. में"
},
{
    question: "भारतीय समाज में ‘अनेकता में एकता’ का सर्वाधिक महत्वपूर्ण आधार है",
    option: ["प्राचीनता", "धार्मिक सहिष्णुता", "मौलिकता", "उपर्युक्त कोई नहीं"],
    answer: "मौलिकता"
},
{
    question: "दिल्ली में सिखों के विरुद्ध दंगा किस वर्ष हुआ था ?",
    option: ["1990", "1992", "1994", "1984"],
    answer: "1984"
},
{
    question: "क्षेत्रवाद, जातिवाद एवं संप्रदायवाद राष्ट्रीय एकीकरण के मार्ग में बाधक है ।",
    option: ["हाँ", "नहीं", "कह नहीं सकते", "इनमें से कोई नहीं"],
    answer: "हाँ"
},
{
    question: "संस्कृतिकरण द्वारा किस प्रकार के परिवर्तन की व्याख्या की जाती है ?",
    option: ["जातीय परिवर्तन", "राजनीतिक परिवर्तन", "धार्मिक परिवर्तन", "व्यावसायिक परिवर्तन"],
    answer: "जातीय परिवर्तन"
},
{
    question: "भारत में राजनीतिक दलों को कौन मान्यता देता है ?",
    option: ["राष्ट्रपति", "उच्चतम न्यायालय", "संसद", "चुनाव आयोग"],
    answer: "चुनाव आयोग"
},
{
    question: "धर्म निरपेक्षता का अर्थ क्या है ?",
    option: ["विभिन्न धर्मों का सह अस्तित्व", "अन्य धर्मों के प्रति श्रद्धा", "राज्य का अपना कोई धर्म न होना है", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "संस्कृतिकरण की अवधारणा किसने विकसित की ?",
    option: ["एस.सी. दुबे", "एम.एन. श्रीनिवास", "सच्चिदानंद", "योगेन्द्र सिंह"],
    answer: "एम.एन. श्रीनिवास"
},
{
    question: "सांप्रदायिकता का दुष्परिणाम भारत – पाक विभाजन के रूप में किस वर्ष देखा गया ?",
    option: ["सन् 1945 में", "सन् 1947 में", "सन् 1950 में", "सन् 1952 में"],
    answer: "सन् 1947 में"
},
{
    question: "2006 का मालेगाँव बम विस्फोट काण्ड उदाहरण",
    option: ["क्षेत्रीयता का", "जातिवाद का", "साम्प्रदायिकता का", "इनमें से कोई नहीं"],
    answer: "साम्प्रदायिकता का"
},
{
    question: "भारत में साम्प्रदायिकतावाद का मुख्य कारण कौन है ?",
    option: ["अपराधी मनोवृत्तियाँ", "निर्धनता एवं बेरोजगारी", "राजनीतिक स्वार्थ", "इनमें से कोई"],
    answer: "राजनीतिक स्वार्थ"
},
{
    question: "साम्प्रदायिकता मानव के लिए खतरा है नहीं",
    option: ["सहमत", "असहमत", "विवादास्पद", "इनमें से कोई नहीं"],
    answer: "विवादास्पद"
},
{
    question: "‘क्रियेशन ऑफ पैट्रियारकी’ नामक पुस्तक किसने लिखी है ?",
    option: ["एम.एन. श्रीनिवास", "वाई. सिंह", "बोगार्डस", "जी. लर्नर"],
    answer: "जी. लर्नर"
},
{
    question: "क्षेत्रवाद की समस्या का मुख्य कारण कौन है ?",
    option: ["भाषायी भिन्नताएँ", "सांस्कृतिक भिन्नताएँ", "जैविक भिन्नताएँ", "आर्थिक भिन्नताएँ"],
    answer: "सांस्कृतिक भिन्नताएँ"
},
{
    question: "किसने कहा है कि क्षेत्रीयता, राष्ट्रीयता के अधीन है ?",
    option: ["डॉ. घुरिये", "डॉ. राधाकमल मुखर्जी", "प्रो. बागार्डस", "प्रो. जीटरवर्ग"],
    answer: "डॉ. राधाकमल मुखर्जी"
},
{
    question: "”जातिवाद एक जाति के व्यक्तियों की वह भावना है जो देश या समाज के सामान्य हितों का ख्याल न रखते हुए केवल अपनी जाति के सदस्यों के उत्थान, जातीय एकता और जाति की सामाजिक प्रस्थिति को सुदृढ़ करने हेतु प्रेरित करती हो ।” यह कथन है",
    option: ["डॉ. कैलाशनाथ शर्मा", "के.एम. पन्निकर", "एम.एस. स्वामीनाथन", "बलवन्त राय मेहता"],
    answer: "डॉ. कैलाशनाथ शर्मा"
},
{
    question: "जातिवाद के विकास का प्रमुख कारक है",
    option: ["नगरीकरण", "औद्योगीकरण", "राजनीति", "ये सभी"],
    answer: "ये सभी"
},
{
    question: "पितृसत्तात्मक परिवार में सत्ता या अधिकार किसके हाथ में रहते हैं ?",
    option: ["पुरुष", "स्त्री", "उपर्युक्त दोनों", "इनमें से कोई नहीं"],
    answer: "पुरुष"
},
{
    question: "उड़ीसा के पहाड़ी प्रदेश में रहने वाली जनजाति में पितृसत्तात्मक संयुक्त परिवारों का विशिष्ट विस्तार है ।",
    option: ["भील", "गारो", "खसिया", "संथाल"],
    answer: "खसिया"
},
{
    question: "निम्न में से कौन साम्प्रदायिकता का परिणाम नहीं है ?",
    option: ["परस्पर विश्वास", "राष्ट्रीय एकता में बाधक", "राष्ट्रीय सुरक्षा में बाधक", "पारस्परिक तनाव"],
    answer: "परस्पर विश्वास"
},
{
    question: "भारत की राष्ट्रीय भाषा कौन है ?",
    option: ["तेलगू", "अंग्रेजी", "मराठी", "हिन्दी"],
    answer: "हिन्दी"
},
{
    question: "निम्न में से कौन मानव तस्करी का कारण है ?",
    option: ["अंगों का निष्कर्षण", "वेश्यावृत्ति", "बलात् विवाह", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "निम्न में से कौन भारतीय समाज की विशेषता है ?",
    option: ["धार्मिक कट्टरता", "सामाजिक गतिशीलता", "व्यक्तिगत सम्पत्ति", "अनेकता में एकता"],
    answer: "अनेकता में एकता"
},
{
    question: "भारत में निम्न में से कौन कारक राष्ट्रीय एकता में बाधक है ?",
    option: ["जातिवाद", "क्षेत्रवाद", "धर्मान्धता", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "निम्न में से किसे द्वितीयक क्षेत्र में रखा जाता है ?",
    option: ["कृषि", "व्यापार", "सेवा", "उद्योग"],
    answer: "उद्योग"
},
{
    question: "रेल यातायांत किस श्रेणी के अन्तर्गत रखा गया है ?",
    option: ["द्वितीय", "तृतीय", "चतुर्थ", "प्रथम"],
    answer: "प्रथम"
},
{
    question: "रासायनिक खाद किस श्रेणी में रखा गया है ?",
    option: ["प्रथम", "द्वितीय", "तृतीय", "चतुर्थ"],
    answer: "द्वितीय"
},
{
    question: "लघु उद्योग में अधिकतम निवेश कितना करोड़ है ।",
    option: ["दो", "चार", "पाँच", "एक"],
    answer: "एक"
},
{
    question: "औद्योगिक नीति के अनुसार भारतीय उद्योगों को कितने श्रेणी में बाँटा गया है ?",
    option: ["चार", "पाँच", "तीन", "सात"],
    answer: "तीन"
},
{
    question: "जिसके स्वामित्व और प्रबंध तथा स्थापना एवं विकास का दायित्व पूर्णरूप से केन्द्रीय सरकार को सौंपा गया है, उसे किस श्रेणी में रखा गया है ?",
    option: ["प्रथम", "द्वितीय", "तृतीय", "चतुर्थ"],
    answer: "प्रथम"
},
{
    question: "किस दशक में राष्ट्रीय और अन्तर्राष्ट्रीय स्तर पर उद्योगों के विकास पर बल दिया गया ?",
    option: ["1950 के दशक में", "1960 के दशक में", "1970 के दशक में", "इनमें से कोई नहीं"],
    answer: "1960 के दशक में"
},
{
    question: "भारत के औद्योगीकरण के विकास हेतु कार्य – योजना में किस बात पर बल दिया गया ?",
    option: ["महानगरों में आबादी से हटकर औद्योगिक इकाइयों का निर्माण", "औद्योगिक कचरा निस्तारण हेतु संयंत्रों को लगाने की अनिवार्यता", "प्रदूषण नियंत्रण हेतु उचित प्रावधान", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "भारत में स्पष्ट रूप से उदारीकरण की प्रक्रिया का आरम्भ किसके शासनकाल में हुआ ?",
    option: ["चन्द्रशेखर", "वी.पी. सिंह", "नरसिम्हा राव", "अटल बिहारी वाजपेयी"],
    answer: "नरसिम्हा राव"
},
{
    question: "उदारीकरण की प्रक्रिया के प्रभावस्वरूप आर्थिक क्षेत्र में कौन – सा सुधार हुआ ?",
    option: ["औद्योगिक उत्पादन में तीव्र वृद्धि", "उत्पादों की गुणवत्ता में सुधार", "प्रत्यक्ष विदेशी निवेश को बढ़ावा", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "भारत में उदारीकरण की प्रक्रिया अपनाये जाने पर कौन – सी चुनौती सामने आयी ?",
    option: ["परम्परागत लघु उद्योगों का ह्रास", "बेकारी ( बेजोजगारी ) में वृद्धि", "ऋणगस्तता में वृद्धि", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "भारतीय अर्थव्यवस्था का मॉडल किस प्रकार का है ?",
    option: ["पूँजीवादी", "मिश्रित", "समाजवादी", "साम्यवादी"],
    answer: "मिश्रित"
},
{
    question: "भारत में उदारीकरण की प्रक्रिया का प्रारम्भ कब से माना जाता है ?",
    option: ["1961", "1971", "1981", "1991"],
    answer: "1991"
},
{
    question: "इनमें से कौन उदारीकरण की देन है ?",
    option: ["बाजारवाद", "वैश्वीकरण", "निजीकरण", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "निम्न में से कौन औद्योगीकरण का सामाजिक परिणाम है ?",
    option: ["संयुक्त परिवार का विघटन", "महिलाओं को रोजगार", "जाति प्रथा का निर्बल होना", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "किस दिन अंतर्राष्ट्रीय औषधि दुरुपयोग एवं अनैतिक व्यापार निरोधक दिवस मनाया जाता है ?",
    option: ["26 जून", "27 जून", "05 जून", "11 जून"],
    answer: "26 जून"
},
{
    question: "किस वर्ष बिहार में पूर्ण नशाबंदी कानून लागू हुआ ?",
    option: ["2015", "2016", "2017", "2018"],
    answer: "2016"
},
{
    question: "किस प्रधानमंत्री के कार्यकाल में “एण्टी नारकोटिक एक्ट” पास हुआ ?",
    option: ["राजीव गाँधी", "वी०पी० सिंह", "इन्दिरा गाँधी", "अटल बिहारी वाजपेई"],
    answer: "राजीव गाँधी"
},
{
    question: "निम्न में से किसको नगरीकरण बढ़ावा देती है ?",
    option: ["गुमनामता", "प्रदूषण", "‘मैं’ की भावना", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "संस्कृतिकरण की अवधारणा किसने विकसित की ?",
    option: ["एस० सी० दूबे", "एम० एन० श्रीनिवास", "सच्चिदानंद सिन्हा", "योगेन्द्र सिंह"],
    answer: "एम० एन० श्रीनिवास"
},
{
    question: "धर्म निरपेक्षता का क्या अर्थ है ?",
    option: ["विभिन्न धर्मों का सह-अस्तित्व", "अन्य धर्मों के प्रति श्रद्धा", "राज्य का अपना कोई धर्म न होना", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "निम्न में से किसे द्वितीयक क्षेत्र में रखा जाता है ?",
    option: ["कृषि", "व्यापार", "सेवा", "उद्योग"],
    answer: "उद्योग"
},
{
    question: "समेकित ग्रामीण विकास कार्यक्रम कब प्रारंभ हुआ ?",
    option: ["1960-61", "1965-66", "1977-78", "1991-92"],
    answer: "1960-61"
},
{
    question: "किसने कहा “नगरीयता एक जीवन पद्धति",
    option: ["रौस", "बर्गल", "विर्थ", "कारपेन्टर"],
    answer: "विर्थ"
},
{
    question: "कब सती प्रथा निषेध अधिनियम पारित हुआ ?",
    option: ["सन् 1825 ई०", "सन् 1859 ई०", "सन् 1832 ई०", "सन् 1835 ई०"],
    answer: "सन् 1832 ई०"
},
{
    question: "आर्य समाज की स्थापना कब हुई ?",
    option: ["1875", "1879", "1882", "1884"],
    answer: "1875"
},
{
    question: "स्त्रियों व कन्याओं का अनैतिक व्यापार अधिनियम कब पारित हुआ ?",
    option: ["सन् 1952", "सन् 1954", "सन् 1956", "सन् 1960"],
    answer: "सन् 1956"
},
{
    question: "गाँव से लोगों का शहर की ओर आना और शहरी मूल्यों को अपनाने को क्या कहते हैं ?",
    option: ["औद्योगिकीकरण", "नगरीकरण", "संस्कृतीकरण", "पश्चिमीकरण"],
    answer: "नगरीकरण"
},
{
    question: "किसने कहा कि, “केवल उत्पादन में होने वाली वृद्धि और प्रति व्यक्ति आय में वृद्धि होना आधुनिकीकरण नहीं है ?",
    option: ["एम० एन० श्रीनिवास", "एस० सी० दुबे", "डॉ० योगेन्द्र सिंह", "डॉ० पी० सिंहा"],
    answer: "एस० सी० दुबे"
},
{
    question: "‘सोशल चेंज इन मॉडर्न इंडिया’ नामक के लेखक कौन हैं ?",
    option: ["श्रीनिवास", "घुरिये", "कॉम्ट", "योगेन्द्र सिंह"],
    answer: "श्रीनिवास"
},
{
    question: "ब्राह्मणीकरण की अवधारणा किनके द्वारा दी गई है ?",
    option: ["श्रीनिवास", "हेतुकर झा", "सच्चिदानंद", "इनमें से कोई नहीं"],
    answer: "श्रीनिवास"
},
{
    question: "धर्म-निरपेक्षीकरण की प्रक्रिया किस विचार को अधिक प्रभावित करता है ?",
    option: ["पवित्रता", "अपवित्रता", "पवित्रता व अपवित्रता", "इनमें से कोई नहीं"],
    answer: "इनमें से कोई नहीं"
},
{
    question: "सूचना का अधिकार अधिनियम कब से लागू हुआ ?",
    option: ["15 जून, 2005 ई० से", "15 जून, 2006 ई० से", "15 अक्टूबर, 2005 ई० से", "15 अक्टूबर, 2006 ई० से"],
    answer: "15 अक्टूबर, 2006 ई० से"
},
{
    question: "ग्रामीण से नगरीय क्षेत्र में रूपांतरित होने वाला पहला देश कौन है ?",
    option: ["ब्रिटेन", "अमेरिका", "फ्रांस", "कनाडा"],
    answer: "ब्रिटेन"
},
{
    question: "“मॉडनाइजेशन ऑफ इंडियन ट्रेडिशन” नामक पुस्तक किसने लिखी है ?",
    option: ["एम० एस० राव", "रवीन्द्रनाथ मुखर्जी", "योगेन्द्र सिंह", "एम० एन० श्रीनिवास"],
    answer: "योगेन्द्र सिंह"
},
{
    question: "“अर्बनाइजेशन ऐन्ड सोशल चेन्ज” नामक पुस्तक किसने लिखी है ?",
    option: ["बर्गेल", "एम० एस० राव", "एन्डसन", "सोरोकन"],
    answer: "एम० एस० राव"
},
{
    question: "औद्योगिकीकरण के फलस्वरूप नगरों में किस तरह का प्रदूषण उत्पन्न हुआ है ?",
    option: ["जल प्रदूषण", "वायु प्रदूषण", "ध्वनि प्रदूषण", "ये सभी"],
    answer: "ये सभी"
},
{
    question: "दहेज निरोधक अधिनियम कब पारित किया गया ?",
    option: ["1960", "1961", "1970", "1962"],
    answer: "1961"
},
{
    question: "आर्य समाज के संस्थापक कौन थे ?",
    option: ["राजाराम मोहन राय", "गोविन्द राणाडे", "दयानन्द सरस्वती", "नारायण जोशी"],
    answer: "दयानन्द सरस्वती"
},
{
    question: "भारत में किसने सर्वप्रथम सतीप्रथा के विरुद्ध आवाज उठाई थी ?",
    option: ["ईश्वरचन्द्र विद्यासागर", "महात्मा गाँधी", "राजाराम मोहन राय", "ऐनी बेसेन्ट"],
    answer: "राजाराम मोहन राय"
},
{
    question: "बाल विवाह निरोधक अधिनियम किस साल लागू हुआ ?",
    option: ["1929", "1939", "1910", "1925"],
    answer: "1929"
},
{
    question: "किसने कहा “ग्रामीण क्षेत्रों का नगरीय क्षेत्रों में बदलने की प्रक्रिया को हम नगरीकरण कहेंगे” ?",
    option: ["श्रीनिवास", "बर्गल", "फेयरचाइल्ड", "थॉमसन"],
    answer: "बर्गल"
},
{
    question: "संस्कृतिकरण की प्रक्रिया के अनुसारनिम्न जातियाँ किस जाति के व्यवहारों का अनुसरण करती हैं?",
    option: ["ब्राह्मण जाति", "द्विज जाति", "प्रभु जाति", "उच्च जाति"],
    answer: "द्विज जाति"
},
{
    question: "“नगरीयता जीवन का एक तरीका है जबकि नगरीकरण एक प्रक्रिया है।” किसने कहा है ?",
    option: ["गाल्पिन", "वर्थ", "वर्गेस", "होमर हियोट"],
    answer: "वर्थ"
},
{
    question: "भारत में लौकिकीकरण किसकी देन है ?",
    option: ["अमेरिकी", "फ्रांसीसी", "अंग्रेज", "पुर्तगाली"],
    answer: "अमेरिकी"
},
{
    question: "आधुनिकीकरण को समाज की संरचना में परिवर्तन लाने वाली एक महत्त्वपूर्ण प्रक्रिया के रूप में किसने स्पष्ट किया है ?",
    option: ["जार्ज साइमन", "एम० एन० श्रीनिवास", "डेनियल लर्नर", "डा० योगेन्द्र सिंह"],
    answer: "डेनियल लर्नर"
},
{
    question: "औद्योगिक समाज में परिवार किस प्रकार की इकाई है?",
    option: ["आर्थिक", "उपयोग", "उत्पादन", "लाभ"],
    answer: "उपयोग"
},
{
    question: "वास्तव में संस्कृतीकरण किस अवधारणाओं को स्पष्ट करता है ?",
    option: ["ब्राह्मणीकरण", "पर संस्कृतीकरण", "अग्रिम समाजीकरण एवं अनुकरण", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "पश्चिमीकरण के कारण समाज में किस वर्ग का उदय हुआ ?",
    option: ["उच्च वर्ग", "निम्न वर्ग", "मध्य एवं व्यापारी वर्ग", "इनमें से कोई नहीं"],
    answer: "उच्च वर्ग"
},
{
    question: "गरिकीकरण सबसे ज्यादा कहाँ हुआ ?",
    option: ["झारखंड", "छत्तीसगढ़", "उत्तराखंड", "महाराष्ट्र"],
    answer: "महाराष्ट्र"
},
{
    question: "किस उद्योग के आरंभ होने को औद्योगिक क्रांति की उत्पत्ति मानी जाती है ?",
    option: ["स्टील उद्योग", "बुनाई उद्योग", "चमड़ा उद्योग", "तेल उद्योग"],
    answer: "चमड़ा उद्योग"
},
{
    question: "कब औद्योगिक क्रान्ति का सूत्रपात हुआ ?",
    option: ["1765", "1766", "1767", "1769"],
    answer: "1767"
},
{
    question: "भारत में औद्योगिकीकरण का इतिहास किस शताब्दी से आरंभ होता है ?",
    option: ["अठारहवीं शताब्दी", "उन्नीसवीं शताब्दी", "बीसवीं शताब्दी", "इक्कीसवीं शताब्दी"],
    answer: "बीसवीं शताब्दी"
},
{
    question: "किस संपदा के आधार पर भारत बड़ा औद्योगिक देश बन सकता है ?",
    option: ["जन संपदा", "प्राकृतिक संपदा", "जन व प्राकृतिक संपदा", "इनमें कोई नहीं"],
    answer: "जन संपदा"
},
{
    question: "विद्वानों ने आधुनिकीकरण को किस शब्द का पर्यायवाची माना है ?",
    option: ["औद्योगिकीकरण", "नगरीकरण", "पश्चिमीकरण", "इनमें से कोई नही"],
    answer: "इनमें से कोई नही"
},
{
    question: "इनमें से आधुनिकीकरण की विशेषता है",
    option: ["गतिशीलता", "हितों का एकत्रीकरण", "अधिक सहभागिता", "इनमें कोई नहीं"],
    answer: "अधिक सहभागिता"
},
{
    question: "आधुनिकीकरण की प्रेरणा से प्रेरित होने पर समाज में कितने प्रकार की अवस्थाएँ उत्पन्न होती है ?",
    option: ["तीन", "दो", "चार", "एक"],
    answer: "एक"
},
{
    question: "नगरीकरण के कारक हैं",
    option: ["औद्योगिक विकास", "व्यावसायिक गतिशीलता", "भौतिकवादी संस्कृति", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "बड़े नगरीय क्षेत्र के निकाय को कहा जाता",
    option: ["नगर पंचायत", "नगर परिषद", "नगर निगम", "इनमें से कोई नहीं"],
    answer: "नगर निगम"
},
{
    question: "विद्वान ने किसकी गतिशीलता व्यक्त करने के लिए संस्कृतिकरण का उपयोग किया ?",
    option: ["वर्ग की गतिशीलता", "जाति की गतिशीलता", "जाति व वर्ग दोनों की गतिशीलता", "इनमें से कोई नहीं"],
    answer: "जाति व वर्ग दोनों की गतिशीलता"
},
{
    question: "निम्नलिखित में से कौन-सी- एक दशा औद्योगिक समाज की विशेषता नहीं है ?",
    option: ["हस्तशिल्प का विकास", "बड़ी मात्रा में उत्पादन", "व्यक्तिगत लाभ की प्रवृत्ति", "नयी प्रौद्योगिकी का उपयोग"],
    answer: "हस्तशिल्प का विकास"
},
{
    question: "निम्नलिखित में से किस एक लेखक ने भारत में सामाजिक परिवर्तन की प्रक्रियाओं का विस्तृत वर्णन प्रस्तुत किया ?",
    option: ["पी० एच० प्रभु", "के० एम० कापड़िया", "इरावती कर्वे", "एम० एन० श्रीनिवास"],
    answer: "एम० एन० श्रीनिवास"
},
{
    question: "भारत में कौन-सी एक दशा उपनिवेशवाद का परिणाम है ?",
    option: ["समाज सुधार आंदोलन का प्रारंभ", "परिवहन के साधनों का आरंभ", "वैज्ञानिक शिक्षा का आरंभ", "धर्मांतरण का आरंभ"],
    answer: "वैज्ञानिक शिक्षा का आरंभ"
},
{
    question: "निम्नलिखित में से कौन-सी एक दशा भारत में नगरीकरण का परिणाम नहीं है ?",
    option: ["एकांकी परिवारों में वृद्धि", "अनौपचारिक संबंधों में वृद्धि", "स्त्रियों की दशा में सुधार", "जातिगत विभेदों में कमी"],
    answer: "अनौपचारिक संबंधों में वृद्धि"
},
{
    question: "उपनिवेशवाद किस दशा का परिणाम है ?",
    option: ["साम्यवाद", "समाजवाद", "साम्राज्यवाद", "प्रजातिवाद"],
    answer: "साम्राज्यवाद"
},
{
    question: "औद्योगीकरण के फलस्वरूप नगरों में किस तरह का प्रदूषण उत्पन्न हुआ ?",
    option: ["जल प्रदूषण", "वायु प्रदूषण", "ध्वनि प्रदूषण", "ये सभी"],
    answer: "ये सभी"
},
{
    question: "भारत के निम्न में से किस राज्य में नगरीकरण की मात्रा सर्वाधिक है ?",
    option: ["बिहार", "पश्चिम बंगाल", "झारखंड", "मध्यप्रदेश –"],
    answer: "पश्चिम बंगाल"
},
{
    question: "वर्ग व्यवस्था परिणाम है",
    option: ["सामाजिक संघर्ष का", "बेरोजगारी का", "वर्ण-व्यवस्था का", "औद्योगीकरण का"],
    answer: "औद्योगीकरण का"
},
{
    question: "धर्म निरपेक्षता का अर्थ क्या है ?",
    option: ["विभिन्न धर्मों का सह-अस्तित्व", "अन्य धर्मों के प्रति श्रद्धा", "राज्य का अपना कोई धर्म न होना", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "भारत में पंचवर्षीय योजना कब आरंभ की गई ?",
    option: ["1950", "1951", "1952", "1954"],
    answer: "1952"
},
{
    question: "एम० एन० श्रीनिवास ने अपनी पुस्तक ‘Social change in Modern India’ में निम्नलिखित में से कौन-सा मत प्रस्तुत किया है ?",
    option: ["जाति पूर्णतः बंद व्यवस्था है", "जाति पूर्णतः खुली व्यवस्था है", "जाति व्यवस्था में गतिशीलता का अवसर निहित है", "जाति वेग की तरह होती है"],
    answer: "जाति व्यवस्था में गतिशीलता का अवसर निहित है"
},
{
    question: "धर्म निरपेक्षीकरण भारत में किसे प्रभावित करती है ?",
    option: ["हिन्दू को", "मुस्लिम को", "आदिवासी को", "सभी नागरिकों को"],
    answer: "आदिवासी को"
},
{
    question: "दहेज उन्मूलन संशोधन अधिनियम कब पारित हुआ ?",
    option: ["1975", "1984", "1990", "1961"],
    answer: "1961"
},
{
    question: "शारदा एक्ट किस वर्ष पारित किया गया ?",
    option: ["1928", "1929", "1930", "1931"],
    answer: "1929"
},
{
    question: "निम्नलिखित में कौन-सा कारण भारतीय नारियों की स्थिति में सुधार के लिए उत्तरदायी है ?",
    option: ["संवैधानिक सुविधाएँ", "शिक्षा का प्रसार", "अन्तर्जातीय विवाह", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "अस्पृश्यता (अपराध) अधिनियम कब पारित हुआ ?",
    option: ["1953", "1954", "1955", "1956"],
    answer: "1955"
},
{
    question: "भारतीय समाज में स्त्रियों की दयनीय स्थिति पर किसने सर्वप्रमुख कार्य किया हैं ?",
    option: ["राजा राममोहन राय", "स्वामी दयानन्द सरस्वती", "ईश्वरचन्द्र विद्यासागर", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "किस वर्ष स्त्रियों को अपने पति से भरण-पोषण की राशि प्राप्त करने का अधिकार दिया गया ?",
    option: ["1936 ई०", "1946 ई०", "1856 ई०", "1966 ई०"],
    answer: "1946 ई०"
},
{
    question: "आर्थिक शोषण के विरुद्ध स्त्रियों की दशा सुधारने के लिए समान वेतन अधिनियम’ कब पारित हुआ ?",
    option: ["सन् 1974", "सन् 1976", "सन् 1978", "सन् 1980"],
    answer: "सन् 1976"
},
{
    question: "ब्रह्म समाज की स्थापना किसने की ?",
    option: ["बाल गंगाधर तिलक", "राजा राममोहन राय", "महात्मा गाँधी", "ईश्वरचंद्र विद्यासागर"],
    answer: "राजा राममोहन राय"
},
{
    question: "भारत के लिए खतरनाक है-",
    option: ["सांप्रदायिकता", "क्षेत्रीयता", "जातीयता", "सभी"],
    answer: "सभी"
},
{
    question: "सामाजिक परिवर्तन का तात्पर्य है –",
    option: ["सामाजिक संबंधों में परिवर्तन", "सामाजिक समूहों में परिवर्तन", "सामाजिक अन्तः क्रियाओं में परिवर्तन", "उपरोक्त सभी"],
    answer: "सामाजिक संबंधों में परिवर्तन"
},
{
    question: "डेन्जरस ड्रग्स एक्ट किस वर्ष में पारित किया गया ?",
    option: ["1930", "1931", "1938", "1933"],
    answer: "1930"
},
{
    question: "मध्याह्न भोजन कहाँ लागू हुआ ?",
    option: ["स्कूल", "कॉलेज", "ऑफिस", "उपर्युक्त सभी"],
    answer: "स्कूल"
},
{
    question: "भारत में किस वर्ष प्रधानमंत्री रोजगार योजना शुरू की गयी ?",
    option: ["1993", "1994", "2011", "2009"],
    answer: "1993"
},
{
    question: "किस वर्ष बालिका समृद्धि योजना की शुरूआत की गई ?",
    option: ["1997", "1998", "1999", "1986"],
    answer: "1997"
},
{
    question: "किस वर्ष बाल श्रम पर एक राष्ट्रीय नीति बनाई गई ।",
    option: ["1987", "1991", "1948", "1952"],
    answer: "1987"
},
{
    question: "भारत में किस वर्ष समेकित बाल विकास सेवा कार्यक्रम प्रारंभ किया गया ?",
    option: ["1975", "1974", "2011", "1985"],
    answer: "1975"
},
{
    question: "“आधुनिक भारत में सामाजिक परिवर्तन’ नामक पुस्तक के लेखक कौन हैं ?",
    option: ["एम० एन० श्रीनिवास", "आर० के० मुखर्जी", "डी० पी० मुखर्जी", "एस० सी० दूबे नर"],
    answer: "एम० एन० श्रीनिवास"
},
{
    question: "’डी०ए० केस’ किस अपराध से संबंधित है ?",
    option: ["हत्या", "बलात्कार", "आप से अधिक सम्पत्ति", "चोरी"],
    answer: "आप से अधिक सम्पत्ति"
},
{
    question: "‘विशेष विवाह अधिनियम’ किस साल पारित हुआ ?",
    option: ["1954", "1956", "1961", "1972"],
    answer: "1954"
},
{
    question: "नगरीय पर्यावरण का सामाजिक जीवन पर निम्न में से कौन प्रभाव नहीं है ?",
    option: ["अपराध", "व्यक्तिवादिता में वृद्धि", "प्रदूषण में कमी", "आवास की समस्या में वृद्धि"],
    answer: "प्रदूषण में कमी"
},
{
    question: "श्रीनिवास ने पश्चिमीकरण की प्रक्रिया के मॉडल के रूप में से निम्न में से किसे आधार माना ?",
    option: ["नयी प्रौद्योगिकी", "आधुनिकीकरण", "शिक्षण संस्थायें", "150 वर्ष के ब्रिटिश शासन"],
    answer: "150 वर्ष के ब्रिटिश शासन"
},
{
    question: "भारत में संस्कृततिकरण को प्रोत्साहित करने वाली दशायें कौन सी है ?",
    option: ["संस्कृति की शिक्षा", "महिला आन्दोलन", "औद्योगीकरण व नगरीकरण", "जनजातीय आन्दोलन"],
    answer: "औद्योगीकरण व नगरीकरण"
},
{
    question: "निम्न में से कौन भारत में औपनिवेशिक शासन के लिए उत्तरदायी है ?",
    option: ["ईस्ट इंडिया कम्पनी", "वारेन हस्टिंग्स", "लार्ड क्लाइव", "इनमें से सभी"],
    answer: "ईस्ट इंडिया कम्पनी"
},
{
    question: "हिन्दू उत्तराधिकार अधिनियम को किस वर्ष संशोधित कर पुत्रियों को पुत्र के समान पैतृक सम्पत्ति में समान अधिकार दिया गया ?",
    option: ["1956", "2005", "1985", "2010"],
    answer: "2005"
},
{
    question: "पश्चिमीकरण को किस तरह की अवधारणा माना जाता है ?",
    option: ["तटस्थ अवधारणा", "यूरोपीय अवधारणा", "भौतिक अवधारणा", "क्षेत्रीय अवधारणा"],
    answer: "तटस्थ अवधारणा"
},
{
    question: "किसने कहा कि नगरीकरण ही आधुनिकीकरण का प्रथम चरण है ?",
    option: ["मैकाईवर", "लर्नर", "श्रीनिवास", "बर्गल"],
    answer: "श्रीनिवास"
},
{
    question: "निम्न में से कौन धर्म का प्रकार्य नहीं है ?",
    option: ["सामाजिक संगठन में बाधक", "सामाजिक नियंत्रण का साधन", "सामाजिक संगठन में सहायक", "सर्व कल्याण में सहायक"],
    answer: "सामाजिक संगठन में बाधक"
},
{
    question: "जब कोई निम्न जाति या जनजाति किसी उच्च जाति की दिशा में अपनी जीवन पद्धति को बदलती है, तो उसे क्या कहते",
    option: ["संस्कृतिकरण", "आधुनिकीकरण", "पश्चिमीकरण", "धर्म निरपेक्षीकरण"],
    answer: "संस्कृतिकरण"
},
{
    question: "भारत में निम्न में से किस राज्य में नगरीकरण की मात्रा सर्वाधिक",
    option: ["बिहार", "पश्चिम बंगाल", "झारखंड", "मध्य प्रदेश"],
    answer: "मध्य प्रदेश"
},
{
    question: "किसने कहा– “नगरीयता एक जीवन पद्धति है” ?",
    option: ["रॉस", "बर्गल", "विर्थ", "कारपेंटर"],
    answer: "बर्गल"
},
{
    question: "1995 ई. में भारत में मलिन बस्तियों में रहने वाले लोगों की संख्या कितनी थी ?",
    option: ["250 लाख", "450 लाख", "300 लाख", "500 लाख"],
    answer: "450 लाख"
},
{
    question: "वर्तमान स्थिति में किसी भी प्रकार के और किसी भी स्तर के बदलाव को कहते हैं",
    option: ["परिवर्तन", "मौसमी प्रवसन", "नगरीकरण", "मलिन बस्तियाँ"],
    answer: "परिवर्तन"
},
{
    question: "यूरोप और अमेरिका की सभ्यताओं से होने वाले परिवर्तन को कहते हैं",
    option: ["उपनिवेशवाद", "मौसमी प्रवसन", "पश्चिमीकरण", "औद्योगिकीकरण"],
    answer: "पश्चिमीकरण"
},
{
    question: "“सामाजिक परिवर्तन से तात्पर्य सामाजिक ढाँचे के परिवर्तन से है” यह कथन किसका था ?",
    option: ["जॉनसन", "गिलिन तथा गिलिन", "डॉ. मजूमदार", "मैकाइवर तथा पेज"],
    answer: "जॉनसन"
},
{
    question: "भारत में औद्योगिकीकरण लगभग कितना वर्ष पुराना है ?",
    option: ["200 वर्ष", "300 वर्ष", "400 वर्ष", "100 वर्ष"],
    answer: "100 वर्ष"
},
{
    question: "“ज्ञान उपयोगी और व्यावहारिक होना चाहिए।” यह कथन किसका है ?",
    option: ["एडम स्मिथ", "आई.बी. शर्मा", "स्टीबेन्सन", "बेलार्ड"],
    answer: "आई.बी. शर्मा"
},
{
    question: "प्रोजेक्ट वास्तविक जीवन पर एक भाग है जिसका प्रयोग विद्यालय में किया जाता है। यह कथन है",
    option: ["बेलाई", "किलपैट्रिक", "स्टीबेन्सन", "रॉबर्ट बीरस्टीक"],
    answer: "बेलाई"
},
{
    question: "भारतीय संविधान के किस अनुच्छेद के अंतर्गत अनुसूचित जातियों को अपनी संस्कृति और भाषा बनाये रखने के लिए संरक्षण प्रदान किया गया है ?",
    option: ["धारा 16", "धारा 29", "धारा 42", "धारा 46"],
    answer: "धारा 29"
},
{
    question: "प्रोजेक्ट एक समस्यामूलक कार्य है जो अपनी स्वाभाविक परिस्थितियों में पूर्णता को प्राप्त करता है",
    option: ["आई.बी. वर्मा", "स्टीबेन्सन", "किल पैट्रिक", "बेवार्ड"],
    answer: "किल पैट्रिक"
},
{
    question: "यह कथन किसका है कि “प्रोजेक्ट वह उद्देश्यपूर्ण कार्य है जो पूर्ण संलग्नता में सामाजिक वातावरण में किया जाता है।”",
    option: ["किल पैट्रिक", "सी.एच. कूले", "एस.बी. केतकर", "मजूमदार और मान"],
    answer: "किल पैट्रिक"
},
{
    question: "शहरीकरण का लक्षण है",
    option: ["व्यापार में विकास", "एक शहर के चारों ओर केन्द्रों का विकास", "ग्रामीण से शहरी प्रवसन", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "निम्नलिखित में से किसको नगरीकरण बढ़ावा देती है ?",
    option: ["गुमनामिता", "भीड़", "प्रदूषण", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "निम्न में से कौन सी जनजाति उत्तरी–पूर्वी भारत की नहीं है ?",
    option: ["नागा", "कूकी", "बोडा", "खस"],
    answer: "खस"
},
{
    question: "‘सोशल चेंज इन मॉडर्न इण्डिया’ नाम पुस्तक के लेखक हैं ?",
    option: ["मजूमदार एवं मदान", "आर.के. मुखर्जी", "एम.एन. श्रीनिवास", "मैकाइवर एवं पेज"],
    answer: "एम.एन. श्रीनिवास"
},
{
    question: "“आधुनिकीकरण एक प्रक्रिया है, जो परम्परागत समाज से प्रौद्योगिकी पर आधारित समाज की ओर अग्रसर होती है।” उक्त परिभाषा दी है",
    option: ["रिटजर", "एस.सी. दुबे", "एम.एस. गोरे", "इनमें से कोई नहीं"],
    answer: "एस.सी. दुबे"
},
{
    question: "निम्न में से आधुनिकीकरण का लक्षण है",
    option: ["औद्योगिकीकरण को प्रोत्साहन", "नवीन तकनीकी का प्रयोग", "संचार व यातायात के साधनों में वृद्धि", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "संविधान के किस अनुच्छेद के अनुसार राज्य के नागरिकों के साथ जाति, धर्म, वंश अथवा जन्मस्थान आदि के आधार पर विभेद नहीं किया जायेगा ?",
    option: ["अनुच्छेद 14", "अनुच्छेद 38", "अनुच्छेद 9", "अनुच्छेद 15"],
    answer: "अनुच्छेद 15"
},
{
    question: "“आधुनिकता एक ऐसा बेलगाम घोड़ा है। जिसे किसी भी तरह नियंत्रण में रखना कठिन है” ऐसा किसने कहा ?",
    option: ["रिटजर", "गोरे", "श्याम चरण दूबे", "बी.पी. शाह"],
    answer: "रिटजर"
},
{
    question: "वह कौन–सी प्रक्रिया है जिसके अन्तर्गत कोई भी जाति, जनजाति या समूह अपने से उच्च जाति (प्रायः द्विज जाति) के रीति–रिवाजों, कर्मकाण्ड, विचारधारा और मूल्यों को अपनाकर समाज में अपनी जातीय स्थिति को ऊपर उठाने का प्रयास करती है ?",
    option: ["आधुनिकीकरण", "संस्कृतीकरण", "धर्मनिरपेक्षीकरण", "पश्चिमीकरण"],
    answer: "संस्कृतीकरण"
},
{
    question: "निम्नलिखित में से धर्मनिरपेक्षीकरण की प्रक्रिया का प्रमुख तत्व है",
    option: ["विभेदीकरण में वृद्धि", "धार्मिकता का हास", "तार्किकता में वृद्धि", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "“परिवर्तन की यह प्रक्रिया जो भारतीय जनजीवन, समाज व संस्कृति के विभिन्न पक्षों में उस पश्चिमी संस्कृति के सम्पर्क में आने के कारण उत्पन्न हुई, जिसे ब्रिटिश शासक अपने साथ लाये थे।” यह प्रक्रिया कहलाती है–",
    option: ["पश्चिमीकरण", "औद्योगीकरण", "नगरीकरण", "आधुनिकीकरण"],
    answer: "पश्चिमीकरण"
},
{
    question: "आधुनिक भारत में प्रौद्योगिक विभाजन होता जा रहा है, ऐसा कौन कहा ?",
    option: ["श्रीनिवास", "डॉ. श्यामचरण दूबे", "योगेन्द्र", "इनमें से कोई नहीं"],
    answer: "श्रीनिवास"
},
{
    question: "द टेक्नोलॉजीकल सोसायटी नामक पुस्तक किसने लिखा था ?",
    option: ["श्रीनिवासन", "योगेन्द्र सिंह", "जेक्यूल ईल्लल", "इनमें से कोई नहीं"],
    answer: "जेक्यूल ईल्लल"
},
{
    question: "आधुनिकीकरण सम्बन्धित है",
    option: ["परम्परागत मूल्य से", "बन्द सामाजिक व्यवस्था से", "अर्जित प्रस्थिति से", "प्रथा से"],
    answer: "अर्जित प्रस्थिति से"
},
{
    question: "पश्चिमीकरण की अवधारणा किसके द्वारा दी गई है ?",
    option: ["आगबर्न", "एम.एन. श्रीनिवास", "मैकाइवर", "आर.के. मुखर्जी"],
    answer: "एम.एन. श्रीनिवास"
},
{
    question: "ब्राह्मणीकरण की अवधारणा किसने विकसित की ?",
    option: ["एम.एन. श्रीनिवास", "ए.आर. देसाई", "एस.सी. दुबे", "जी.एस. घुरिये"],
    answer: "एम.एन. श्रीनिवास"
},
{
    question: "संस्कृतीकरण की प्रक्रिया के अनुसार निम्न जातियाँ किस जाति के व्यवहारों का अनुसरण करती है ?",
    option: ["ब्राह्मण", "द्विज जाति", "प्रभु जाति", "उच्च जाति"],
    answer: "उच्च जाति"
},
{
    question: "परसंस्कृति का सम्बन्ध है",
    option: ["स्वास्थ्य से", "अर्थव्यवस्था से", "संस्कृति से", "कृषि से"],
    answer: "संस्कृति से"
},
{
    question: "निम्न में से कौन भारत में सामाजिक परिवर्तन का कारक नहीं है ?",
    option: ["संस्कृतिकरण", "पश्चिमीकरण", "परम्परा", "औद्योगीकरण एवं नगरीकरण"],
    answer: "परम्परा"
},
{
    question: "‘संस्कृतिकरण’ की अवधारणा किसने प्रतिपादित किया?",
    option: ["एस.सी. दूबे", "एम. एन. श्रीनिवास", "योगेन्द्र सिंह", "के.एल. शर्मा"],
    answer: "एम. एन. श्रीनिवास"
},
{
    question: "सत्यप्रकाश पुस्तक की रचना किसने किया?",
    option: ["विवेकानन्द", "राजाराम मोहन राय", "सहजानन्द सरस्वती", "दयानन्द सरस्वती"],
    answer: "दयानन्द सरस्वती"
},
{
    question: "निम्न में कौन पश्चिमीकरण का कारक है?",
    option: ["रेडियो", "टेलीविजन", "समाचार – पत्र", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "आर्य समाज के संस्थापक कौन हैं?",
    option: ["दयानंद सरस्वती", "सहजानन्द सरस्वती", "विवेकानन्द", "राजा राममोहन राय"],
    answer: "दयानंद सरस्वती"
},
{
    question: "ब्रह्म समाज की स्थापना किसने की थी?",
    option: ["महात्मा गाँधी", "दयानन्द सरस्वती", "राजा राममोहन राय", "समाजीकरण किसने की थी"],
    answer: "राजा राममोहन राय"
},
{
    question: "परंपराओं को त्यागकर नए विचारों को ग्रहण करना कहलाता है?",
    option: ["आधुनिकीकरण", "कार्य निरपेक्षीकरण", "दयानन्द सरस्वती", "संस्कृतिकरण"],
    answer: "आधुनिकीकरण"
},
{
    question: "विधवा विवाह संघ की स्थापना किसने की थी",
    option: ["स्वामी दयानन्द", "महादेव गोविंद रानाडे", "राजा राममोहन राय", "केशव चन्द्र सेन"],
    answer: "महादेव गोविंद रानाडे"
},
{
    question: "ब्रह्म समाज की स्थापना कब की गई थी?",
    option: ["1832 ई. में", "1840 ई. में", "1825 ई. में", "1828 ई. में"],
    answer: "1828 ई. में"
},
{
    question: "मूल शंकर किसके बचपन का नाम था?",
    option: ["गाँधीजी का", "राजा राममोहन राय का", "स्वामी दयानन्द का", "केशवचन्द्र का"],
    answer: "स्वामी दयानन्द का"
},
{
    question: "‘सर्वोदय’ शब्द किसकी देन है?",
    option: ["स्वामी विवेकानन्द का", "राजा राममोहन राय का", "स्वामी दयानन्द का", "गाँधी जी का"],
    answer: "गाँधी जी का"
},
{
    question: "ब्रह्म समाज के स्थापना का क्या उद्देश्य था?",
    option: ["हिन्दू धर्म का समापन करना", "पश्चिमी सभ्यता लागू करना", "हिन्दू धर्म को पुनः व्याख्या करना", "इनमें से सभी"],
    answer: "हिन्दू धर्म को पुनः व्याख्या करना"
},
{
    question: "आधुनिकीकरण की अवधारणा किसने दी?",
    option: ["डेनियल लर्नर", "डेनियल बेल", "डेनियल थॉर्नर", "डेनियल गूच"],
    answer: "डेनियल लर्नर"
},
{
    question: "हरिजन आन्दोलन किसने चलाया था?",
    option: ["राजा राममोहन राय", "गाँधी", "नेहरू जी", "दयानन्द सरस्वती"],
    answer: "गाँधी"
},
{
    question: "भारत में ब्रिटिश उपनिवेशवाद सहायक था?",
    option: ["लॉर्ड कार्नवालिस", "मौसमी", "वारेन हेस्टिंग्ज", "औद्योगीकरण"],
    answer: "औद्योगीकरण"
},
{
    question: "सन् 1995 में भारत में मलिन बस्तियों में रहनेवाले लोगों की संख्या कितनी थी?",
    option: ["250 लाख", "450 लाख", "300 लाख", "500 लाख"],
    answer: "450 लाख"
},
{
    question: "वर्तमान स्थिति में किसी भी प्रकार के और किसी भी स्तर के बदलाव को कहते है",
    option: ["परिवर्तन", "लॉर्ड क्लाइव", "नगरीकरण", "उपर्युक्त सभी"],
    answer: "परिवर्तन"
},
{
    question: "यूरोप और अमेरिका की सभ्यताओं की संस्कृति से प्रभावित होकर होने वाले परिवर्तन को कहते हैं",
    option: ["उपनिवेशवाद", "मौसमी परिवर्तन", "पश्चिमीकरण", "मलिन बस्तियाँ"],
    answer: "पश्चिमीकरण"
},
{
    question: "“सामाजिक परिवर्तन से तात्पर्य सामाजिक ढाँचे के परिवर्तन से है” यह कथन किसका था?",
    option: ["जॉनसन", "गिलिन तथा गिलिन", "डॉ. मजूमदार", "मैकाइवर तथा पेज"],
    answer: "जॉनसन"
},
{
    question: "जब सरकारी उद्यम व्यक्ति या व्यक्तियों के समूह को बेच दिए जाते हैं अथवा चलाने के लिए दिए जाते हैं तो यह प्रक्रिया कहलाती है",
    option: ["उदारीकरण", "निजीकरण", "महिला सशक्तीकरण", "लोक क्षेत्र"],
    answer: "निजीकरण"
},
{
    question: "जातीय संगठन राजनीति में कैसी भूमिका निभा रही है",
    option: ["दबाव समूह", "स्वार्थ समूह", "सक्रिय समूह", "कल्याणकारी समूह"],
    answer: "दबाव समूह"
},
{
    question: "राज्य की परिभाषा का आधार क्या है?",
    option: ["जनसंख्या तथा निश्चित भू – भाग पर आधारित है", "जनसंख्या निश्चित भू – भाग तथा सरकार पर आधारित है।", "जनसंख्या निश्चित भू – भाग, सरकार तथा संप्रभुता पर आधारित है", "उपर्युक्त सभी तत्वों पर आधारित है"],
    answer: "जनसंख्या निश्चित भू – भाग, सरकार तथा संप्रभुता पर आधारित है"
},
{
    question: "निम्न में सही उत्तर पर चिह्न लगावें",
    option: ["संविधान धार्मिक नियमों तथा प्रावधानों का एक व्यवस्थित प्रलेख है", "संविधान प्रशासनिक नियमों तथा प्रावधानों का एक व्यवस्थित प्रलेख है", "संविधान प्रशासनिक नियमों तथा प्रावधानों का एक व्यवस्थित प्रलेख है", "संविधान शैक्षणिक नियमों तथा प्रावधानों का एक व्यवस्थित प्रलेख है।"],
    answer: "संविधान प्रशासनिक नियमों तथा प्रावधानों का एक व्यवस्थित प्रलेख है"
},
{
    question: "निम्न में जो सही है उस पर चिह्न लगायें",
    option: ["पंचायत का कार्यकाल तीन वर्षों के लिए निर्धारित है", "पंचायत का कार्यकाल चार वर्षों के लिए निर्धारित है", "पंचायत का कार्यकाल पाँच वर्षों के लिए निर्धारित है", "पंचायत का कार्यकाल छः वर्षों के लिए निर्धारित है"],
    answer: "पंचायत का कार्यकाल पाँच वर्षों के लिए निर्धारित है"
},
{
    question: "किस वर्ष से बलवंत राय मेहता कमिटी की सिफारिशों के आधार पर विभिन्न राज्यों में नया पंचायतीराज कानून लागू होना शुरू हुआ?",
    option: ["1947", "1950", "1959", "1965"],
    answer: "1959"
},
{
    question: "निम्नांकित में कौन आधुनिक राज्य के कार्य हैं?",
    option: ["बाहरी आक्रमण से रक्षा करना", "आंतरिक शांति स्थापित करना", "लोगों के लिए न्याय की व्यवस्था करना", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "भारतीय संस्कृति की निम्न में से कौन – सी विशेषता है?",
    option: ["धर्म की प्रधानता", "पुनर्जन्म में विश्वास", "कर्मफल में विश्वास", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "निम्न में से किसके प्रयास से सत्ती प्रथा उन्मूलन सम्भव हुआ?",
    option: ["राममोहन राय", "रमा बाई", "बिनोवा भावे", "राम मनोहर लोहिया"],
    answer: "राममोहन राय"
},
{
    question: "पंचायतों को बल प्रदान करने वाला विधेयक संविधान के किस संशोधन द्वारा लाया गया ?",
    option: ["71 वाँ", "73 वाँ", "75 वाँ", "69 वाँ"],
    answer: "73 वाँ"
},
{
    question: "एक ग्राम पंचायत में कौन न्यायाधीश की भूमिका अदा करता है ?",
    option: ["मुखिया", "सरपंच", "पंच", "ग्राम सेवक"],
    answer: "सरपंच"
},
{
    question: "राज्य का क्या अर्थ है ?",
    option: ["जान – माल की रक्षा", "कल्याण", "न्याय", "इनमें सभी"],
    answer: "इनमें सभी"
},
{
    question: "सीटू ‘ का सम्बन्ध किस राजनीतिक दल से है ?",
    option: ["काँग्रेस ( आई )", "मार्क्सवादी कम्युनिस्ट पार्टी", "भारतीय जनता पार्टी", "भारतीय कम्युनिस्ट पार्टी"],
    answer: "मार्क्सवादी कम्युनिस्ट पार्टी"
},
{
    question: "भारतीय अर्थव्यवस्था का मॉडल किस प्रकार का है ?",
    option: ["पूँजीवादी", "मिश्रित", "समाजवादी", "साम्यवादी"],
    answer: "मिश्रित"
},
{
    question: "किस विद्वान ने सर्वप्रथम ‘ दबाव समूह ‘ शब्द का प्रयोग किया है ?",
    option: ["मैक्स वेबर", "पीटर ऑडीगार्ड", "समनर", "टी.के. उम्मन"],
    answer: "मैक्स वेबर"
},
{
    question: "पंचायती राज में सबसे प्रमुख इकाई कौन है ?",
    option: ["मुखिया", "सरपंच", "ग्राम सभा", "ग्राम सेवक"],
    answer: "ग्राम सभा"
},
{
    question: "निम्न में से किसने ग्रामीण नगरीय सातत्य अवधारणा के विकास में योगदान दिया ?",
    option: ["एस.सी. दूबे", "सारोकिन", "रेडफील्ड", "कॉम्ट"],
    answer: "रेडफील्ड"
},
{
    question: "भारत में राजनीतिक दल को कौन मान्यता देता है ?",
    option: ["राष्ट्रपति", "उच्चतम न्यायालय", "संसद", "चुनाव आयोग"],
    answer: "चुनाव आयोग"
},
{
    question: "पंचायती राज व्यवस्था कितने स्तर की है",
    option: ["दो स्तरीय", "तीन स्तरीय", "चार स्तरीय", "पाँच स्तरीय"],
    answer: "तीन स्तरीय"
},
{
    question: "पंचायत समिति का अध्यक्ष कौन होता है ?",
    option: ["सी.ओ.", "प्रमुख", "मुखिया", "बी.डी.ओ"],
    answer: "प्रमुख"
},
{
    question: "प्रजातंत्र की विशेषता है",
    option: ["सार्वभौमिक मताधिकार", "कानून की दृष्टि में समानता", "प्रेस की स्वतंत्रता", "इनमें सभी"],
    answer: "इनमें सभी"
},
{
    question: "73 वें संविधान संशोधन कब किया गया ?",
    option: ["1980 ई. में", "1990 ई. में", "1985 ई. में", "1992 ई. में"],
    answer: "1992 ई. में"
},
{
    question: "किस समाजशास्त्री ने प्रजातंत्र का विरोध किया एवं फासीवाद का समर्थन किया ?",
    option: ["पैरेटो", "कॉम्टे", "मार्क्स", "वेबर"],
    answer: "पैरेटो"
},
{
    question: "संविधान के कौन – से संशोधन के द्वारा स्थानीय स्वशासन निकायों में महिलाओं के प्रतिनिधित्व को बढ़ाने की कोशिश की गई है ?",
    option: ["51 वाँ एवं 52 वाँ", "73 वाँ एवं 74 वाँ", "81 वाँ एवं 82 वाँ", "इनमें से कोई नहीं"],
    answer: "73 वाँ एवं 74 वाँ"
},
{
    question: "पंचायती राज्य के गाँव के विकास के लिए कितनी संस्थाएँ कार्य करती हैं ?",
    option: ["दो", "चार", "तीन", "पाँच"],
    answer: "तीन"
},
{
    question: "बलवंत राय मेहता समिति की सिफारिशों को लागू करने वाला पहला राज्य था ?",
    option: ["बिहार", "मध्य प्रदेश", "राजस्थान", "गुजरात"],
    answer: "राजस्थान"
},
{
    question: "कितने वर्ष के अंतर्गत के बच्चों को किसी खतरनाक कार्य में लगाना दंडनीय अपराध माना गया है ?",
    option: ["14 वर्ष", "18 वर्ष", "10 वर्ष", "20 वर्ष"],
    answer: "14 वर्ष"
},
{
    question: "पंचायती राज संस्थाओं में निम्नलिखित में कौन निम्नतम इकाई है ?",
    option: ["ग्राम पंचायती", "पंचायत समिति", "जिला परिषद्", "पंचायत सेवक"],
    answer: "ग्राम पंचायती"
},
{
    question: "रानाडे व भण्डारकर ने सन् 1867 में किस संस्था की स्थापना की",
    option: ["प्रार्थना समाज", "आर्य समाज", "ब्रह्म समाज", "पारसी समाज"],
    answer: "प्रार्थना समाज"
},
{
    question: "सिस्टर निवेदिता किसकी शिष्य थीं ?",
    option: ["महर्षि दयानन्द सरस्वती", "स्वामी विवेकानन्द", "गोकुल चन्द नारंग", "डॉ. मानिक चन्द्र"],
    answer: "स्वामी विवेकानन्द"
},
{
    question: "आर्य समाज ने गुजराँवाला में गुरुकुल की स्थापना किस वर्ष की थी ?",
    option: ["1900 में", "1901 में", "1903 में", "1904 में"],
    answer: "1900 में"
},
{
    question: "‘ Indian Miror ‘ पुस्तक के लेखक कौन हैं ?",
    option: ["केशवचन्द्र सेन", "देवेन्द्र नाथ ठाकुर", "राजा राममोहन राय", "स्वामी विवेकानन्द"],
    answer: "देवेन्द्र नाथ ठाकुर"
},
{
    question: "“ प्रजातंत्र जनता के लिए, जनता के द्वारा, जनता की सरकार है ” प्रजातंत्र की यह परिभाषा किसने दी है ?",
    option: ["बाराक ओबामा", "महात्मा गाँधी", "अब्राहम लिंकन", "जवाहरलाल नेहरू"],
    answer: "अब्राहम लिंकन"
},
{
    question: "स्वतंत्र भारत में सर्वप्रथम किस पंचवर्षीय योजना में उद्योग पर जोर दिया गया ?",
    option: ["प्रथम पंचवर्षीय योजना", "द्वितीय पंचवर्षीय योजना", "तृतीय पंचवर्षीय योजना", "चतुर्थ पंचवर्षीय योजना"],
    answer: "द्वितीय पंचवर्षीय योजना"
},
{
    question: "ग्यारहवीं पंचवर्षीय योजना का काल क्या है ?",
    option: ["2002-2007", "2007-2009", "2007-2012", "2008-2013"],
    answer: "2007-2012"
},
{
    question: "‘ सत्य शोधक समाज ‘ के संस्थापक कौन थे ?",
    option: ["आचार्य रामानुज", "स्वामी विवेकानन्द", "स्वामी दयानन्द", "ज्योतिबा फुले"],
    answer: "ज्योतिबा फुले"
},
{
    question: "” गाँव एक लघु गणराज्य है ” किसने कहा ?",
    option: ["मेटकॉफ", "ए.आर. देसाई", "कार्ल मार्क्स", "महात्मा गाँधी"],
    answer: "मेटकॉफ"
},
{
    question: "बाल विवाह निरोधक अधिनियम किस साल लागू हुआ ?",
    option: ["1929", "1939", "1910", "1925"],
    answer: "1929"
},
{
    question: "राज्य द्वारा पारित किए गये वे कानून जो सामाजिक कुरीतियों को दूर करने, सामाजिक विघटन को रोकने तथा समाज सुधार के अनुकूल परिस्थितियाँ उत्पन्न करने के उद्देश्य से बनाये जाते हैं, उन्हें कहते हैं",
    option: ["सामाजिक विधान", "प्रार्थना समाज", "आर्य समाज", "भारत सेवक समाज"],
    answer: "सामाजिक विधान"
},
{
    question: "निम्नलिखित में किस राज्य में सर्वप्रथम पंचायत चुनाव में महिलाओं को 50 % आरक्षण दिया गया ?",
    option: ["मध्य प्रदेश", "राजस्थान", "पश्चिम बंगाल", "बिहार"],
    answer: "बिहार"
},
{
    question: "‘ अस्पृश्यता अधिनियम ‘ कब पारित हुआ ?",
    option: ["1950", "1955", "1957", "1959"],
    answer: "1955"
},
{
    question: "‘ नागरिक अधिकार संरक्षण कानून ‘ किस सन् में बना ?",
    option: ["1971", "1972", "1975", "1976"],
    answer: "1976"
},
{
    question: "‘ हिन्दू गोद लेना भरण – पोषण अधिनियम के अनुसार गोद लेने वाले व्यक्ति में निम्न में से कौन – सी विशेषताएँ होनी चाहिए ?",
    option: ["उनका मन स्वस्थ हो", "उनकी आयु कम से कम 18 वर्ष की हो", "यदि उसकी पत्नी जीवित है तो गोद लेने के लिए उसकी सहमति भी आवश्यक है", "उपर्युक्त सभी"],
    answer: "यदि उसकी पत्नी जीवित है तो गोद लेने के लिए उसकी सहमति भी आवश्यक है"
},
{
    question: "निम्नलिखित में से राजनीतिक दल का प्रकार है",
    option: ["एक दलीय व्यवस्था", "द्विदलीय व्यवस्था", "बहुदलीय व्यवस्था", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "‘ पॅलिटिकल साइंस ‘ नामक पुस्तक के रचयिता हैं",
    option: ["लीकॉक", "गैटिल", "मैकाइवर", "गिलक्राइस्ट"],
    answer: "गैटिल"
},
{
    question: "” राजनीतिक दल एक ऐसा समुदाय है, जो किसी ऐसे सिद्धान्त अथवा ऐसी नीति के समर्थन के लिए संगठित हुए हो, जिससे वह वैधानिक साधनों से सरकार का आधार बनाना चाहता हो । ” यह परिभाषा दी है",
    option: ["मैकाइवर", "रूसो", "स्पेंसर", "गैटिल"],
    answer: "मैकाइवर"
},
{
    question: "निम्न में से राजनीतिक दल का कार्य है",
    option: ["जनता और सरकार के बीच समन्वय स्थापित करना", "जनमत तैयार करना", "जनता में राजनैतिक जागरूकता पैदा करना", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "“ दबाव समूह व्यक्तियों का वह समूह है, जो शासकीय विषयों के माध्यम से अथवा उनके बिना ही राजनीतिक परिवर्तन लाने का प्रयत्न करता है । ऐसे दबाव समूहों को विधानमण्डल में राजनीतिक दलों के रूप में कोई प्रतिनिधित्व नहीं होता । ” उक्त परिभाषा सम्बन्धित है",
    option: ["पी. ओडीगार्ड", "लीकॉक", "फ्रांसिस कैसेल्स", "एच. जेगलर"],
    answer: "फ्रांसिस कैसेल्स"
},
{
    question: "निम्न में से दबाव समूह का साधन है",
    option: ["घेराव एवं प्रदर्शन", "जनसंचार के साधनों का प्रयोग", "हड़ताल", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "भारत में किस प्रकार शासन प्रणाली पायी जाती है ?",
    option: ["संसदीय शासन प्रणाली", "अध्यक्षीय शासन प्रणाली", "( a ) और ( b ) दोनो", "इनमें से कोई नहीं"],
    answer: "संसदीय शासन प्रणाली"
},
{
    question: "पीटर मार्कल ने दबाव समूह को कितने भागों में वर्गीकृत किया है ?",
    option: ["तीन", "चार", "छः", "आठ"],
    answer: "छः"
},
{
    question: "भारतीय संसद दो सदनों में विभाजित है । प्रथम सदन को लोकसभा कहा जाता है और द्वितीय सदन का नाम है",
    option: ["विधान सभा", "विधान परिषद्", "राज्य सभा", "इनमें से कोई नहीं"],
    answer: "राज्य सभा"
},
{
    question: "निम्नलिखित से संविधान प्रारूप समिति के अध्यक्ष थे",
    option: ["रवीन्द्रनाथ टैगोर", "भीमराव अम्बेडकर", "महात्मा गाँधी", "सरदार पटेल"],
    answer: "भीमराव अम्बेडकर"
},
{
    question: "भारतीय संविधान कब लागू किया गया ?",
    option: ["25 जनवरी, 1948", "20 दिसम्बर, 1949", "26 जनवरी, 1950", "26 जनवरी, 1949"],
    answer: "26 जनवरी, 1950"
},
{
    question: "भारतीय संविधान में निम्न में से कौन से मूल्य निहित हैं",
    option: ["धर्मनिरपेक्षता", "स्वतंत्रता", "समानता", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "निम्नलिखित में किस कमिटी की अनुशंसा के आधार पर पंचायतीराज व्यवस्था लागू की गई ?",
    option: ["काका कालेलकर कमिटी", "अशोक मेहता कमिटी", "बलवंतराय मेहता कमिटी", "थुंगन कमिटी"],
    answer: "बलवंतराय मेहता कमिटी"
},
{
    question: "संविधान के किस अनुच्छेद में वृद्धों, असहायों एवं बालकों को संरक्षण प्रदान किया गया है ?",
    option: ["अनुच्छेद 17", "अनुच्छेद 39", "अनुच्छेद 15 एवं 16", "अनुच्छेद 39"],
    answer: "अनुच्छेद 39"
},
{
    question: "संविधान के किस अनुच्छेद में अनुसूचित जाति, जनजाति एवं पिछड़े वर्गों को लोकसभा एवं राज्य विधान सभाओं में प्रतिनिधित्व का प्रावधान किया गया है ?",
    option: ["अनुच्छेद 330 एवं 332", "अनुच्छेद 14 एवं 14", "अनुच्छेद 23 एवं 24", "इने से कोई नहीं"],
    answer: "अनुच्छेद 330 एवं 332"
},
{
    question: "योजना आयोग के स्थान पर नवीन आयोग का गठन किया गया है। उसे किस नाम से जाना जाता है ?",
    option: ["लोक सेवा आयोग", "जन सेवा आयोग", "नीति आयोग", "कल्याण आयोग"],
    answer: "नीति आयोग"
},
{
    question: "निम्न में से किसे मौलिक अधिकारों की सूची से हटा दिया गया है ?",
    option: ["शिक्षा का अधिकार", "सम्पति का अधिकार", "शोषण के विरुद्ध अधिकार", "स्वतंत्रता का अधिकार"],
    answer: "सम्पति का अधिकार"
},
{
    question: "निम्न में से कौन मौलिक अधिकार नहीं है ?",
    option: ["समानता का अधिकार", "स्वतंत्रता का अधिकार", "शिक्षा का अधिकार", "हिंसा का अधिकार"],
    answer: "हिंसा का अधिकार"
},
{
    question: "डॉ. भीमराव अम्बेडकर का जन्म भारत के किस राज्य में हुआ था ?",
    option: ["गुजरात", "उत्तर प्रदेश", "महाराष्ट्र", "मध्य प्रदेश"],
    answer: "महाराष्ट्र"
},
{
    question: "मंडल आयोग के अध्यक्ष कौन थे ?",
    option: ["बिन्देश्वरी प्रसाद मंडल", "धनिक लाल मंडल", "मंगनी लाल मंडल", "चन्दौश्वरी लाल मंडल"],
    answer: "बिन्देश्वरी प्रसाद मंडल"
},
{
    question: "निम्नलिखित में से किसे शारदा एक्ट कहा जाता है ?",
    option: ["विशेष विवाह एक्ट", "सहमति आयु", "बाल विवाह एक्ट", "हिन्दू विवाह एक्ट"],
    answer: "बाल विवाह एक्ट"
},
{
    question: "कितने वर्ष के अंतर्गत के बच्चों को किसी खतरनाक कार्य में लगाना दंडनीय अपराध माना गया है ?",
    option: ["14", "18", "10", "20"],
    answer: "14"
},
{
    question: "भारत में पंचायतीराज एक्ट कब पारित हुआ ?",
    option: ["1951 ई. में", "1947 ई. में", "1952 ई. में", "1959 ई. में"],
    answer: "1959 ई. में"
},
{
    question: "पंचायतीराज व्यवस्था सर्वप्रथम किस राज्य में लागू किया गया ?",
    option: ["बिहार", "उत्तर प्रदेश", "महाराष्ट्र", "राजस्थान"],
    answer: "राजस्थान"
},
{
    question: "बलवंत राय मेहता समिति किससे सम्बन्धित है ?",
    option: ["भूमि सुधार से", "हरित क्रांति से", "पंचायती राज से", "नक्सल आन्दोलन से"],
    answer: "पंचायती राज से"
},
{
    question: "बिहार में किस वर्ष ग्राम पंचायत की स्थापना हुई ?",
    option: ["1946", "1947", "1949", "1950"],
    answer: "1947"
},
{
    question: "‘ दलित वर्ग कल्याण लीग ‘ की स्थापना किसने की थी ?",
    option: ["महात्मा गाँधी", "राम विलास पासवान", "जगजीवन राम", "बी ० आर ० अम्बेदकर"],
    answer: "जगजीवन राम"
},
{
    question: "बिहार में पंचायती राज के सदस्यों का कार्यकाल कितने वर्षों का होता है ?",
    option: ["पाँच वर्ष", "तीन वर्ष", "सात वर्ष", "चार वर्ष"],
    answer: "पाँच वर्ष"
},
{
    question: "निम्न में कौन ग्रामीण समाज की विशेषता है ?",
    option: ["श्रम विभाजन", "सामाजिक गतिशीलता", "घनी आबादी", "कृषि व्यवसाय"],
    answer: "कृषि व्यवसाय"
},
{
    question: "निम्न में से किस राज्य में भू – सुधार कार्यक्रम सबसे सफल रहा है ?",
    option: ["बिहार", "कर्नाटक", "पश्चिम बंगाल", "उत्तराखण्ड"],
    answer: "पश्चिम बंगाल"
},
{
    question: "हरित क्रांति का मुख्य कारक कौन है ?",
    option: ["उपजाऊ भूमि", "रासायनिक खाद और बीज", "वर्षा", "शिक्षा"],
    answer: "रासायनिक खाद और बीज"
},
{
    question: "जमींदारी उन्मूलन अधिनियम किस वर्ष पारित किया गया ?",
    option: ["1961 ई. में", "1948 ई. में", "1950 ई. में", "1955 ई. में"],
    answer: "1950 ई. में"
},
{
    question: "जीवन जीने के लिए आवश्यक रोजगार या कार्य जिससे धन की प्राप्ति हो उसे कहते हैं",
    option: ["जीविका", "बिचौलिए", "बटाईदारी", "काश्तकारी"],
    answer: "जीविका"
},
{
    question: "भारत में कितना प्रतिशत राष्ट्रीय आय कृषि से प्राप्त होती है ?",
    option: ["28 %", "29 %", "30 %", "40 %"],
    answer: "29 %"
},
{
    question: "गहन कृषि जिला कार्यक्रम आरम्भ किया गया",
    option: ["1961 ई. में", "1951 ई. में", "1971 ई. में", "1991 ई. में"],
    answer: "1961 ई. में"
},
{
    question: "भारत में हरित क्रांति लाने में किसका योगदान है ?",
    option: ["जगदीशचन्द्र बसु", "चन्द्रशेखर वेंकट रमन", "डॉ. होमी जहाँगीर भाभा", "डॉ. एम.एस. स्वामीनाथन"],
    answer: "डॉ. एम.एस. स्वामीनाथन"
},
{
    question: "मध्याह्न भोजन कहाँ लागू हुआ ?",
    option: ["स्कूल", "कॉलेज", "ऑफिस", "उपर्युक्त सभी"],
    answer: "स्कूल"
},
{
    question: "भारत में जमींदारी व्यवस्था के अन्तर्गत भूमि का कितने प्रतिशत भाग आता था ?",
    option: ["20 प्रतिशत", "40 प्रतिशत", "60 प्रतिशत", "80 प्रतिशत"],
    answer: "20 प्रतिशत"
},
{
    question: "राबर्ट रेडफील्ड के अनुसार कृषक समाज की विशेषता है",
    option: ["समरूप समाज", "कृषि भूमि पर नियंत्रण", "स्वयं उत्पादनकर्ता", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "थियोडोर शनीन ने कृषक समाज के कितने मौलिक पक्षों का उल्लेख किया है ?",
    option: ["तीन", "चार", "पाँच", "छः"],
    answer: "चार"
},
{
    question: "हरित क्रांति के प्रथम चरण के रूप में ‘ गहन कृषि जिला कार्यक्रम ‘ कब लागू किया गया ?",
    option: ["सन् 1960", "सन् 1962", "सन् 1961", "सन् 1963"],
    answer: "सन् 1961"
},
{
    question: "भारत सरकार की ओर से भूमि के पुनर्गठन हेतु कौन – सा प्रयास किया गया ?",
    option: ["भूमि – प्रबन्धन", "सहकारी कृषि", "चकबन्दी", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "हरित क्रांति का उत्प्रेरक कौन है ?",
    option: ["नदियाँ", "संकरित बीज", "उपजाऊ जमीन", "वर्षा"],
    answer: "संकरित बीज"
},
{
    question: "हरित क्रान्ति किस राज्य में ज्यादा सफल रही ?",
    option: ["गुजरात", "असम ( असोम )", "पंजाब", "बिहार"],
    answer: "पंजाब"
},
{
    question: "निम्नलिखित में कौन हरित क्रान्ति के तत्व हैं ?",
    option: ["अच्छे बीज का उपयोग", "बहु फसल", "सिंचाई पर बल", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "निम्नलिखित में कौन हरित क्रान्ति का प्रकार्य है ?",
    option: ["शैक्षणिक विकास", "क्षेत्रीय असमानता", "अर्थव्यवस्था में विकास", "उपर्युक्त सभी"],
    answer: "अर्थव्यवस्था में विकास"
},
{
    question: "इनमें से कौन आदिम अर्थव्यवस्था का दूसरा स्तर है ?",
    option: ["शिकार एवं भोजन संग्रह स्तर", "कृषि स्तर", "पशुचारण स्तर", "औद्योगिक स्तर"],
    answer: "कृषि स्तर"
},
{
    question: "‘ सबला ‘ स्कीम केन्द्रित है",
    option: ["असहाय महिलाएँ", "किशोरियाँ", "मातृत्व लाभ", "इनमें से सभी"],
    answer: "किशोरियाँ"
},
{
    question: "बिहार में कौन – सी संस्था ग्रामीण विवादों का निपटारा करती है ?",
    option: ["न्याय पंचायत", "पंचायत कचहरी", "ग्राम कचहरी", "इनमें से कोई नहीं"],
    answer: "ग्राम कचहरी"
},
{
    question: "भूमंडलीकरण का सम्बन्ध किससे है ?",
    option: ["उदारीकरण से", "निजीकरण से", "(a) एवं (b) दोनों से", "इनमें से कोई नहीं"],
    answer: "(a) एवं (b) दोनों से"
},
{
    question: "उदारीकरण से क्या अर्थ निकलता है ?",
    option: ["समाजवाद", "मनुष्य का उदार होना", "काफी उन्नति होना", "मुक्त बाजार व्यवस्था"],
    answer: "मुक्त बाजार व्यवस्था"
},
{
    question: "निम्न में से कौन – सी दशा उदारीकरण का परिणाम नहीं है ?",
    option: ["उपभोक्तावाद", "ग्रामीण उद्योग का विघटन", "बेरोजगारी", "संयुक्त परिवार का विघटन"],
    answer: "उपभोक्तावाद"
},
{
    question: "किस वर्ष अंतर्राष्ट्रीय श्रम संगठन की स्थापना हुई ?",
    option: ["1918 ई. में", "1919 ई. में", "1941 ई. में", "1949 ई. में"],
    answer: "1919 ई. में"
},
{
    question: "विश्व व्यापार संगठन की स्थापना कब किया गया ?",
    option: ["1990 ई. में", "1980 ई. में", "1977 ई. में", "1995 ई. में"],
    answer: "1995 ई. में"
},
{
    question: "वैश्वीकरण का संबंध है",
    option: ["सार्वभौमिकरण के साथ", "एकीकरण के साथ", "सजातीयता के साथ", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "विश्व व्यापार संगठन का मुख्यालय कहाँ है ?",
    option: ["नई दिल्ली", "पेरिस", "जिनेवा", "इस्लामाबाद"],
    answer: "जिनेवा"
},
{
    question: "इनमें कौन विदेशी चैनल है ?",
    option: ["सहारा", "स्टार", "आज तक", "इनमें से कोई नहीं"],
    answer: "स्टार"
},
{
    question: "निम्न में कौन विकसित देश है ?",
    option: ["श्रीलंका", "नेपाल", "अमेरिका", "भारत"],
    answer: "अमेरिका"
},
{
    question: "ऐसी कंपनियाँ जो एक से अधिक देशों में अपना उत्पादन करती है अथवा बाजार सेवाएं प्रदान करती है, उसे क्या कहते हैं ?",
    option: ["स्वदेशी निगम", "पारा राष्ट्रीय निगम", "लघु उद्योग", "वृहत् उद्योग"],
    answer: "पारा राष्ट्रीय निगम"
},
{
    question: "भूमण्डलीकरण वह प्रक्रिया है जो पूँजीवाद के विस्तार एवं उसकी समृद्धि के कारण उत्पन्न हुई है। इस परिभाषा के प्रस्तुतकर्त्ता कौन हैं ?",
    option: ["गिड्डेन्स", "बेलरस्टेन", "इन्टरनेशनल सोशियालॉजी", "इनमें से कोई नहीं"],
    answer: "बेलरस्टेन"
},
{
    question: "The Consequence of Modernity पुस्तक के लेखक कौन हैं ?",
    option: ["दीपक गुप्ता", "गिड्डेन्स", "बेलरस्टेन", "इनमें से कोई नहीं"],
    answer: "गिड्डेन्स"
},
{
    question: "Historical Capitalism के लेखक कौन हैं ?",
    option: ["कार्ल मार्क्स", "जॉर्ज रिट्यर", "दीपंकर गुप्ता", "बेलरस्टेन"],
    answer: "बेलरस्टेन"
},
{
    question: "भूमण्डलीकरण को आगे बढ़ाने वाले प्रमुख प्रेरक कौन से हैं ?",
    option: ["बाजार की खोज", "बहुराष्ट्रीय विनिवेश", "प्रौद्योगिकी, इलेक्ट्रॉनिक के नए उपकरण और नेटवर्क", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "निम्न में से कौन – सा एक प्रभाव भारत पर भूमण्डलीकरण का प्रभाव नहीं है ?",
    option: ["राष्ट्रीय आय में वृद्धि", "महिला जागरूकता", "राष्ट्रीयकरण", "कृषि उत्पादन में वृद्धि"],
    answer: "राष्ट्रीयकरण"
},
{
    question: "समाजशास्त्रीय दृष्टिकोण से भूमण्डलीकरण की अवधारणा का विश्लेषण किसने किया ?",
    option: ["के. डेविस", "टी.बी. बाटोमोर", "मैकाइवर एवं पेज", "एंथनी गिड्डेन्स"],
    answer: "एंथनी गिड्डेन्स"
},
{
    question: "भूमण्डलीकरण का मौलिक उद्देश्य प्रत्येक राष्ट्र को विश्व स्तर पर क्या सुगम रूप से उपलब्ध कराना है ?",
    option: ["संसाधन", "ज्ञान", "तकनीकी", "ये सभी"],
    answer: "ये सभी"
},
{
    question: "यद्यपि भूमण्डलीकरण प्रक्रिया का कार्य क्षेत्र आर्थिक माना जाता है तथापि कौन – सा क्षेत्र इससे अछूता नहीं है ?",
    option: ["सामाजिक", "सांस्कृतिक", "राजनीतिक", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "भूमण्डलीकरण का प्रमुख आधार है",
    option: ["भौतिकवादी दर्शन", "राजदर्शन", "सामाजिक दर्शन", "इनमें से कोई नहीं"],
    answer: "भौतिकवादी दर्शन"
},
{
    question: "भारत में भूमण्डलीकरण का प्रारम्भ किस वर्ष हुआ ?",
    option: ["सन् 1990", "सन् 1991", "सन् 2000", "सन् 2001"],
    answer: "सन् 1991"
},
{
    question: "निम्न में से कौन सामाजिक परिवर्तन की विशेषता नहीं है ?",
    option: ["विश्वव्यापी", "सामुदायिक परिवर्तन", "स्थायी अवधारणा", "अनिश्चित भविष्यवाणी"],
    answer: "अनिश्चित भविष्यवाणी"
},
{
    question: "निम्न में से कौन – सा एक प्रभाव भारत में वैश्वीकरण का प्रभाव नहीं है ?",
    option: ["राष्ट्रीय आय में वृद्धि", "महिला जागरूकता", "राष्ट्रीयकरण", "कृषि उत्पादन में वृद्धि"],
    answer: "राष्ट्रीयकरण"
},
{
    question: "इनमें से किसको प्रजातंत्र का चौथा स्तंभ कहा जाता है ?",
    option: ["कार्यपालिका", "विधायिका", "प्रेस", "न्यायपालिका"],
    answer: "प्रेस"
},
{
    question: "रेडियो का आविष्कार कब हुआ ?",
    option: ["1895 ई. में", "1795 ई. में", "1695 ई. में", "1595 ई. में"],
    answer: "1895 ई. में"
},
{
    question: "प्रसार भारती का गठन हुआ",
    option: ["1985 ई. में", "1987 ई. में", "1997 ई. में", "1999 ई. में"],
    answer: "1997 ई. में"
},
{
    question: "भारत में विधिवत टी.वी. सेवा का आरंभ कब हुआ ?",
    option: ["15 अगस्त, 1965 में", "15 अगस्त, 1970 में", "15 अगस्त, 1968 में", "15 अगस्त, 1966 में"],
    answer: "15 अगस्त, 1965 में"
},
{
    question: "F.M. रेडियो की शुरूआत हुई",
    option: ["1960 ई. में", "1980 ई. में", "1975 ई. में", "1993 ई. में"],
    answer: "1993 ई. में"
},
{
    question: "BBC ने अपना टेलीविजन सेवा शुरू की",
    option: ["1936 ई. में", "1940 ई. में", "1942 ई. में", "1945 ई. में"],
    answer: "1936 ई. में"
},
{
    question: "जनसंचार के प्रभावस्वरूप भारतीय समाज ने किस मूल्य को आत्मसात किया है ?",
    option: ["स्वतंत्रतावादी", "धर्मनिरपेक्षवादी", "समानतावादी", "उपर्युक्त सभी"],
    answer: "समानतावादी"
},
{
    question: "वर्तमान भारतीय संस्कृति सर्वाधिक रूप से किससे प्रभावित है ?",
    option: ["नैतिकता से", "पाश्चात्य संस्कृति से", "प्रबुद्ध वर्ग से", "आदर्शवाद से"],
    answer: "पाश्चात्य संस्कृति से"
},
{
    question: "भारत के सामान्य ग्रामीणों में जनसंचार के किस साधन का प्रचलन सबसे अधिक है ?",
    option: ["समाचार पत्र", "चलचित्र", "टेलीविजन", "रेडियो"],
    answer: "रेडियो"
},
{
    question: "यह किसका कथन है कि “जनसंचार एक ऐसी प्रक्रिया है जिसके द्वारा कुछ विचारों को विभिन्न साधनों के माध्यम से सम्पूर्ण समुदाय तक पहुँचाया जाता है।”",
    option: ["लैपियर", "विल्सन", "मैकाइवर", "मर्टन"],
    answer: "मैकाइवर"
},
{
    question: "निम्नलिखित में से जनसंचार का प्रकार है",
    option: ["मुद्रित संचार", "विद्युत संचार", "दृश्य – श्रव्य संचार", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "मोबाइल फोन, फैक्स और इन्टरनेट आदि जनसंचार के किस साधन के अन्तर्गत आते हैं ?",
    option: ["विद्युत संचार के साधन", "मुद्रित संचार", "दृश्य – श्रव्य संचार के साधन के साधन", "इनमें से कोई नहीं"],
    answer: "विद्युत संचार के साधन"
},
{
    question: "चिपको आंदोलन की अगुआयी किसने की ?",
    option: ["इंद्रेश चिपकलानी", "मेघा पाटेकर", "सुंदरलाल बहुगुणा", "स्वामी अग्निवेष"],
    answer: "सुंदरलाल बहुगुणा"
},
{
    question: "निम्न में से किसका सम्बन्ध जनजातीय आंदोलन से है ?",
    option: ["राम जयपाल सिंह का", "बिरसा मुंडा का", "शिबू सोरेन का", "इनमें सभी"],
    answer: "इनमें सभी"
},
{
    question: "निम्न में से कौन महिला आंदोलन से जुड़े हैं ?",
    option: ["सरोजनी नायडू", "मोहिनी गरि", "रंजना कुमारी", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "पिछड़े वर्गों के लिए बनाया गया प्रथम आयोग के अध्यक्ष कौन थे ?",
    option: ["कर्पूरी ठाकुर", "मुंगेरी लाल", "वी.पी. मंडल", "काका कालेलकर"],
    answer: "काका कालेलकर"
},
{
    question: "मानसरोवर बांध के खिलाफ आंदोलन को नेतृत्व किसने प्रदान किया ?",
    option: ["सुंदरलाल बहुगुणा", "अरूंधती राय", "मेधा पाटकर", "सुनिता नारायण"],
    answer: "मेधा पाटकर"
},
{
    question: "निम्न में कौन किसान नेता माने जाते हैं ?",
    option: ["जयप्रकाश नारायण", "स्वामी सहजानंद सरस्वती", "लाला लाजपत", "इनमें से कोई नहीं"],
    answer: "स्वामी सहजानंद सरस्वती"
},
{
    question: "भारत के किस राज्य में पिछड़ी जाति आन्दोलन सर्वप्रथम शुरू हुआ ?",
    option: ["बिहार", "पश्चिम बंगाल", "आन्ध्र प्रदेश", "तमिलनाडु"],
    answer: "तमिलनाडु"
},
{
    question: "ताना भगत आन्दोलन संबंधित है",
    option: ["पिछड़ी जाति से", "दलित से", "जनजाति से", "इनमें से सभी"],
    answer: "जनजाति से"
},
{
    question: "फरवरी – मार्च 2015 से किस भारतीय ने किसान आन्दोलन में पदार्पण किया ?",
    option: ["राकेश टिकैत", "अन्ना हजारे", "अरविन्द केजरीवाल", "इनमें से कोई"],
    answer: "अन्ना हजारे"
},
{
    question: "भारत में नारीवादी आन्दोलन के पुरोधा के रूप में किनकी पहचान है ?",
    option: ["सुचेता कृपलानी", "सरोजिनी नायडू", "इन्दिरा गाँधी", "कमला नेहरू"],
    answer: "सरोजिनी नायडू"
},
{
    question: "स्वामी सहजानन्द सरस्वती का सम्बन्ध है",
    option: ["साम्यवादी आन्दोलन से", "किसान आन्दोलन से", "मजदूर आन्दोलन से", "इनमें से कोई नहीं"],
    answer: "किसान आन्दोलन से"
},
{
    question: "किस प्रकार के आन्दोलन के साथ आप रामस्वामी नाइक के नाम की जोड़ते हो ?",
    option: ["किसान आन्दोलन", "पर्यावरण सम्बन्धी आन्दोलन", "नारी – स्वतंत्रता आन्दोलन", "पिछड़ी वर्ग आन्दोलन"],
    answer: "पिछड़ी वर्ग आन्दोलन"
},
{
    question: "चिपको आन्दोलन सम्बन्धित है",
    option: ["वृक्षों की रक्षा से", "जल की रक्षा से", "पशुओं की रक्षा से", "खनिजों की रक्षा से"],
    answer: "वृक्षों की रक्षा से"
},
{
    question: "जनजातीय आंदोलन संबंधित है",
    option: ["जाति से", "जनजाति से", "सम्प्रदाय से", "धर्म से"],
    answer: "जनजाति से"
},
{
    question: "भारतीय किसान यूनियन के किसान आन्दोलन में नए सिरे से प्राण फेंकने का श्रेय किसे जाता है ?",
    option: ["विजय सिंह पथिक", "एम. एस. जोशी", "महेन्द्र सिंह टिकैत", "इनमें से कोई नहीं"],
    answer: "महेन्द्र सिंह टिकैत"
},
{
    question: "आत्मसम्मान आंदोलन के प्रणेता कौन थे ?",
    option: ["कर्पूरी ठाकुर", "राम मनोहर लोहिया", "रामास्वामी नायकर", "कांशीराम"],
    answer: "रामास्वामी नायकर"
},
{
    question: "‘मुण्डा विद्रोह’ का नेतृत्व किसने किया था ?",
    option: ["जतरा भगत", "बिरसा मुण्डा", "सिद्धो कान्हो", "करिया मुण्डा"],
    answer: "बिरसा मुण्डा"
},
{
    question: "भारत में किस वर्ष प्रधानमंत्री रोजगार योजना शुरू की गयी ?",
    option: ["1993", "1994", "2011", "2009"],
    answer: "1993"
},
{
    question: "किस वर्ष बालिका समृद्धि योजना की शुरूआत की गई ?",
    option: ["1997", "1998", "1999", "1986"],
    answer: "1997"
},
{
    question: "अहिंसा के आधार पर चलाया गया एक आंदोलन जिसे गाँधीजी ने चलाया, उसका नाम है",
    option: ["तेभागा आंदोलन", "ट्रेड यूनियन आंदोलन", "जन आंदोलन", "सत्याग्रह आंदोलन"],
    answer: "सत्याग्रह आंदोलन"
},
{
    question: "चिपको आन्दोलन चलाया गया",
    option: ["1973 ई. में", "1970 ई. में", "1983 ई. में", "1999 ई. में"],
    answer: "1973 ई. में"
},
{
    question: "“ताड़ी की बिक्री बंद करो” यह आंदोलन किस राज्य में शुरू हुआ ?",
    option: ["बिहार", "झारखण्ड", "गुजरात", "आंध्र प्रदेश"],
    answer: "आंध्र प्रदेश"
},
{
    question: "दलित – पैंथर्स की स्थापना कब की गई ?",
    option: ["1972 ई. में", "1980 ई. में", "1970 ई. में", "1983 ई. में"],
    answer: "1972 ई. में"
},
{
    question: "भारत सरकार ने महिला सशक्तिकरण के लिए राष्ट्रीय नीति की घोषणा कब की ?",
    option: ["2003 ई. में", "2005 ई. में", "2001 ई. में", "2002 ई. में"],
    answer: "2001 ई. में"
},
{
    question: "निम्न में से किस आन्दोलन का सम्बन्ध पर्यावरण समस्याओं से जुड़ा हुआ है ?",
    option: ["दलित आन्दोलन", "आदिवासी आन्दोलन", "चिपको आन्दोलन", "पिछड़ी जाति आन्दोलन"],
    answer: "चिपको आन्दोलन"
},
{
    question: "‘संथाल विद्रोह’ का नेतृत्व किसने किया था ?",
    option: ["जतरा भगत", "बिरसा मुंडा", "सिद्धो – कान्हो", "करिया मुंडा"],
    answer: "सिद्धो – कान्हो"
},
{
    question: "मेघा पाटेकर किस आन्दोलन से जुड़ी है ?",
    option: ["पर्यावरण आन्दोलन", "दलित आन्दोलन", "किसान आन्दोलन", "छात्र आन्दोलन"],
    answer: "पर्यावरण आन्दोलन"
},
{
    question: "बिहार में ग्राम पंचायतों में महिलाओं के लिए कितने प्रतिशत स्थान आरक्षित किये गये हैं ?",
    option: ["25 %", "33 %", "67 %", "50 %"],
    answer: "50 %"
},
{
    question: "चिपको आन्दोलन का संबंध किस राज्य से है ?",
    option: ["उत्तर प्रदेश", "उत्तराखण्ड", "मध्य प्रदेश", "आंध्र प्रदेश"],
    answer: "उत्तराखण्ड"
},
{
    question: "वर्ग संघर्ष का सिद्धान्त किसने दिया ?",
    option: ["कार्ल मार्क्स", "मैकाइवर", "रिजले", "फ्रेजर"],
    answer: "कार्ल मार्क्स"
},
{
    question: "भारतीय किसान यूनियन का गठन किस वर्ष किया गया ?",
    option: ["सन् 1979", "सन् 1980", "सन् 1982", "सन् 1984"],
    answer: "सन् 1979"
},
{
    question: "“जीवन की एक नई व्यवस्था को स्थापित करने के उद्देश्य से किए गए सामूहिक प्रयास ही सामाजिक आन्दोलन है।” यह कथन किसका है ?",
    option: ["एम.एस.ए. राव", "हरबर्ट ब्लूमर", "केमरान", "इनमें से कोई नहीं"],
    answer: "हरबर्ट ब्लूमर"
},
{
    question: "सूचना का अधिकार के लिए आन्दोलन, पर्यावरण बचाओ, कृषक आन्दोलन आदि किस प्रकार के आन्दोलन हैं ?",
    option: ["सुधारवादी", "क्रान्तिकारी", "विरोधवादी", "इनमें से कोई नहीं"],
    answer: "सुधारवादी"
},
{
    question: "“श्रमिक आन्दोलन से आशय श्रमिकों की उन समस्त संगठित क्रियाओं से है जो तत्काल या निकट भविष्य में उनकी दशाओं को श्रेष्ठ बनाने के लिए की जाती है।” यह परिभाषा किसने दी है ?",
    option: ["जी.डी.एच. कोल", "डेल योडर", "हेनिमन", "जे.आर. कामन्स"],
    answer: "जे.आर. कामन्स"
},
{
    question: "भारत में श्रमिक आन्दोलन का विकास किसके फलस्वरूप हुआ ?",
    option: ["नगरीकरण", "औद्योगीकरण", "निजीकरण", "उदारीकरण"],
    answer: "औद्योगीकरण"
},
{
    question: "भारत में सर्वप्रथम किस वर्ष सोरानजी शाहपुर ने श्रमिकों की दुर्दशा की ओर सरकार का ध्यान आकर्षित किया ?",
    option: ["सन् 1875", "सन् 1880", "सन् 1895", "सन् 1905"],
    answer: "सन् 1875"
},
{
    question: "भारत में श्रम संघ का इतिहास किस वर्ष से शुरू होता है ?",
    option: ["सन् 1880", "सन् 1890", "सन् 1900", "सन् 1910"],
    answer: "सन् 1890"
},
{
    question: "श्रमिकों की समस्याओं पर नियंत्रण पाने के वाद – विवाद अधिनियम कब पारित किया गया ?",
    option: ["सन् 1950", "सन् 1949", "सन् 1948", "सन् 1947"],
    answer: "सन् 1947"
},
{
    question: "सभी श्रमिक संघों को एक मंच पर लाने के लिए कम्युनिस्ट पार्टी (मार्क्सवादी) ने किस संगठन की स्थापना की ?",
    option: ["यूनाइटेड ट्रेड यूनियन काँग्रेस", "हिन्दू मजदूर सभा", "भारतीय श्रमिक संघ केन्द्र", "इण्डियन नेशनल ट्रेड यूनियन काँग्रेस"],
    answer: "भारतीय श्रमिक संघ केन्द्र"
},
{
    question: "भारत की किस आर्थिक नीति को भूमण्डलीकरण के साथ अपनाया गया ?",
    option: ["आर्थिक नीति, 1972", "आर्थिक नीति, 1991", "आर्थिक नीति, 2001", "आर्थिक नीति, 2011"],
    answer: "आर्थिक नीति, 1991"
},
{
    question: "“कोई भी आन्दोलन कृषक आन्दोलन हो सकता है बशर्ते उसका मूल उद्देश्य कृषकों के अधिकार की लड़ाई हो, चाहे वह कृषकों द्वारा गठित हो या अन्य समूहों द्वारा।” यह कथन किसका है ?",
    option: ["प्रो. आर. सिंह", "आर.बी. पाण्डेय", "घुरिये", "सी.आर. पाण्डेय"],
    answer: "आर.बी. पाण्डेय"
},
{
    question: "वर्ष 1928-29 में बारदोली (गुजरात) के किसान आन्दोलन (बारदोली सत्याग्रह) का नेतृत्व किसने किया ?",
    option: ["जयप्रकाश नारायण", "बल्लभ भाई पटेल", "महात्मा गाँधी", "इनमें से कोई नहीं"],
    answer: "बल्लभ भाई पटेल"
},
{
    question: "बिहार किसान सभा की स्थापना किस वर्ष हुई ?",
    option: ["सन् 1927", "सन् 1929", "सन् 1931", "सन् 1933"],
    answer: "सन् 1929"
},
{
    question: "बिहार किसान सभा किस वर्ष अखिल भारतीय किसान सभा में परिवर्तित हो गई ?",
    option: ["सन् 1938", "सन् 1937", "सन् 1936", "सन् 1934"],
    answer: "सन् 1936"
},
{
    question: "तिभागा आन्दोलन के प्रमुख नेता कौन थे ?",
    option: ["भोवानी सेन", "रत्नसेन", "योगेश चन्द्र चटर्जी", "इनमें से कोई नहीं"],
    answer: "भोवानी सेन"
},
{
    question: "तिभागा आन्दोलन किस वर्ष समाप्त हो गया ?",
    option: ["सन् 1945", "सन् 1947", "सन् 1949", "सन् 1953"],
    answer: "सन् 1947"
},
{
    question: "तेलांगाना आन्दोलन हैदराबाद के नोलगोण्डा जिले में कब शुरू हुआ ?",
    option: ["सन् 1992", "सन् 1932", "सन् 1944", "सन् 1946"],
    answer: "सन् 1946"
},
{
    question: "पंजाब में उन्नीसवीं शताब्दी के अन्त में प्रारम्भ हुए किसान आन्दोलन का नेतृत्व किसने किया ?",
    option: ["लाला लाजपत राय", "सरदार अजीत सिंह", "उपर्युक्त दोनों", "इनमें से कोई नहीं"],
    answer: "उपर्युक्त दोनों"
},
{
    question: "भारत में निम्न में से कौन – सा कारक राष्ट्रीय एकता में बाधक है ?",
    option: ["जातिवाद", "क्षेत्रवाद", "धर्मान्धता", "इनमें से सभी"],
    answer: "इनमें से सभी"
}
];

// English Questions
const sociologyEnglish = [
{
    question: "following in from who ‘soshiyoloNjii’ shbdaavlii of sRjn done ?",
    option: ["speNsr", "agst koNmtt", "dukhiim", "kaarl maarks"],
    answer: "agst koNmtt"
},
{
    question: "smaajshaastr to ‘social sthaitik’ and social gtik’ in who vibhaajit done ?",
    option: ["mekaaiivr and pej", "joNnsn", "agst koNmtt", "dukhiim"],
    answer: "dukhiim"
},
{
    question: "mnusmRti of rgramkaar which are ?",
    option: ["tulsiidaas", "vedvyaas", "caannky", "mnu"],
    answer: "mnu"
},
{
    question: "smaajshaastr of birth In which year was ?",
    option: ["1838", "1836", "1898", "1810"],
    answer: "1838"
},
{
    question: "which smaajshaastrii of smudaay of – pribhaassaa in’hm bhaavnaa’ of spsstt ullekh done was is ?",
    option: ["bogaardds of", "giNsbrg of", "maikaaivr", "kiNgsle ddevis of"],
    answer: "bogaardds of"
},
{
    question: "following in which smudaay of udaahrnn is ?",
    option: ["krikett ttiim", "raajy", "college of chaatraavaas", "sNgh lok sevaa aayog"],
    answer: "raajy"
},
{
    question: "“India in bhinntaa in ektaa nihit is, prntu maulik ektaa utnii spsstt is not, jitnii baahy bhinntaa / ” such who said is ?",
    option: ["phikttr ne", "Smith ne", "griin ne", "ttoNylr"],
    answer: "Smith ne"
},
{
    question: "national ekiikrnn for most more necessary what is ?",
    option: ["economic unnti", "dhaarmik svtNtrtaa", "dhaarmik shissnnutaa", "education of prsaar"],
    answer: "dhaarmik shissnnutaa"
},
{
    question: "raassttriiytaa of taatpry what is ?",
    option: ["normal social pRsstthbhuumi", "normal jaatigt pRsstthbhuumi", "normal bhaugolik pRsstthbhuumi", "above-mentioned any correct not"],
    answer: "normal bhaugolik pRsstthbhuumi"
},
{
    question: "India chodd'o aaNdoln of aarNbh when from was ?",
    option: ["9 agst, 1917 from", "9 agst, 1939 from", "9 agst, 1942 from", "9 agst 1947 from"],
    answer: "9 agst, 1942 from"
},
{
    question: "‘punrjnm’ of avdhaarnnaa which dhrm related to is ?",
    option: ["hinduu", "islaam", "iisaaii", "All of these"],
    answer: "hinduu"
},
{
    question: "national smnvy of maarg in which-saa element baadhk is not ?",
    option: ["jaatiiy bhaavnaa", "dhaarmik bhaavnaa", "alpsNkhyk of security", "economic vissmtaa"],
    answer: "alpsNkhyk of security"
},
{
    question: "“reproduction capacity in lack being of before naitiktaa of level in hraas honaa jruurii hai / ” this vicaakisne vykt of is ?",
    option: ["ddblyuu0 nottestten", "maalths", "thaamsn", "ke0 ddevis"],
    answer: "ddblyuu0 nottestten"
},
{
    question: "ugr raassttrvaadiyoN of kaal when said goes is ?",
    option: ["1905 from 1918", "1885 from 1905", "1919 from 1947", "among these any not"],
    answer: "1905 from 1918"
},
{
    question: "following in which vidvaan ne Indian village to one life method maanaa is ?",
    option: ["mjuumdaar", "shriinivaas", "maikim mairiytt", "belii"],
    answer: "mjuumdaar"
},
{
    question: "institution shbd use of srvprthm which vidvaan ne done thaa ?",
    option: ["durthiim", "spensr", "kaamtt", "em0 en0 shriinivaas"],
    answer: "spensr"
},
{
    question: "spensr of book ‘First Principles’ in srvprthm which shbd use of done was ?",
    option: ["institution", "smiti", "primary group", "jaati"],
    answer: "institution"
},
{
    question: "which vidvaan ne smudaay of pribhaassaa in hm of bhaavnaa’ of spsstt ullekh done is ?",
    option: ["bogaardds ne", "giNsbrg ne", "maikaaivr ne", "kiNgsle ddevis ne"],
    answer: "bogaardds ne"
},
{
    question: "following in from which society in mhilaaoN of prsthiti apekssaakRt behtr is ?",
    option: ["industrial society", "aadivaasii society", "agricultural society", "All of the above in"],
    answer: "industrial society"
},
{
    question: "when death dr bddh'tii is and birth dr in giraavtt aatii is then uske phlsvruup –",
    option: ["population in growth occurs", "population in giraavtt aatii is", "population sthir rhtii is", "population in gtishiiltaa aatii is"],
    answer: "population in giraavtt aatii is"
},
{
    question: "vh aaNdoln jisko maalths of anuyaayiyoN ne sNtti nigrh and other upaayoN by population less doing for claayaa, is called is—",
    option: ["nv-maalthsvaad", "maalthsvaad", "maarksvaad", "nv-maarksvaad"],
    answer: "nv-maalthsvaad"
},
{
    question: "following in who vicln to society for prkaaryaatmk maanaa is ?",
    option: ["e0 kohn", "AD durkhaaim", "aar0 ke0 mrttn", "el0 ke0 vvaaitt"],
    answer: "AD durkhaaim"
},
{
    question: "among these which smudaay of udaahrnn is ?",
    option: ["school", "village", "dhrm", "jaati"],
    answer: "jaati"
},
{
    question: "smudaay in hm of bhaavnaa viksit occurs –",
    option: ["economic smaantaa from", "raajniitik aadhaaroN from", "members of sNkhyaa from", "among these from any from not"],
    answer: "among these from any from not"
},
{
    question: "” village one small gnnraajy are”  /  who said ?",
    option: ["mettkoNph", "e0 aar0 desaaii", "kaarl maarks", "mhaatmaa gaaNdhii"],
    answer: "mettkoNph"
},
{
    question: "India in iistt India company of shaasn when brittish shaasn as privrtit was ?",
    option: ["sn 1839", "sn 1858", "sn 1862", "sn 1885"],
    answer: "sn 1858"
},
{
    question: "India in national population aayog of adhykss which are ?",
    option: ["raassttrpti", "prdhaanmNtrii", "health mNtrii", "gRhmNtrii"],
    answer: "prdhaanmNtrii"
},
{
    question: "India of log main form from aashrit are—",
    option: ["job on", "agricultural on", "vyfaty on", "industry on"],
    answer: "agricultural on"
},
{
    question: "following in from rural smudaay of prmukh characteristic which are ?",
    option: ["social gtishiiltaa", "bdd'aa aakaar", "women of high prsthiti", "agricultural on aadhaarit"],
    answer: "agricultural on aadhaarit"
},
{
    question: "India in jnaadhiky of muul cause what is ?",
    option: ["environment", "reproduction power", "social-saaNskRtik kaark", "None of these"],
    answer: "social-saaNskRtik kaark"
},
{
    question: "Indian rural smudaay characteristic ofeN is –",
    option: ["normal fixed field", "saamudaayik ektaa", "primary sNbNdhoN of prdhaantaa", "All of the above"],
    answer: "All of the above"
},
{
    question: "paarsns by how many types of prtimaanit viklpoN of vrnnn done was is ?",
    option: ["three", "four", "five", "six"],
    answer: "three"
},
{
    question: "naisrgik prtibndh whose avdhaarnnaa is ?",
    option: ["maalths", "saiddlr", "kainn", "ddaalttn"],
    answer: "maalths"
},
{
    question: "when national kaaNgres of adhiveshn in muul right of ghossnnaa of was ?",
    option: ["1930", "1931", "1932", "1933"],
    answer: "1931"
},
{
    question: "naisrgik prtibNdh whose avdhaarnnaa is ?",
    option: ["maalths", "saiddlr", "kainn", "ddaalttn"],
    answer: "maalths"
},
{
    question: "2001 AD of jngnnnaa according to India in srvaadhik liNgaanupaat which raajy which-saa thaa ?",
    option: ["sikkim", "mdhyprdesh", "kerl", "bihaar"],
    answer: "kerl"
},
{
    question: "2001 AD of jngnnnaa according to India of nyuuntm liNgaanupaat which raajy which-saa thaa ?",
    option: ["hriyaannaa", "mdhyprdesh", "kerl", "bihaar"],
    answer: "hriyaannaa"
},
{
    question: "infant death dr in how many year of children of gnnnaa is done ?",
    option: ["two year", "one year", "four year", "five year"],
    answer: "one year"
},
{
    question: "national population niiti-2000 under following in from which baatoN to shaamil done was is ?",
    option: ["ttkaalik uddeshy", "mdhykaaliin uddeshy", "diirghkaalik uddeshy", "All of the above"],
    answer: "All of the above"
},
{
    question: "maalths according to bddh'tii was population to controlled doing of Which of the following-from upaay appropriate are ?",
    option: ["naisrgik prtibNdh", "nirodhk prtibNdh", "both", "above-mentioned in any not"],
    answer: "nirodhk prtibNdh"
},
{
    question: "India of which vishvvidyaaly from smaajshaastr of pddh'aaii start huyii thii ?",
    option: ["bmbii vishvvidyaaly", "klkttaa vishvvidyaaly", "pttnaa vishvvidyaaly", "dillii vishvvidyaaly"],
    answer: "bmbii vishvvidyaaly"
},
{
    question: "smaajshaastr of utptti which bhaassaaoN from was is ?",
    option: ["laittin and French", "laittin and griik", "laittin and aNgrejii", "griik and aNgrejii"],
    answer: "laittin and griik"
},
{
    question: "following in from kisko ngriikrnn promotion detii is ?",
    option: ["gumnaamitaa", "bhiidd'", "pollution", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "Which of the following India of most more ngriiliver raajy is ?",
    option: ["pshcim bNgaal", "mhaaraassttr", "aadhr prdesh", "kerl"],
    answer: "mhaaraassttr"
},
{
    question: "shhriikrnn of lkssnn is –",
    option: ["vyaapaar in development", "one shhr of caaroN or keNdroN of development", "rural from urban prvsn", "All of the above"],
    answer: "All of the above"
},
{
    question: "dhrm nirpeksstaa of meaning what is ?",
    option: ["vibhinn dhrmoN of sh astitv", "other dhrmo towards shrddhaa", "raajy of apnaa any dhrm n honaa is", "All of these"],
    answer: "All of these"
},
{
    question: "2001 of jngnnnaa according to India in prti 1000 man on women of sNkhyaa is –",
    option: ["967", "933", "947", "955"],
    answer: "933"
},
{
    question: "1931 in Indian national kaaNgres of adhiveshn which place on was thaa ?",
    option: ["kraacii", "laahaur", "dillii", "klkttaa"],
    answer: "kraacii"
},
{
    question: "saamudaayik phcaan what occurs ?",
    option: ["arjit", "prdtt", "arjit v prdtt both", "None of these"],
    answer: "prdtt"
},
{
    question: "following in from who ‘rural-ngriiy saatvy’ of avdhaarnnaa of development in yogdaan given ?",
    option: ["es0 sii0 duube0", "sorokin", "reddphiildd", "koNmtt"],
    answer: "reddphiildd"
},
{
    question: "India in family niyojn kaarykrm when implemented done was ?",
    option: ["1948", "1950", "1952", "1954"],
    answer: "1952"
},
{
    question: "women of most more percent which raajy in is ?",
    option: ["bihaar", "pshcim bNgaal", "uttr prdesh", "kerl"],
    answer: "kerl"
},
{
    question: "human society and sNskRti of history where from start is ?",
    option: ["village from", "shhr from", "ngr from", "None of these"],
    answer: "village from"
},
{
    question: "Indian society of history how many years of period of is ?",
    option: ["2000 year", "3000 year", "4000 year", "5000 year"],
    answer: "4000 year"
},
{
    question: "Which of these-sii characteristic village of is not ?",
    option: ["agricultural vyfaty", "ekaakii family", "sjaatiiytaa", "ruuddh'ivaaditaa"],
    answer: "ruuddh'ivaaditaa"
},
{
    question: "among these from population growth of prinnaam which is not ?",
    option: ["food problem", "aavaas of problem", "employment of problem", "tthNdde weather in srdii spread"],
    answer: "tthNdde weather in srdii spread"
},
{
    question: "upniveshvaad which soc of prtiphl is ?",
    option: ["saamraajyvaad", "smaajvaad", "maanvtaavaad", "aNtrraassttriiytaavaad"],
    answer: "saamraajyvaad"
},
{
    question: "India in brittish upniveshvaad establishment and iske vistaar in which shaayk thaa ?",
    option: ["loNrdd kaarnvaalis", "loNrdd klaaiv", "vaaren hesttigj", "above-mentioned sii"],
    answer: "above-mentioned sii"
},
{
    question: "ddemograaphii (jnaaNkikii) shbd use of sbbefore which vidvaan by was thaa ?",
    option: ["guiilaardd", "sorokin", "levis", "vaarkle"],
    answer: "guiilaardd"
},
{
    question: "‘rural areas of ngriiy kssetroN in privrtit being of prkriyaa to ngriikrnn called are’, this whose kthn is ?",
    option: ["pheyr caaildd", "em0 es0 e0 raav", "em0 en0 shriinivaas", "i0 eph0 brges"],
    answer: "i0 eph0 brges"
},
{
    question: "nii national population niiti when ghossit of gyii ?",
    option: ["1999", "2000", "2001", "2002"],
    answer: "2000"
},
{
    question: "smudaay of srvmhttvpuurnn lkssnn following in what is ?",
    option: ["hm bhaavnaa", "smaan bhuu-part", "saamudaayik bhaavnaa", "smaan niym"],
    answer: "saamudaayik bhaavnaa"
},
{
    question: "population suucii stNbh from whom judd'aa is ?",
    option: ["age and marriage sNrgram", "age and liNg sNrgram", "age and shrm force sNrgram", "age and saakssrtaa sNrgram"],
    answer: "age and liNg sNrgram"
},
{
    question: "population related to suugram obtained doing of primary method what is ?",
    option: ["senss", "srve method", "sempl method", "among these any not"],
    answer: "senss"
},
{
    question: "India in population in growth and ghntv direct form from determined is—",
    option: ["field of mhilaaoN of sNkhyaa by", "reproduction dr and death dr by", "desh of vibhinn bhaagoN in prvrjnvaiminy of by", "purussoN on Indian mhilaaoN of bauddhik shresstthtaa by"],
    answer: "reproduction dr and death dr by"
},
{
    question: "jnaaNkikii viknowledge is –",
    option: ["environment adhyyn of", "population adhyyn of", "forest adhyyn of", "water adhyyn of"],
    answer: "population adhyyn of"
},
{
    question: "among these which ngriiy smudaay characteristic of is ?",
    option: ["more population", "social variety", "sthaaniiy pRthkkrnn", "All of the above"],
    answer: "All of the above"
},
{
    question: "jnaaNkikii shbd use of sbbefore when was ?",
    option: ["sn 1855", "sn 1856", "sn 1857", "sn 1860"],
    answer: "sn 1855"
},
{
    question: "udaariikrnn, bhuumNddliikrnn of what type of tttv is ?",
    option: ["social", "economic", "raajnaitik", "saaNskRtik"],
    answer: "economic"
},
{
    question: "India in aniyNtrit population growth for uttrdaayii kaark is –",
    option: ["child-marriage", "raajniitik cetnaa", "economic development", "None of these"],
    answer: "child-marriage"
},
{
    question: "Indian population of history in which-saa year ‘grett ddivaaidd’ maanaa goes is ?",
    option: ["1901", "1921", "1951", "1961"],
    answer: "1921"
},
{
    question: "following in which this vishvaas does is ki population growth occurs ?",
    option: ["e0 ddyumo", "phreNk phettr", "eph0 es0 niitto", "yuu0 sttrenbrg"],
    answer: "eph0 es0 niitto"
},
{
    question: "vivekpuurnn population niiti of necessary tttv what is ?",
    option: ["family niyojn kaarykrm of prcaar and prsaar", "social vaataavrnn in change", "prvaasii-prvRti to protsaahn", "All of the above"],
    answer: "All of the above"
},
{
    question: "raassttrvaad means",
    option: ["normal social pRsstthbhuumi", "normal jaati pRsstthbhuumi", "normal bhaugolik pRsstthbhuumi", "None of these"],
    answer: "normal bhaugolik pRsstthbhuumi"
},
{
    question: "Which of the following Indian society characteristic of is ?",
    option: ["anektaa in ektaa", "sNskaaroN by smaajiikrnn", "purussaarth", "All of these"],
    answer: "All of these"
},
{
    question: "‘sosaaittii’ naamk book of rcyitaa which is ?",
    option: ["mekaaivr enndd pej", "pii0 jiisvrtt", "ec0 em0 joNnsn", "None of these"],
    answer: "mekaaivr enndd pej"
},
{
    question: "udaariikrnn from what meaning nikltaa is ?",
    option: ["smaajvaad", "mnussy of udaar honaa", "kaaphii unnti honaa", "mukt baajaar arrangement"],
    answer: "mukt baajaar arrangement"
},
{
    question: "sn 2001 of jngnnnaa according to India of rural population is approximately –",
    option: ["56 percent", "65 percent", "72 percent", "80 percent"],
    answer: "72 percent"
},
{
    question: "Indian national kaaNgres when was established was ?",
    option: ["dismbr, 1885 in", "dismbr, 1857 in", "dismbr, 1947 in", "dismbr, 1917 in"],
    answer: "dismbr, 1885 in"
},
{
    question: "”The Population of India & Pakistan” naamk book of lekhk which are ?",
    option: ["ddevis", "mrttn", "mirddl", "maalths"],
    answer: "ddevis"
},
{
    question: "cmpaarnn in niil aaNdoln’ when aarmbh was ?",
    option: ["1917 AD", "1918 AD", "1919 AD", "None of these"],
    answer: "1917 AD"
},
{
    question: "woman-man anupaat which raajy in most less is ?",
    option: ["bihaar", "pshcim bNgaal", "udd'iisaa", "tmilnaaddu"],
    answer: "bihaar"
},
{
    question: "Which of the following national ekiikrnn in baadhk is ?",
    option: ["dhrmnirpeksstaa", "saaNprdaayiktaa", "both", "above-mentioned in from any not"],
    answer: "saaNprdaayiktaa"
},
{
    question: "bihaar in smaajshaastr of pddh'aaii srvprthm which vishvvidyaaly in start was thii ?",
    option: ["pttnaa vishvvidyaaly", "muNger vishvvidyaaly", "paattliputr vishvvidyaaly", "bhaaglpur vishvvidyaaly"],
    answer: "pttnaa vishvvidyaaly"
},
{
    question: "agst koNmtt of guruu which the ?",
    option: ["mekaaiivr", "arstuu", "seNtt saaimn", "maarks"],
    answer: "seNtt saaimn"
},
{
    question: "who said, “smaajshaastr society of viknowledge is” ?",
    option: ["vaardd", "mekaaiivr", "giddigs", "speNsr"],
    answer: "vaardd"
},
{
    question: "“poNjittiv philaasphii” naamk book of rcyitaa which the ?",
    option: ["koNmtt", "sorokin", "maarks", "hiigle"],
    answer: "koNmtt"
},
{
    question: "bmbii vishvvidyaaly in smaajshaastr department establishment kinkii adhyksstaa in was ?",
    option: ["jii0es0ghurye", "paittrik gidds", "aar0ke0mukhrjii", "ddii0en0mukhrjii"],
    answer: "paittrik gidds"
},
{
    question: "Which of these Indian sNskRti of muul element is ?",
    option: ["aadhyaatmvaad", "krm sNbNdhii vishvaas", "saamuuhiktaa", "these all"],
    answer: "these all"
},
{
    question: "Which of the following society characteristic of is not ?",
    option: ["society muurt is", "privrtnshiiltaa", "paarsprik dependence", "paarsprik awareness"],
    answer: "society muurt is"
},
{
    question: "who said, “society sNghrss mishrit cooperation is” ?",
    option: ["bogaardds", "maikaaiivr", "agst koNmtt", "joNrj simel"],
    answer: "maikaaiivr"
},
{
    question: "who said, “each person this jaantaa is ki ngr what is, kintu any ne also sNtossjnk pribhaassaa not dii is” ?",
    option: ["brgel", "ennddrsn", "bil koNks", "mekaaiivr"],
    answer: "brgel"
},
{
    question: "which prmukh aitihaasik ghttnaa from India in raassttrvaad of bhaavnaa of udy was ?",
    option: ["1857 of sipaahii vidroh", "India chodd'o aandoln", "ashyog aandoln", "sviny avjnyaa aandoln"],
    answer: "1857 of sipaahii vidroh"
},
{
    question: "‘vaanprsth aashrm’ aashrm arrangement of which saa level is ?",
    option: ["prthm", "dvitiiy", "tRtiiy", "cturth"],
    answer: "tRtiiy"
},
{
    question: "bNgaal in svdeshii aandoln who aarmbh done ?",
    option: ["raajnaaraaynn bsu", "raamsiNh kuukaa", "vaasudev joshii", "mhaatmaa gaaNdhii"],
    answer: "raajnaaraaynn bsu"
},
{
    question: "India of vrtmaan aabaadii how many is ?",
    option: ["one arb of above", "one arb from below", "100 lakh", "None of these"],
    answer: "one arb of above"
},
{
    question: "following in from India of which raajy in saakssrtaa dr most less is ?",
    option: ["uttr prdesh", "jhaarkhnndd", "mdhy prdesh", "bihaar"],
    answer: "bihaar"
},
{
    question: "India in jnaadhiky of muul cause what is ?",
    option: ["environment", "social – saaNskRtik kaark", "reproduction power", "None of these"],
    answer: "reproduction power"
},
{
    question: "nii national population niiti when ghossit of gyii ?",
    option: ["1999 ii. in", "2000 ii. in", "2001 ii. in", "2002 ii. in"],
    answer: "2000 ii. in"
},
{
    question: "India in prthm times jngnnnaa when was thaa ?",
    option: ["1873", "1872", "1856", "1874"],
    answer: "1872"
},
{
    question: "alpsNkhyk one",
    option: ["saamjshaastriiy sNklpnaa is", "gnnitiiy sNklpnaa is", "raajnaitik sNklpnaa is", "mnovaiknowledgeik sNklpnaa is"],
    answer: "raajnaitik sNklpnaa is"
},
{
    question: "sexual vissmtaa of smbndh is",
    option: ["social values from", "economicii from", "raajnaitik values from", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "who sexual asmaantaa of seven type of ullekh done is ?",
    option: ["paannikr", "mjuumdaar", "duube", "aamrtysen"],
    answer: "aamrtysen"
},
{
    question: "rural and ngriiy society between following in which aNtr of basis is ?",
    option: ["jnsNkhyaatmk basis", "smudaay of aakaar", "social gtishiiltaa of prkRti", "All of the above"],
    answer: "All of the above"
},
{
    question: "ttii.of. ummn ne sNprdaayvaad of how many aayaamoN to rekhaaNkit done is ?",
    option: ["two aayaamoN to", "four aayaamoN to", "six aayaamoN to", "eight aayaamoN to"],
    answer: "two aayaamoN to"
},
{
    question: "reddikl naariivaad according to sexual asmaantaa of muul cause what is ?",
    option: ["pitRsttaa is", "maatRsttaa is  / ", "both in any also not", "not kh can"],
    answer: "pitRsttaa is"
},
{
    question: "social class one smudaay of any part is jo social condition of basis on shess part from pRthk done jaa ske  /  this kthn whose is ?",
    option: ["oNgbrn and nimkoNph", "maikaaivr and pej", "bogaardds", "goNn ec ttainnddl"],
    answer: "maikaaivr and pej"
},
{
    question: "raassttr from abhipraay one jaati athvaa vNshgt vishesstaaoN which human sNgtthn is  /  this kthn whose is ?",
    option: ["brges", "maikaaivr and pej", "liikoNk", "bogaardds"],
    answer: "brges"
},
{
    question: "Indian society of vibhaajn of aadhaaroN on was is, this vibhaajn only is called",
    option: ["smudaay", "upniveshvaad", "raassttrvaad", "class"],
    answer: "smudaay"
},
{
    question: "economic basis on society how many vrgoN in vibhkt is ?",
    option: ["four", "five", "three", "two"],
    answer: "three"
},
{
    question: "2011 of jngnnnaa according to which raajy of population ghttii is ?",
    option: ["bihaar", "mhaaraassttr", "naagaalainndd", "sikkim"],
    answer: "naagaalainndd"
},
{
    question: "India in most more population pnl which raajy is",
    option: ["pshcim bNgaal", "jhaarkhNdd", "bihaar", "chttiisgddh'"],
    answer: "pshcim bNgaal"
},
{
    question: "India in most more shikssit mhilaaoN which raajy is",
    option: ["mdhy prdesh", "kerl", "bihaar", "uttr prdesh"],
    answer: "kerl"
},
{
    question: "India in most less saakssrtaa which raajy is  / ",
    option: ["raajsthaan", "gujraat", "mdhy prdesh", "bihaar"],
    answer: "bihaar"
},
{
    question: "India of population world of population of kul what percentage is  / ",
    option: ["20 percent", "16 percent", "10 percent", "40 percent"],
    answer: "16 percent"
},
{
    question: "‘jnsaaNkhyikii’ shbd which language from liyaa was is ?",
    option: ["urduu", "sNskRt", "griik", "French"],
    answer: "griik"
},
{
    question: "population adhyyn to what called",
    option: ["nyuumesmettiks", "ddemegraaphii", "ipiigraaphii", "None of these"],
    answer: "ddemegraaphii"
},
{
    question: "jnaaNkikii (jnsaaNkhikii) of jnk said goes",
    option: ["maalths", "gurddlaaii", "joNn graantt", "Adam Smith"],
    answer: "joNn graantt"
},
{
    question: "population of dRsstti from India of world in which – saa place is ?",
    option: ["duusraa", "tiisraa", "paaNcvaaN", "aatthvaaN"],
    answer: "duusraa"
},
{
    question: "year 2011 of jngnnnaa according to India in saakssrtaa of dr (approximately) is",
    option: ["65 %", "68 %", "74 %", "76 %"],
    answer: "74 %"
},
{
    question: "India in phlii times In which year national population niiti ghossit of gyii ?",
    option: ["sn 1974 in", "sn 1976 in", "sn 1956 in", "sn 1982 in"],
    answer: "sn 1976 in"
},
{
    question: "following in from whose smbndh ‘population of svyN smaayojn cycle’ from is ?",
    option: ["Adam Smith", "caaildd", "maalths", "None of these"],
    answer: "Adam Smith"
},
{
    question: "India in family niyojn kaarykrm of shuruuaat of gyii",
    option: ["sn 1944 in", "sn 1952 in", "sn 1956 in", "sn 1960 in"],
    answer: "sn 1952 in"
},
{
    question: "following in from population of which priprekssy to ‘jnaaNkikiiy paargmn tri – striiy moNddl’ of name from go goes is ?",
    option: ["jnaakikii priprekssy", "smaajshaastriiy priprekssy", "economic priprekssy", "aitihaasik priprekssy"],
    answer: "aitihaasik priprekssy"
},
{
    question: "jnsaaNkhyikii of adhyyn in nin in from kise smmilit done was is ?",
    option: ["population of aakaar in change", "population of construction", "population of vitrnn", "None of these"],
    answer: "population of aakaar in change"
},
{
    question: "India in population growth of prmukh cause is",
    option: ["dhaarmik and bhaagyvaadii maanytaaoN of effect", "ignorance and aeducation", "above-mentioned both", "None of these"],
    answer: "above-mentioned both"
},
{
    question: "India in national population niiti (1976) in Which of the following – saa praavdhaan done was ?",
    option: ["marriage for nyuuntm age krmshH ldd'ke of 21 year and girl of 18 year determined of gyii", "kendriiy assistance of 8 % part family klyaann kaarykrm on expenditure doing of praavdhaan", "aupcaarik vidyaalyii education in population education of anivaarytaa", "All of the above"],
    answer: "kendriiy assistance of 8 % part family klyaann kaarykrm on expenditure doing of praavdhaan"
},
{
    question: "following in from maalths of population principle of maanytaa is",
    option: ["mnussy to jiivit keeping for dining necessary is", "agricultural in utptti hraas niym implemented is", "population necessary form from jiivikaa of saadhnoN by determined is", "All of the above"],
    answer: "All of the above"
},
{
    question: "who said “mnussy to this smjh lenaa should ki vh apnii griibii of svyN only cause is ?”",
    option: ["sorokin", "ricrdd ddevii", "brgel", "maalths"],
    answer: "maalths"
},
{
    question: "2001 of jngnnnaa according to India in prti 1000 man on women of sNkhyaa is",
    option: ["967", "933", "947", "955"],
    answer: "933"
},
{
    question: "which – sii pristhiti population growth for uttrdaayii is ?",
    option: ["social value", "life pddhti", "shaikssnnik level", "economic development"],
    answer: "shaikssnnik level"
},
{
    question: "Indian society of history how many years of period of is ?",
    option: ["2000 year", "3000 year", "4000 year", "5000 year"],
    answer: "3000 year"
},
{
    question: "among these from population growth of prinnaam which is not ?",
    option: ["food problem", "aavaas of problem", "employment of problem", "tthNdde weather in srdii spread"],
    answer: "tthNdde weather in srdii spread"
},
{
    question: "bihaar in berojgaarii bhttaa Which age group is given ?",
    option: ["21 from 31", "18 from 25", "18 from 27", "16 from 27"],
    answer: "21 from 31"
},
{
    question: "“combined family one such family is jismeN log smaan aavaas in remain are, one stove of bnaa khaate are, smaan smptti of hkdaar are and smaan puujaa–paatth in part lete haiN / ” combined family of such pribhaassaa who dii is?",
    option: ["iraavtiikaarve", "aaii 0 pii 0 desaaii", "e 0 aar 0 desaaii", "em 0 en 0 shriinivaas"],
    answer: "em 0 en 0 shriinivaas"
},
{
    question: "following in which jnjaatiiy dhrm of svruup is?",
    option: ["brhmvaad", "ttottmvaad", "ojhaagirii", "inmeNsbhii"],
    answer: "ttottmvaad"
},
{
    question: "priikssaa marriage which jnjaati in occurs?",
    option: ["muNddaa", "sNthaal", "naagaa", "bhiil"],
    answer: "bhiil"
},
{
    question: "India in anusuucit jaatiyoN for aarkssnn of praavdhaan which dhaaraa of under of gyii is?",
    option: ["dhaaraa-355", "dhaaraa-379", "dhaaraa-302", "dhaaraa-330"],
    answer: "dhaaraa-355"
},
{
    question: "following in which one jaati is?",
    option: ["vaishy", "raajpuut", "shuudr", "inmeNse all"],
    answer: "inmeNse all"
},
{
    question: "Indian social arrangement of important phn what is?",
    option: ["combined family", "jaati–arrangement", "dhrm", "inmeNse all"],
    answer: "inmeNse all"
},
{
    question: "following in which one institution is?",
    option: ["village", "raassttr", "marriage", "farmer sNgh"],
    answer: "marriage"
},
{
    question: "following in from India of which raajy in aadivaasii aabaadii srvaadhik is?",
    option: ["pshcim bNgaal", "chttiisgddh'", "uttr prdesh", "gujraat"],
    answer: "gujraat"
},
{
    question: "jaati–arrangement of utptti from smbndhit prjaatiiy principle towardspaadk Which of the following–saa vidvaan is",
    option: ["httttn", "rijle", "nesphiildd", "shriinivaas"],
    answer: "rijle"
},
{
    question: "Which of the following one institution is?",
    option: ["raassttr", "village", "family", "inmeNse all"],
    answer: "inmeNse all"
},
{
    question: "Which of the following jaati–arrangement of one maulik characteristic is not?",
    option: ["sNstrnn", "society of khnnddaatmk vibhaajn", "social gtishiiltaa", "antrvivaah"],
    answer: "social gtishiiltaa"
},
{
    question: "India of most bdd'aa jnjaatiiy group which is?",
    option: ["sNthaal", "muNddaa", "gaaro", "goNdd"],
    answer: "gaaro"
},
{
    question: "Indian sNvidhaan of which anucched of by loksbhaa anusuucit jaati and jnjaati of members for place aarkssit done was is?",
    option: ["anucched-334", "anucched-332", "anucched-330", "anucched-338"],
    answer: "anucched-330"
},
{
    question: "khs or khaasii bhupti marriage which jnjaati in is found?",
    option: ["sNthl", "ttoddaa", "muNddaa", "khs"],
    answer: "khs"
},
{
    question: "who said, ‘jaati one closed class is’",
    option: ["maiks vebr", "mjuumdaar and mdn", "rijle", "maikaaivr and pej"],
    answer: "mjuumdaar and mdn"
},
{
    question: "which saa aadivaasii society maatR prdhaan is?",
    option: ["sNthaal", "muNddaa", "bhiil", "inmeNse any not"],
    answer: "inmeNse any not"
},
{
    question: "which Indian society of most prmukh characteristic is?",
    option: ["vrnn arrangement", "anektaameN ektaa", "yjmaaniivyvsthaa", "inmeNsbhii"],
    answer: "inmeNsbhii"
},
{
    question: "Which of the following jnjaatiiy society of problem is not?",
    option: ["bhuumivilgaav", "chuaachuut", "( a ) and ( b ) both", "inmeNse any not"],
    answer: "( a ) and ( b ) both"
},
{
    question: "Which of the following family characteristic of is",
    option: ["saarvbhaumiktaa", "siimit aakaar", "bhaavaatmk basis", "inmeNse all"],
    answer: "inmeNse all"
},
{
    question: "Which of the following jnjaati characteristic of is?",
    option: ["normal bhuu–part", "normal language", "normal sNskRti", "inmeNsbhii"],
    answer: "inmeNsbhii"
},
{
    question: "following in from bnd striikrnn of udaahrnn which–saa is",
    option: ["class", "sttaa", "jaati", "All of the above"],
    answer: "jaati"
},
{
    question: "Which of the following from kaark Indian jaati arrangement in change of uttrdaayii is?",
    option: ["audyogikrnn", "pNcaaytiiraaj", "jjmaaniivyvsthaa", "prbhujaati"],
    answer: "pNcaaytiiraaj"
},
{
    question: "bhiil naamk jnjaati which raajy in nivaas does is?",
    option: ["asm", "prdesh", "pshcim bNgaal", "bihaar"],
    answer: "prdesh"
},
{
    question: "Which of the following jaati characteristic of is not?",
    option: ["sNstrnn", "antHvivaah", "purity", "khulaapn"],
    answer: "khulaapn"
},
{
    question: "‘caacaa’ naatedaarii of which shrennii of under comes is?",
    option: ["primary", "secondary", "tertiary", "inmeNse any not"],
    answer: "secondary"
},
{
    question: "Which of the following–saa naatedaarii from spsstt form from not comes is?",
    option: ["vNsh prmpraa", "marriage other relation", "prsthiti", "smkkss group"],
    answer: "marriage other relation"
},
{
    question: "jaati arrangement of utptti–sNbNdhii devtv of siddhaaNt which ved in vrnnit is?",
    option: ["athrvved", "saamved", "Rgved", "yjurved"],
    answer: "saamved"
},
{
    question: "Which of the following Indian ne jaajaatiyoN for ‘algaav of niiti’ of vkaalt of?",
    option: ["belii", "ghuriye", "elvin", "ddoN. mjuumdaar"],
    answer: "ddoN. mjuumdaar"
},
{
    question: "jnjaati smaajoN in following in from what not is found?",
    option: ["shrm–vibhaajn", "yuvaagRh", "mhilaakii aajaadii", "srl economy"],
    answer: "mhilaakii aajaadii"
},
{
    question: "ghumkuriyaa which jnjaati in is found?",
    option: ["muNddaa", "sNthaal", "uraaNv", "be"],
    answer: "uraaNv"
},
{
    question: "jaati arrangement of vyaafatyaartyk siddhaaNt towardspaadk which is?",
    option: ["rijle", "ghuriye", "nesphiildd", "maarks"],
    answer: "rijle"
},
{
    question: "jaati of basis what is?",
    option: ["bhaagy", "krm", "punrjnm", "birth"],
    answer: "birth"
},
{
    question: "Which of the following dvij not khlaate are?",
    option: ["braahmnn", "ksstriy", "vaishy", "shuudr"],
    answer: "shuudr"
},
{
    question: "which society in hutu marriage of prcln is?",
    option: ["hinduusmaaj in", "jnjaatiiy society in", "muslim society in", "inmeNse any not"],
    answer: "jnjaatiiy society in"
},
{
    question: "muslim vibaah is one",
    option: ["sNskaar", "smjhautaa", "mitrtaa", "inmeNse any not"],
    answer: "smjhautaa"
},
{
    question: "Which of the following hinduu marriage of uddeshy is",
    option: ["dhaarmik krttvy", "putr obtaining", "rti", "inmeNse all"],
    answer: "inmeNse all"
},
{
    question: "class arrangement is one",
    option: ["khuliivyvsthaa", "bnd arrangement", "n only khulii n only bnd", "inmeNse any not"],
    answer: "khuliivyvsthaa"
},
{
    question: "social change of taatpry is",
    option: ["social sNbNdhoN meNprivrtn", "social smuuhoN in change", "social antH kriyaaoN meNprivrtn", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "shplaayn marriage, marriage of one type is–",
    option: ["jnjaatiiy society in", "hinduusmaaj in", "muslim society in", "iisaaii society in"],
    answer: "jnjaatiiy society in"
},
{
    question: "who said dhrm any aadhyaatmik power in vishvaas is?",
    option: ["ttaaylr", "phrejr", "dukhiim", "moNlinoskii"],
    answer: "ttaaylr"
},
{
    question: "Which of the following one class is not?",
    option: ["doctor", "shikssk", "braahmnn", "vkiil"],
    answer: "braahmnn"
},
{
    question: "priviikssaa marriage, marriage of one type is",
    option: ["jnjaatiiy society in", "hinduusmaaj in", "muslim society in", "iisaaii society in"],
    answer: "jnjaatiiy society in"
},
{
    question: "hinduuoN in marriage of how many svruup maane go h",
    option: ["ten", "five", "eight", "four"],
    answer: "eight"
},
{
    question: "”India in marriage and family” who likhii?",
    option: ["e.em. shaah", "jii.es. ghurye", "of.em. kpaaddiyaa", "ddblyuu. aaii. vaarnr"],
    answer: "of.em. kpaaddiyaa"
},
{
    question: "ddenjrs ddrgs ektt In which year in paarit done was?",
    option: ["1930", "1931", "1938", "1933"],
    answer: "1938"
},
{
    question: "family social control of what type of saadhnoN of under comes is",
    option: ["aupcaarik control", "anaupcaarik control of means", "above-mentioned both", "None of these"],
    answer: "anaupcaarik control of means"
},
{
    question: "“family fixed yaun smbndhoN by pribhaassit one such group is, jo children of jnn and paaln–nutrition of arrangement does hai / ” above-mentioned pribhaassaa dii is",
    option: ["lsuumeyr ne", "bogaardds ne", "maikaaivr and pej ne", "brges and loNk ne"],
    answer: "maikaaivr and pej ne"
},
{
    question: "which vidvaan ne family to ‘human svbhaav of podhikaa’ said is?",
    option: ["mrddoNk", "caarls kuule", "maikaaivr", "inmeNse any not"],
    answer: "caarls kuule"
},
{
    question: "Which of these jaati arrangement of den is?",
    option: ["shossnn", "asmaantaa", "jaativaad", "inmeNse all"],
    answer: "inmeNse all"
},
{
    question: "what type of family to ‘two–piiddh'ii family’ said goes is?",
    option: ["bRhtsNyukt family", "combined family", "ekaakiiprivaar", "inmeNse any not"],
    answer: "ekaakiiprivaar"
},
{
    question: "following in from family of prkaary is",
    option: ["sntaanotptti", "yaun icchaaoN kiipuurti", "prjaatikii nirntrtaa", "inmeNse all"],
    answer: "inmeNse all"
},
{
    question: "”naatedaarii social uddeshyoN for sviikRt vNsh smbndh is, jo ki social smbndhoN of prmpraagt smbndhoN of basis hai / ” above-mentioned kthn of smbndh is",
    option: ["rivrs", "jii.ddii. maaikel", "raiddkliph braaun", "mrddoNk"],
    answer: "raiddkliph braaun"
},
{
    question: "‘maanvshaastriiy shbdkoss’ naamk book of lekhk are",
    option: ["caarls vinik", "iraavtiikrve", "maikaaivr and pej", "aar. of. braaun"],
    answer: "caarls vinik"
},
{
    question: "moNrgn ne naatedaarii sNjnyaaoN of how many prkaaroN of ullekh done is?",
    option: ["one", "two", "three", "four"],
    answer: "two"
},
{
    question: "this whose kthn is ki “prihaas smbndhoN of by naatedaaroN between shjtaapuurnn v ghnisstth maitriipuurnn smbndhoN of development is / ”",
    option: ["aar.of. braaun", "je. phrejr", "vesttrmaark", "ttoNylr"],
    answer: "vesttrmaark"
},
{
    question: "combined family arrangement paayii goes is",
    option: ["industrial society in", "ngriiy society in", "rural society in", "inmeNse any not"],
    answer: "rural society in"
},
{
    question: "combined family of which–sii characteristic is?",
    option: ["bdd'aaaakaar", "normal smptti", "normal nivaas", "inmeNse all"],
    answer: "inmeNse all"
},
{
    question: "praayH combined family krtaa which is?",
    option: ["sbsebujurg man", "sbsebujurg woman", "pddh'aa–likhaa person", "jyesstth putr"],
    answer: "sbsebujurg man"
},
{
    question: "following in what combined family of prkaary is not?",
    option: ["social security", "economic security", "vyktivaaditaa", "mental security"],
    answer: "vyktivaaditaa"
},
{
    question: "jnmmuulk family and reproduction muulk family of vyaakhyaa which vidvaan ne of is?",
    option: ["linnttn", "ddevis", "maikaaivr", "bogaardds"],
    answer: "ddevis"
},
{
    question: "”one jnjaati as field, language, saaNskRtik smruuptaa and one suutr in baaNdhne which social sNgtthn to lete are, jismeN gotr or village smmilit are / ” jnjaati of said pribhaassaa dii is",
    option: ["hrbrtt spensn", "caarls vinik", "ddii.en. mjuumdaar", "maikaaivr and pej"],
    answer: "caarls vinik"
},
{
    question: "following in from normal nissedh ‘(ttev) of smbndh is",
    option: ["khaan–paan from", "marriage from", "vyfaty from", "these in all from"],
    answer: "these in all from"
},
{
    question: "pro. es.sii. dube ne bhaugolik dRsstti from Indian jnjaatiyoN to following in from how many bhaagoN in vibhkt done is?",
    option: ["two", "three", "four", "five"],
    answer: "four"
},
{
    question: "following in from shikaar and food sNgrhnn jnjaati group hai / ",
    option: ["kukaa", "munnddaa", "bhiil", "goNdd"],
    answer: "kukaa"
},
{
    question: "which maanvshaastrii ne on–sNskRtigrhnn to jnjaati sNskRti of vighttn for uttrdaayii maanaa is?",
    option: ["em.en. shriinivaas", "raiddkliph braaun", "kiNgsle ddevis", "mjuumdaar and mdaan"],
    answer: "mjuumdaar and mdaan"
},
{
    question: "which sNvidhaan sNshodhn of tht anusuucit jaati, jnjaati atyaacaar nirodhk Act paarit done was?",
    option: ["32 veN", "65 veN", "44 veN", "66 veN"],
    answer: "65 veN"
},
{
    question: "sNvidhaan of which anucched of under this praavdhaan done was ki smbndhit raajy of raajypaal, raassttrpti of anumti from any also jnjaati to anusuucit jnjaati in smmilit by can is?",
    option: ["anucched-342", "anucched-338", "anucched-339", "All of the above"],
    answer: "anucched-342"
},
{
    question: "jnjaatiyoN to ‘pichdd'e hinduu’ khkr which smaajshaastrii ne smbodhit done is?",
    option: ["aar.of. mukhrjii", "jii.es. ghurye", "aar.of. braaun", "es.sii. dube"],
    answer: "jii.es. ghurye"
},
{
    question: "bii.es. guhaa ne uttrii–puurvii field of under which siimaavrtii raajy to smmilit done is?",
    option: ["mdhy prdesh", "jhaarkhnndd", "puurviipNjaab", "aandhr prdesh"],
    answer: "puurviipNjaab"
},
{
    question: "following in from jnjaati characteristic of is",
    option: ["normal sNskRti", "one special name", "bhirvivaahiismuuh", "All of the above"],
    answer: "All of the above"
},
{
    question: "following in from drvidd' bhaassaayii family from smbndhit jnjaati is",
    option: ["goNdd", "uraaNv", "( a ) and ( b ) both", "inmeNse any not"],
    answer: "( a ) and ( b ) both"
},
{
    question: "Indian society in social striikrnn of buniyaadii basis what is",
    option: ["money and smptti", "jaati", "family", "dhrm"],
    answer: "dhrm"
},
{
    question: "prbhujaati of avdhaarnnaa den is",
    option: ["pii.en. prbhu of", "mjuumdaar of", "rijlekii", "shriinivaas of"],
    answer: "shriinivaas of"
},
{
    question: "following in from who jaati prthaa of utptti on prjaatiiy dRssttikonn prstut done is?",
    option: ["moNrgn", "rijle", "nesphiildd", "e.aar. desaaii"],
    answer: "rijle"
},
{
    question: "Which of the following jnjaati characteristic of is?",
    option: ["normal bhuubhaag", "normal language", "normal sNskRti", "inmeNse all"],
    answer: "inmeNse all"
},
{
    question: "following in from who social–dhaarmik sudhaar aandolnoN in agrnnii bhuumikaa nibhaayii?",
    option: ["raajaaraammohn raay", "dyaannd srsvtii", "above-mentioned both", "above-mentioned in from any not"],
    answer: "above-mentioned both"
},
{
    question: "following in from who Indian jnjaatiyoN for ‘algaav of niiti’ of vkaalt of?",
    option: ["belii", "ghuriye", "elvin", "mjuumdaar"],
    answer: "elvin"
},
{
    question: "jnjaati smaajoN in following in from what not is found?",
    option: ["shrm vibhaajn", "yuvaagRh", "mhilaakii aajaadii", "srl economy"],
    answer: "shrm vibhaajn"
},
{
    question: "Government of India by ‘dhej nirodhk Act’ In which year paarit done was?",
    option: ["sn1961 in", "sn1965 in", "sn1968 in", "sn1971 in"],
    answer: "sn1961 in"
},
{
    question: "uraaNv nivaasii are raajy ke / ",
    option: ["bihaar", "jhaarkhnndd", "oddishaa", "mdhy prdesh"],
    answer: "jhaarkhnndd"
},
{
    question: "yuvaa sNgtthn paayaajaataa is",
    option: ["rural society in", "ngriiy society in", "jnjaatiiy society in", "industrial society in"],
    answer: "jnjaatiiy society in"
},
{
    question: "which problem jnjaatiiy life from smbndhit is not?",
    option: ["chuuaachuut", "yuvaaaavaasshaalaa", "jaatisNstrnn kaavikaas", "bhuuminisskaasn"],
    answer: "chuuaachuut"
},
{
    question: "one vicaardhaaraa as ‘jaati–arrangement’ of adhyyn following in from which smaajshaastrii ne done is?",
    option: ["luii ddyuumaaN", "em.es. shriinivaas", "maikm mairiytt", "inmeNse all"],
    answer: "inmeNse all"
},
{
    question: "jaati arrangement in change for Which of the following–saa cause uttrdaayii is?",
    option: ["educationof prsaar", "dhrm of effect meNkmii", "pshcimiisbhytaa of effect", "inmeNse all"],
    answer: "inmeNse all"
},
{
    question: "which smaajshaastrii ne ‘jaati’ of avdhaarnnaa use of ‘prjaati’ of sndrbh in done is?",
    option: ["maiks vebr", "abbedduvoNys", "ketkr", "rijle"],
    answer: "abbedduvoNys"
},
{
    question: "this kthn whose is ki “when one class approximately full form from vNshaanukrmnn on aadhaarit is, then use hm jaati called are”?",
    option: ["caarls kuule", "luii ddyuumaa", "em.en. shriinivaas", "aandrebetaaii"],
    answer: "caarls kuule"
},
{
    question: "‘dvidhr prtikuultaa of principle’ given is",
    option: ["es.sii. dube", "em.en. shriinivaas", "aandre betaaii", "luii ddyuumaa"],
    answer: "luii ddyuumaa"
},
{
    question: "sr hrbrtt rijle of leadership in In which year jaati aadhaarit jngnnnaa aayojit of gyii?",
    option: ["sn1971 in", "sn1981 in", "sn1901 in", "sn1921 in"],
    answer: "sn1901 in"
},
{
    question: "following in from jaati arrangement characteristic of is",
    option: ["khaan–paan and social shvaas on prtibndh", "khuliivyvsthaa", "one antrvivaahii group", "inmeNse all"],
    answer: "khaan–paan and social shvaas on prtibndh"
},
{
    question: "naatedaarii of how many shrenniyaaN occursN?",
    option: ["two", "three", "four", "five"],
    answer: "three"
},
{
    question: "dhrm of utptti of ‘aatmvaad’ of principle who given?",
    option: ["ttaaylr", "durthiim", "maiks muulr", "phrejr"],
    answer: "ttaaylr"
},
{
    question: "Which of the following jaativaad of dussprinnaam is?",
    option: ["audyaugik prtisprdhaa", "social smsyaaoN meNvRddhi", "jjmaaniivyvsthaa", "naariieducation"],
    answer: "social smsyaaoN meNvRddhi"
},
{
    question: "Which of the following bihaar in anusuucit jaati is not?",
    option: ["paasvaan", "maaNjhii", "rvidaas", "kurmii"],
    answer: "kurmii"
},
{
    question: "Indian society how many aashrmoN in vibhaajit thaa?",
    option: ["four", "five", "three", "seven"],
    answer: "four"
},
{
    question: "‘daadii’ naatedaarii of which shrennii of under aatii is?",
    option: ["primary", "secondary", "tertiary", "inmeNse any not"],
    answer: "secondary"
},
{
    question: "Which of the following–saa one vrnn is?",
    option: ["braahmnn", "yaadv", "tyaagii", "agrvaal"],
    answer: "braahmnn"
},
{
    question: "which society in ‘paishaac marriage’ of prcln thaa?",
    option: ["hinduusmaaj in", "muslim society in", "sikh society in", "aadivaasii society in"],
    answer: "hinduusmaaj in"
},
{
    question: "mrddoNk according to marriage of what uddeshy is?",
    option: ["yaun icchaa of puurti", "bccoNkaa paaln nutrition", "economic cooperation", "inmeNse all"],
    answer: "yaun icchaa of puurti"
},
{
    question: "‘ahiNsaa prmo dhrmH’ which dhrm of education is?",
    option: ["hinduu", "bauddh", "sikh", "jain"],
    answer: "hinduu"
},
{
    question: "Which of the following jaati is not?",
    option: ["braahmnn", "shuudr", "kushvaahaa", "rvidaas"],
    answer: "shuudr"
},
{
    question: "domestic hiNsaa of what taatpry is?",
    option: ["rural hiNsaa", "saamudaayik hiNsaa", "dhaarmik hiNsaa", "family hiNsaa"],
    answer: "family hiNsaa"
},
{
    question: "Which of the following jnjaati is not?",
    option: ["bhiil", "sNthaal", "khaasii", "caupaal"],
    answer: "caupaal"
},
{
    question: "jaati of prjaatiiy principle who prtipaadit done?",
    option: ["nesphiildd", "es 0 sii 0 duube", "hokaartt", "hrbrtt rijle"],
    answer: "nesphiildd"
},
{
    question: "Which of the following one class is not?",
    option: ["prdhaanaacaary", "cikitsk", "nyaayaadhiish", "raajpuut"],
    answer: "raajpuut"
},
{
    question: "hinduu marriage of which svruup in one jodd'e bail and gaay of demand is done?",
    option: ["daiv marriage", "brhm marriage", "aarss marriage", "prjaapty marriage"],
    answer: "aarss marriage"
},
{
    question: "hinduu marriage of Which of the following–saa type amaany is?",
    option: ["brhm marriage", "daiv marriage", "prjaapty marriage", "asur marriage"],
    answer: "asur marriage"
},
{
    question: "jnjaatiyoN in life saathii obtained doing of how many pddhtiyaaN are?",
    option: ["eight", "seven", "five", "eleven"],
    answer: "seven"
},
{
    question: "society production of following in from from whom is?",
    option: ["vyktiyoNse", "sNsthaaoNse", "social sNbNdhoN from", "inmeNse all"],
    answer: "inmeNse all"
},
{
    question: "praaciin Indian society how many years in vibhaajit thaa?",
    option: ["three", "four", "five", "two"],
    answer: "four"
},
{
    question: "hinduu marriage of which–saa type prspr prem on aadhaarit is?",
    option: ["gNdhrv", "prjaapty", "asur", "raaksss"],
    answer: "gNdhrv"
},
{
    question: "Which of the following naatedaarii of riitiyaaN is not?",
    option: ["prihaar", "vrgiikRt sNjnyaaeN", "prihaas smbndh", "maadhymik sNbodhn"],
    answer: "vrgiikRt sNjnyaaeN"
},
{
    question: "following in from who jaati arrangement of utptti of dhaarmik principle of vkaalt of?",
    option: ["hokaartt and senaartt", "hbrtt rijle", "mjuumdaar and mdaan", "jii0 es0 ghurye"],
    answer: "hokaartt and senaartt"
},
{
    question: "which society in sevaa marriage of prcln is?",
    option: ["hinduusmaaj in", "muslim society in", "jnjaatiiy society in", "sikh society in"],
    answer: "jnjaatiiy society in"
},
{
    question: "baajaar what is ?",
    option: ["one institution", "one social group", "one smudaay", "None of these"],
    answer: "None of these"
},
{
    question: "baajaar which ciij of center is ?",
    option: ["vinimy", "khpt", "vitrnn", "All of the above"],
    answer: "All of the above"
},
{
    question: "two pkssoN of of mdhy being which aicchik, vaidhaanik and paarsprik money of hstaaNtrnn to vinimy called haiN /  this whose kthn is ?",
    option: ["Marshall", "thoNms", "Smith", "ddoN. mjuumdaar"],
    answer: "Marshall"
},
{
    question: "one item from duusrii item of direct vinimy to only item vinimy are khte /  this kthn whose is ?",
    option: ["Marshall", "thoNms", "Adam Smith", "bleyr"],
    answer: "thoNms"
},
{
    question: "ghoraaii which raajy in is ?",
    option: ["bihaar", "jhaarkhNdd", "mdhy prdesh", "chttiisgddh'"],
    answer: "chttiisgddh'"
},
{
    question: "‘d velth of neshns’ of rcyitaa are",
    option: ["maiks vebr", "Adam Smith", "kaarl maarks", "koNlins"],
    answer: "Adam Smith"
},
{
    question: "baajaar condition from meaning vinimy of any also vissy for use drv in bdlne of those tmaam avsroN from is, jinke baare in baajaar condition in shbhaagii to address is ki ve unheN obtained are and ve daamoN and prtisprddhaa of dRsstti from unkii mnovRttiyoN for sndrbhpuurnn haiN /  baajaar of said pribhaassaa dii is",
    option: ["maiks vebr", "sijvik", "Adam Smith", "maikaaivr and pej"],
    answer: "sijvik"
},
{
    question: "‘adRsh hand’ of avdhaarnnaa of smbndh which society vaiknowledgeik from is ?",
    option: ["aar. of. braaun", "Marshall", "spensr", "Smith"],
    answer: "Smith"
},
{
    question: "praaciin kaal in India in ‘vinimy bil’ or hunnddii of prcln what type of arrangement from smbndhit thaa ?",
    option: ["baiNkiNg arrangement from", "jaati arrangement from", "class arrangement from", "among these from any from not"],
    answer: "baiNkiNg arrangement from"
},
{
    question: "rural India in ‘item vinimy’ which name from go goes is ? on aadhaarit economy to",
    option: ["stii prthaa", "jjmaanii prthaa", "jauhr prthaa", "these all"],
    answer: "jjmaanii prthaa"
},
{
    question: "vh baajaar jo any also type of national athvaa other prevention from puurnntH mukt is, is called is",
    option: ["mukt or khulaa baajaar", "bnd baajaar", "above-mentioned both", "None of these"],
    answer: "mukt or khulaa baajaar"
},
{
    question: "this whose kthn is ki all economic arrangements social arrangements also haiN /  each production method special production smbndhoN from made occurs, jo anttH one special class sNrgram production of does hai / ",
    option: ["joNrj simail", "maiks vebr", "kaarl maarks", "luiis vrth"],
    answer: "kaarl maarks"
},
{
    question: "India in bhuumnnddliikrnn of aarmbh which dshk from maanaa goes is ?",
    option: ["1960 ii. in", "1990 ii. in", "1980 ii. in", "None of these"],
    answer: "1990 ii. in"
},
{
    question: "vh prkriyaa jismeN any also item jo puurv in baajaar of hissaa not thii, vh ab baajaar in bikne which item bn gyii is arthaat vh ab baajaar of one hissaa bn gyii is, khlaatii is",
    option: ["pnnyiikrnn", "puuNjiivaad", "upbhog", "udaarvaad"],
    answer: "pnnyiikrnn"
},
{
    question: "following in from baajaar of prmukh characteristic is",
    option: ["baajaar in vstuoN of value uskii demand and puurti by determined is done / ", "baajaar in all sevaaeN also other vstuoN of bhaaNti khriidii v becii goes hai / ", "baajaar in shrm vibhaajn and vishissttiikrnn is foundN / ", "All of the above"],
    answer: "All of the above"
},
{
    question: "following in from baajaar of svruup is",
    option: ["saaptaahik baajaar (haatt)", "industrial baajaar", "full and apuurnn baajaar", "these all"],
    answer: "these all"
},
{
    question: "In which year child shrm on one national niiti bnaaii was ?",
    option: ["1986", "1991", "1948", "1952"],
    answer: "1986"
},
{
    question: "Which of the following vaishviikrnn of prmukh prerk are ?",
    option: ["baajaar of khoj", "praudyogikii, ilekttroNnik and kmpyuuttr nettvrk", "bhuraassttriiy investment", "All of the above"],
    answer: "All of the above"
},
{
    question: "India in In which year smekit child development sevaa kaarykrm praarNbh done was ?",
    option: ["1975", "1974", "2011", "1985"],
    answer: "1975"
},
{
    question: "child right preservation for kinheN nobel peace purskaar from smmaanit done was ?",
    option: ["mlaalaa yusuphjaaii", "kailaash styaarthii", "mdr tteresaa", "amrty sen"],
    answer: "kailaash styaarthii"
},
{
    question: "‘bcpn bcaao aandoln’ of sNsthaapk which are ?",
    option: ["kailaash styaarthii", "medhaa paattekr", "niiraa desaaii", "mdr tteresaa"],
    answer: "kailaash styaarthii"
},
{
    question: "jnjaatiyoN of pichdd'epn of following in which one kaark is ?",
    option: ["aeducation", "dhrm", "jNgl", "nshaakhorii"],
    answer: "aeducation"
},
{
    question: "muslim mhilaaoN to smptti of right of vivaad from whose name judd'aa was is ?",
    option: ["shaahbaano", "nuur phaatimaa", "shaabaanaa aajmii", "caaNd biibii"],
    answer: "shaahbaano"
},
{
    question: "The Government of India srvprthm alpsNkhyk aayog establishment In which year of ?",
    option: ["1978 ii. in", "1992 ii. in", "1999 ii. in", "1988 ii. in"],
    answer: "1978 ii. in"
},
{
    question: "chuaachuut to sNvidhaan of which anucched under prtibndhit done was is ?",
    option: ["anucched -23", "anucched -14", "anucched -17", "anucched -25"],
    answer: "anucched -17"
},
{
    question: "India of which praaNt in hinduu alpsNkhyk are ?",
    option: ["hriyaannaa", "pNjaab", "jmmuu – kshmiir", "kerl"],
    answer: "jmmuu – kshmiir"
},
{
    question: "following in from India of which raajy in iisaaiyoN of sNkhyaa srvaadhik is ?",
    option: ["bihaar", "mdhy prdesh", "tmilnaaddu", "kerl"],
    answer: "kerl"
},
{
    question: "following smuuhoN in from from whom aap India of most chottii dhaarmik alpsNkhyk smprdaay maante are ?",
    option: ["muslim", "iisaaii", "sikkh", "paarsii"],
    answer: "paarsii"
},
{
    question: "jaatiiy puurvaagrh of what meaning is ?",
    option: ["jaati vrgiikrnn", "jaati sNghrss", "any jaati in prvesh obtaining for done was pryaas", "any jaati from smbndhit avaiknowledgeik and wrong avdhaarnnaa"],
    answer: "any jaati from smbndhit avaiknowledgeik and wrong avdhaarnnaa"
},
{
    question: "bihaar in jtiiy tnaav of main cause is",
    option: ["jmiin", "phaishn", "education", "None of these"],
    answer: "jmiin"
},
{
    question: "hinduu marriage Act paarit was",
    option: ["1950 ii. in", "1954 ii. in", "1955 ii. in", "1976 ii. in"],
    answer: "1955 ii. in"
},
{
    question: "Government of India by anusuucit jaatiyoN of adhikRt anusuucii when ghossit of was ?",
    option: ["sn 1955", "sn 1950", "sn 1935", "sn 1952"],
    answer: "sn 1950"
},
{
    question: "other pichdd'aa class for government ne how much aarkssnn provide done is ?",
    option: ["33 percent", "27 percent", "11 percent", "44 percent"],
    answer: "27 percent"
},
{
    question: "Which of the following one social problem is ?",
    option: ["prem marriage", "ngriikrnn", "bhikssaavRti", "aadhunikiikrnn"],
    answer: "bhikssaavRti"
},
{
    question: "paarsns ne children of smaajiikrnn in",
    option: ["three avsthaaoN of ullekh done is", "three avsthaaoN of ullekh done is", "five avsthaaoN of ullekh done is", "six avsthaaoN of ullekh done is"],
    answer: "five avsthaaoN of ullekh done is"
},
{
    question: "Indian society in social striikrnn of buniyaad what is ?",
    option: ["money and smptti", "jaati", "family", "dhrm"],
    answer: "jaati"
},
{
    question: "Indian history of ks kaal to Indian woman jaati of ‘black yug’ said goes is ?",
    option: ["Rgvaidik kaal", "uttr vaidik kaal", "brittish kaal", "mdhy kaal"],
    answer: "mdhy kaal"
},
{
    question: "when vRddhoN for national niiti of ghossnnaa of was ?",
    option: ["1999 ii. in", "1998 ii. in", "1997 ii. in", "2000 ii. in"],
    answer: "1999 ii. in"
},
{
    question: "following in which Act of by vaivaahik sNbNdhoN establishment in dhrm and jaati of mddoN to vaidhaanik taur on smaapt done was is ?",
    option: ["stii prthaa nissedh Act, 1829", "hinduu vidhvaa punrvivaah Act, 1856", "hinduu women of sNpti on right Act, 1937", "special marriage Act, 1954"],
    answer: "special marriage Act, 1954"
},
{
    question: "‘mehr’ shbd which dhrm related to is ?",
    option: ["hinduu", "muslim", "sikkh", "None of these"],
    answer: "muslim"
},
{
    question: "‘punrjnm’ of avdhaarnnaa which dhrm related to is ?",
    option: ["hinduu", "islaam", "iisaaii", "All of these"],
    answer: "hinduu"
},
{
    question: "pichdd'aa class finance v development Corporation when was established of was ?",
    option: ["1992 ii. in", "2004 ii. in", "1995 ii. in", "2007 ii. in"],
    answer: "1992 ii. in"
},
{
    question: "national level on India in kul how many smudaayoN to alpsNkhykoN as maanytaa dii was is ?",
    option: ["ten", "eight", "five", "four"],
    answer: "five"
},
{
    question: "India of kul population of what percentage hinduu are ?",
    option: ["82.42 %", "88.42 %", "77.92 %", "66.42 %"],
    answer: "82.42 %"
},
{
    question: "sNvidhaan of which anucched in jnjaatiyoN for naukriyoN in aarkssnn of praavdhaan is ?",
    option: ["335", "244", "341", "15"],
    answer: "335"
},
{
    question: "Indian society in social striikrnn of buniyaadii adhaar what is ?",
    option: ["money and smptti", "jaati", "vNsh", "dhrm"],
    answer: "jaati"
},
{
    question: "India in which praaNt in muslmaanoN of sNkhyaa srvaadhik is ?",
    option: ["aaNdhr prdesh", "kerl", "asm", "kshmiir"],
    answer: "kshmiir"
},
{
    question: "following in from kisko any one jaati to anusuucit jaati ghossit doing of right is ?",
    option: ["India of raassttrpti", "raajy of raajypaal", "anusuucit jaati aayukt", "kendriiy mNtriimNddl"],
    answer: "India of raassttrpti"
},
{
    question: "sNvidhaan of which anucched by loksbhaa in anusuucit jaati and anusuucit jnjaati of members for siitt of aarkssnn done was is ?",
    option: ["anucched -330", "anucched -332", "anucched -320", "anucched -338"],
    answer: "anucched -330"
},
{
    question: "sNvidhaan of which anucched in aspRshytaa nivaarnn of praavdhaan done was is ?",
    option: ["anucched -23", "anucched -17", "anucched–29", "anucched–25"],
    answer: "anucched -17"
},
{
    question: "anusuucit jnjaati to before following in which name from pukaaraa goes thaa ?",
    option: ["aadivaasii", "jNglii jaati", "vnjaati", "All of the above"],
    answer: "All of the above"
},
{
    question: "India in anusuucit jaatiyoN jnjaatiyoN for aarkssnn of praavdhaan sNvidhaan of which dhaaraa in done was is ?",
    option: ["dhaaraa 335", "dhaaraa 379", "dhaaraa 369", "dhaaraa 330"],
    answer: "dhaaraa 335"
},
{
    question: "2001 of jngnnnaa according to India in anusuucit jaati of sNkhyaa what percentage is ?",
    option: ["10 percent", "13 percent", "15 percent", "18 percent"],
    answer: "15 percent"
},
{
    question: "hinduu marriage of uddeshy dhrm, reproduction, riiti and kuch other daayitvoN of nirvhn is",
    option: ["puurnnt: correct is", "aaNshik form from correct is", "wrong is", "not kh can"],
    answer: "aaNshik form from correct is"
},
{
    question: "anusuucit jaatiyoN to aarkssnn is given, unkii",
    option: ["griibii of sNdrbh in", "economic aavshyktaaoN of sNdrbh in", "sNkhyaa of sNdrbh in", "following anusstthaanik condition of sNdrbh in"],
    answer: "following anusstthaanik condition of sNdrbh in"
},
{
    question: "which dhrm in marriage to one sNvidaa maanaa goes is ?",
    option: ["hinduu", "islaam", "sikh", "paarsii"],
    answer: "islaam"
},
{
    question: "Which of the following maadk agent vysn and mdypaan of cause is ?",
    option: ["sukh of icchaa", "niraashaa", "bad sNgt", "All of these"],
    answer: "All of these"
},
{
    question: "Which of the following pichdd'aa class aayog of adhykss the ?",
    option: ["kaakaa klelkr", "krpuurii tthaakur", "dhniklaal mNddl", "raam mnohr lohiyaa"],
    answer: "kaakaa klelkr"
},
{
    question: "public life in bhrssttaacaar following in from which dshaa related to is ?",
    option: ["naitik ptn from", "griibii from", "mdypaan from", "All of these"],
    answer: "All of these"
},
{
    question: "Which of the followingmaajik problem is not ?",
    option: ["child shrm", "bhrssttaacaar", "tskrii", "aadhunikiikrnn"],
    answer: "aadhunikiikrnn"
},
{
    question: "following in from In which year work of bdle cereals scheme start of was?",
    option: ["1975", "1976", "1977", "1948"],
    answer: "1977"
},
{
    question: "Which of the following one anusuucit jaati is not ?",
    option: ["mushr", "dusaadh", "rjk", "dhnuk"],
    answer: "rjk"
},
{
    question: "In which year sNsd in ”three tlaak” near was ?",
    option: ["2016", "2017", "2018", "2019"],
    answer: "2019"
},
{
    question: "In which year domestic hiNsaa law near was ?",
    option: ["2005", "2007", "1998", "2009"],
    answer: "2005"
},
{
    question: "combined raassttr sNgh by antrraassttriiy woman dshk when was ?",
    option: ["1975-85", "1980-90", "1985-95", "1990-2000"],
    answer: "1975-85"
},
{
    question: "who yaaNtrik ektaa and saavyvii ektaa of avdhaarnnaaoN of niruupnn done is ?",
    option: ["maiks vebr", "pairetto", "mrttn", "durkhiim"],
    answer: "durkhiim"
},
{
    question: "kssetrvaad of problem of muul cause is",
    option: ["economic bhinntaa", "saaNskRtik bhinntaa", "jaivikiiy bhinntaa", "naitik bhinntaa"],
    answer: "economic bhinntaa"
},
{
    question: "India in how many bhaassaaeN are  / ",
    option: ["179", "185", "220", "100"],
    answer: "179"
},
{
    question: "India in how many boliyaaN are ?",
    option: ["200", "444", "344", "544"],
    answer: "200"
},
{
    question: "hindii to raajbhaassaa of drjaa obtained was",
    option: ["14 September, 1950", "14 September 1949", "14 September, 1951", "14 September 1947"],
    answer: "14 September 1949"
},
{
    question: "pNjaab and hriyaannaa different – different raajy bnaa",
    option: ["1966 ii. in", "1953 ii. in", "1965 ii. in", "1980 ii. in"],
    answer: "1966 ii. in"
},
{
    question: "language of basis on aaNdhr prdesh when was established was ?",
    option: ["1955 ii. in", "1953 ii. in", "1952 ii. in", "195 ii. in"],
    answer: "1953 ii. in"
},
{
    question: "Indian society in ‘anektaa in ektaa’ of srvaadhik important basis is",
    option: ["praaciintaa", "dhaarmik shissnnutaa", "mauliktaa", "above-mentioned any not"],
    answer: "mauliktaa"
},
{
    question: "dillii in sikhoN of viruddh dNgaa In which year was thaa ?",
    option: ["1990", "1992", "1994", "1984"],
    answer: "1984"
},
{
    question: "kssetrvaad, jaativaad and sNprdaayvaad national ekiikrnn of maarg in baadhk is  / ",
    option: ["haaN", "not", "kh not can", "None of these"],
    answer: "haaN"
},
{
    question: "sNskRtikrnn by what type of change of vyaakhyaa is done ?",
    option: ["jaatiiy change", "raajniitik change", "dhaarmik change", "vyaafatyik change"],
    answer: "jaatiiy change"
},
{
    question: "India in raajniitik dloN to which maanytaa gives is ?",
    option: ["raassttrpti", "ucctm nyaayaaly", "sNsd", "cunaav aayog"],
    answer: "cunaav aayog"
},
{
    question: "dhrm nirpeksstaa of meaning what is ?",
    option: ["vibhinn dhrmoN of sh astitv", "other dhrmoN towards shrddhaa", "raajy of apnaa any dhrm n honaa is", "All of these"],
    answer: "All of these"
},
{
    question: "sNskRtikrnn of avdhaarnnaa who viksit of ?",
    option: ["es.sii. dube", "em.en. shriinivaas", "sccidaanNd", "yogendr siNh"],
    answer: "em.en. shriinivaas"
},
{
    question: "saaNprdaayiktaa of dussprinnaam India – paak vibhaajn as In which year dekhaa was ?",
    option: ["sn 1945 in", "sn 1947 in", "sn 1950 in", "sn 1952 in"],
    answer: "sn 1947 in"
},
{
    question: "2006 of maalegaaNv bm visphott kaanndd udaahrnn",
    option: ["kssetriiytaa of", "jaativaad of", "saamprdaayiktaa of", "None of these"],
    answer: "saamprdaayiktaa of"
},
{
    question: "India in saamprdaayiktaavaad of main cause which is ?",
    option: ["apraadhii mnovRttiyaaN", "poverty and berojgaarii", "raajniitik svaarth", "Any of these"],
    answer: "raajniitik svaarth"
},
{
    question: "saamprdaayiktaa human for khtraa is not",
    option: ["shmt", "ashmt", "vivaadaaspd", "None of these"],
    answer: "vivaadaaspd"
},
{
    question: "‘kriyeshn of paittriyaarkii’ naamk book who likhii is ?",
    option: ["em.en. shriinivaas", "vaaii. siNh", "bogaardds", "jii. lrnr"],
    answer: "jii. lrnr"
},
{
    question: "kssetrvaad of problem of main cause which is ?",
    option: ["bhaassaayii bhinntaaeN", "saaNskRtik bhinntaaeN", "jaivik bhinntaaeN", "economic bhinntaaeN"],
    answer: "saaNskRtik bhinntaaeN"
},
{
    question: "who said is ki kssetriiytaa, raassttriiytaa of adhiin is ?",
    option: ["ddoN. ghuriye", "ddoN. raadhaakml mukhrjii", "pro. baagaardds", "pro. jiittrvrg"],
    answer: "ddoN. raadhaakml mukhrjii"
},
{
    question: "”jaativaad one jaati of vyktiyoN of vh bhaavnaa is jo desh or society of normal hitoN of khyaal n keep were only apnii jaati of members of utthaan, jaatiiy ektaa and jaati of social prsthiti to sudRddh' doing for prerit does be  / ” this kthn is",
    option: ["ddoN. kailaashnaath shrmaa", "of.em. pnnikr", "em.es. svaamiinaathn", "blvnt raay Mehta"],
    answer: "ddoN. kailaashnaath shrmaa"
},
{
    question: "jaativaad of development of prmukh kaark is",
    option: ["ngriikrnn", "audyogiikrnn", "raajniiti", "these all"],
    answer: "these all"
},
{
    question: "pitRsttaatmk family in sttaa or right whose hand in remain are ?",
    option: ["man", "woman", "above-mentioned both", "None of these"],
    answer: "man"
},
{
    question: "udd'iisaa of phaadd'ii prdesh in rhne which jnjaati in pitRsttaatmk combined privaaroN of special vistaar is  / ",
    option: ["bhiil", "gaaro", "khsiyaa", "sNthaal"],
    answer: "khsiyaa"
},
{
    question: "Which of the followingmprdaayiktaa of prinnaam is not ?",
    option: ["prspr vishvaas", "national ektaa in baadhk", "national security in baadhk", "paarsprik tnaav"],
    answer: "prspr vishvaas"
},
{
    question: "India of national language which is ?",
    option: ["telguu", "aNgrejii", "mraatthii", "hindii"],
    answer: "hindii"
},
{
    question: "Which of the following human tskrii of cause is ?",
    option: ["organs of nisskrssnn", "veshyaavRtti", "blaat marriage", "All of these"],
    answer: "All of these"
},
{
    question: "Which of the following Indian society characteristic of is ?",
    option: ["dhaarmik kttttrtaa", "social gtishiiltaa", "personal smptti", "anektaa in ektaa"],
    answer: "anektaa in ektaa"
},
{
    question: "India in Which of the following kaark national ektaa in baadhk is ?",
    option: ["jaativaad", "kssetrvaad", "dhrmaandhtaa", "All of the above"],
    answer: "All of the above"
},
{
    question: "following in from kise secondary field in rkhaa goes is ?",
    option: ["agricultural", "vyaapaar", "sevaa", "industry"],
    answer: "industry"
},
{
    question: "rel yaataayaaNt which shrennii of under rkhaa was is ?",
    option: ["dvitiiy", "tRtiiy", "cturth", "prthm"],
    answer: "prthm"
},
{
    question: "chemical khaad which shrennii in rkhaa was is ?",
    option: ["prthm", "dvitiiy", "tRtiiy", "cturth"],
    answer: "dvitiiy"
},
{
    question: "small industry in maximum investment how much crore is  / ",
    option: ["two", "four", "five", "one"],
    answer: "one"
},
{
    question: "industrial niiti according to Indian udyogoN to how many shrennii in baaNttaa was is ?",
    option: ["four", "five", "three", "seven"],
    answer: "three"
},
{
    question: "jiske svaamitv and management and establishment and development of daayitv puurnnruup from kendriiy government to sauNpaa was is, use which shrennii in rkhaa was is ?",
    option: ["prthm", "dvitiiy", "tRtiiy", "cturth"],
    answer: "prthm"
},
{
    question: "which dshk in national and antrraassttriiy level on udyogoN of development on force given was ?",
    option: ["1950 of dshk in", "1960 of dshk in", "1970 of dshk in", "None of these"],
    answer: "1960 of dshk in"
},
{
    question: "India of audyogiikrnn of development for function – scheme in which baat on force given was ?",
    option: ["mhaangroN in aabaadii from httkr industrial ikaaiyoN production of", "industrial waste nistaarnn for sNyNtroN to applying of anivaarytaa", "pollution control for proper praavdhaan", "All of the above"],
    answer: "All of the above"
},
{
    question: "India in spsstt form from udaariikrnn of prkriyaa of aarmbh whose shaasnkaal in was ?",
    option: ["cndrshekhr", "vii.pii. siNh", "nrsimhaa raav", "attl bihaarii vaajpeyii"],
    answer: "nrsimhaa raav"
},
{
    question: "udaariikrnn of prkriyaa of prbhaavsvruup economic field in which – saa sudhaar was ?",
    option: ["industrial production in tiivr growth", "utpaadoN of quality in sudhaar", "direct videshii investment to promotion", "All of the above"],
    answer: "All of the above"
},
{
    question: "India in udaariikrnn of prkriyaa apnaaye going on which – sii cunautii saamne aayii ?",
    option: ["prmpraagt small udyogoN of hraas", "bekaarii ( bejojgaarii ) in growth", "Rnngsttaa in growth", "All of the above"],
    answer: "All of the above"
},
{
    question: "Indian economy of moNddl what type of is ?",
    option: ["puuNjiivaadii", "mishrit", "smaajvaadii", "saamyvaadii"],
    answer: "mishrit"
},
{
    question: "India in udaariikrnn of prkriyaa of praarmbh when from maanaa goes is ?",
    option: ["1961", "1971", "1981", "1991"],
    answer: "1991"
},
{
    question: "Which of these udaariikrnn of den is ?",
    option: ["baajaarvaad", "vaishviikrnn", "nijiikrnn", "All of the above"],
    answer: "All of the above"
},
{
    question: "Which of the following audyogiikrnn of social prinnaam is ?",
    option: ["combined family of vighttn", "mhilaaoN to employment", "jaati prthaa of nirbl honaa", "All of these"],
    answer: "All of these"
},
{
    question: "On which day aNtrraassttriiy aussdhi durupyog and anaitik vyaapaar nirodhk day mnaayaa goes is ?",
    option: ["26 June", "27 June", "05 June", "11 June"],
    answer: "26 June"
},
{
    question: "In which year bihaar in full nshaabNdii law implemented was ?",
    option: ["2015", "2016", "2017", "2018"],
    answer: "2016"
},
{
    question: "which prdhaanmNtrii functions ofkaal in “ennttii naarkottik ektt” near was ?",
    option: ["raajiiv gaaNdhii", "vii0pii0 siNh", "indiraa gaaNdhii", "attl bihaarii vaajpeii"],
    answer: "raajiiv gaaNdhii"
},
{
    question: "following in from kisko ngriikrnn promotion detii is ?",
    option: ["gumnaamtaa", "pollution", "‘maiN’ of bhaavnaa", "All of the above"],
    answer: "All of the above"
},
{
    question: "sNskRtikrnn of avdhaarnnaa who viksit of ?",
    option: ["es0 sii0 duube", "em0 en0 shriinivaas", "sccidaanNd sinhaa", "yogendr siNh"],
    answer: "em0 en0 shriinivaas"
},
{
    question: "dhrm nirpeksstaa of what meaning is ?",
    option: ["vibhinn dhrmoN of sh-astitv", "other dhrmoN towards shrddhaa", "raajy of apnaa any dhrm n honaa", "All of these"],
    answer: "All of these"
},
{
    question: "following in from kise secondary field in rkhaa goes is ?",
    option: ["agricultural", "vyaapaar", "sevaa", "industry"],
    answer: "industry"
},
{
    question: "smekit rural development kaarykrm when praarNbh was ?",
    option: ["1960-61", "1965-66", "1977-78", "1991-92"],
    answer: "1960-61"
},
{
    question: "who said “ngriiytaa one life pddhti",
    option: ["raus", "brgl", "virth", "kaarpenttr"],
    answer: "virth"
},
{
    question: "when stii prthaa nissedh Act paarit was ?",
    option: ["sn 1825 AD", "sn 1859 AD", "sn 1832 AD", "sn 1835 AD"],
    answer: "sn 1832 AD"
},
{
    question: "aary society when was established was ?",
    option: ["1875", "1879", "1882", "1884"],
    answer: "1875"
},
{
    question: "women v knyaaoN of anaitik vyaapaar Act when paarit was ?",
    option: ["sn 1952", "sn 1954", "sn 1956", "sn 1960"],
    answer: "sn 1956"
},
{
    question: "village from people of shhr of or aanaa and urban values to apnaane to what called are ?",
    option: ["audyogikiikrnn", "ngriikrnn", "sNskRtiikrnn", "pshcimiikrnn"],
    answer: "ngriikrnn"
},
{
    question: "who said ki, “only production in being which growth and prti person income in growth honaa aadhunikiikrnn is not ?",
    option: ["em0 en0 shriinivaas", "es0 sii0 dube", "ddoN0 yogendr siNh", "ddoN0 pii0 siNhaa"],
    answer: "es0 sii0 dube"
},
{
    question: "‘soshl ceNj these moNddrn India’ naamk of lekhk which are ?",
    option: ["shriinivaas", "ghuriye", "koNmtt", "yogendr siNh"],
    answer: "shriinivaas"
},
{
    question: "braahmnniikrnn of avdhaarnnaa kinke by dii was is ?",
    option: ["shriinivaas", "hetukr jhaa", "sccidaanNd", "None of these"],
    answer: "shriinivaas"
},
{
    question: "dhrm-nirpekssiikrnn of prkriyaa which vicaar to more prbhaavit does is ?",
    option: ["purity", "apvitrtaa", "purity v apvitrtaa", "None of these"],
    answer: "None of these"
},
{
    question: "suugram of right Act when from implemented was ?",
    option: ["15 June, 2005 AD from", "15 June, 2006 AD from", "15 October, 2005 AD from", "15 October, 2006 AD from"],
    answer: "15 October, 2006 AD from"
},
{
    question: "rural from ngriiy field in ruupaaNtrit being which first desh which is ?",
    option: ["britten", "amerikaa", "phraaNs", "knaaddaa"],
    answer: "britten"
},
{
    question: "“moNddnaaijeshn of iNddiyn ttreddishn” naamk book who likhii is ?",
    option: ["em0 es0 raav", "rviindrnaath mukhrjii", "yogendr siNh", "em0 en0 shriinivaas"],
    answer: "yogendr siNh"
},
{
    question: "“arbnaaijeshn aindd soshl cenj” naamk book who likhii is ?",
    option: ["brgel", "em0 es0 raav", "enddsn", "sorokn"],
    answer: "em0 es0 raav"
},
{
    question: "audyogikiikrnn of phlsvruup ngroN in which trh of pollution produced was is ?",
    option: ["Water pollution", "Air pollution", "Noise pollution", "these all"],
    answer: "these all"
},
{
    question: "dhej nirodhk Act when paarit done was ?",
    option: ["1960", "1961", "1970", "1962"],
    answer: "1961"
},
{
    question: "aary society of sNsthaapk which the ?",
    option: ["raajaaraam mohn raay", "govind raannaadde", "dyaannd srsvtii", "naaraaynn joshii"],
    answer: "dyaannd srsvtii"
},
{
    question: "India in who srvprthm stiiprthaa of viruddh aavaaj utthaaii thii ?",
    option: ["iishvrcndr vidyaasaagr", "mhaatmaa gaaNdhii", "raajaaraam mohn raay", "ainii besentt"],
    answer: "raajaaraam mohn raay"
},
{
    question: "child marriage nirodhk Act which year implemented was ?",
    option: ["1929", "1939", "1910", "1925"],
    answer: "1929"
},
{
    question: "who said “rural areas of ngriiy kssetroN in bdlne of prkriyaa to hm ngriikrnn kheNge” ?",
    option: ["shriinivaas", "brgl", "pheyrcaaildd", "thoNmsn"],
    answer: "brgl"
},
{
    question: "sNskRtikrnn of prkriyaa according tofollowing jaatiyaaN which jaati of vyvhaaroN of anusrnn does are?",
    option: ["braahmnn jaati", "dvij jaati", "prbhu jaati", "high jaati"],
    answer: "dvij jaati"
},
{
    question: "“ngriiytaa life of one triikaa is jbki ngriikrnn one prkriyaa hai / ” who said is ?",
    option: ["gaalpin", "vrth", "vrges", "homr hiyott"],
    answer: "vrth"
},
{
    question: "India in laukikiikrnn whose den is ?",
    option: ["amerikii", "phraaNsiisii", "aNgrej", "purtgaalii"],
    answer: "amerikii"
},
{
    question: "aadhunikiikrnn to society of sNrgram in change laane which one mhttvpuurnn prkriyaa as who spsstt done is ?",
    option: ["jaarj saaimn", "em0 en0 shriinivaas", "ddeniyl lrnr", "ddaa0 yogendr siNh"],
    answer: "ddeniyl lrnr"
},
{
    question: "industrial society in family what type of unit is?",
    option: ["economic", "use", "production", "profit"],
    answer: "use"
},
{
    question: "vaastv in sNskRtiikrnn which avdhaarnnaaoN to spsstt does is ?",
    option: ["braahmnniikrnn", "on sNskRtiikrnn", "agrim smaajiikrnn and anukrnn", "All of the above"],
    answer: "All of the above"
},
{
    question: "pshcimiikrnn because of society in which class of udy was ?",
    option: ["high class", "following class", "mdhy and vyaapaarii class", "None of these"],
    answer: "high class"
},
{
    question: "grikiikrnn most more where was ?",
    option: ["jhaarkhNdd", "chttiisgddh'", "uttraakhNdd", "mhaaraassttr"],
    answer: "mhaaraassttr"
},
{
    question: "which industry of aarNbh being to industrial kraaNti of utptti maanii goes is ?",
    option: ["sttiil industry", "bunaaii industry", "cmdd'aa industry", "oil industry"],
    answer: "cmdd'aa industry"
},
{
    question: "when industrial kraanti of suutrpaat was ?",
    option: ["1765", "1766", "1767", "1769"],
    answer: "1767"
},
{
    question: "India in audyogikiikrnn of history which shtaabdii from aarNbh is ?",
    option: ["atthaarhviiN shtaabdii", "unniisviiN shtaabdii", "biisviiN shtaabdii", "ikkiisviiN shtaabdii"],
    answer: "biisviiN shtaabdii"
},
{
    question: "which sNpdaa of basis on India bdd'aa industrial desh bn can is ?",
    option: ["jn sNpdaa", "natural sNpdaa", "jn v natural sNpdaa", "among these any not"],
    answer: "jn sNpdaa"
},
{
    question: "vidvaanoN ne aadhunikiikrnn to which shbd of pryaayvaacii maanaa is ?",
    option: ["audyogikiikrnn", "ngriikrnn", "pshcimiikrnn", "Any of these nhii"],
    answer: "Any of these nhii"
},
{
    question: "among these from aadhunikiikrnn characteristic of is",
    option: ["gtishiiltaa", "hitoN of ektriikrnn", "more shbhaagitaa", "among these any not"],
    answer: "more shbhaagitaa"
},
{
    question: "aadhunikiikrnn of prernnaa from prerit being on society in how many types of avsthaaeN produced occurs ?",
    option: ["three", "two", "four", "one"],
    answer: "one"
},
{
    question: "ngriikrnn of kaark are",
    option: ["industrial development", "vyaafatyik gtishiiltaa", "physicalvaadii sNskRti", "All of the above"],
    answer: "All of the above"
},
{
    question: "elder ngriiy field of nikaay to said goes",
    option: ["ngr pNcaayt", "ngr prissd", "ngr Corporation", "None of these"],
    answer: "ngr Corporation"
},
{
    question: "vidvaan ne whose gtishiiltaa vykt doing for sNskRtikrnn use of done ?",
    option: ["class of gtishiiltaa", "jaati of gtishiiltaa", "jaati v class both of gtishiiltaa", "None of these"],
    answer: "jaati v class both of gtishiiltaa"
},
{
    question: "Which of the following-sii- one dshaa industrial society characteristic of is not ?",
    option: ["hstshilp of development", "bdd'ii quantity in production", "personal profit of prvRtti", "nyii praudyogikii use of"],
    answer: "hstshilp of development"
},
{
    question: "following in from which one lekhk ne India in social change of prkriyaaoN of vistRt vrnnn prstut done ?",
    option: ["pii0 ec0 prbhu", "ke0 em0 kaapdd'iyaa", "iraavtii krve", "em0 en0 shriinivaas"],
    answer: "em0 en0 shriinivaas"
},
{
    question: "India in which-sii one dshaa upniveshvaad of prinnaam is ?",
    option: ["society sudhaar aaNdoln of praarNbh", "transport of saadhnoN of aarNbh", "vaiknowledgeik education of aarNbh", "dhrmaaNtrnn of aarNbh"],
    answer: "vaiknowledgeik education of aarNbh"
},
{
    question: "Which of the following-sii one dshaa India in ngriikrnn of prinnaam is not ?",
    option: ["ekaaNkii privaaroN in growth", "anaupcaarik sNbNdhoN in growth", "women of dshaa in sudhaar", "jaatigt vibhedoN in lack"],
    answer: "anaupcaarik sNbNdhoN in growth"
},
{
    question: "upniveshvaad which dshaa of prinnaam is ?",
    option: ["saamyvaad", "smaajvaad", "saamraajyvaad", "prjaativaad"],
    answer: "saamraajyvaad"
},
{
    question: "audyogiikrnn of phlsvruup ngroN in which trh of pollution produced was ?",
    option: ["Water pollution", "Air pollution", "Noise pollution", "these all"],
    answer: "these all"
},
{
    question: "India of following in from which raajy in ngriikrnn of quantity srvaadhik is ?",
    option: ["bihaar", "pshcim bNgaal", "jhaarkhNdd", "mdhyprdesh –"],
    answer: "pshcim bNgaal"
},
{
    question: "class arrangement prinnaam is",
    option: ["social sNghrss of", "berojgaarii of", "vrnn-arrangement of", "audyogiikrnn of"],
    answer: "audyogiikrnn of"
},
{
    question: "dhrm nirpeksstaa of meaning what is ?",
    option: ["vibhinn dhrmoN of sh-astitv", "other dhrmoN towards shrddhaa", "raajy of apnaa any dhrm n honaa", "All of these"],
    answer: "All of these"
},
{
    question: "India in pNcvrssiiy scheme when aarNbh of was ?",
    option: ["1950", "1951", "1952", "1954"],
    answer: "1952"
},
{
    question: "em0 en0 shriinivaas ne apnii book ‘Social change in Modern India’ in Which of the following mt prstut done is ?",
    option: ["jaati puurnntH closed arrangement is", "jaati puurnntH khulii arrangement is", "jaati arrangement in gtishiiltaa of opportunity nihit is", "jaati veg of trh occurs"],
    answer: "jaati arrangement in gtishiiltaa of opportunity nihit is"
},
{
    question: "dhrm nirpekssiikrnn India in kise prbhaavit does is ?",
    option: ["hinduu to", "muslim to", "aadivaasii to", "all naagrikoN to"],
    answer: "aadivaasii to"
},
{
    question: "dhej unmuuln sNshodhn Act when paarit was ?",
    option: ["1975", "1984", "1990", "1961"],
    answer: "1961"
},
{
    question: "shaardaa ektt In which year paarit done was ?",
    option: ["1928", "1929", "1930", "1931"],
    answer: "1929"
},
{
    question: "following in which-saa cause Indian naariyoN of condition in sudhaar for uttrdaayii is ?",
    option: ["sNvaidhaanik suvidhaaeN", "education of prsaar", "antrjaatiiy marriage", "All of the above"],
    answer: "All of the above"
},
{
    question: "aspRshytaa (apraadh) Act when paarit was ?",
    option: ["1953", "1954", "1955", "1956"],
    answer: "1955"
},
{
    question: "Indian society in women of dyniiy condition on who srvprmukh function done are ?",
    option: ["raajaa raammohn raay", "svaamii dyaannd srsvtii", "iishvrcndr vidyaasaagr", "All of the above"],
    answer: "All of the above"
},
{
    question: "In which year women to apne husband from bhrnn-nutrition of amount obtained doing of right given was ?",
    option: ["1936 AD", "1946 AD", "1856 AD", "1966 AD"],
    answer: "1946 AD"
},
{
    question: "economic shossnn of viruddh women of dshaa sudhaarne for smaan salary Act’ when paarit was ?",
    option: ["sn 1974", "sn 1976", "sn 1978", "sn 1980"],
    answer: "sn 1976"
},
{
    question: "brhm society establishment who of ?",
    option: ["child gNgaadhr tilk", "raajaa raammohn raay", "mhaatmaa gaaNdhii", "iishvrcNdr vidyaasaagr"],
    answer: "raajaa raammohn raay"
},
{
    question: "India for khtrnaak is-",
    option: ["saaNprdaayiktaa", "kssetriiytaa", "jaatiiytaa", "all"],
    answer: "all"
},
{
    question: "social change of taatpry is –",
    option: ["social sNbNdhoN in change", "social smuuhoN in change", "social antH kriyaaoN in change", "uprokt all"],
    answer: "social sNbNdhoN in change"
},
{
    question: "ddenjrs ddrgs ektt In which year in paarit done was ?",
    option: ["1930", "1931", "1938", "1933"],
    answer: "1930"
},
{
    question: "mdhyaahn dining where implemented was ?",
    option: ["school", "college", "oNphis", "All of the above"],
    answer: "school"
},
{
    question: "India in In which year prdhaanmNtrii employment scheme start of gyii ?",
    option: ["1993", "1994", "2011", "2009"],
    answer: "1993"
},
{
    question: "In which year baalikaa smRddhi scheme of shuruuaat of was ?",
    option: ["1997", "1998", "1999", "1986"],
    answer: "1997"
},
{
    question: "In which year child shrm on one national niiti bnaaii was  / ",
    option: ["1987", "1991", "1948", "1952"],
    answer: "1987"
},
{
    question: "India in In which year smekit child development sevaa kaarykrm praarNbh done was ?",
    option: ["1975", "1974", "2011", "1985"],
    answer: "1975"
},
{
    question: "“aadhunik India in social change’ naamk book of lekhk which are ?",
    option: ["em0 en0 shriinivaas", "aar0 ke0 mukhrjii", "ddii0 pii0 mukhrjii", "es0 sii0 duube nr"],
    answer: "em0 en0 shriinivaas"
},
{
    question: "’ddii0e0 kes’ which apraadh related to is ?",
    option: ["htyaa", "blaatkaar", "aap from more smptti", "corii"],
    answer: "aap from more smptti"
},
{
    question: "‘special marriage Act’ which year paarit was ?",
    option: ["1954", "1956", "1961", "1972"],
    answer: "1954"
},
{
    question: "ngriiy environment of social life on Which of the following effect is not ?",
    option: ["apraadh", "vyktivaaditaa in growth", "pollution in lack", "aavaas of problem in growth"],
    answer: "pollution in lack"
},
{
    question: "shriinivaas ne pshcimiikrnn of prkriyaa of moNddl as from following in from kise basis maanaa ?",
    option: ["nyii praudyogikii", "aadhunikiikrnn", "shikssnn sNsthaayeN", "150 year of brittish shaasn"],
    answer: "150 year of brittish shaasn"
},
{
    question: "India in sNskRttikrnn to protsaahit doing which dshaayeN which sii is ?",
    option: ["sNskRti of education", "woman aandoln", "audyogiikrnn v ngriikrnn", "jnjaatiiy aandoln"],
    answer: "audyogiikrnn v ngriikrnn"
},
{
    question: "Which of the following India in aupniveshik shaasn for uttrdaayii is ?",
    option: ["iistt India kmpnii", "vaaren hsttiNgs", "laardd klaaiv", "All of these"],
    answer: "iistt India kmpnii"
},
{
    question: "hinduu uttraadhikaar Act to In which year sNshodhit by putriyoN to putr of smaan paitRk smptti in smaan right given was ?",
    option: ["1956", "2005", "1985", "2010"],
    answer: "2005"
},
{
    question: "pshcimiikrnn to which trh of avdhaarnnaa maanaa goes is ?",
    option: ["tttsth avdhaarnnaa", "yuuropiiy avdhaarnnaa", "physical avdhaarnnaa", "kssetriiy avdhaarnnaa"],
    answer: "tttsth avdhaarnnaa"
},
{
    question: "who said ki ngriikrnn only aadhunikiikrnn of prthm crnn is ?",
    option: ["maikaaiivr", "lrnr", "shriinivaas", "brgl"],
    answer: "shriinivaas"
},
{
    question: "Which of the following dhrm of prkaary is not ?",
    option: ["social sNgtthn in baadhk", "social control of means", "social sNgtthn in shaayk", "srv klyaann in shaayk"],
    answer: "social sNgtthn in baadhk"
},
{
    question: "when any following jaati or jnjaati any high jaati of dishaa in apnii life pddhti to bdltii is, then use what called",
    option: ["sNskRtikrnn", "aadhunikiikrnn", "pshcimiikrnn", "dhrm nirpekssiikrnn"],
    answer: "sNskRtikrnn"
},
{
    question: "India in following in from which raajy in ngriikrnn of quantity srvaadhik",
    option: ["bihaar", "pshcim bNgaal", "jhaarkhNdd", "mdhy prdesh"],
    answer: "mdhy prdesh"
},
{
    question: "who said– “ngriiytaa one life pddhti is” ?",
    option: ["roNs", "brgl", "virth", "kaarpeNttr"],
    answer: "brgl"
},
{
    question: "1995 ii. in India in mlin bstiyoN in rhne which people of sNkhyaa how many thii ?",
    option: ["250 lakh", "450 lakh", "300 lakh", "500 lakh"],
    answer: "450 lakh"
},
{
    question: "vrtmaan condition in any also type of and any also level of bdlaav to called are",
    option: ["change", "mausmii prvsn", "ngriikrnn", "mlin bstiyaaN"],
    answer: "change"
},
{
    question: "yuurop and amerikaa of sbhytaaoN from being which change to called are",
    option: ["upniveshvaad", "mausmii prvsn", "pshcimiikrnn", "audyogikiikrnn"],
    answer: "pshcimiikrnn"
},
{
    question: "“social change from taatpry social ddhaaNce of change from is” this kthn whose thaa ?",
    option: ["joNnsn", "gilin and gilin", "ddoN. mjuumdaar", "maikaaivr and pej"],
    answer: "joNnsn"
},
{
    question: "India in audyogikiikrnn approximately how much year old is ?",
    option: ["200 year", "300 year", "400 year", "100 year"],
    answer: "100 year"
},
{
    question: "“knowledge upyogii and vyaavhaarik should be / ” this kthn whose is ?",
    option: ["Adam Smith", "aaii.bii. shrmaa", "sttiibensn", "belaardd"],
    answer: "aaii.bii. shrmaa"
},
{
    question: "projektt real life on one part is whichuse of school in is done /  this kthn is",
    option: ["belaaii", "kilpaittrik", "sttiibensn", "roNbrtt biirsttiik"],
    answer: "belaaii"
},
{
    question: "Indian sNvidhaan of which anucched under anusuucit jaatiyoN to apnii sNskRti and language bnaaye keeping for preservation provide done was is ?",
    option: ["dhaaraa 16", "dhaaraa 29", "dhaaraa 42", "dhaaraa 46"],
    answer: "dhaaraa 29"
},
{
    question: "projektt one smsyaamuulk function is jo apnii svaabhaavik pristhitiyoN in puurnntaa to obtained does is",
    option: ["aaii.bii. vrmaa", "sttiibensn", "kil paittrik", "bevaardd"],
    answer: "kil paittrik"
},
{
    question: "this kthn whose is ki “projektt vh uddeshypuurnn function is jo full sNlgntaa in social vaataavrnn in is done / ”",
    option: ["kil paittrik", "sii.ec. kuule", "es.bii. ketkr", "mjuumdaar and maan"],
    answer: "kil paittrik"
},
{
    question: "shhriikrnn of lkssnn is",
    option: ["vyaapaar in development", "one shhr of caaroN or kendroN of development", "rural from urban prvsn", "All of the above"],
    answer: "All of the above"
},
{
    question: "following in from kisko ngriikrnn promotion detii is ?",
    option: ["gumnaamitaa", "bhiidd'", "pollution", "uprokt all"],
    answer: "uprokt all"
},
{
    question: "Which of the following sii jnjaati uttrii–puurvii India of is not ?",
    option: ["naagaa", "kuukii", "boddaa", "khs"],
    answer: "khs"
},
{
    question: "‘soshl ceNj these moNddrn innddiyaa’ name book of lekhk are ?",
    option: ["mjuumdaar and mdaan", "aar.of. mukhrjii", "em.en. shriinivaas", "maikaaivr and pej"],
    answer: "em.en. shriinivaas"
},
{
    question: "“aadhunikiikrnn one prkriyaa is, jo prmpraagt society from praudyogikii on aadhaarit society of or agrsr occurs / ” said pribhaassaa dii is",
    option: ["rittjr", "es.sii. dube", "em.es. gore", "None of these"],
    answer: "es.sii. dube"
},
{
    question: "following in from aadhunikiikrnn of lkssnn is",
    option: ["audyogikiikrnn to protsaahn", "nviin tkniikii use of", "sNcaar v traffic of saadhnoN in growth", "All of the above"],
    answer: "All of the above"
},
{
    question: "sNvidhaan of which anucched according to raajy of naagrikoN of with jaati, dhrm, vNsh athvaa jnmsthaan aadi of basis on vibhed not done jaayegaa ?",
    option: ["anucched 14", "anucched 38", "anucched 9", "anucched 15"],
    answer: "anucched 15"
},
{
    question: "“aadhuniktaa one such belgaam ghodd'aa hai /  jise any also trh control in keep ktthin is” such who said ?",
    option: ["rittjr", "gore", "shyaam crnn duube", "bii.pii. shaah"],
    answer: "rittjr"
},
{
    question: "vh which–sii prkriyaa is jiske under any also jaati, jnjaati or group apne from high jaati (praayH dvij jaati) of riiti–rivaajoN, krmkaanndd, vicaardhaaraa and values to apnaakr society in apnii jaatiiy condition to above utthaane of pryaas does is ?",
    option: ["aadhunikiikrnn", "sNskRtiikrnn", "dhrmnirpekssiikrnn", "pshcimiikrnn"],
    answer: "sNskRtiikrnn"
},
{
    question: "following in from dhrmnirpekssiikrnn of prkriyaa of prmukh element is",
    option: ["vibhediikrnn in growth", "dhaarmiktaa of haas", "taarkiktaa in growth", "All of the above"],
    answer: "All of the above"
},
{
    question: "“change of this prkriyaa jo Indian jnjiivn, society v sNskRti of vibhinn pkssoN in that pshcimii sNskRti of smprk in coming because of produced was, jise brittish shaask apne with laaye the / ” this prkriyaa khlaatii is–",
    option: ["pshcimiikrnn", "audyogiikrnn", "ngriikrnn", "aadhunikiikrnn"],
    answer: "pshcimiikrnn"
},
{
    question: "aadhunik India in praudyogik vibhaajn is jaa rhaa is, such which said ?",
    option: ["shriinivaas", "ddoN. shyaamcrnn duube", "yogendr", "None of these"],
    answer: "shriinivaas"
},
{
    question: "d tteknoloNjiikl sosaayttii naamk book who likhaa thaa ?",
    option: ["shriinivaasn", "yogendr siNh", "jekyuul iilll", "None of these"],
    answer: "jekyuul iilll"
},
{
    question: "aadhunikiikrnn smbndhit is",
    option: ["prmpraagt value from", "bnd social arrangement from", "arjit prsthiti from", "prthaa from"],
    answer: "arjit prsthiti from"
},
{
    question: "pshcimiikrnn of avdhaarnnaa by whom dii was is ?",
    option: ["aagbrn", "em.en. shriinivaas", "maikaaivr", "aar.of. mukhrjii"],
    answer: "em.en. shriinivaas"
},
{
    question: "braahmnniikrnn of avdhaarnnaa who viksit of ?",
    option: ["em.en. shriinivaas", "e.aar. desaaii", "es.sii. dube", "jii.es. ghuriye"],
    answer: "em.en. shriinivaas"
},
{
    question: "sNskRtiikrnn of prkriyaa according to following jaatiyaaN which jaati of vyvhaaroN of anusrnn does is ?",
    option: ["braahmnn", "dvij jaati", "prbhu jaati", "high jaati"],
    answer: "high jaati"
},
{
    question: "prsNskRti of smbndh is",
    option: ["health from", "economy from", "sNskRti from", "agricultural from"],
    answer: "sNskRti from"
},
{
    question: "Which of the following India in social change of kaark is not ?",
    option: ["sNskRtikrnn", "pshcimiikrnn", "prmpraa", "audyogiikrnn and ngriikrnn"],
    answer: "prmpraa"
},
{
    question: "‘sNskRtikrnn’ of avdhaarnnaa who prtipaadit done?",
    option: ["es.sii. duube", "em. en. shriinivaas", "yogendr siNh", "of.el. shrmaa"],
    answer: "em. en. shriinivaas"
},
{
    question: "styprkaash book of rgram who done?",
    option: ["vivekaannd", "raajaaraam mohn raay", "shjaannd srsvtii", "dyaannd srsvtii"],
    answer: "dyaannd srsvtii"
},
{
    question: "following in which pshcimiikrnn of kaark is?",
    option: ["reddiyo", "tteliivijn", "smaacaar – letter", "All of these"],
    answer: "All of these"
},
{
    question: "aary society of sNsthaapk which are?",
    option: ["dyaanNd srsvtii", "shjaannd srsvtii", "vivekaannd", "raajaa raammohn raay"],
    answer: "dyaanNd srsvtii"
},
{
    question: "brhm society establishment who of thii?",
    option: ["mhaatmaa gaaNdhii", "dyaannd srsvtii", "raajaa raammohn raay", "smaajiikrnn who of thii"],
    answer: "raajaa raammohn raay"
},
{
    question: "prNpraaoN to tyaagkr ne vicaaroN to intake to do is called is?",
    option: ["aadhunikiikrnn", "function nirpekssiikrnn", "dyaannd srsvtii", "sNskRtikrnn"],
    answer: "aadhunikiikrnn"
},
{
    question: "vidhvaa marriage sNgh establishment who of thii",
    option: ["svaamii dyaannd", "mhaadev goviNd raanaadde", "raajaa raammohn raay", "keshv cndr sen"],
    answer: "mhaadev goviNd raanaadde"
},
{
    question: "brhm society when was established of was thii?",
    option: ["1832 ii. in", "1840 ii. in", "1825 ii. in", "1828 ii. in"],
    answer: "1828 ii. in"
},
{
    question: "muul shNkr whose bcpn of name thaa?",
    option: ["gaaNdhiijii of", "raajaa raammohn raay of", "svaamii dyaannd of", "keshvcndr of"],
    answer: "svaamii dyaannd of"
},
{
    question: "‘srvody’ shbd whose den is?",
    option: ["svaamii vivekaannd of", "raajaa raammohn raay of", "svaamii dyaannd of", "gaaNdhii jii of"],
    answer: "gaaNdhii jii of"
},
{
    question: "brhm society of establishment of what uddeshy thaa?",
    option: ["hinduu dhrm of smaapn to do", "pshcimii sbhytaa implemented to do", "hinduu dhrm to punH vyaakhyaa to do", "All of these"],
    answer: "hinduu dhrm to punH vyaakhyaa to do"
},
{
    question: "aadhunikiikrnn of avdhaarnnaa who dii?",
    option: ["ddeniyl lrnr", "ddeniyl bel", "ddeniyl thoNrnr", "ddeniyl guuc"],
    answer: "ddeniyl lrnr"
},
{
    question: "hrijn aandoln who claayaa thaa?",
    option: ["raajaa raammohn raay", "gaaNdhii", "nehruu jii", "dyaannd srsvtii"],
    answer: "gaaNdhii"
},
{
    question: "India in brittish upniveshvaad shaayk thaa?",
    option: ["loNrdd kaarnvaalis", "mausmii", "vaaren hesttiNgj", "audyogiikrnn"],
    answer: "audyogiikrnn"
},
{
    question: "sn 1995 in India in mlin bstiyoN in rhnevaale people of sNkhyaa how many thii?",
    option: ["250 lakh", "450 lakh", "300 lakh", "500 lakh"],
    answer: "450 lakh"
},
{
    question: "vrtmaan condition in any also type of and any also level of bdlaav to called is",
    option: ["change", "loNrdd klaaiv", "ngriikrnn", "All of the above"],
    answer: "change"
},
{
    question: "yuurop and amerikaa of sbhytaaoN of sNskRti from prbhaavit hokr being which change to called are",
    option: ["upniveshvaad", "mausmii change", "pshcimiikrnn", "mlin bstiyaaN"],
    answer: "pshcimiikrnn"
},
{
    question: "“social change from taatpry social ddhaaNce of change from is” this kthn whose thaa?",
    option: ["joNnsn", "gilin and gilin", "ddoN. mjuumdaar", "maikaaivr and pej"],
    answer: "joNnsn"
},
{
    question: "when srkaarii udym person or vyktiyoN of group to bec given go are athvaa claane for given go are then this prkriyaa khlaatii is",
    option: ["udaariikrnn", "nijiikrnn", "woman sshktiikrnn", "lok field"],
    answer: "nijiikrnn"
},
{
    question: "jaatiiy sNgtthn raajniiti in kaisii bhuumikaa nibhaa rhii is",
    option: ["dbaav group", "svaarth group", "skriy group", "klyaannkaarii group"],
    answer: "dbaav group"
},
{
    question: "raajy of pribhaassaa of basis what is?",
    option: ["population and fixed bhuu – part on aadhaarit is", "population fixed bhuu – part and government on aadhaarit hai / ", "population fixed bhuu – part, government and sNprbhutaa on aadhaarit is", "All of the above ttvoN on aadhaarit is"],
    answer: "population fixed bhuu – part, government and sNprbhutaa on aadhaarit is"
},
{
    question: "following in correct uttr on mark lgaaveN",
    option: ["sNvidhaan dhaarmik niymoN and praavdhaanoN of one vyvsthit prlekh is", "sNvidhaan prshaasnik niymoN and praavdhaanoN of one vyvsthit prlekh is", "sNvidhaan prshaasnik niymoN and praavdhaanoN of one vyvsthit prlekh is", "sNvidhaan shaikssnnik niymoN and praavdhaanoN of one vyvsthit prlekh hai / "],
    answer: "sNvidhaan prshaasnik niymoN and praavdhaanoN of one vyvsthit prlekh is"
},
{
    question: "following in jo correct is that on mark lgaayeN",
    option: ["pNcaayt function ofkaal three years for determined is", "pNcaayt function ofkaal four years for determined is", "pNcaayt function ofkaal five years for determined is", "pNcaayt function ofkaal six years for determined is"],
    answer: "pNcaayt function ofkaal five years for determined is"
},
{
    question: "In which year from blvNt raay Mehta kmittii of siphaarishoN of basis on vibhinn raajyoN in nyaa pNcaaytiiraaj law implemented honaa start was?",
    option: ["1947", "1950", "1959", "1965"],
    answer: "1959"
},
{
    question: "nimnaaNkit in which aadhunik raajy functions of are?",
    option: ["external aakrmnn from protection to do", "indoor peace sthaapit to do", "people for nyaay of arrangement to do", "All of the above"],
    answer: "All of the above"
},
{
    question: "Indian sNskRti of Which of the following – sii characteristic is?",
    option: ["dhrm of prdhaantaa", "punrjnm in vishvaas", "krmphl in vishvaas", "All of these"],
    answer: "All of these"
},
{
    question: "following in from whose pryaas from sttii prthaa unmuuln smbhv was?",
    option: ["raammohn raay", "rmaa baaii", "binovaa bhaave", "raam mnohr lohiyaa"],
    answer: "raammohn raay"
},
{
    question: "pNcaaytoN to force provide doing which vidheyk sNvidhaan of which sNshodhn by laayaa was ?",
    option: ["71 vaaN", "73 vaaN", "75 vaaN", "69 vaaN"],
    answer: "73 vaaN"
},
{
    question: "one Gram Panchayat in which nyaayaadhiish of bhuumikaa adaa does is ?",
    option: ["mukhiyaa", "srpNc", "pNc", "grams sevk"],
    answer: "srpNc"
},
{
    question: "raajy of what meaning is ?",
    option: ["jaan – goods of protection", "klyaann", "nyaay", "All of these"],
    answer: "All of these"
},
{
    question: "siittuu ‘ of smbndh which raajniitik dl from is ?",
    option: ["kaaNgres ( aaii )", "maarksvaadii kmyunistt paarttii", "Indian jntaa paarttii", "Indian kmyunistt paarttii"],
    answer: "maarksvaadii kmyunistt paarttii"
},
{
    question: "Indian economy of moNddl what type of is ?",
    option: ["puuNjiivaadii", "mishrit", "smaajvaadii", "saamyvaadii"],
    answer: "mishrit"
},
{
    question: "which vidvaan ne srvprthm ‘ dbaav group ‘ shbd use of done is ?",
    option: ["maiks vebr", "piittr oNddiigaardd", "smnr", "ttii.of. ummn"],
    answer: "maiks vebr"
},
{
    question: "pNcaaytii raaj in most prmukh unit which is ?",
    option: ["mukhiyaa", "srpNc", "grams sbhaa", "grams sevk"],
    answer: "grams sbhaa"
},
{
    question: "following in from who rural ngriiy saatty avdhaarnnaa of development in yogdaan given ?",
    option: ["es.sii. duube", "saarokin", "reddphiildd", "koNmtt"],
    answer: "reddphiildd"
},
{
    question: "India in raajniitik dl to which maanytaa gives is ?",
    option: ["raassttrpti", "ucctm nyaayaaly", "sNsd", "cunaav aayog"],
    answer: "cunaav aayog"
},
{
    question: "pNcaaytii raaj arrangement how many level of is",
    option: ["two striiy", "three striiy", "four striiy", "five striiy"],
    answer: "three striiy"
},
{
    question: "pNcaayt smiti of adhykss which is ?",
    option: ["sii.o.", "prmukh", "mukhiyaa", "bii.ddii.o"],
    answer: "prmukh"
},
{
    question: "prjaatNtr characteristic of is",
    option: ["saarvbhaumik mtaadhikaar", "law of dRsstti in smaantaa", "pres of svtNtrtaa", "All of these"],
    answer: "All of these"
},
{
    question: "73 veN sNvidhaan sNshodhn when was ?",
    option: ["1980 ii. in", "1990 ii. in", "1985 ii. in", "1992 ii. in"],
    answer: "1992 ii. in"
},
{
    question: "which smaajshaastrii ne prjaatNtr of virodh done and phaasiivaad of smrthn done ?",
    option: ["pairetto", "koNmtte", "maarks", "vebr"],
    answer: "pairetto"
},
{
    question: "sNvidhaan of which – from sNshodhn of by sthaaniiy svshaasn nikaayoN in mhilaaoN towardsnidhitv to increasing of koshish of was is ?",
    option: ["51 vaaN and 52 vaaN", "73 vaaN and 74 vaaN", "81 vaaN and 82 vaaN", "None of these"],
    answer: "73 vaaN and 74 vaaN"
},
{
    question: "pNcaaytii raajy of village of development for how many sNsthaaeN function does are ?",
    option: ["two", "four", "three", "five"],
    answer: "three"
},
{
    question: "blvNt raay Mehta smiti of siphaarishoN to implemented doing which first raajy thaa ?",
    option: ["bihaar", "mdhy prdesh", "raajsthaan", "gujraat"],
    answer: "raajsthaan"
},
{
    question: "how many year under of children to any khtrnaak function in planting dNddniiy apraadh maanaa was is ?",
    option: ["14 year", "18 year", "10 year", "20 year"],
    answer: "14 year"
},
{
    question: "pNcaaytii raaj sNsthaaoN in following in which nimntm unit is ?",
    option: ["Gram Panchayatii", "pNcaayt smiti", "jilaa prissd", "pNcaayt sevk"],
    answer: "Gram Panchayatii"
},
{
    question: "raanaadde v bhnnddaarkr ne sn 1867 in which institution establishment of",
    option: ["praarthnaa society", "aary society", "brhm society", "paarsii society"],
    answer: "praarthnaa society"
},
{
    question: "sisttr niveditaa whose shissy thiiN ?",
    option: ["mhrssi dyaannd srsvtii", "svaamii vivekaannd", "gokul cnd naarNg", "ddoN. maanik cndr"],
    answer: "svaamii vivekaannd"
},
{
    question: "aary society ne gujraaNvaalaa in gurukul establishment In which year of thii ?",
    option: ["1900 in", "1901 in", "1903 in", "1904 in"],
    answer: "1900 in"
},
{
    question: "‘ Indian Miror ‘ book of lekhk which are ?",
    option: ["keshvcndr sen", "devendr naath tthaakur", "raajaa raammohn raay", "svaamii vivekaannd"],
    answer: "devendr naath tthaakur"
},
{
    question: "“ prjaatNtr jntaa for, jntaa of by, jntaa of government is ” prjaatNtr of this pribhaassaa who dii is ?",
    option: ["baaraak obaamaa", "mhaatmaa gaaNdhii", "abraahm liNkn", "jvaahrlaal nehruu"],
    answer: "abraahm liNkn"
},
{
    question: "svtNtr India in srvprthm which pNcvrssiiy scheme in industry on jor given was ?",
    option: ["prthm pNcvrssiiy scheme", "dvitiiy pNcvrssiiy scheme", "tRtiiy pNcvrssiiy scheme", "cturth pNcvrssiiy scheme"],
    answer: "dvitiiy pNcvrssiiy scheme"
},
{
    question: "gyaarhviiN pNcvrssiiy scheme of kaal what is ?",
    option: ["2002-2007", "2007-2009", "2007-2012", "2008-2013"],
    answer: "2007-2012"
},
{
    question: "‘ sty shodhk society ‘ of sNsthaapk which the ?",
    option: ["aacaary raamaanuj", "svaamii vivekaannd", "svaamii dyaannd", "jyotibaa phule"],
    answer: "jyotibaa phule"
},
{
    question: "” village one small gnnraajy is ” who said ?",
    option: ["mettkoNph", "e.aar. desaaii", "kaarl maarks", "mhaatmaa gaaNdhii"],
    answer: "mettkoNph"
},
{
    question: "child marriage nirodhk Act which year implemented was ?",
    option: ["1929", "1939", "1910", "1925"],
    answer: "1929"
},
{
    question: "raajy by paarit done gye ve law jo social kuriitiyoN to far doing, social vighttn to rokne and society sudhaar of anukuul pristhitiyaaN produced doing of uddeshy from bnaaye go are, unheN called are",
    option: ["social vidhaan", "praarthnaa society", "aary society", "India sevk society"],
    answer: "social vidhaan"
},
{
    question: "following in which raajy in srvprthm pNcaayt cunaav in mhilaaoN to 50 % aarkssnn given was ?",
    option: ["mdhy prdesh", "raajsthaan", "pshcim bNgaal", "bihaar"],
    answer: "bihaar"
},
{
    question: "‘ aspRshytaa Act ‘ when paarit was ?",
    option: ["1950", "1955", "1957", "1959"],
    answer: "1955"
},
{
    question: "‘ naagrik right preservation law ‘ which sn in bnaa ?",
    option: ["1971", "1972", "1975", "1976"],
    answer: "1976"
},
{
    question: "‘ hinduu god lenaa bhrnn – nutrition Act according to god lene which person in Which of the following – sii vishesstaaeN honii should ?",
    option: ["unkaa mn healthy be", "unkii age at least 18 year of be", "if uskii wife jiivit is then god lene for uskii shmti also necessary is", "All of the above"],
    answer: "if uskii wife jiivit is then god lene for uskii shmti also necessary is"
},
{
    question: "following in from raajniitik dl of type is",
    option: ["one dliiy arrangement", "dvidliiy arrangement", "bhudliiy arrangement", "All of the above"],
    answer: "All of the above"
},
{
    question: "‘ peNlittikl saaiNs ‘ naamk book of rcyitaa are",
    option: ["liikoNk", "gaittil", "maikaaivr", "gilkraaistt"],
    answer: "gaittil"
},
{
    question: "” raajniitik dl one such smudaay is, jo any such principle athvaa such niiti of smrthn for sNgtthit were be, jisse vh vaidhaanik saadhnoN from government of basis making caahtaa be  /  ” this pribhaassaa dii is",
    option: ["maikaaivr", "ruuso", "speNsr", "gaittil"],
    answer: "maikaaivr"
},
{
    question: "following in from raajniitik dl function of is",
    option: ["jntaa and government between smnvy sthaapit to do", "jnmt taiyaar to do", "jntaa in raajnaitik awareness paidaa to do", "All of the above"],
    answer: "All of the above"
},
{
    question: "“ dbaav group vyktiyoN of vh group is, jo shaaskiiy vissyoN of maadhym from athvaa unke binaa only raajniitik change laane of prytn does is  /  such dbaav smuuhoN to vidhaanmnnddl in raajniitik dloN as any prtinidhitv does not occur  /  ” said pribhaassaa smbndhit is",
    option: ["pii. oddiigaardd", "liikoNk", "phraaNsis kaisels", "ec. jeglr"],
    answer: "phraaNsis kaisels"
},
{
    question: "following in from dbaav group of means is",
    option: ["gheraav and prdrshn", "jnsNcaar of saadhnoN use of", "hdddhtaal", "All of the above"],
    answer: "All of the above"
},
{
    question: "India in which type shaasn system paayii goes is ?",
    option: ["sNsdiiy shaasn system", "adhykssiiy shaasn system", "( a ) and ( b ) dono", "None of these"],
    answer: "sNsdiiy shaasn system"
},
{
    question: "piittr maarkl ne dbaav group to how many bhaagoN in vrgiikRt done is ?",
    option: ["three", "four", "six", "eight"],
    answer: "six"
},
{
    question: "Indian sNsd two sdnoN in vibhaajit is  /  prthm sdn to loksbhaa said goes is and dvitiiy sdn of name is",
    option: ["vidhaan sbhaa", "vidhaan prissd", "raajy sbhaa", "None of these"],
    answer: "raajy sbhaa"
},
{
    question: "following from sNvidhaan praaruup smiti of adhykss the",
    option: ["rviindrnaath ttaigor", "bhiimraav ambeddkr", "mhaatmaa gaaNdhii", "srdaar pttel"],
    answer: "bhiimraav ambeddkr"
},
{
    question: "Indian sNvidhaan when implemented done was ?",
    option: ["25 jnvrii, 1948", "20 dismbr, 1949", "26 jnvrii, 1950", "26 jnvrii, 1949"],
    answer: "26 jnvrii, 1950"
},
{
    question: "Indian sNvidhaan in Which of the following from value nihit are",
    option: ["dhrmnirpeksstaa", "svtNtrtaa", "smaantaa", "All of these"],
    answer: "All of these"
},
{
    question: "following in which kmittii of anushNsaa of basis on pNcaaytiiraaj arrangement implemented of was ?",
    option: ["kaakaa kaalelkr kmittii", "ashok Mehta kmittii", "blvNtraay Mehta kmittii", "thuNgn kmittii"],
    answer: "blvNtraay Mehta kmittii"
},
{
    question: "sNvidhaan of which anucched in vRddhoN, ashaayoN and children to preservation provide done was is ?",
    option: ["anucched 17", "anucched 39", "anucched 15 and 16", "anucched 39"],
    answer: "anucched 39"
},
{
    question: "sNvidhaan of which anucched in anusuucit jaati, jnjaati and pichdd'e vrgoN to loksbhaa and raajy vidhaan sbhaaoN in prtinidhitv of praavdhaan done was is ?",
    option: ["anucched 330 and 332", "anucched 14 and 14", "anucched 23 and 24", "ine from any not"],
    answer: "anucched 330 and 332"
},
{
    question: "scheme aayog of place on nviin aayog of gtthn done was hai /  use which name from go goes is ?",
    option: ["lok sevaa aayog", "jn sevaa aayog", "niiti aayog", "klyaann aayog"],
    answer: "niiti aayog"
},
{
    question: "following in from kise maulik adhikaaroN of suucii from httaa given was is ?",
    option: ["education of right", "smpti of right", "shossnn of viruddh right", "svtNtrtaa of right"],
    answer: "smpti of right"
},
{
    question: "Which of the following maulik right is not ?",
    option: ["smaantaa of right", "svtNtrtaa of right", "education of right", "hiNsaa of right"],
    answer: "hiNsaa of right"
},
{
    question: "ddoN. bhiimraav ambeddkr of birth India of which raajy in was thaa ?",
    option: ["gujraat", "uttr prdesh", "mhaaraassttr", "mdhy prdesh"],
    answer: "mhaaraassttr"
},
{
    question: "mNddl aayog of adhykss which the ?",
    option: ["bindeshvrii prsaad mNddl", "dhnik red mNddl", "mNgnii red mNddl", "cndaushvrii red mNddl"],
    answer: "bindeshvrii prsaad mNddl"
},
{
    question: "following in from kise shaardaa ektt said goes is ?",
    option: ["special marriage ektt", "shmti age", "child marriage ektt", "hinduu marriage ektt"],
    answer: "child marriage ektt"
},
{
    question: "how many year under of children to any khtrnaak function in planting dNddniiy apraadh maanaa was is ?",
    option: ["14", "18", "10", "20"],
    answer: "14"
},
{
    question: "India in pNcaaytiiraaj ektt when paarit was ?",
    option: ["1951 ii. in", "1947 ii. in", "1952 ii. in", "1959 ii. in"],
    answer: "1959 ii. in"
},
{
    question: "pNcaaytiiraaj arrangement srvprthm which raajy in implemented done was ?",
    option: ["bihaar", "uttr prdesh", "mhaaraassttr", "raajsthaan"],
    answer: "raajsthaan"
},
{
    question: "blvNt raay Mehta smiti from whom smbndhit is ?",
    option: ["land sudhaar from", "hrit kraaNti from", "pNcaaytii raaj from", "nksl aandoln from"],
    answer: "pNcaaytii raaj from"
},
{
    question: "bihaar in In which year Gram Panchayat establishment was ?",
    option: ["1946", "1947", "1949", "1950"],
    answer: "1947"
},
{
    question: "‘ dlit class klyaann liig ‘ establishment who of thii ?",
    option: ["mhaatmaa gaaNdhii", "raam vilaas paasvaan", "jgjiivn raam", "bii 0 aar 0 ambedkr"],
    answer: "jgjiivn raam"
},
{
    question: "bihaar in pNcaaytii raaj of members function ofkaal how many years of is ?",
    option: ["five year", "three year", "seven year", "four year"],
    answer: "five year"
},
{
    question: "following in which rural society characteristic of is ?",
    option: ["shrm vibhaajn", "social gtishiiltaa", "ghnii aabaadii", "agricultural vyfaty"],
    answer: "agricultural vyfaty"
},
{
    question: "following in from which raajy in bhuu – sudhaar kaarykrm most sphl rhaa is ?",
    option: ["bihaar", "krnaattk", "pshcim bNgaal", "uttraakhnndd"],
    answer: "pshcim bNgaal"
},
{
    question: "hrit kraaNti of main kaark which is ?",
    option: ["upjaauu land", "chemical khaad and seeds", "rain", "education"],
    answer: "chemical khaad and seeds"
},
{
    question: "jmiiNdaarii unmuuln Act In which year paarit done was ?",
    option: ["1961 ii. in", "1948 ii. in", "1950 ii. in", "1955 ii. in"],
    answer: "1950 ii. in"
},
{
    question: "life jiine for necessary employment or function jisse money of obtaining be use called are",
    option: ["jiivikaa", "bicaulie", "bttaaiidaarii", "kaashtkaarii"],
    answer: "jiivikaa"
},
{
    question: "India in what percentage national income agricultural from obtained occurs ?",
    option: ["28 %", "29 %", "30 %", "40 %"],
    answer: "29 %"
},
{
    question: "ghn agricultural jilaa kaarykrm aarmbh done was",
    option: ["1961 ii. in", "1951 ii. in", "1971 ii. in", "1991 ii. in"],
    answer: "1961 ii. in"
},
{
    question: "India in hrit kraaNti laane in whose yogdaan is ?",
    option: ["jgdiishcndr bsu", "cndrshekhr veNktt rmn", "ddoN. homii jhaaNgiir bhaabhaa", "ddoN. em.es. svaamiinaathn"],
    answer: "ddoN. em.es. svaamiinaathn"
},
{
    question: "mdhyaahn dining where implemented was ?",
    option: ["school", "college", "oNphis", "All of the above"],
    answer: "school"
},
{
    question: "India in jmiiNdaarii arrangement of under land of how many percent part comes thaa ?",
    option: ["20 percent", "40 percent", "60 percent", "80 percent"],
    answer: "20 percent"
},
{
    question: "raabrtt reddphiildd according to kRssk society characteristic of is",
    option: ["smruup society", "agricultural land on control", "svyN utpaadnkrtaa", "All of these"],
    answer: "All of these"
},
{
    question: "thiyoddor shniin ne kRssk society of how many maulik pkssoN of ullekh done is ?",
    option: ["three", "four", "five", "six"],
    answer: "four"
},
{
    question: "hrit kraaNti of prthm crnn as ‘ ghn agricultural jilaa kaarykrm ‘ when implemented done was ?",
    option: ["sn 1960", "sn 1962", "sn 1961", "sn 1963"],
    answer: "sn 1961"
},
{
    question: "Government of India of or from land of punrgtthn for which – saa pryaas done was ?",
    option: ["land – prbndhn", "shkaarii agricultural", "ckbndii", "All of these"],
    answer: "All of these"
},
{
    question: "hrit kraaNti of utprerk which is ?",
    option: ["ndiyaaN", "sNkrit seeds", "upjaauu jmiin", "rain"],
    answer: "sNkrit seeds"
},
{
    question: "hrit kraanti which raajy in more sphl rhii ?",
    option: ["gujraat", "asm ( asom )", "pNjaab", "bihaar"],
    answer: "pNjaab"
},
{
    question: "following in which hrit kraanti of element are ?",
    option: ["good seeds use of", "bhu phsl", "siNcaaii on force", "All of the above"],
    answer: "All of the above"
},
{
    question: "following in which hrit kraanti of prkaary is ?",
    option: ["shaikssnnik development", "kssetriiy asmaantaa", "economy in development", "All of the above"],
    answer: "economy in development"
},
{
    question: "Which of these primitive economy of duusraa level is ?",
    option: ["shikaar and dining sNgrh level", "agricultural level", "pshucaarnn level", "industrial level"],
    answer: "agricultural level"
},
{
    question: "‘ sblaa ‘ skiim kendrit is",
    option: ["ashaay women", "kishoriyaaN", "maatRtv profit", "All of these"],
    answer: "kishoriyaaN"
},
{
    question: "bihaar in which – sii institution rural vivaadoN of nipttaaraa does is ?",
    option: ["nyaay pNcaayt", "pNcaayt kchrii", "grams kchrii", "None of these"],
    answer: "grams kchrii"
},
{
    question: "bhuumNddliikrnn of smbndh from whom is ?",
    option: ["udaariikrnn from", "nijiikrnn from", "(a) and (b) both from", "None of these"],
    answer: "(a) and (b) both from"
},
{
    question: "udaariikrnn from what meaning nikltaa is ?",
    option: ["smaajvaad", "mnussy of udaar honaa", "kaaphii unnti honaa", "mukt baajaar arrangement"],
    answer: "mukt baajaar arrangement"
},
{
    question: "Which of the following – sii dshaa udaariikrnn of prinnaam is not ?",
    option: ["upbhoktaavaad", "rural industry of vighttn", "berojgaarii", "combined family of vighttn"],
    answer: "upbhoktaavaad"
},
{
    question: "In which year aNtrraassttriiy shrm sNgtthn establishment was ?",
    option: ["1918 ii. in", "1919 ii. in", "1941 ii. in", "1949 ii. in"],
    answer: "1919 ii. in"
},
{
    question: "world vyaapaar sNgtthn when was established done was ?",
    option: ["1990 ii. in", "1980 ii. in", "1977 ii. in", "1995 ii. in"],
    answer: "1995 ii. in"
},
{
    question: "vaishviikrnn of relation is",
    option: ["saarvbhaumikrnn of with", "ekiikrnn of with", "sjaatiiytaa of with", "All of these"],
    answer: "All of these"
},
{
    question: "world vyaapaar sNgtthn of mukhyaaly where is ?",
    option: ["nii dillii", "peris", "jinevaa", "islaamaabaad"],
    answer: "jinevaa"
},
{
    question: "among these which videshii cainl is ?",
    option: ["shaaraa", "sttaar", "aaj up to", "None of these"],
    answer: "sttaar"
},
{
    question: "following in which viksit desh is ?",
    option: ["shriilNkaa", "nepaal", "amerikaa", "India"],
    answer: "amerikaa"
},
{
    question: "such kNpniyaaN jo one from more deshoN in apnaa production does is athvaa baajaar sevaaeN provide does is, use what called are ?",
    option: ["svdeshii Corporation", "paaraa national Corporation", "small industry", "vRht industry"],
    answer: "paaraa national Corporation"
},
{
    question: "bhuumnnddliikrnn vh prkriyaa is jo puuNjiivaad of vistaar and uskii smRddhi because of produced was hai /  this pribhaassaa of prstutkrttaa which are ?",
    option: ["giddddens", "belrstten", "inttrneshnl soshiyaaloNjii", "None of these"],
    answer: "belrstten"
},
{
    question: "The Consequence of Modernity book of lekhk which are ?",
    option: ["diipk guptaa", "giddddens", "belrstten", "None of these"],
    answer: "giddddens"
},
{
    question: "Historical Capitalism of lekhk which are ?",
    option: ["kaarl maarks", "joNrj rittyr", "diipNkr guptaa", "belrstten"],
    answer: "belrstten"
},
{
    question: "bhuumnnddliikrnn to front increasing which prmukh prerk which from are ?",
    option: ["baajaar of khoj", "bhuraassttriiy vinivesh", "praudyogikii, ilekttroNnik of ne upkrnn and nettvrk", "All of the above"],
    answer: "All of the above"
},
{
    question: "Which of the following – saa one effect India on bhuumnnddliikrnn of effect is not ?",
    option: ["national income in growth", "woman awareness", "raassttriiykrnn", "agricultural production in growth"],
    answer: "raassttriiykrnn"
},
{
    question: "smaajshaastriiy dRssttikonn from bhuumnnddliikrnn of avdhaarnnaa of vishlessnn who done ?",
    option: ["of. ddevis", "ttii.bii. baattomor", "maikaaivr and pej", "eNthnii giddddens"],
    answer: "eNthnii giddddens"
},
{
    question: "bhuumnnddliikrnn of maulik uddeshy each raassttr to world level on what sugm form from available kraanaa is ?",
    option: ["resource", "knowledge", "tkniikii", "these all"],
    answer: "these all"
},
{
    question: "ydypi bhuumnnddliikrnn prkriyaa function of field economic maanaa goes is tthaapi which – saa field isse achuutaa is not ?",
    option: ["social", "saaNskRtik", "raajniitik", "All of the above"],
    answer: "All of the above"
},
{
    question: "bhuumnnddliikrnn of prmukh basis is",
    option: ["physicalvaadii drshn", "raajdrshn", "social drshn", "None of these"],
    answer: "physicalvaadii drshn"
},
{
    question: "India in bhuumnnddliikrnn of praarmbh In which year was ?",
    option: ["sn 1990", "sn 1991", "sn 2000", "sn 2001"],
    answer: "sn 1991"
},
{
    question: "Which of the followingmaajik change characteristic of is not ?",
    option: ["vishvvyaapii", "saamudaayik change", "sthaayii avdhaarnnaa", "uncertain bhvissyvaannii"],
    answer: "uncertain bhvissyvaannii"
},
{
    question: "Which of the following – saa one effect India in vaishviikrnn of effect is not ?",
    option: ["national income in growth", "woman awareness", "raassttriiykrnn", "agricultural production in growth"],
    answer: "raassttriiykrnn"
},
{
    question: "among these from kisko prjaatNtr of cauthaa stNbh said goes is ?",
    option: ["kaarypaalikaa", "vidhaayikaa", "pres", "nyaaypaalikaa"],
    answer: "pres"
},
{
    question: "reddiyo of aavisskaar when was ?",
    option: ["1895 ii. in", "1795 ii. in", "1695 ii. in", "1595 ii. in"],
    answer: "1895 ii. in"
},
{
    question: "prsaar bhaartii of gtthn was",
    option: ["1985 ii. in", "1987 ii. in", "1997 ii. in", "1999 ii. in"],
    answer: "1997 ii. in"
},
{
    question: "India in vidhivt ttii.vii. sevaa of aarNbh when was ?",
    option: ["15 agst, 1965 in", "15 agst, 1970 in", "15 agst, 1968 in", "15 agst, 1966 in"],
    answer: "15 agst, 1965 in"
},
{
    question: "F.M. reddiyo of shuruuaat was",
    option: ["1960 ii. in", "1980 ii. in", "1975 ii. in", "1993 ii. in"],
    answer: "1993 ii. in"
},
{
    question: "BBC ne apnaa tteliivijn sevaa start of",
    option: ["1936 ii. in", "1940 ii. in", "1942 ii. in", "1945 ii. in"],
    answer: "1936 ii. in"
},
{
    question: "jnsNcaar of prbhaavsvruup Indian society ne which value to aatmsaat done is ?",
    option: ["svtNtrtaavaadii", "dhrmnirpekssvaadii", "smaantaavaadii", "All of the above"],
    answer: "smaantaavaadii"
},
{
    question: "vrtmaan Indian sNskRti srvaadhik form from from whom prbhaavit is ?",
    option: ["naitiktaa from", "paashcaaty sNskRti from", "prbuddh class from", "aadrshvaad from"],
    answer: "paashcaaty sNskRti from"
},
{
    question: "India of normal graamiinnoN in jnsNcaar of which means of prcln most more is ?",
    option: ["smaacaar letter", "clcitr", "tteliivijn", "reddiyo"],
    answer: "reddiyo"
},
{
    question: "this whose kthn is ki “jnsNcaar one such prkriyaa is jiske by kuch vicaaroN to vibhinn saadhnoN of maadhym from smpuurnn smudaay up to phuNcaayaa goes hai / ”",
    option: ["laipiyr", "vilsn", "maikaaivr", "mrttn"],
    answer: "maikaaivr"
},
{
    question: "following in from jnsNcaar of type is",
    option: ["mudrit sNcaar", "vidyut sNcaar", "dRshy – shrvy sNcaar", "All of the above"],
    answer: "All of the above"
},
{
    question: "mobile phon, phaiks and inttrnett aadi jnsNcaar of which means of under come are ?",
    option: ["vidyut sNcaar of means", "mudrit sNcaar", "dRshy – shrvy sNcaar of means of means", "None of these"],
    answer: "vidyut sNcaar of means"
},
{
    question: "cipko aaNdoln of aguaayii who of ?",
    option: ["iNdresh cipklaanii", "meghaa paattekr", "suNdrlaal bhugunnaa", "svaamii agnivess"],
    answer: "suNdrlaal bhugunnaa"
},
{
    question: "following in from whose smbndh jnjaatiiy aaNdoln from is ?",
    option: ["raam jypaal siNh of", "birsaa muNddaa of", "shibuu soren of", "All of these"],
    answer: "All of these"
},
{
    question: "Which of the following woman aaNdoln from judd'e are ?",
    option: ["srojnii naaydduu", "mohinii gri", "rNjnaa kumaarii", "All of these"],
    answer: "All of these"
},
{
    question: "pichdd'e vrgoN for made was prthm aayog of adhykss which the ?",
    option: ["krpuurii tthaakur", "muNgerii red", "vii.pii. mNddl", "kaakaa kaalelkr"],
    answer: "kaakaa kaalelkr"
},
{
    question: "maansrovr baaNdh of khilaaph aaNdoln to leadership who provide done ?",
    option: ["suNdrlaal bhugunnaa", "aruuNdhtii raay", "medhaa paattkr", "sunitaa naaraaynn"],
    answer: "medhaa paattkr"
},
{
    question: "following in which farmer netaa maane go are ?",
    option: ["jyprkaash naaraaynn", "svaamii shjaanNd srsvtii", "laalaa laajpt", "None of these"],
    answer: "svaamii shjaanNd srsvtii"
},
{
    question: "India of which raajy in pichdd'ii jaati aandoln srvprthm start was ?",
    option: ["bihaar", "pshcim bNgaal", "aandhr prdesh", "tmilnaaddu"],
    answer: "tmilnaaddu"
},
{
    question: "taanaa bhgt aandoln related is",
    option: ["pichdd'ii jaati from", "dlit from", "jnjaati from", "All of these"],
    answer: "jnjaati from"
},
{
    question: "phrvrii – March 2015 from which Indian ne farmer aandoln in pdaarpnn done ?",
    option: ["raakesh ttikait", "annaa hjaare", "arvind kejriivaal", "Any of these"],
    answer: "annaa hjaare"
},
{
    question: "India in naariivaadii aandoln of purodhaa as kinkii phcaan is ?",
    option: ["sucetaa kRplaanii", "srojinii naaydduu", "indiraa gaaNdhii", "kmlaa nehruu"],
    answer: "srojinii naaydduu"
},
{
    question: "svaamii shjaannd srsvtii of smbndh is",
    option: ["saamyvaadii aandoln from", "farmer aandoln from", "mjduur aandoln from", "None of these"],
    answer: "farmer aandoln from"
},
{
    question: "what type of aandoln of with aap raamsvaamii naaik of name of jodd'te be ?",
    option: ["farmer aandoln", "environment smbndhii aandoln", "naarii – svtNtrtaa aandoln", "pichdd'ii class aandoln"],
    answer: "pichdd'ii class aandoln"
},
{
    question: "cipko aandoln smbndhit is",
    option: ["vRkssoN of protection from", "water of protection from", "pshuoN of protection from", "khnijoN of protection from"],
    answer: "vRkssoN of protection from"
},
{
    question: "jnjaatiiy aaNdoln related is",
    option: ["jaati from", "jnjaati from", "smprdaay from", "dhrm from"],
    answer: "jnjaati from"
},
{
    question: "Indian farmer yuuniyn of farmer aandoln in ne sire from praann pheNkne of shrey kise goes is ?",
    option: ["vijy siNh pthik", "em. es. joshii", "mhendr siNh ttikait", "None of these"],
    answer: "mhendr siNh ttikait"
},
{
    question: "aatmsmmaan aaNdoln of prnnetaa which the ?",
    option: ["krpuurii tthaakur", "raam mnohr lohiyaa", "raamaasvaamii naaykr", "kaaNshiiraam"],
    answer: "raamaasvaamii naaykr"
},
{
    question: "‘munnddaa vidroh’ of leadership who done thaa ?",
    option: ["jtraa bhgt", "birsaa munnddaa", "siddho kaanho", "kriyaa munnddaa"],
    answer: "birsaa munnddaa"
},
{
    question: "India in In which year prdhaanmNtrii employment scheme start of gyii ?",
    option: ["1993", "1994", "2011", "2009"],
    answer: "1993"
},
{
    question: "In which year baalikaa smRddhi scheme of shuruuaat of was ?",
    option: ["1997", "1998", "1999", "1986"],
    answer: "1997"
},
{
    question: "ahiNsaa of basis on claayaa was one aaNdoln jise gaaNdhiijii ne claayaa, uskaa name is",
    option: ["tebhaagaa aaNdoln", "ttredd yuuniyn aaNdoln", "jn aaNdoln", "styaagrh aaNdoln"],
    answer: "styaagrh aaNdoln"
},
{
    question: "cipko aandoln claayaa was",
    option: ["1973 ii. in", "1970 ii. in", "1983 ii. in", "1999 ii. in"],
    answer: "1973 ii. in"
},
{
    question: "“taadd'ii of bikrii closed kro” this aaNdoln which raajy in start was ?",
    option: ["bihaar", "jhaarkhnndd", "gujraat", "aaNdhr prdesh"],
    answer: "aaNdhr prdesh"
},
{
    question: "dlit – paiNthrs when was established of was ?",
    option: ["1972 ii. in", "1980 ii. in", "1970 ii. in", "1983 ii. in"],
    answer: "1972 ii. in"
},
{
    question: "The Government of India woman sshktikrnn for national niiti of ghossnnaa when of ?",
    option: ["2003 ii. in", "2005 ii. in", "2001 ii. in", "2002 ii. in"],
    answer: "2001 ii. in"
},
{
    question: "following in from which aandoln of smbndh environment smsyaaoN from judd'aa was is ?",
    option: ["dlit aandoln", "aadivaasii aandoln", "cipko aandoln", "pichdd'ii jaati aandoln"],
    answer: "cipko aandoln"
},
{
    question: "‘sNthaal vidroh’ of leadership who done thaa ?",
    option: ["jtraa bhgt", "birsaa muNddaa", "siddho – kaanho", "kriyaa muNddaa"],
    answer: "siddho – kaanho"
},
{
    question: "meghaa paattekr which aandoln from judd'ii is ?",
    option: ["environment aandoln", "dlit aandoln", "farmer aandoln", "chaatr aandoln"],
    answer: "environment aandoln"
},
{
    question: "bihaar in Gram PanchayatoN in mhilaaoN for how many percent place aarkssit kiye gye are ?",
    option: ["25 %", "33 %", "67 %", "50 %"],
    answer: "50 %"
},
{
    question: "cipko aandoln of relation which raajy from is ?",
    option: ["uttr prdesh", "uttraakhnndd", "mdhy prdesh", "aaNdhr prdesh"],
    answer: "uttraakhnndd"
},
{
    question: "class sNghrss of principle who given ?",
    option: ["kaarl maarks", "maikaaivr", "rijle", "phrejr"],
    answer: "kaarl maarks"
},
{
    question: "Indian farmer yuuniyn of gtthn In which year done was ?",
    option: ["sn 1979", "sn 1980", "sn 1982", "sn 1984"],
    answer: "sn 1979"
},
{
    question: "“life of one nii arrangement to sthaapit doing of uddeshy from done were saamuuhik pryaas only social aandoln hai / ” this kthn whose is ?",
    option: ["em.es.e. raav", "hrbrtt bluumr", "kemraan", "None of these"],
    answer: "hrbrtt bluumr"
},
{
    question: "suugram of right for aandoln, environment bcaao, kRssk aandoln aadi what type of aandoln are ?",
    option: ["sudhaarvaadii", "kraantikaarii", "virodhvaadii", "None of these"],
    answer: "sudhaarvaadii"
},
{
    question: "“shrmik aandoln from aashy shrmikoN of those smst sNgtthit kriyaaoN from is jo ttkaal or niktt bhvissy in unkii dshaaoN to shresstth making for is done / ” this pribhaassaa who dii is ?",
    option: ["jii.ddii.ec. kol", "ddel yoddr", "henimn", "je.aar. kaamns"],
    answer: "je.aar. kaamns"
},
{
    question: "India in shrmik aandoln of development whose phlsvruup was ?",
    option: ["ngriikrnn", "audyogiikrnn", "nijiikrnn", "udaariikrnn"],
    answer: "audyogiikrnn"
},
{
    question: "India in srvprthm In which year soraanjii shaahpur ne shrmikoN of durdshaa of or government of dhyaan aakrssit done ?",
    option: ["sn 1875", "sn 1880", "sn 1895", "sn 1905"],
    answer: "sn 1875"
},
{
    question: "India in shrm sNgh of history In which year from start is ?",
    option: ["sn 1880", "sn 1890", "sn 1900", "sn 1910"],
    answer: "sn 1890"
},
{
    question: "shrmikoN of smsyaaoN on control obtaining of vaad – vivaad Act when paarit done was ?",
    option: ["sn 1950", "sn 1949", "sn 1948", "sn 1947"],
    answer: "sn 1947"
},
{
    question: "all shrmik sNghoN to one mNc on laane for kmyunistt paarttii (maarksvaadii) ne which sNgtthn establishment of ?",
    option: ["yuunaaittedd ttredd yuuniyn kaaNgres", "hinduu mjduur sbhaa", "Indian shrmik sNgh center", "innddiyn neshnl ttredd yuuniyn kaaNgres"],
    answer: "Indian shrmik sNgh center"
},
{
    question: "India of which economic niiti to bhuumnnddliikrnn of with apnaayaa was ?",
    option: ["economic niiti, 1972", "economic niiti, 1991", "economic niiti, 2001", "economic niiti, 2011"],
    answer: "economic niiti, 1991"
},
{
    question: "“any also aandoln kRssk aandoln may cause bshrte uskaa muul uddeshy kRsskoN of right of ldd'aaii be, caahe vh kRsskoN by gtthit be or other smuuhoN dvaaraa / ” this kthn whose is ?",
    option: ["pro. aar. siNh", "aar.bii. paannddey", "ghuriye", "sii.aar. paannddey"],
    answer: "aar.bii. paannddey"
},
{
    question: "year 1928-29 in baardolii (gujraat) of farmer aandoln (baardolii styaagrh) of leadership who done ?",
    option: ["jyprkaash naaraaynn", "bllbh brother pttel", "mhaatmaa gaaNdhii", "None of these"],
    answer: "bllbh brother pttel"
},
{
    question: "bihaar farmer sbhaa establishment In which year was ?",
    option: ["sn 1927", "sn 1929", "sn 1931", "sn 1933"],
    answer: "sn 1929"
},
{
    question: "bihaar farmer sbhaa In which year akhil Indian farmer sbhaa in privrtit be was ?",
    option: ["sn 1938", "sn 1937", "sn 1936", "sn 1934"],
    answer: "sn 1936"
},
{
    question: "tibhaagaa aandoln of prmukh netaa which the ?",
    option: ["bhovaanii sen", "rtnsen", "yogesh cndr cttrjii", "None of these"],
    answer: "bhovaanii sen"
},
{
    question: "tibhaagaa aandoln In which year smaapt be was ?",
    option: ["sn 1945", "sn 1947", "sn 1949", "sn 1953"],
    answer: "sn 1947"
},
{
    question: "telaaNgaanaa aandoln haidraabaad of nolgonnddaa jile in when start was ?",
    option: ["sn 1992", "sn 1932", "sn 1944", "sn 1946"],
    answer: "sn 1946"
},
{
    question: "pNjaab in unniisviiN shtaabdii of ant in praarmbh were farmer aandoln of leadership who done ?",
    option: ["laalaa laajpt raay", "srdaar ajiit siNh", "above-mentioned both", "None of these"],
    answer: "above-mentioned both"
},
{
    question: "India in Which of the following – saa kaark national ektaa in baadhk is ?",
    option: ["jaativaad", "kssetrvaad", "dhrmaandhtaa", "All of these"],
    answer: "All of these"
},
];

// --- Helper: Shuffle questions ---
const shuffleQuestions = (questions) => {
  const shuffled = [...questions];
  for (let i = shuffled.length - 1; i > 0; i--) {
    const j = Math.floor(Math.random() * (i + 1));
    [shuffled[i], shuffled[j]] = [shuffled[j], shuffled[i]];
  }
  return shuffled;
};

// --- Component ---
export default function Sociology12thQuiz() {
  const [started, setStarted] = useState(false);
  const [submitted, setSubmitted] = useState(false);
  const [timer, setTimer] = useState(3600); // 60 minutes = 3600 seconds
  const [language, setLanguage] = useState('hi');
  const [questions, setQuestions] = useState([]);
  const [current, setCurrent] = useState(0);
  const [answers, setAnswers] = useState({});
  const [score, setScore] = useState(0);
  const [resultDetails, setResultDetails] = useState([]);
  const [showTimerWarning, setShowTimerWarning] = useState(false);
  const resultRef = useRef(null);

  useEffect(() => {
    if (started && !submitted && timer > 0) {
      const t = setInterval(() => {
        setTimer((p) => {
          if (p <= 60) setShowTimerWarning(true);
          return p - 1;
        });
      }, 1000);
      return () => clearInterval(t);
    }
    if (timer === 0 && started && !submitted) {
      submitExam();
    }
  }, [started, submitted, timer]);

  const startExam = () => {
    const questionBank = language === 'hi' ? sociologyHindi : sociologyEnglish;
    // Select only 100 questions (all of them)
    const selectedQuestions = shuffleQuestions(questionBank).slice(0, 100);
    setQuestions(selectedQuestions);
    setStarted(true);
    setTimer(3600);
    setAnswers({});
    setCurrent(0);
    setShowTimerWarning(false);
  };

  const submitExam = () => {
    let s = 0;
    const details = questions.map((q, i) => {
      const isCorrect = answers[i] === q.answer;
      if (isCorrect) s++;
      return {
        question: q.question,
        option: q.option,
        correctAnswer: q.answer,
        userAnswer: answers[i] || (language === 'hi' ? "प्रयास नहीं किया" : "Not Attempted"),
        isCorrect: isCorrect,
        isAttempted: answers[i] !== undefined,
      };
    });
    setScore(s);
    setResultDetails(details);
    setSubmitted(true);
  };

  const toggleLanguage = () => {
    if (!started) {
      setLanguage(language === 'hi' ? 'en' : 'hi');
    }
  };

  const downloadResult = () => {
    if (resultRef.current) {
      const printWindow = window.open('', '_blank');
      if (printWindow) {
        const content = resultRef.current.innerHTML;
        printWindow.document.write(`
          <html>
            <head>
              <title>${language === 'hi' ? 'समाजशास्त्र 12वीं परिणाम' : 'Sociology 12th Result'}</title>
              <style>
                body { font-family: Arial, sans-serif; padding: 20px; }
                .result-container { max-width: 800px; margin: 0 auto; }
                .header { text-align: center; padding: 20px; background: linear-gradient(135deg, #1a237e, #3f51b5); color: white; border-radius: 10px; margin-bottom: 20px; }
                .score-card { text-align: center; padding: 20px; border: 2px solid #1a237e; border-radius: 10px; margin-bottom: 20px; }
                .score { font-size: 40px; font-weight: bold; color: #1a237e; }
                .status { font-size: 20px; margin: 10px 0; }
                .pass { color: #28a745; }
                .fail { color: #dc3545; }
                .question-item { padding: 15px; margin: 10px 0; border-radius: 8px; border-left: 4px solid #48bb78; background: #f8f9fa; }
                .question-item.wrong { border-left-color: #dc3545; background: #fff5f5; }
                .question-item .q { font-weight: bold; font-size: 14px; }
                .question-item .your-answer { margin-top: 5px; font-size: 13px; }
                .question-item .correct-answer { margin-top: 3px; font-size: 13px; color: #28a745; font-weight: bold; }
                .wrong-answer { color: #dc3545; }
                .correct-answer-text { color: #28a745; }
                .not-attempted { color: #ffc107; }
                .footer { text-align: center; margin-top: 20px; padding: 10px; color: #666; font-size: 12px; border-top: 1px solid #ddd; }
              </style>
            </head>
            <body>
              <div class="result-container">
                ${content}
              </div>
            </body>
          </html>
        `);
        printWindow.document.close();
        printWindow.print();
      }
    }
  };

  const getText = (key) => {
    const texts = {
      'title': { hi: '👥 समाजशास्त्र 12वीं', en: '👥 Sociology 12th' },
      'subtitle': { hi: 'कक्षा 12 समाजशास्त्र प्रश्नोत्तरी', en: 'Class 12 Sociology Quiz' },
      'questions': { hi: '📝 प्रश्न', en: '📝 Questions' },
      'time': { hi: '⏱️ समय', en: '⏱️ Time' },
      'instructions': { hi: '📋 निर्देश:', en: '📋 Instructions:' },
      'compulsory': { hi: 'सभी प्रश्न अनिवार्य हैं', en: 'All questions are compulsory' },
      'marks': { hi: 'प्रत्येक प्रश्न 1 अंक का है', en: 'Each question carries 1 mark' },
      'negative': { hi: 'कोई नकारात्मक अंकन नहीं', en: 'No negative marking' },
      'start': { hi: '🚀 क्विज़ शुरू करें', en: '🚀 Start Quiz' },
      'answered': { hi: 'उत्तर दिए:', en: 'Answered:' },
      'prev': { hi: '⬅ पिछला', en: '⬅ Prev' },
      'next': { hi: 'अगला ➡', en: 'Next ➡' },
      'submit': { hi: '📤 जमा करें', en: '📤 Submit' },
      'navigator': { hi: 'प्रश्न नेविगेटर', en: 'Question Navigator' },
      'answered_status': { hi: '🟢 उत्तर दिया', en: '🟢 Answered' },
      'current_status': { hi: '🔵 वर्तमान', en: '🔵 Current' },
      'unanswered_status': { hi: '⚪ अनुत्तरित', en: '⚪ Unanswered' },
      'congrats': { hi: '🎉 शानदार प्रदर्शन!', en: '🎉 Excellent Performance!' },
      'practice': { hi: '📖 सीखते रहें!', en: '📖 Keep Learning!' },
      'passed': { hi: '✔️ उत्तीर्ण', en: '✔️ Passed' },
      'failed': { hi: '❌ सुधार की आवश्यकता', en: '❌ Needs Improvement' },
      'review': { hi: '📋 उत्तर समीक्षा', en: '📋 Answer Review' },
      'your_answer': { hi: 'आपका उत्तर:', en: 'Your Answer:' },
      'correct_answer': { hi: 'सही उत्तर:', en: 'Correct Answer:' },
      'new_quiz': { hi: '🔄 नई क्विज़ लें', en: '🔄 Take New Quiz' },
      'warning': { hi: '⚠️ 1 मिनट से कम समय शेष!', en: '⚠️ Less than 1 minute remaining!' },
      'download': { hi: '📥 परिणाम डाउनलोड करें', en: '📥 Download Result' },
      'status': { hi: 'स्थिति', en: 'Status' },
      'correct': { hi: 'सही', en: 'Correct' },
      'wrong': { hi: 'गलत', en: 'Wrong' },
      'not_attempted': { hi: 'प्रयास नहीं किया', en: 'Not Attempted' },
    };
    return texts[key]?.[language] || texts[key]?.['en'] || key;
  };

  // Home Page
  if (!started) {
    return (
      <div style={{
        minHeight: "100vh",
        display: "flex",
        justifyContent: "center",
        alignItems: "center",
        background: "linear-gradient(135deg, #1a237e 0%, #283593 50%, #3f51b5 100%)",
        fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif",
        padding: "20px"
      }}>
        <div style={{
          backgroundColor: "white",
          padding: "25px 20px",
          borderRadius: "16px",
          boxShadow: "0 20px 60px rgba(0,0,0,0.6)",
          textAlign: "center",
          maxWidth: "500px",
          width: "100%",
          animation: "fadeInUp 0.6s ease"
        }}>
          <div style={{ fontSize: "48px", marginBottom: "5px" }}>👥</div>
          <h1 style={{ 
            color: "#1a237e", 
            marginBottom: "3px", 
            fontSize: "22px",
            fontWeight: "700"
          }}>
            {getText('title')}
          </h1>
          <p style={{ color: "#666", fontSize: "12px", marginBottom: "15px" }}>
            {getText('subtitle')}
          </p>
          <div style={{
            height: "3px",
            background: "linear-gradient(90deg, #1a237e, #3f51b5)",
            margin: "10px auto",
            width: "60px"
          }}></div>

          {/* Language Toggle */}
          <div style={{
            display: "flex",
            justifyContent: "center",
            alignItems: "center",
            gap: "12px",
            marginTop: "15px",
            marginBottom: "15px"
          }}>
            <span style={{ 
              fontSize: "14px", 
              fontWeight: language === 'hi' ? "700" : "400",
              color: language === 'hi' ? "#1a237e" : "#999"
            }}>हिन्दी</span>
            <button
              onClick={toggleLanguage}
              style={{
                width: "50px",
                height: "26px",
                borderRadius: "13px",
                background: language === 'hi' ? "#3f51b5" : "#4a90d9",
                border: "none",
                cursor: "pointer",
                position: "relative",
                transition: "all 0.3s ease"
              }}
            >
              <div style={{
                width: "20px",
                height: "20px",
                borderRadius: "50%",
                background: "white",
                position: "absolute",
                top: "3px",
                left: language === 'hi' ? "3px" : "27px",
                transition: "all 0.3s ease",
                boxShadow: "0 2px 4px rgba(0,0,0,0.2)"
              }}></div>
            </button>
            <span style={{ 
              fontSize: "14px", 
              fontWeight: language === 'en' ? "700" : "400",
              color: language === 'en' ? "#1a237e" : "#999"
            }}>English</span>
          </div>

          <div style={{
            display: "grid",
            gridTemplateColumns: "1fr 1fr",
            gap: "10px",
            marginTop: "10px"
          }}>
            <div style={{ 
              backgroundColor: "#e8f0fe", 
              padding: "12px", 
              borderRadius: "10px"
            }}>
              <div style={{ fontSize: "11px", color: "#666" }}>{getText('questions')}</div>
              <div style={{ fontSize: "22px", fontWeight: "bold", color: "#1a237e" }}>100</div>
            </div>
            <div style={{ 
              backgroundColor: "#e8f0fe", 
              padding: "12px", 
              borderRadius: "10px"
            }}>
              <div style={{ fontSize: "11px", color: "#666" }}>{getText('time')}</div>
              <div style={{ fontSize: "22px", fontWeight: "bold", color: "#1a237e" }}>60 Mins</div>
            </div>
          </div>

          <div style={{
            backgroundColor: "#e8f0fe",
            padding: "10px",
            borderRadius: "10px",
            marginTop: "10px",
            fontSize: "12px",
            color: "#1a237e"
          }}>
            💡 {language === 'hi' ? 'कक्षा 12 समाजशास्त्र के सभी अध्यायों की व्यापक कवरेज' : 'Comprehensive coverage of all Class 12 Sociology chapters'}
          </div>

          <div style={{
            backgroundColor: "#f8f9fa",
            padding: "10px",
            borderRadius: "10px",
            marginTop: "10px",
            fontSize: "12px",
            color: "#555",
            textAlign: "left"
          }}>
            <strong>{getText('instructions')}</strong>
            <ul style={{ margin: "5px 0 0 0", paddingLeft: "18px" }}>
              <li>{getText('compulsory')}</li>
              <li>{getText('marks')}</li>
              <li>{getText('negative')}</li>
            </ul>
          </div>

          <button
            onClick={startExam}
            style={{
              padding: "14px 40px",
              fontSize: "18px",
              fontWeight: "bold",
              background: "linear-gradient(135deg, #1a237e 0%, #3f51b5 100%)",
              color: "white",
              border: "none",
              borderRadius: "50px",
              cursor: "pointer",
              marginTop: "20px",
              width: "100%",
              transition: "transform 0.3s, box-shadow 0.3s",
              boxShadow: "0 4px 15px rgba(63, 81, 181, 0.4)"
            }}
            onMouseEnter={(e) => e.target.style.transform = "scale(1.02)"}
            onMouseLeave={(e) => e.target.style.transform = "scale(1)"}
          >
            {getText('start')}
          </button>
        </div>
      </div>
    );
  }

  // Result Page
  if (submitted) {
    const percentage = ((score / questions.length) * 100).toFixed(2);
    const isPassed = percentage >= 60;
    return (
      <div style={{
        minHeight: "100vh",
        background: "#f5f7fa",
        padding: "15px",
        fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif"
      }}>
        <div style={{
          maxWidth: "800px",
          margin: "0 auto"
        }}>
          {/* Result Card - For Download */}
          <div ref={resultRef} style={{
            backgroundColor: "white",
            borderRadius: "16px",
            padding: "25px 20px",
            boxShadow: "0 10px 40px rgba(0,0,0,0.1)",
            textAlign: "center",
            marginBottom: "20px",
            animation: "slideIn 0.5s ease"
          }}>
            <div className="header" style={{
              background: "linear-gradient(135deg, #1a237e, #3f51b5)",
              color: "white",
              padding: "15px",
              borderRadius: "10px",
              marginBottom: "15px"
            }}>
              <h1 style={{ margin: "0", fontSize: "22px" }}>{getText('title')}</h1>
              <p style={{ margin: "5px 0 0", fontSize: "12px", opacity: 0.9 }}>
                {language === 'hi' ? 'कक्षा 12 समाजशास्त्र क्विज़' : 'Class 12 Sociology Quiz'}
              </p>
            </div>
            
            <h2 style={{ 
              fontSize: "20px", 
              marginBottom: "5px",
              color: "#2d3748"
            }}>
              {isPassed ? getText('congrats') : getText('practice')}
            </h2>
            <div style={{
              width: "80px",
              height: "80px",
              borderRadius: "50%",
              background: isPassed ? "#d4edda" : "#f8d7da",
              display: "flex",
              alignItems: "center",
              justifyContent: "center",
              margin: "15px auto",
              fontSize: "32px"
            }}>
              {isPassed ? "✅" : "📝"}
            </div>
            <div style={{ fontSize: "40px", fontWeight: "bold", color: "#1a237e" }}>
              {score} <span style={{ fontSize: "20px", color: "#888" }}>/ {questions.length}</span>
            </div>
            <div style={{ 
              fontSize: "18px", 
              color: isPassed ? "#28a745" : "#dc3545", 
              marginTop: "5px",
              fontWeight: "600"
            }}>
              {percentage}% {isPassed ? getText('passed') : getText('failed')}
            </div>
            <div style={{
              marginTop: "10px",
              fontSize: "13px",
              color: "#718096"
            }}>
              {language === 'hi' ? "भाषा: हिन्दी" : "Language: English"} • {getText('negative')}
            </div>

            <div style={{
              marginTop: "15px",
              display: "grid",
              gridTemplateColumns: "1fr 1fr 1fr",
              gap: "10px",
              fontSize: "13px"
            }}>
              <div style={{ backgroundColor: "#d4edda", padding: "8px", borderRadius: "8px", color: "#155724" }}>
                ✅ {getText('correct')}: {resultDetails.filter(r => r.isCorrect).length}
              </div>
              <div style={{ backgroundColor: "#f8d7da", padding: "8px", borderRadius: "8px", color: "#721c24" }}>
                ❌ {getText('wrong')}: {resultDetails.filter(r => !r.isCorrect && r.isAttempted).length}
              </div>
              <div style={{ backgroundColor: "#fff3cd", padding: "8px", borderRadius: "8px", color: "#856404" }}>
                ⚪ {getText('not_attempted')}: {resultDetails.filter(r => !r.isAttempted).length}
              </div>
            </div>
          </div>

          {/* Download Button */}
          <div style={{ textAlign: "center", marginBottom: "20px" }}>
            <button
              onClick={downloadResult}
              style={{
                padding: "12px 30px",
                fontSize: "15px",
                fontWeight: "bold",
                background: "linear-gradient(135deg, #48bb78 0%, #38a169 100%)",
                color: "white",
                border: "none",
                borderRadius: "50px",
                cursor: "pointer",
                boxShadow: "0 4px 15px rgba(72, 187, 120, 0.4)",
                transition: "all 0.3s ease"
              }}
              onMouseEnter={(e) => e.target.style.transform = "scale(1.02)"}
              onMouseLeave={(e) => e.target.style.transform = "scale(1)"}
            >
              {getText('download')}
            </button>
          </div>

          {/* Answer Review */}
          <div style={{
            backgroundColor: "white",
            borderRadius: "16px",
            padding: "20px 15px",
            boxShadow: "0 10px 40px rgba(0,0,0,0.1)"
          }}>
            <h2 style={{ 
              borderBottom: "2px solid #eee", 
              paddingBottom: "12px", 
              marginBottom: "15px",
              fontSize: "18px",
              color: "#2d3748"
            }}>
              {getText('review')}
            </h2>
            {resultDetails.map((item, index) => (
              <div
                key={index}
                className={item.isCorrect ? '' : 'wrong'}
                style={{
                  backgroundColor: item.isCorrect ? "#f0fff4" : 
                                   item.isAttempted ? "#fff5f5" : "#fff3cd",
                  borderLeft: `4px solid ${item.isCorrect ? "#48bb78" : 
                              item.isAttempted ? "#fc8181" : "#ffc107"}`,
                  padding: "12px 15px",
                  marginBottom: "12px",
                  borderRadius: "8px",
                  animation: `fadeIn 0.3s ease ${index * 0.05}s`
                }}
              >
                <div style={{ display: "flex", justifyContent: "space-between", alignItems: "flex-start" }}>
                  <h4 style={{ 
                    margin: "0", 
                    fontSize: "14px", 
                    color: "#2d3748",
                    flex: 1,
                    marginRight: "10px"
                  }}>
                    Q{index + 1}. {item.question}
                  </h4>
                  <span style={{ fontSize: "18px", flexShrink: 0 }}>
                    {item.isCorrect ? "✅" : item.isAttempted ? "❌" : "⚪"}
                  </span>
                </div>
                <div style={{ marginTop: "8px", marginLeft: "5px", fontSize: "13px" }}>
                  <p style={{ margin: "3px 0" }}>
                    <strong>{getText('your_answer')}</strong>{" "}
                    <span style={{ 
                      color: item.isCorrect ? "#48bb78" : 
                             item.isAttempted ? "#dc3545" : "#ffc107",
                      fontWeight: item.isAttempted ? "bold" : "normal"
                    }}>
                      {item.userAnswer}
                    </span>
                    {!item.isAttempted && (
                      <span style={{ color: "#ffc107", marginLeft: "5px" }}>
                        ({getText('not_attempted')})
                      </span>
                    )}
                  </p>
                  {!item.isCorrect && (
                    <p style={{ margin: "3px 0" }}>
                      <strong>{getText('correct_answer')}</strong>{" "}
                      <span style={{ color: "#48bb78", fontWeight: "bold" }}>{item.correctAnswer}</span>
                    </p>
                  )}
                </div>
              </div>
            ))}
          </div>

          <div style={{ textAlign: "center", marginTop: "20px" }}>
            <button
              onClick={() => {
                setStarted(false);
                setSubmitted(false);
                setAnswers({});
                setResultDetails([]);
                setTimer(3600);
                setShowTimerWarning(false);
                setQuestions([]);
              }}
              style={{
                padding: "14px 35px",
                fontSize: "16px",
                fontWeight: "bold",
                background: "linear-gradient(135deg, #1a237e 0%, #3f51b5 100%)",
                color: "white",
                border: "none",
                borderRadius: "50px",
                cursor: "pointer",
                width: "100%",
                maxWidth: "300px",
                boxShadow: "0 4px 15px rgba(63, 81, 181, 0.4)",
                transition: "transform 0.3s ease"
              }}
              onMouseEnter={(e) => e.target.style.transform = "scale(1.02)"}
              onMouseLeave={(e) => e.target.style.transform = "scale(1)"}
            >
              {getText('new_quiz')}
            </button>
          </div>
        </div>
      </div>
    );
  }

  // Exam Page
  const q = questions[current] || { question: "", option: [], answer: "" };
  const answeredCount = Object.keys(answers).length;

  return (
    <div style={{
      minHeight: "100vh",
      background: "#f5f7fa",
      padding: "10px",
      fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif"
    }}>
      <div style={{
        maxWidth: "800px",
        margin: "0 auto"
      }}>
        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "10px 14px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginBottom: "10px",
          display: "flex",
          justifyContent: "space-between",
          alignItems: "center"
        }}>
          <div style={{ flex: 1 }}>
            <p style={{ 
              margin: "0", 
              fontSize: "11px", 
              color: "#718096"
            }}>
              Q{current + 1}/{questions.length}
            </p>
            <p style={{ 
              margin: "2px 0 0", 
              fontSize: "10px", 
              color: "#a0aec0"
            }}>
              {getText('answered')} {answeredCount}/{questions.length}
            </p>
          </div>
          <div style={{
            fontSize: "20px",
            fontWeight: "bold",
            color: timer < 60 ? "#fc8181" : "#1a237e",
            display: "flex",
            alignItems: "center",
            gap: "6px"
          }}>
            <span style={{ fontSize: "16px" }}>⏱️</span>
            <span>{Math.floor(timer / 60)}:{String(timer % 60).padStart(2, "0")}</span>
          </div>
        </div>

        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "16px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginBottom: "10px",
          animation: "fadeIn 0.3s ease"
        }}>
          <div style={{
            display: "inline-block",
            backgroundColor: "#e8f0fe",
            padding: "2px 10px",
            borderRadius: "12px",
            fontSize: "11px",
            color: "#1a237e",
            marginBottom: "12px"
          }}>
            📌 {language === 'hi' ? 'समाजशास्त्र 12वीं' : 'Sociology 12th'}
          </div>
          <h3 style={{
            fontSize: "16px",
            color: "#1a237e",
            marginBottom: "16px",
            fontWeight: "600",
            lineHeight: "1.5"
          }}>
            {q.question}
          </h3>

          <div style={{ marginTop: "5px" }}>
            {q.option && q.option.map((op, idx) => (
              <div
                key={idx}
                style={{
                  padding: "10px 12px",
                  margin: "5px 0",
                  backgroundColor: answers[current] === op ? "#ebf8ff" : "#f7fafc",
                  border: answers[current] === op ? "2px solid #3f51b5" : "2px solid transparent",
                  borderRadius: "8px",
                  cursor: "pointer",
                  transition: "all 0.3s ease",
                  display: "flex",
                  alignItems: "center",
                  transform: answers[current] === op ? "scale(1.01)" : "scale(1)"
                }}
                onClick={() => setAnswers({ ...answers, [current]: op })}
                onMouseEnter={(e) => {
                  if (answers[current] !== op) {
                    e.currentTarget.style.backgroundColor = "#f0f0f0";
                    e.currentTarget.style.transform = "scale(1.005)";
                  }
                }}
                onMouseLeave={(e) => {
                  if (answers[current] !== op) {
                    e.currentTarget.style.backgroundColor = "#f7fafc";
                    e.currentTarget.style.transform = "scale(1)";
                  }
                }}
              >
                <input
                  type="radio"
                  id={`q${current}-opt${idx}`}
                  name={`question-${current}`}
                  checked={answers[current] === op}
                  onChange={() => {}}
                  style={{ marginRight: "10px", width: "16px", height: "16px", flexShrink: 0 }}
                />
                <label
                  htmlFor={`q${current}-opt${idx}`}
                  style={{
                    fontSize: "14px",
                    cursor: "pointer",
                    flex: 1,
                    margin: "0",
                    color: "#2d3748"
                  }}
                >
                  {op}
                </label>
              </div>
            ))}
          </div>
        </div>

        <div style={{
          display: "flex",
          gap: "8px",
          flexWrap: "wrap",
          justifyContent: "space-between"
        }}>
          <div style={{ display: "flex", gap: "8px" }}>
            <button
              onClick={() => setCurrent(Math.max(0, current - 1))}
              disabled={current === 0}
              style={{
                padding: "8px 14px",
                fontSize: "13px",
                backgroundColor: current === 0 ? "#e2e8f0" : "#3f51b5",
                color: current === 0 ? "#a0aec0" : "white",
                border: "none",
                borderRadius: "8px",
                cursor: current === 0 ? "not-allowed" : "pointer",
                fontWeight: "600",
                transition: "all 0.3s ease"
              }}
              onMouseEnter={(e) => {
                if (current !== 0) {
                  e.target.style.transform = "scale(1.05)";
                  e.target.style.boxShadow = "0 4px 12px rgba(63, 81, 181, 0.3)";
                }
              }}
              onMouseLeave={(e) => {
                e.target.style.transform = "scale(1)";
                e.target.style.boxShadow = "none";
              }}
            >
              {getText('prev')}
            </button>
            <button
              onClick={() => setCurrent(Math.min(questions.length - 1, current + 1))}
              disabled={current === questions.length - 1}
              style={{
                padding: "8px 14px",
                fontSize: "13px",
                backgroundColor: current === questions.length - 1 ? "#e2e8f0" : "#3f51b5",
                color: current === questions.length - 1 ? "#a0aec0" : "white",
                border: "none",
                borderRadius: "8px",
                cursor: current === questions.length - 1 ? "not-allowed" : "pointer",
                fontWeight: "600",
                transition: "all 0.3s ease"
              }}
              onMouseEnter={(e) => {
                if (current !== questions.length - 1) {
                  e.target.style.transform = "scale(1.05)";
                  e.target.style.boxShadow = "0 4px 12px rgba(63, 81, 181, 0.3)";
                }
              }}
              onMouseLeave={(e) => {
                e.target.style.transform = "scale(1)";
                e.target.style.boxShadow = "none";
              }}
            >
              {getText('next')}
            </button>
          </div>

          <button
            onClick={submitExam}
            style={{
              padding: "8px 18px",
              fontSize: "13px",
              backgroundColor: "#48bb78",
              color: "white",
              border: "none",
              borderRadius: "8px",
              cursor: "pointer",
              fontWeight: "600",
              transition: "all 0.3s ease",
              boxShadow: "0 2px 8px rgba(72, 187, 120, 0.3)"
            }}
            onMouseEnter={(e) => {
              e.target.style.transform = "scale(1.05)";
              e.target.style.boxShadow = "0 4px 15px rgba(72, 187, 120, 0.5)";
            }}
            onMouseLeave={(e) => {
              e.target.style.transform = "scale(1)";
              e.target.style.boxShadow = "0 2px 8px rgba(72, 187, 120, 0.3)";
            }}
          >
            {getText('submit')}
          </button>
        </div>

        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "12px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginTop: "10px"
        }}>
          <p style={{ 
            margin: "0 0 8px 0", 
            color: "#718096", 
            fontSize: "11px", 
            fontWeight: "600" 
          }}>
            {getText('navigator')}
          </p>
          <div style={{
            display: "flex",
            flexWrap: "wrap",
            gap: "5px"
          }}>
            {questions.map((_, idx) => (
              <button
                key={idx}
                onClick={() => setCurrent(idx)}
                style={{
                  width: "32px",
                  height: "32px",
                  fontSize: "11px",
                  backgroundColor: answers[idx] ? "#48bb78" : 
                                   current === idx ? "#3f51b5" : "#e2e8f0",
                  color: answers[idx] ? "white" :
                         current === idx ? "white" : "#4a5568",
                  border: current === idx ? "2px solid #3f51b5" : "none",
                  borderRadius: "6px",
                  cursor: "pointer",
                  fontWeight: "bold",
                  transition: "all 0.3s ease",
                  transform: answers[idx] ? "scale(1.05)" : "scale(1)"
                }}
                onMouseEnter={(e) => {
                  e.target.style.transform = "scale(1.1)";
                }}
                onMouseLeave={(e) => {
                  e.target.style.transform = answers[idx] ? "scale(1.05)" : "scale(1)";
                }}
              >
                {idx + 1}
              </button>
            ))}
          </div>
          <div style={{
            display: "flex",
            gap: "12px",
            marginTop: "8px",
            fontSize: "10px",
            color: "#4a5568",
            flexWrap: "wrap"
          }}>
            <span>{getText('answered_status')}</span>
            <span>{getText('current_status')}</span>
            <span>{getText('unanswered_status')}</span>
          </div>
        </div>

        {showTimerWarning && (
          <div style={{
            position: "fixed",
            bottom: "15px",
            right: "15px",
            left: "15px",
            backgroundColor: "#fc8181",
            color: "white",
            padding: "12px 18px",
            borderRadius: "10px",
            boxShadow: "0 4px 15px rgba(252, 129, 129, 0.4)",
            textAlign: "center",
            fontSize: "14px",
            fontWeight: "600",
            animation: "pulse 1.5s ease-in-out infinite",
            maxWidth: "400px",
            margin: "0 auto"
          }}>
            {getText('warning')}
          </div>
        )}
      </div>
      <style>
        {`
          @keyframes pulse {
            0% { opacity: 1; transform: scale(1); }
            50% { opacity: 0.6; transform: scale(0.98); }
            100% { opacity: 1; transform: scale(1); }
          }
          @keyframes fadeInUp {
            from { opacity: 0; transform: translateY(20px); }
            to { opacity: 1; transform: translateY(0); }
          }
          @keyframes fadeIn {
            from { opacity: 0; transform: translateX(-10px); }
            to { opacity: 1; transform: translateX(0); }
          }
          @keyframes slideIn {
            from { opacity: 0; transform: translateY(-30px); }
            to { opacity: 1; transform: translateY(0); }
          }
        `}
      </style>
    </div>
  );
}